{"organizations": [], "uuid": "77cdd448bce33f575a57a814b09c5f8d91eb53d0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nbcnews.com", "main_image": "http://media3.s-nbcnews.com/j/newscms/2016_38/1720241/160922-trump-police-statement-mbe-854p_a9ecf21632889e4845424fd405dd8860.nbcnews-fp-1200-800.jpg", "site_section": "http://www.nbcnews.com/politics", "section_title": "Politics - NBC News", "url": "http://www.nbcnews.com/politics/first-read/political-elite-fights-trump-they-re-still-losing-n657356", "country": "US", "domain_rank": 478, "title": "The Political Elite Fights Trump -- And They're Still Not Winning", "performance_score": 0, "site": "nbcnews.com", "participants_count": 6, "title_full": "The Political Elite Fights Trump -- And They're Still Not Winning - NBC News", "spam_score": 0.0, "site_type": "news", "published": "2016-09-30T20:45:00.000+03:00", "replies_count": 5, "uuid": "6dd02e03a3dba9cf33ff93da69ea2c3f8050b3df"}, "author": "Jody, Iowa", "url": "http://www.nbcnews.com/politics/first-read/political-elite-fights-trump-they-re-still-losing-n657356#post-3", "ord_in_thread": 3, "title": "", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Trump and his Trumpettes deny he is part of the \\\"elite\\\" but he is. Pretty bad when even the \\\"elites\\\" throw one of their own under the bus. Most likely that is because they recognize Trump as the crook and con artist he is; they understand he will be as crooked a president in order to line his own pockets as he is a crooked businessman. \\n\n“AND THAT'S THE WAY IT IS” this week. \\n\nScientists using radar from satellites determined five Texas earthquakes, one a magnitude 4.8, were caused by injecting waste water in drilling for oil and gas. \\n\nThe Trump campaign has paid $8.2 million to Trump Enterprises for services related to campaign events. Nothing like Trump lining his pockets with cash while conning Americans into believing he's running to Make America Great Again and will “stiff” them instead. \\n\nBobby Knight, “I actually enjoyed the day with Saint Donald and I've enjoyed watching him.” Yep, he said “Saint Donald.” \\n\nCorey Lewandowski will be paid $500K by the Trump campaign, one fourth coming after he was fired. So, Lewandowski is being paid by Trump while CNN is paying him to shill for Trump. Nice gig if you can get it. \\n\nU.S. Intelligence is investigating whether Trump adviser Carter Page has opened up private communications with senior Russian officials. Intelligence has briefed senior members of Congress regarding Page's questionable activities both in Russia and here. \\n\nFor those who believe Trump, who has declared bankruptcy 6 times, would be good for the economy, here's a few of Trump's failures: Bought Trump Plaza Hotel for $400 Million; repossessed by the bank. Bought a $29-Million yacht, repossessed by the bank. Built 4 casinos at a cost of $3 Billion; filed for bankruptcy, went out of business and stiffed contractors and employees in the process. Started Trump Airlines; never made a profit; planes and helicopters repossessed by Citibank. Trump Mortgage, Trump Vodka, Trump Steaks—never made a profit and went out of business. \\n\nThe GOP House Wild Goose Chasers issued a subpoena for Hillary Clinton's current server security details. Clinton's attorney rejected the subpoena saying this server is the replacement for the one the FBI took and never hosted her work-related emails. Hopefully, the attorney added that she's a private citizen, it's none of the GOP's business and to stuff the subpoena up their collective noses. \\n\nFormer National Security Adviser to G.H.W. Bush, Donald P. Gregg said Clinton would be an “extremely good president. We now have a person at the top of the Republican ticket who I believe is dangerous, doesn't understand the complex world we live in, doesn't care to, and is without any moral or international philosophy.” \\n\nColombian leaders of the Revolutionary Armed Forces gave their unanimous support to a peace agreement reached with the Colombian Government last month. \\n\nMonday night, Hillary Clinton debated the schoolyard bully and class clown Donald Trump. The “flaming yam” fizzled out. Trump \\\"got Hillaried\\\"; she played him like a violin. We know she trounced him because he and his Trumpkins have spent four days hurling insults, lashing out, and stupidly doubling down on the bait Hillary aimed Trump's direction. \\n\nTrump and his Trumpkins hinted that his debate microphone was tampered with. Funny thing, no one had a bit of trouble hearing his sniffing. Sour grapes and whinery. \\n\nTuesday both in TV interviews and at his campaign rally, Trump declared he did well debating immigration....except the topic was not debated. His supporters cheered never doubting he did well debating a topic that wasn't debated. \\n\nRudy Giuliani, who's on his third wife, said because Hillary Clinton stood by Bill after Lewinsky that proves she is “too stupid” to be president. Boomerang. \\n\nChelsea Clinton said Trump keeps making comments about her father's infidelity “to distract from his lack of knowledge.” There we have it. \\n\nIn the newest PPP National poll, it was noted that previously 59% of Trump's Republicans did not believe President Obama was born in the United States. After Trump told them Obama is a citizen, only 33% remain birthers. Never underestimate the gullibility and willful ignorance of 59% of Republican voters. \\n\nNewsweek uncovered proof that Trump's company violated the US Embargo on Cuba which was a Federal crime. In a motor mouth word salad while trying to deny the allegations, his campaign manager Kellyanne Conway said in 1998 he spent money in Cuba—which also would have been a federal crime.", "external_links": [], "published": "2016-09-30T20:55:00.000+03:00", "crawled": "2016-10-03T06:00:07.787+03:00", "highlightTitle": ""}