{"organizations": [], "uuid": "c23286eaa19a6b230a74d7958632b111657c4add", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 4}, "facebook": {"likes": 41, "shares": 41, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nbcnews.com", "main_image": "http://media3.s-nbcnews.com/j/newscms/2016_43/1770141/michigan-poll-voter_3cac579c4ac0b164ca548d5eba9bbd8d.nbcnews-fp-1200-800.jpg", "site_section": "", "section_title": "", "url": "http://www.nbcnews.com/news/latino/amid-bitter-political-season-michigan-s-latinos-ready-vote-n673886", "country": "US", "domain_rank": 478, "title": "Amid Bitter Political Season, Michigan's Latinos Ready to Vote - NBC News", "performance_score": 0, "site": "nbcnews.com", "participants_count": 0, "title_full": "Amid Bitter Political Season, Michigan's Latinos Ready to Vote - NBC News", "spam_score": 0.132, "site_type": "news", "published": "2016-10-28T08:00:00.000+03:00", "replies_count": 0, "uuid": "c23286eaa19a6b230a74d7958632b111657c4add"}, "author": "Patricia Guadalupe", "url": "http://www.nbcnews.com/news/latino/amid-bitter-political-season-michigan-s-latinos-ready-vote-n673886", "ord_in_thread": 0, "title": "Amid Bitter Political Season, Michigan's Latinos Ready to Vote - NBC News", "locations": [], "entities": {"persons": [{"name": "patricia", "sentiment": "negative"}, {"name": "miguel", "sentiment": "none"}, {"name": "maldonado", "sentiment": "none"}, {"name": "margarita bauzá", "sentiment": "none"}, {"name": "justin sullivan/getty images", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "cynthia orosco", "sentiment": "none"}, {"name": "obama", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "clinton", "sentiment": "none"}, {"name": "bill", "sentiment": "none"}, {"name": "juanita orosco", "sentiment": "none"}, {"name": "bill pugliano", "sentiment": "none"}, {"name": "bauzá", "sentiment": "none"}, {"name": "patricia guadalupe", "sentiment": "none"}, {"name": "hillary", "sentiment": "none"}, {"name": "margarita bauza", "sentiment": "none"}, {"name": "justin sullivan", "sentiment": "none"}, {"name": "orosco", "sentiment": "none"}, {"name": "justin maldonado", "sentiment": "none"}], "locations": [{"name": "michigan", "sentiment": "none"}, {"name": "mich.", "sentiment": "none"}, {"name": "idaho", "sentiment": "none"}, {"name": "miami", "sentiment": "none"}, {"name": "guadalupe", "sentiment": "none"}, {"name": "mississippi", "sentiment": "none"}, {"name": "hawaii", "sentiment": "none"}, {"name": "st. louis", "sentiment": "none"}, {"name": "win fla", "sentiment": "none"}, {"name": "detroit", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}, {"name": "puerto rico", "sentiment": "none"}, {"name": "great lake state", "sentiment": "none"}, {"name": "southwest", "sentiment": "none"}, {"name": "detroit", "sentiment": "none"}, {"name": "ohio", "sentiment": "none"}], "organizations": [{"name": "nbc news", "sentiment": "negative"}, {"name": "wayne state university", "sentiment": "none"}, {"name": "colorado  cynthia", "sentiment": "none"}, {"name": "state", "sentiment": "none"}, {"name": "american psychological association", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "gop", "sentiment": "none"}, {"name": "instagram", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Oct 28 2016, 11:13 am ET Amid Bitter Political Season, Michigan's Latinos Ready to Vote by Patricia Guadalupe advertisement \nDETROIT, Mich. — With less than two weeks to the presidential election, a conversation with Latinos in the \"battleground\" state of Michigan finds many reeling from what has been a bitter and no-holds-barred campaign. \nMichigan resident Margarita Bauzá is a native of Puerto Rico who came to the state for college and stayed for work. She says she is \"most definitely voting\" on Election Day, but adds that the level of negativity is so nerve-wracking that she prefers not to say which candidate she'll pick on November 8. \n\"Election season is always a difficult time, especially for its impact on important relationships where families and friends have different points of view,\" said Bauzá. \"This election has been particularly disruptive in that regard. I've been coping by hitting the yoga mat as often as possible,\" she said. Detroit resident Margarita Bauzá is doing yoga to keep calm during the high-stakes political season. Margarita Bauzá / Margarita Bauza \nThe political vitriol is so bad this year that an American Psychological Association survey found that more than half say this campaign has been \"a very or somewhat significant source of stress.\" That is particularly true for Latinos in battleground states like Michigan as they watch the constant barrage of ads and campaigning. \nMore than 230,000 Michigan Hispanics are eligible to vote this year , representing nearly half of the state's Latino residents. Latinos are 5 percent of Michigan's population and 3 percent of the electorate but their numbers are expected to at least double by 2040. That number of Hispanic voters, say groups involved in voter registration efforts this year, will likely be larger once the final tally is calculated after the election. \nHispanics are not just recent arrivals; many may not know that Michigan had a significant Mexican-American population that shrank after the state took measures during the Depression to support the return of workers to Mexico. \nDemocratic candidate Hillary Clinton continues to enjoy widespread support among Latino voters nationwide. The latest Latino Decisions/Telemundo tracking poll shows Latinos backing Clinton 66 percent compared to just 15 percent for her GOP rival Donald Trump . Of the 11 states - including Michigan -- likely to determine the winner on November 8, President Obama swept them all in 2008 and all except one in 2012. Latino voters in Michigan believe that not only will Clinton likely repeat those wins, but the margin will be larger because of one factor: Donald Trump. \nRELATED: Clinton Beats Trump Among Latinos 76 Percent to 14 Percent \n\"Our choices in this election are so stark, and the vitriol and threats and fear-mongering and such coming from Donald Trump truly are scary,\" said Cynthia Orosco, a resident of suburban Detroit who works in the advertising field. \"I also think it's scary, as the mother of a young daughter, that his candidacy has given such a broad forum to people who share discriminatory, sexist, and racist points of view — we're all entitled to our opinions, but perpetuating hate serves no purpose,\" she said. \nThat \"ugliness\" that Orosco mentions is a recurring theme among Latino voters in the Great Lake State. \nRELATED: Latino Vote is 'Front and Center' in Colorado \nCynthia's mother, Juanita Orosco, also a Clinton supporter, is a 65-year-old retired autoworker who has been voting for decades, but says this election is unique - and not in a positive way. \"This is the worst and ugliest election I have seen in my life.\" \nMany of Michigan's more than 230,000 Latino voters mirror the rest of the country's Hispanic voters in backing Clinton, but also express a level of dissatisfaction overall - just like voters in other states, according to the polls. DETROIT, MI - OCTOBER 10: Supporters look on as emocratic presidential nominee former Secretary of State Hillary Clinton speaks during a campaign rally at Wayne State University on October 10, 2016 in Detroit, Michigan. A day after the second presidential debate in St. Louis, Hillary Clinton is campaigning in Michigan and Ohio. (Photo by Justin Sullivan/Getty Images) Justin Sullivan / Getty Images \nThat's true even among some Trump supporters, says Miguel, who asked to be identified only by his first name because he is afraid of backlash. \n\"I just don't want to hear about how terrible Trump is. I have a lot of family and friends who are Democrats and I know they would be mad if they knew I was voting for Trump, and I don't want to be attacked for it,\" says Miguel, an office worker. \"I've even voted for Democrats before, but I can't this time around. I'm real uncomfortable with Hillary.\" \nRELATED: More Democrat-Leaning Miami Cubans, Latinos Could Help Clinton Win Fla. \nMiguel described Clinton as a \"typical career politician\" and said Trump is a businessman; he'll know what to do. Miguel said he's seen a lot of people struggling financially. \n\"And yeah, we have to do something about illegal immigration and our borders. People forget Detroit is right on the border too —it scares me to think what kind of bad people might be coming in through here because no one is paying attention and just looking at the border with Mexico,\" said Miguel. He's a native of Michigan born to Mexican-American parents who left the Southwest to work in the state's automotive industry back in the 1960s. DETROIT, MI - MARCH 8: A resident votes in the Michigan primary March 8, 2016 in Detroit, Michigan. There are 59 Republican delegates and 130 Democratic delegates up for grabs in Michigan. Mississippi and Idaho are also holding primaries and Hawaii is holding a caucus. (Photo by Bill Pugliano/Getty Images) Bill Pugliano / Getty Images \nFirst-time voter Justin Maldonado, a community college freshman who turned 18 over the summer, said he feels slightly jealous of those who voted for the first time in previous elections. \n\"I wish I had been able to vote when President Obama first ran. Everyone was so excited back then and it was such a big deal. You felt this real electricity in the air. Now, not so much,\" said Maldonado, who adds he's not enthusiastic about any candidate this year. \nMillennials like Maldonado —those between the ages of 18 and 32 — make up more than four-in-ten of Michigan's Latinos. \nRELATED: Stars Join Latino Voter Registration Campaign to Oppose Donald Trump \n\"Trump has said some terrible things, but Hillary is not someone I'm real happy about either. I'm going to vote, for sure I'm not staying home, my family says it's real important that we all vote, but I'm still up in the air as to who (I'm picking). I'm really going to think about this and also focus on the other races on the ballot,\" he said. \nIn the meantime, Bauzá is hitting her yoga mat frequently as she counts down to Election Day. \n\"I am pretty much all about letting go right now. You can control your vote, but not the way other people vote.\" \nFollow NBC Latino on Facebook , Twitter and Instagram . Patricia Guadalupe ", "external_links": [], "published": "2016-10-28T08:00:00.000+03:00", "crawled": "2016-10-28T20:21:11.967+03:00", "highlightTitle": ""}