{"organizations": [], "uuid": "43d0550b5dedd32eb385f3c1655816f4eaf9b13c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 2}, "facebook": {"likes": 269, "shares": 269, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nbcnews.com", "main_image": "http://media2.s-nbcnews.com/j/newscms/2016_43/1548676/gettyimages-155668618_47aebf7a6c2c3c0a2f5b602589f1187f.nbcnews-fp-1200-800.jpg", "site_section": "", "section_title": "", "url": "http://www.nbcnews.com/news/asian-america/asian-american-pacific-islander-groups-work-get-out-vote-election-n672431", "country": "US", "domain_rank": 478, "title": "Asian-American, Pacific Islander Groups Work to Get Out Vote as Election Nears - NBC News", "performance_score": 2, "site": "nbcnews.com", "participants_count": 0, "title_full": "Asian-American, Pacific Islander Groups Work to Get Out Vote as Election Nears - NBC News", "spam_score": 0.016, "site_type": "news", "published": "2016-10-25T08:00:00.000+03:00", "replies_count": 0, "uuid": "43d0550b5dedd32eb385f3c1655816f4eaf9b13c"}, "author": "Chris Fuchs", "url": "http://www.nbcnews.com/news/asian-america/asian-american-pacific-islander-groups-work-get-out-vote-election-n672431", "ord_in_thread": 0, "title": "Asian-American, Pacific Islander Groups Work to Get Out Vote as Election Nears - NBC News", "locations": [], "entities": {"persons": [{"name": "ramakrishnan", "sentiment": "none"}, {"name": "raja krishnamoorthi", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "tim kaine", "sentiment": "none"}, {"name": "taumoepeau-latu", "sentiment": "none"}, {"name": "lavinia taumoepeau-latu", "sentiment": "none"}, {"name": "tengco", "sentiment": "none"}, {"name": "grace meng", "sentiment": "none"}, {"name": "tian wang", "sentiment": "none"}, {"name": "pramila jayapal", "sentiment": "none"}, {"name": "ted lieu", "sentiment": "none"}, {"name": "tian", "sentiment": "none"}, {"name": "krishnamoorthi", "sentiment": "none"}, {"name": "tammy duckworth", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "herman martir", "sentiment": "none"}, {"name": "maharath", "sentiment": "none"}, {"name": "constance wu", "sentiment": "none"}, {"name": "david", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "brady walkinshaw", "sentiment": "none"}, {"name": "karthick ramakrishnan", "sentiment": "none"}, {"name": "clinton", "sentiment": "none"}, {"name": "tina maharath", "sentiment": "none"}, {"name": "pete dicianni", "sentiment": "none"}, {"name": "lou dematteis", "sentiment": "none"}, {"name": "wang", "sentiment": "none"}, {"name": "george h. w. bush", "sentiment": "none"}, {"name": "hillary", "sentiment": "none"}, {"name": "katie mcginty", "sentiment": "none"}, {"name": "jason tengco", "sentiment": "none"}, {"name": "pat toomey", "sentiment": "none"}, {"name": "margaret cho", "sentiment": "none"}], "locations": [{"name": "pacific islander", "sentiment": "none"}, {"name": "chinatown plaza", "sentiment": "none"}, {"name": "west", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "columbus", "sentiment": "none"}, {"name": "maryland", "sentiment": "none"}, {"name": "salt lake city", "sentiment": "none"}, {"name": "nevada", "sentiment": "none"}, {"name": "ohio", "sentiment": "none"}, {"name": "las vegas", "sentiment": "none"}, {"name": "clark county", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "illinois", "sentiment": "none"}, {"name": "virginia", "sentiment": "none"}, {"name": "philadelphia", "sentiment": "none"}, {"name": "dc", "sentiment": "none"}, {"name": "u.s", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "7th district", "sentiment": "none"}, {"name": "beverly hills", "sentiment": "none"}, {"name": "utah", "sentiment": "none"}, {"name": "new jersey", "sentiment": "none"}, {"name": "pennsylvania", "sentiment": "none"}], "organizations": [{"name": "nbc news", "sentiment": "negative"}, {"name": "vietnamese student association", "sentiment": "none"}, {"name": "senate", "sentiment": "none"}, {"name": "gop", "sentiment": "none"}, {"name": "aapi", "sentiment": "none"}, {"name": "apa", "sentiment": "none"}, {"name": "house", "sentiment": "none"}, {"name": "aarp", "sentiment": "none"}, {"name": "u.s. senate", "sentiment": "none"}, {"name": "utah department of health", "sentiment": "none"}, {"name": "pacific islanders", "sentiment": "none"}, {"name": "national tongan american society", "sentiment": "none"}, {"name": "seafood city market", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "chinese americans for trump", "sentiment": "none"}, {"name": "ntas", "sentiment": "none"}, {"name": "congress", "sentiment": "none"}, {"name": "u.s. census", "sentiment": "none"}, {"name": "republican national committee", "sentiment": "none"}, {"name": "asian action network", "sentiment": "none"}, {"name": "office of grace meng  in", "sentiment": "none"}, {"name": "ohio state university", "sentiment": "none"}, {"name": "university of california", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "democratic", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "advertisement \nWith just two weeks to go before the general election, community nonprofits have been hard at work making sure Asian American and Pacific Islander (AAPI) voters head to the polls on Nov. 8. \nFrom phone banks to door knocking, from festivals to townhalls, nonpartisan organizations serving AAPI communities across the country are leaving nothing to chance, voter outreach workers tell NBC News. And it's not just the presidential contest that is driving these efforts. The results of local, state, and federal elections, they say, also matter since they stand to shape the political landscape in coming years. \nTo that end, the AAPI electorate, which accounts for roughly five percent of voters nationwide, could make a difference in battleground states, including Nevada, Ohio, Pennsylvania, and Virginia. Depending on turnout, they could also end up being the margin of victory in some states for either Republican nominee Donald Trump or Democratic candidate Hillary Clinton, according to Karthick Ramakrishnan, a public policy professor at the University of California. Post by NBC News . \nAnd with all 435 House seats up for grabs, AAPIs might tip the results of elections in 103 congressional districts, in which they account for at least five percent of the electorate . That includes Washington's 7th District , a race between Indian-American Pramila Jayapal and Brady Walkinshaw, both Democrats, and Illinois' 8th District , with Indian-American Raja Krishnamoorthi facing off against Republican Pete DiCianni. \nKrishnamoorthi and DiCianni are vying for the seat held by Asian-American U.S. Rep. Tammy Duckworth (D-Il), who is running for Senate. \n\"It looks like this will probably be a record year in terms of AAPIs getting elected to Congress, and particularly in the South Asian community,\" Ramakrishnan told NBC News. A new AARP report finds the economic health of Asian Americans age 65 and older to be much worse than the general US population of the same age. LOU DEMATTEIS / REUTERS \nBut while voter outreach workers and volunteers say the fiery political rhetoric of this campaign season has spurred many AAPIs to register to vote, apathy still exists among others who feel their votes might not matter. \nBoth major parties and the candidates' campaigns have been making efforts to win over AAPIs, realizing that the fastest growing racial group in the U.S . could help decide elections across the country. \nRELATED: Asian-American Population Surges, But Voter Turnout Still Lacks \nHaving seen AAPI support steadily wane since the 1992 presidential election, when 55 percent of Asians voted for former President George H. W. Bush, the GOP last year launched its Republican Leadership Initiative , designed to recruit and train grassroots organizers in AAPI communities. In July, the Trump campaign also formed an Asian Pacific American (APA) advisory committee, which met for the first time a day before the third and final debate in Las Vegas. Presumptive Republican presidential candidate Donald Trump meeting with members of Chinese Americans for Trump on June 3 in Beverly Hills, California. Courtesy of Tian Wang \nSome members of Trump's APA advisory committee, including Chinese Americans for Trump founder Tian (David) Wang and Asian Action Network president Herman Martir, told NBC News they've been knocking on doors and handing out literature about Trump and the GOP in swing states like Nevada, Virginia, and Pennsylvania. \nNBC News reached out multiple times by phone and email to the Trump campaign and the Republican National Committee for additional information on AAPI voter outreach efforts as Election Day nears, but did not receive a response. \nRELATED: Clinton Holds 41-Point Lead Over Trump Among Asian-American Voters: Survey \nHillary Clinton's campaign told NBC News that the Democratic nominee is not taking a single vote for granted — even as she enjoys solid support among Asian-American registered voters, leading Trump by 41 points , according to a report released in October. \n\"The only poll that matters to us is the one on November 8,\" said Jason Tengco, Clinton's AAPI outreach director. d meeting all the @HillaryClinton volunteers in NV! Great talks about amazing AAPI girls&youth&growth&empowerment pic.twitter.com/K170FSOt0K — Constance Wu (@ConstanceWu) October 9, 2016 \nTengco said Clinton's team has been shoring up the AAPI base in Nevada, Ohio, Pennsylvania, and Virginia, which running mate Tim Kaine represents in the U.S. Senate. All of these are or were battleground states, some of them with local races that can go either way. \nIn addition to door knocking and phone banking, Clinton's campaign has deployed celebrity surrogates like actress Constance Wu and comedian Margaret Cho, along with U.S. Rep. Ted Lieu (D-CA), to help register AAPIs at Las Vegas's Chinatown Plaza to vote, Tengco said. \nHer campaign has also been publicizing locations in Las Vegas where voters can cast ballots early, including at Seafood City Market, an Asian supermarket, and Chinatown Plaza, Tengco said. AAPIs make up almost nine percent of eligible voters in Clark County, according to APIAVote, which includes Las Vegas. \nMeanwhile, Clinton volunteers from New York and New Jersey, two blue states, have been trekking on weekends to the battleground state of Pennsylvania to reach out to AAPI voters, Tengco said. Volunteers bus from New York and New Jersey to Pennsylvania to stump for Hillary Clinton . Courtesy of the Office of Grace Meng \nIn mid October, U.S. Rep. Grace Meng (D-NY) and 35 others took a bus from New York to Philadelphia, a city where nearly five percent of the eligible electorate is AAPI. Volunteers went door-to-door speaking with voters not just about the presidential election, but also about federal contests, Tengco said, including the close Senate race between Democrat Katie McGinty and incumbent Republican Pat Toomey. \nTo gain control of the Senate, Democrats would have to win four seats if they take the White House (because the vice president gets to break a 50-50 tie) and five seats if they don't. \nIn Ohio, Tengco said Clinton's campaign has been using bilingual speakers and voter lists broken down by AAPI language to target specific voters. And in the DC, Maryland and Virginia area, AAPI for Hillary groups have been hosting phone banks and canvassing for votes, he added. Efforts have focused particularly on northern Virginia, given its diverse AAPI population, including Koreans, Vietnamese, and Indians, among others, he said. \"The challenge has always been getting people to understand that they have a right to vote, that you're not going to be intimidated as a result of it.\" \nBut Ramakrishnan, the public policy professor, said both parties are not doing enough to reach out to AAPIs — a demographic, he noted, that is less likely to be contacted by either Democrats or Republicans. And while community organizations are trying to pick up the slack, Ramakrishnan said they are outmatched compared to the parties and campaigns in terms of resources at their disposal. \n\"Historically, foundations have not invested nearly as much in AAPI voter education and outreach as they have in other communities of color,\" Ramakrishnan said. \nThat underinvestment, he said, stems from a lack of awareness of AAPI communities among foundation program officers. Other contributing factors include perceptions that the AAPI community is not large enough and that it doesn't need assistance because AAPIs are highly educated and have high incomes, a reflection of the model minority myth, Ramakrishnan said. \nA Community Effort \nIn spite of this, nonpartisan community groups across the U.S. have been making an all-out effort to meet with AAPIs, register new voters, and stress the importance of casting ballots on Election Day. Voter outreach workers say they hope for an improvement over the last presidential election in 2012, when roughly three in five eligible Asian-American voters were registered to vote, according to the U.S. Census , and one in two reported actually heading to the polls on Election Day. \nLooking to help beef up those numbers, nonprofit APIAVote in Ohio partnered in late September with the Vietnamese Student Association at The Ohio State University in Columbus to sign up new voters, Tina Maharath, APIAVote Ohio field fellow, told NBC News. \nBut voting can be a tough sell for millennials, she said. Post by NBC News . \nThat day, Maharath said they registered six people since most of the 80 who attended were already signed up. One way she said she tries to motivate Southeast Asians is by reminding them that some of their ancestors came to America by way of refugee camps and may not have had the opportunity to register to vote. \n\"I have to drill it down to where it gets them deep in the heart,\" Maharath said. \"Otherwise, they won't even pay any attention to me.\" \nA lack of interest in politics is another obstacle for outreach workers like Maharath. In Ohio, part of the problem on the local level, she said, is that candidates don't mention AAPIs in their speeches and generally don't do enough to engage AAPI voters. \nFrom 2008 to 2012, the number of eligible AAPI voters grew in Ohio by 18.6 percent, according to APIAVote. \n\"It really brings me down when I'm trying to get them in the political process,\" she said. Post by NBC News . \nOut in the West, efforts in Utah have also been underway to turn out the state's Native Hawaiian and Pacific Islander electorate on Election Day. While Asians make up just 2.5 percent of Utah's total population, according to the Census, the proportion of Native Hawaiians and Pacific Islanders living in Salt Lake City — the state capital — is larger than any other city in the continental U.S ., according to the Utah Department of Health. \nLavinia Taumoepeau-Latu, director of civic engagement for the National Tongan American Society (NTAS), a Utah nonprofit, told NBC News her organization has been creating a space to discuss issues important to the state's Native Hawaiian and Pacific Islander community, including healthcare, education, and racial profiling in schools. \nDuring the last couple of months, NTAS helped organize a town hall with candidates for local office and filmed public service announcements in the Tongan, Samoan, and English languages with Pacific Islanders discussing the importance of voting, Taumoepeau-Latu said. In August, NTAS also hosted the Friendly Island Tongan Festival, a three-day event now in its twentieth year that was attended by 1,200 people. \nThe group signed up around 100 new voters, while local candidates set up campaign booths to meet face-to-face with members of the Pacific Islander community, Taumoepeau-Latu said. \nAt the end of October, NTAS will also conduct phone banking to follow up with registered voters and may also hold training on how to read a ballot, she said. \nBut despite the group's best efforts, Taumoepeau-Latu added, challenges still remain. \n\"When we deal with our communities, it's a little bit different because a lot of them have voter apathy, a lot of them don't really understand the whole process of getting civically engaged,\" she said. \"Some of them have been here for a long time, which makes it really difficult to explain how important their voice matters.\" Play ", "external_links": [], "published": "2016-10-25T08:00:00.000+03:00", "crawled": "2016-10-25T22:01:54.962+03:00", "highlightTitle": ""}