{"organizations": [], "uuid": "a89fdaa520797fa8bc7f13092f3e606161d1191e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 29, "shares": 29, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nbcnews.com", "main_image": "http://media3.s-nbcnews.com/j/newscms/2016_39/1724191/election_roundup-jpeg-0580f_9614e9ea5ac4aa9dd7ae313a395e4601.nbcnews-fp-1200-800.jpg", "site_section": "", "section_title": "", "url": "http://www.nbcnews.com/news/latino/pew-report-finds-democrats-continue-struggle-latino-millennials-n664381", "country": "US", "domain_rank": 478, "title": "Pew Report Finds Democrats Continue to Struggle with Latino Millennials - NBC News", "performance_score": 0, "site": "nbcnews.com", "participants_count": 0, "title_full": "Pew Report Finds Democrats Continue to Struggle with Latino Millennials - NBC News", "spam_score": 0.277, "site_type": "news", "published": "2016-10-11T08:00:00.000+03:00", "replies_count": 0, "uuid": "a89fdaa520797fa8bc7f13092f3e606161d1191e"}, "author": "Stephen A. Nu O", "url": "http://www.nbcnews.com/news/latino/pew-report-finds-democrats-continue-struggle-latino-millennials-n664381", "ord_in_thread": 0, "title": "Pew Report Finds Democrats Continue to Struggle with Latino Millennials - NBC News", "locations": [], "entities": {"persons": [{"name": "clinton", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "stephen a. nuño", "sentiment": "none"}, {"name": "jill stein", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "ben margot", "sentiment": "none"}, {"name": "gary johnson", "sentiment": "none"}], "locations": [{"name": "chinatown", "sentiment": "none"}, {"name": "san francisco", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "nbc news", "sentiment": "negative"}, {"name": "pew", "sentiment": "none"}, {"name": "catholic", "sentiment": "none"}, {"name": "republican party", "sentiment": "none"}, {"name": "instagram", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "pew research center hispanic trends", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Oct 11 2016, 12:29 pm ET Pew Report Finds Democrats Continue to Struggle with Latino Millennials by Stephen A. Nuño A woman walks past a polling place in San Francisco's Chinatown Tuesday, Nov. 8, 2011. Ben Margot / AP Share advertisement \nThe newest report from Pew Research Center Hispanic Trends is a mixed bag of good news and looming challenges for the Democrats and politics in general. Despite the overwhelming number of Hispanics who will cast votes for Democrats in the next election, young Hispanics continue to send clear signals to both political parties that they are not connecting with their concerns. \nPolitical scientists place significant importance on a subject they call political efficacy, the belief by someone that their political participation will make a difference, and their confidence that they would be able to understand the system enough to make a change if they needed to. Low levels of political efficacy have long been seen to have a discouraging impact on voter turnout, the gold standard measure of political participation in a democracy. \nRELATED : Latino Millennials Among Most Worried By White Extremism: Poll \nPew's latest numbers highlight this problem among Hispanics, with 57 percent of respondents saying they were dissatisfied with the nation's direction, up from this time in 2012. \nMost concerning, the share of Latino registered voters who say they are \"absolutely certain\" they will vote this November is down from 77 percent in 2012 to 69 percent in 2016. This is \"after more than a year of Republican presidential candidate Donald Trump making provocative comments about Mexican and Muslim immigrants and Hispanics in general,\" the report's authors note. \nWith almost half of the Hispanic population belonging to the \"millennial generation\", failing to connect with this demographic can have a long term negative impact on governance, as well as implications for the ability of Democrats to maintain its high vote share of Latinos. \nMore concerning for Democrats is the number of millennials willing to cast their vote for someone other than Hillary Clinton, with less than half of millennials — 48 percent — saying they would cast their vote for her and 15 percent of millennials interviewed saying they would vote for Donald Trump. The rest split their votes between Jill Stein, Gary Johnson, or did not say. \nRELATED: For 2016, Almost Half of the Latino Electorate will be Millennials \nWith 64 percent of Millennial Latino voters who back Clinton saying their support is more a vote against Trump than for Clinton, Democrats will need to consider whether their luck of running against a string of Republican candidates who Latinos simply could not support may run out at sometime soon. \nIn an election season where the Republicans have essentially abandoned any hope of attracting Latino voters, it is also concerning for Democrats that their share of Latino voters has remained relatively stable over the last 16 years. \nThe share of Latino voters who identify with the Republican Party has remained constant since 1999, according to Pew's historical data, where it was 25 percent. Today that number is 24 percent, perhaps suggesting a that Democrats have reached a limit to their ability to attract a greater share of Latino voters. \nOther findings from the report: Among Latino registered voters, education is the top issue of concern (83 percent) followed by the economy, health care, terrorism and then immigration. One-in-five Hispanic registered voters will be casting their ballots for the first time Overall, Clinton supporters are more likely to be women, Catholic, foreign born, Spanish dominant and have a high school degree. Trump supporters tend to be male, U.S. born, English dominant, evangelical and have some college experience. \nFollow NBC Latino on Facebook , Twitter and Instagram . Stephen A. Nuño ", "external_links": [], "published": "2016-10-11T08:00:00.000+03:00", "crawled": "2016-10-12T01:36:17.520+03:00", "highlightTitle": ""}