{"organizations": [], "uuid": "5b15b8a2bbe98fae8b358dc2071cb555f36d9f5d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 910, "shares": 910, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nbcnews.com", "main_image": "http://media3.s-nbcnews.com/j/newscms/2016_39/1729586/gettyimages-587569580_d5673f7cc618e5fabc4c138638cbc672.nbcnews-fp-1200-800.jpg", "site_section": "", "section_title": "", "url": "http://www.nbcnews.com/storyline/vice-presidential-debate/how-tim-kaine-quickly-became-reliable-messenger-clinton-n659281", "country": "US", "domain_rank": 478, "title": "How Tim Kaine Quickly Became a Reliable Messenger for Clinton - NBC News", "performance_score": 9, "site": "nbcnews.com", "participants_count": 0, "title_full": "How Tim Kaine Quickly Became a Reliable Messenger for Clinton - NBC News", "spam_score": 0.023, "site_type": "news", "published": "2016-10-04T08:00:00.000+03:00", "replies_count": 0, "uuid": "5b15b8a2bbe98fae8b358dc2071cb555f36d9f5d"}, "author": "Kailani Koenig", "url": "http://www.nbcnews.com/storyline/vice-presidential-debate/how-tim-kaine-quickly-became-reliable-messenger-clinton-n659281", "ord_in_thread": 0, "title": "How Tim Kaine Quickly Became a Reliable Messenger for Clinton - NBC News", "locations": [], "entities": {"persons": [{"name": "kailani koe", "sentiment": "negative"}, {"name": "clinton", "sentiment": "negative"}, {"name": "ku klux", "sentiment": "none"}, {"name": "tim kaine", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "david duke", "sentiment": "none"}, {"name": "kaine", "sentiment": "none"}, {"name": "mark kelly", "sentiment": "none"}, {"name": "bone burnett", "sentiment": "none"}, {"name": "obama", "sentiment": "none"}, {"name": "lindsey buckingham", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "stephen colbert", "sentiment": "none"}, {"name": "reno", "sentiment": "none"}, {"name": "michael bolton", "sentiment": "none"}, {"name": "kailani koenig", "sentiment": "none"}, {"name": "eva longoria", "sentiment": "none"}, {"name": "mark warner", "sentiment": "none"}, {"name": "mike pence", "sentiment": "none"}, {"name": "gabby giffords", "sentiment": "none"}, {"name": "black", "sentiment": "none"}, {"name": "jack kennedy", "sentiment": "none"}, {"name": "al", "sentiment": "none"}], "locations": [{"name": "kansas city", "sentiment": "none"}, {"name": "wilmington", "sentiment": "none"}, {"name": "rhode island", "sentiment": "none"}, {"name": "cleveland", "sentiment": "none"}, {"name": "richmond", "sentiment": "none"}, {"name": "orlando", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}, {"name": "baltimore", "sentiment": "none"}, {"name": "richmond", "sentiment": "none"}, {"name": "va", "sentiment": "none"}, {"name": "uso building", "sentiment": "none"}, {"name": "honduras", "sentiment": "none"}, {"name": "norfolk", "sentiment": "none"}, {"name": "ohio", "sentiment": "none"}, {"name": "new orleans", "sentiment": "none"}, {"name": "las vegas", "sentiment": "none"}, {"name": "virginia", "sentiment": "none"}, {"name": "va.", "sentiment": "none"}, {"name": "atlanta", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}, {"name": "dayton", "sentiment": "none"}, {"name": "new york city", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "north carolina", "sentiment": "none"}, {"name": "chickahominy", "sentiment": "none"}, {"name": "georgia", "sentiment": "none"}, {"name": "michigan", "sentiment": "none"}, {"name": "pennsylvania", "sentiment": "none"}, {"name": "central park", "sentiment": "none"}], "organizations": [{"name": "nbc news oct", "sentiment": "negative"}, {"name": "trump", "sentiment": "none"}, {"name": "va tech", "sentiment": "none"}, {"name": "hillary for america & the democratic party", "sentiment": "none"}, {"name": "national urban league", "sentiment": "none"}, {"name": "virginia tech", "sentiment": "none"}, {"name": "senate", "sentiment": "none"}, {"name": "nbc news", "sentiment": "none"}, {"name": "green restaurant", "sentiment": "none"}, {"name": "kaine &amp; pence", "sentiment": "none"}, {"name": "dnc", "sentiment": "none"}, {"name": "telemundo", "sentiment": "none"}, {"name": "fiesta mexicana", "sentiment": "none"}, {"name": "fleetwood mac", "sentiment": "none"}, {"name": "univision", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Oct 4 2016, 12:21 pm ET How Tim Kaine Quickly Became a Reliable Messenger for Clinton by Kailani Koenig advertisement \nRICHMOND, Va. —For Tim Kaine, the logistical adjustment to being a vice presidential nominee seems to have been more jarring than the transition to effective campaign messenger. \nTwo weeks after Kaine took his famous phone call on a Rhode Island pier from Hillary Clinton asking him to join her as her running mate, the Virginia senator remained in awe of the situation around him. He told volunteers in Michigan then that \"it feels like I got kidnapped.\" Even just last month at an event in Norfolk, Virginia, Kaine marveled at Clinton picking him: \"I felt like Pinocchio turning into a real boy. What, me?\" Play VPs' task: 'Make the candidates look good' 4:35 autoplay autoplay Copy this code to your website or blog <iframe src=\"http://www.nbcnews.com/widget/video-embed/778852419737\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen></iframe> \nUp until the moment he was chosen, Kaine was living a largely normal life within the bounds of being a U.S. senator, doing his own errands and showing up to many of his public events by himself in his own car. Since then, his entourage has grown substantially with secret service, more staffers, and a crew of reporters following him everywhere he goes. \nBut the process of melding into the campaign as an effective partner for Clinton has been fairly seamless and Kaine has proven to be a highly reliable messenger for the ticket, echoing the campaign's daily talking points and becoming a smooth-running part of the campaign's tightly controlled machine without the threat of ever going rogue. \nAt Tuesday night's vice presidential debate in Kaine's home state of Virginia, the senator's challenge will be to keep that steady message going. Staying on point \nWhile a few members of Kaine's Senate office moved over to work for him on the campaign, including his former chief of staff and communications director, it is largely people from the Clinton campaign who are in charge of the operation around Kaine now. \nOn a daily basis, the message Kaine is pushing on the campaign trail is in lockstep with the overall Clinton campaign. The week of the NBC News Commander-In-Chief forum, when Clinton was focused on hitting Trump on national security issues, Kaine gave a wide-ranging speech at a historic USO building in Wilmington, North Carolina condemning what he sees as Trump's \"disqualifying\" foreign policy views. \nThe day after Hillary Clinton gave an extensive speech in Reno aiming to tie Trump to the \"alt-right\" corners of the country, Kaine doubled down on her message, telling a crowd the next day at one of Florida's historically black colleges, \"Ku Klux Klan values, David Duke values, Donald Trump values are not American values, they're not our values, and we've got to do all we can to fight to push back and win.\" \nKaine's campaigning and fundraising travels have so far taken him to 35 states - many of them multiple times - and hundreds of people show up to see him at each visit, although in most cases the people coming to see Kaine are already big Clinton supporters or volunteers. The senator spends considerable time after almost every event taking pictures and shaking hands. But unlike his rival Mike Pence, who regularly does town halls where he takes questions from voters, Kaine has never held a \"town hall\" as the vice presidential nominee where he took formal questions from the people who show up to see him. \nAlthough Kaine's campaign stops in swing states rarely end up dominating major national headlines, his visits are geared toward getting local news coverage. Kaine does interviews with local TV stations or publications at almost every market he visits. Play Vice presidential debates: 'You're no Jack Kennedy' and other memorable moments 3:11 autoplay autoplay Copy this code to your website or blog <iframe src=\"http://www.nbcnews.com/widget/video-embed/778721859943\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen></iframe> \nIf there are disputes he has with Clinton, Kaine prefers to keep those out of the public eye. \"You think I'm new at this?\" Kaine told Stephen Colbert when asked about any issues where he and Clinton disagree, pointing to his experience as a both a lieutenant governor under Mark Warner and a DNC chairman under President Obama. \"My deal was the same as with Hillary Clinton, which is, 'I'll tell ya if I disagree with you and I may lobby, but you're going to hear about it from me. You're not going to read about it in the press and you're not going to see it on TV.' The relationship works when you play a supportive role like that if you are extremely candid in person, but you can't surprise folks.\" \nEven though their message and talking points are usually in tandem, Kaine doesn't necessarily talk with Clinton on a daily basis, a fact that became evident when he eventually admitted that he didn't learn of her pneumonia diagnosis until two days later. \n\"We don't talk every day, but in terms of communicating either directly or in a larger group we're communicating, it's -- you know, most, like within a two-day period we're doing something together, talking to each other,\" he told reporters at a press conference in Dayton, Ohio last month, pointing out, \"any time I need to talk to her, I do. And we talk immediately. Sometimes it's one-on-one and sometimes it's part of a larger group.\" \nWhile Pence regularly appears with Trump on the trail - roughly once a week or so - Kaine and Clinton have primarily campaigned separately. They kicked off a 3-day bus tour together across Pennsylvania and Ohio after the Democratic National Convention, and they held a joint rally together on Labor Day in Cleveland, but they have not campaigned together since. Stressing the biography \nOn the campaign trail over the last few months, Kaine has hit all of the major swing states for rallies or public appearances, but many of his stops have been tailor-made to accentuate details of his biography. \nIn a major address to the National Urban League in Baltimore, on August 4th, Kaine spoke in depth about the racial \"scar tissue\" in his home city of Richmond, Virginia - a majority minority city -- highlighting his work as a civil rights lawyer focusing on housing discrimination cases and as a local city councilman and mayor while the city continued to work through racial division. \"Those of us in the majority, we are not forced to learn the ways of anybody else,\" he said that day . \"And we can insulate or wall ourselves off, even without intending to. We have to force ourselves out of our comfort zone to learn about the realities of all the beautiful parts of this wonderful American tapestry.\" \nDays later, Kaine sang along to himself before he spoke to a crowd at the Progressive National Baptist Convention in New Orleans, and spoke at length both about his faith, his long-time, diverse church in Richmond, his civil rights work and thoughts on voting rights and criminal justice reform. Play Kaine &amp; Pence hunker down for VP debate prep 2:29 autoplay autoplay Copy this code to your website or blog <iframe src=\"http://www.nbcnews.com/widget/video-embed/778562627793\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen></iframe> \nOn August 22nd, Kaine addressed the Ironworkers International Convention in Las Vegas and spoke with workers at the Local 525 Plumbers and Pipefitters training center, as he worked to push themes about unions, small businesses, and Trump's history of making products overseas. Kaine told stories about his father, Al, who was in attendance, and who ran an ironworking shop near the stockyards of Kansas City, as the campaign tried to appeal to these crowds of mostly white men with technical education training, a group Trump has made inroads with. \nOn one of his single \"days off\" from the trail last month on September 24th, Kaine wanted to pay a visit to the Chickahominy Indian Tribe Fall Festival & Pow Wow in Providence Forge, Virginia, an event he has attended for years with people who have \"enriched\" his life. He told reporters there about his ongoing efforts to get six Virginia tribes federal recognition. Kaine spoke about his ongoing efforts to get six VA tribes including the Chickahominy federal recognition, & the Pamunkey tribe's success. pic.twitter.com/FkW9tS82WF — Kailani Koenig (@kailanikm) September 24, 2016 \nThe campaign has also been constantly utilizing Kaine's Spanish speaking skills, as he does regular interviews with Univision, Telemundo, and their affiliates, and he will break back and forth into Spanish as he talks about his experience as a young missionary working in Honduras while campaigning in places like Florida and Texas. On September 25th, Kaine stopped by Fiesta Mexicana in Atlanta, Georgia, an annual local festival featuring Latin entertainers where Kaine spoke almost entirely in Spanish while greeting people at the festival for more than an hour and speaking on stage about immigration and voting. \nThen the next day on September 26th, Kaine made a stop in Florida that served as a somber reminder of the toughest period of his career. The senator made a quiet, unannounced visit to the site of the Pulse Nightclub shooting in Orlando with Gabby Giffords and Mark Kelly. Kaine was governor of Virginia during the massacre at Virginia Tech in 2007, and he refers to that day as the worst day of his life. At the Pulse site, Kaine approached the small group of reporters following him with tears in his eyes. \"This is a weird thing to say, but I always hoped that the Virginia Tech one would be the worst one ever,\" he said, appearing to choke up. \"As bad as that was, I hoped that nothing would ever eclipse it but, such as life. We got work to do.\" Very emotional moment as a choked up Kaine visited Pulse shooting site. \"I always hoped that the VA Tech one would be the worst one ever.\" pic.twitter.com/vn5oUovyMp — Kailani Koenig (@kailanikm) September 26, 2016 The other trail \nWhile Kaine has been traveling almost non-stop since joining Clinton's ticket, he hasn't just been on the campaign trail -- he's spent a considerable time chasing the money trail, attending nearly 80 private fundraisers since the start of August, more than the number of publicly advertised campaign events he has done in the same amount of time. At these private fundraisers, which have all been closed to the public and the press, Kaine has raised money at the homes of celebrities like Eva Longoria, and appeared alongside musical guests like Lindsey Buckingham from Fleetwood Mac, T Bone Burnett, Michael Bolton, and Asleep At The Wheel. \nThe fundraisers have been in all corners of the country with varying degrees of pricing to attend. One of the more pricey appearances was at the Tavern on the Green Restaurant in Central Park in New York City last month, where five people contributed up to $500,000 to attend. \nOne of Kaine's assets as a running mate was always going to be his connections to major donors who he grew to know during his years as chairman of the DNC. On Saturday, the Clinton campaign boasted their strongest fundraising month yet, raising $154 million for Hillary for America & the Democratic Party in September, leaving them with more than $150 million in the bank. \nWhen he was asked on his plane recently about his role in raising massive amount of money while also pushing for campaign finance reform, he told reporters, \"I'm going to keep pushing for reform, but if the other side's going to block reform, and I have to play an away game on their field, I'm going to play an away game on their field.\" Kailani Koenig ", "external_links": [], "published": "2016-10-04T08:00:00.000+03:00", "crawled": "2016-10-05T06:20:56.895+03:00", "highlightTitle": ""}