{"organizations": [], "uuid": "7fa7e5ddf259173643b8de4a50e6338da2e4732e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 7, "shares": 7, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nbcnews.com", "main_image": "http://nodeassets.nbcnews.com/images/og-nbcnews200x200.gif", "site_section": "", "section_title": "", "url": "http://www.nbcnews.com/card/trump-ticket-muddles-fbi-quid-pro-quo-story-n667801", "country": "US", "domain_rank": 478, "title": "Trump Ticket Muddles FBI 'Quid Pro Quo' Story - NBC News", "performance_score": 0, "site": "nbcnews.com", "participants_count": 0, "title_full": "Trump Ticket Muddles FBI 'Quid Pro Quo' Story - NBC News", "spam_score": 0.054, "site_type": "news", "published": "2016-10-18T09:24:00.000+03:00", "replies_count": 0, "uuid": "7fa7e5ddf259173643b8de4a50e6338da2e4732e"}, "author": "Christina Coleburn", "url": "http://www.nbcnews.com/card/trump-ticket-muddles-fbi-quid-pro-quo-story-n667801", "ord_in_thread": 0, "title": "Trump Ticket Muddles FBI 'Quid Pro Quo' Story - NBC News", "locations": [], "entities": {"persons": [{"name": "donna brazile", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "bill clinton", "sentiment": "none"}, {"name": "obama", "sentiment": "none"}, {"name": "brazile", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "clinton", "sentiment": "none"}, {"name": "james comey", "sentiment": "none"}, {"name": "ronald reagan", "sentiment": "none"}, {"name": "patrick kennedy", "sentiment": "none"}, {"name": "kennedy", "sentiment": "none"}, {"name": "mike pence", "sentiment": "none"}, {"name": "hillary", "sentiment": "none"}, {"name": "pence", "sentiment": "none"}], "locations": [{"name": "united states", "sentiment": "none"}, {"name": "new hampshire", "sentiment": "none"}, {"name": "qatar", "sentiment": "none"}, {"name": "miami", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "virginia", "sentiment": "none"}, {"name": "portsmouth", "sentiment": "none"}, {"name": "wisconsin", "sentiment": "none"}], "organizations": [{"name": "nbc news", "sentiment": "negative"}, {"name": "trump ticket muddles fbi", "sentiment": "negative"}, {"name": "new york university school of law", "sentiment": "none"}, {"name": "cnn", "sentiment": "none"}, {"name": "nbc news/wall street journal", "sentiment": "none"}, {"name": "trump claims widespread 'voter fraud", "sentiment": "none"}, {"name": "clinton foundation", "sentiment": "none"}, {"name": "tax foundation", "sentiment": "none"}, {"name": "trump organization", "sentiment": "none"}, {"name": "trump got right and wrong", "sentiment": "none"}, {"name": "miss utah", "sentiment": "none"}, {"name": "unless trump", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "grateful dead", "sentiment": "none"}, {"name": "congress", "sentiment": "none"}, {"name": "abc news/washington post", "sentiment": "none"}, {"name": "drug kingpins", "sentiment": "none"}, {"name": "fbi", "sentiment": "none"}, {"name": "brennan center for justice", "sentiment": "none"}, {"name": "state", "sentiment": "none"}, {"name": "dnc", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "customs enforcement", "sentiment": "none"}, {"name": "congressional", "sentiment": "none"}, {"name": "state department", "sentiment": "none"}, {"name": "wikileaks", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "latest posts from WHAT ARE THE FACTS? 6 hours ago Trump Ticket Muddles FBI 'Quid Pro Quo' Story \n\"The FBI documents show that Undersecretary of State Patrick Kennedy made the request for altering classification as part of a 'quid pro quo.' \" Trump said at a Wisconsin rally Monday. \"This is felony corruption. under secretary Kennedy needs to resign.\" \nBoth the FBI and State Department say no such quid pro quo deal existed, and note that the two actionable items — a change of classification, and FBI office space for agencies in overseas embassies — were part of separate requests. The email remained classified, despite Kennedy's disagreement on its classification. What's more: Kennedy did not propose the quid pro quo; the FBI agent did. Kennedy's agency later ordered a review of his conduct. \nThe episode appears to have been borne from a misunderstanding and muddled conversations, NBC News reported Monday. \n\"The FBI confirmed today that the State Department and senior State Department officials offered a quid pro quo to the FBI to cover up classified documents that were on Hillary Clinton's private server,\" Gov. Mike Pence said on Monday. \"According to documents, listen up on this, folks, this is real. According to documents released by the FBI today, one of Hillary Clinton's top, top aides, Under Secretary of State, contacted the FBI to ask the FBI to change the classified status of emails on Hillary Clinton's private server in exchange for a quid pro quo,\" \nThe FBI denied the allegation. It did not confirm it, as Pence alleges, and they also noted that the FBI agent is the one who offered quid pro quo, not the State Department official. 6 hours ago Actually, the Electric Chair Is Still In Use \n\"If Donald Trump got the questions and answers, do you know what they'd do? They'd reinvent the electric chair!\" Republican nominee Donald Trump quipped while slamming rival Hillary Clinton for allegedly receiving a debate question in advance of a debate. \nThe electric chair still exists — and it's still in use. \nIts use is still legal in a handful of states, and it's making a comeback as lethal injection drugs grow scarce. The most recent execution by electric chair was three years ago in Virginia. 17 hours ago Trump Claims Widespread 'Voter Fraud;' Data Says Otherwise \nAn investigation of 1 billion ballots cast over more than a decade found just 31 credible incidents of voter fraud. \nThe Brennan Center for Justice at New York University School of Law found that \"it is more likely that an individual will be struck by lightning than that he will impersonate another voter at the polls.\" Of course there is large scale voter fraud happening on and before election day. Why do Republican leaders deny what is going on? So naive! Trump Misleads On Clinton's Support From Women \nDonald Trump tweeted Sunday that Hillary Clinton was down 11 points with women. \n\"Finally, in the new ABC News/Washington Post Poll, Hillary Clinton is down 11 points with WOMEN VOTERS and the election is close at 47-43!\" he wrote. \nHowever, a closer look at the poll results indicate that Trump is misinterpreting Clinton's support among female voters. \nIn the ABC News/Washington Post poll that Trump referenced, Clinton actually leads by 8 points among women. She and Trump now run evenly among men, an unanticipated shift from polls taken at the end of September when Clinton had a 19-point advantage with women and Trump had a 19-point lead with men. The latest poll indicates that Trump has gained among white women without college degrees while Clinton has made inroads with white men. \nA new NBC News/Wall Street Journal poll conducted entirely after the second presidential debate shows an even starker gender gap. Its findings indicate that Clinton holds a 20-point lead among female voters in a two-way race, 55 percent to 35 percent. Trump is ahead among men by only three points, 48 percent to 45 percent. Finally, in the new ABC News/Washington Post Poll, Hillary Clinton is down 11 points with WOMEN VOTERS and the election is close at 47-43! 2 days ago Fact Check: No, Obama Isn't Flooding Streets with Drug Kingpins \n\"President Obama has commuted the sentences of record numbers of high level drug traffickers, many of them kingpins, and violent armed traffickers with extensive criminal histories. Hillary Clinton promises to continue and expand this approach, turning our streets back over to gangs, drug cartels, and armed career criminals. Over the last few years this administration has been steadily dismantling the federal criminal justice system. Tens of thousands of drug dealers have been released from prison early, including many illegal immigrants--regardless of their history of violence, or ties to transnational gangs and cartels,\" Donald Trump said on Saturday according to prepared remarks for his Portsmouth, New Hampshire speech. \nPresident Obama is not flooding the streets with drug kingpins, as Donald Trump alleges, and Hillary Clinton has not voiced support for doing anything similar. \nThe president has commuted the sentences of a record number of nonviolent drug offenders, like a 25-year-old convicted of selling LSD while following the Grateful Dead on tour and sentenced to life in prison. He will now be released in 2018. The commutations are designed to combat long, draconian, drug sentencing. \nSome with longer criminal records have benefited from Obama's policy, like one Miami dealer who oversaw several drug dealers and had weapons charges on this record. His sentence was reduced from life in prison to 30 years; he'll be released sometime after 2035. The White House says all applicants for commutation are evaluated \"to determine that an applicant is ready to make use of his or her second chance.\" \nLast year, the federal government — prompted not by Obama but an independent body that unanimously approved lowering sentencing charges — also released 6,000 prisoners convicted of drug-related charges released early after being deemed not to be a threat to society by judges. That's not tens of thousands, as Trump alleges, but the administration did say as many as 40,000 could become eligible for similar early release programs in the coming years. \nAs for his suggestion that these are \"illegal immigrants\" with cartel ties? All non-U.S. citizens (roughly one in three) face deportation or deportation hearings. 3 days ago Trump Ditched the Teleprompters — Here Are 6 Facts He Blurred \n1. \"Crooked Hillary is giving you a big tax increase, your taxes will go way down under a Trump administration.\" \nThis is only true if Trump's crowd is full of rich folks: Under Trump's plan, the conservative Tax Foundation expects that the bottom 80 percent of Americans will see just 0.8 percent to 1.8 percent more income after his tax cuts. Clinton's plan will only increase taxes for America's wealthiest earners. \n2. Clinton deleted emails \"to cover up her crimes.\" \nClinton deleted 33,000 emails, thousands of which were found on other servers. FBI Director James Comey said, \"We found no evidence that any of the additional work-related emails were intentionally deleted in an effort to conceal them.\" \n3. \"I pay contractors on time, I am so good.\" \nHundreds of contractors including cabinet makers, dishwashers, waitresses and more have alleged that their bills were not paid. One such contractor, a piano manufacturer, said the quality of his work was never contested by the Trump Organization. They simply said they were \"short on funds\" and would only pay 70 percent of the bill. \n4. \"Murders in the United States are up 45 — did you see the numbers — the highest they've been in 45 years. Murder's the highest it's been in 45 years.\" \nIt's not, though the murder rate hike is at its highest point in 45 years. \n5. Trump said the U.S. Immigration and Customs Enforcement (ICE) agency endorsed him. \nAgain: They did not; a union of some of their employees did. \n6. \"[The military has] fighter jets that are so old that they have to go to museums where they're on display. They have to plane graveyards because they don't make the parts anymore. \" \nThere's some truth to Trump's statement. Politifact reached out to a range of third-party experts and found that some military jets are more than 20 years old. But that's not to say that the U.S. military doesn't invest in new planes for its forces. What Trump Got Right and Wrong On Friday \nHere's what Trump got wrong, and right, in his Friday afternoon speech. \n1. \"Your taxes go way down under a Trump administration.\" \nUnless Trump's crowd is filled with extremely wealthy Americans, their taxes will not go \"way down.\" \nThe wealthy would see the biggest tax cut under Trump's plan, according to the conservative Tax Foundation's analysis. The bottom 80% of Americans, would see 0.8 percent to 1.9 percent more after-tax income thanks to Trump's tax cuts. The richest 1 percent of Americans would see income gains between 10 percent and 16 percent. \n2. \"Crooked Hillary is doing no more public events until after the debate. They say she's doing debate prep, but really she's just resting.\" \nIt's true that Clinton doesn't have any publicly scheduled events until after the debate, but there is no evidence she is napping. She prepares at length: For a previous debate , Clinton hunkered down in hotels near her home for day-long sessions of debate prep with her advisors, often working until very late at night. \n3. \"Hillary bleached and deleted 33,000 emails after a Congressional subpoena. She got a subpoena from Congress…and she said get rid of 'em, delete 'em, bleach 'em, nobody bleaches because it's such an expensive process, she bleaches them, and then she made everyone get rid of iPhones, hammer them.\" \nClinton requested that 33,000 emails deemed personal by her team be deleted weeks before the Congressional subpoena; she did not stop their deletion, but it was not a direct response to the subpoena. She did not use an expensive process to delete her emails. She used a free app called BleachBit. Some of her mobile phones were destroyed with a hammer, but that was also not a response to the Congressional subpoena. \n4. Trump said Qatar gave $1 million dollars for \"Bill Clinton's birthday party.\" \nThe Emirate gave the Clinton Foundation $1 million dollars as a birthday present; that money went towards charitable acts, not festivities. \n5. \"WikiLeaks shows media conspires with the campaign, including giving the questions and answers before the debate.\" \nCNN and DNC Chair Donna Brazile deny that a debate question was ever given to the Clinton campaign, though an email does appear to show a question being offered up by Brazile to the Clinton campaign. \n6. \"I have no idea who these women are,\" Trump said of the women who have come forward to accuse him of improper sexual advances and groping. \nThis has become a routine denial for Trump, but months before he started denying he knew a Miss Utah who accused him of kissing her on the lips without consent, he argued that she'd personally recanted the story and that she was a \"nice girl.\" \n7. \"Biggest tax cut since Ronald Reagan.\" ", "external_links": [], "published": "2016-10-18T09:24:00.000+03:00", "crawled": "2016-10-18T10:20:27.169+03:00", "highlightTitle": ""}