{"organizations": [], "uuid": "b51eb6c9f7387cc84de11ea227bc51a8593da36f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 40, "shares": 40, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nbcnews.com", "main_image": "http://media1.s-nbcnews.com/j/newscms/2016_39/1731746/shameless_1_6b3a41eea5d5bb0b08487e54aeb58515.nbcnews-fp-1200-800.jpg", "site_section": "", "section_title": "", "url": "http://www.nbcnews.com/feature/nbc-out/shameless-polyamorous-throuple-next-door-n657581", "country": "US", "domain_rank": 478, "title": "The 'Shameless' Polyamorous Throuple Next Door - NBC News", "performance_score": 0, "site": "nbcnews.com", "participants_count": 0, "title_full": "The 'Shameless' Polyamorous Throuple Next Door - NBC News", "spam_score": 0.193, "site_type": "news", "published": "2016-10-01T08:00:00.000+03:00", "replies_count": 0, "uuid": "b51eb6c9f7387cc84de11ea227bc51a8593da36f"}, "author": "Trish Bendix", "url": "http://www.nbcnews.com/feature/nbc-out/shameless-polyamorous-throuple-next-door-n657581", "ord_in_thread": 0, "title": "The 'Shameless' Polyamorous Throuple Next Door - NBC News", "locations": [], "entities": {"persons": [{"name": "isidora", "sentiment": "negative"}, {"name": "trish bendix", "sentiment": "negative"}, {"name": "kev", "sentiment": "none"}, {"name": "goreshter", "sentiment": "none"}, {"name": "debbie", "sentiment": "none"}, {"name": "svetlana", "sentiment": "none"}, {"name": "frank", "sentiment": "none"}, {"name": "veronica fisher", "sentiment": "none"}, {"name": "steve howie", "sentiment": "none"}, {"name": "mickey", "sentiment": "none"}, {"name": "steve howey", "sentiment": "none"}, {"name": "hampton", "sentiment": "none"}, {"name": "veronica", "sentiment": "none"}, {"name": "isidora goreshter", "sentiment": "none"}, {"name": "shanola hampton", "sentiment": "none"}, {"name": "monica", "sentiment": "none"}, {"name": "lipson", "sentiment": "none"}, {"name": "ian", "sentiment": "none"}, {"name": "kevin", "sentiment": "none"}, {"name": "kevin ball", "sentiment": "none"}, {"name": "paul sarkis", "sentiment": "none"}], "locations": [{"name": "svetlana", "sentiment": "none"}, {"name": "south side chicago", "sentiment": "none"}, {"name": "los angeles", "sentiment": "none"}], "organizations": [{"name": "nbc news oct", "sentiment": "negative"}, {"name": "abc", "sentiment": "none"}, {"name": "showtime cliff lipson / showtime", "sentiment": "none"}, {"name": "audience network", "sentiment": "none"}, {"name": "showtime showtime", "sentiment": "none"}, {"name": "nbc", "sentiment": "none"}, {"name": "gallaghers", "sentiment": "none"}, {"name": "instagram", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "showtime", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Oct 1 2016, 9:32 am ET The 'Shameless' Polyamorous Throuple Next Door by Trish Bendix (L-R) Isidora Goreshter as Svetlana, Shanola Hampton as Veronica Fisher and Steve Howey as Kevin Ball in \"Shameless.\" Cliff Lipson / SHOWTIME Share advertisement \nShowtime's family comedy, \"Shameless,\" has quietly been one of the most boundary pushing shows on premium cable, especially when it comes to sex and relationships. The Gallaghers and their extended chosen family of friends are some of the queerest to ever exist, with Ian's coming out and subsequent relationships with men, Monica's leaving Frank for a butch trucker and then later a pixie-haired woman she met while institutionalized, and Debbie's willingness to feign interest in a woman dying of cancer in order to try and seduce her rich husband. \nIn the Gallaghers' world, there are rich lesbians gentrifying the neighborhood and gay teens with guns. For better or for worse, their poor but recently deemed up-and-coming South Side Chicago neighborhood is where lines have been crossed so many times that there's no way to establish where they begin or end—and that's what makes it so fun to watch. \nSeason 7, premiering Sunday on Showtime, will expand on the notions of love and family with the throuple that they established at the latter half of season 6: Veronica (Shanola Hampton), Kevin (Steve Howie) and Svetlana (Isidora Goreshter). The cast of \"Shameless\" on Showtime SHOWTIME \nPolyamorous relationships are still taboo on television with little exploration given to the idea that three (or more) people can be involved romantically and sexually. But on a show like \"Shameless,\" it's almost commonplace for an interracial couple (Kevin and Veronica, or Kev and V to those who know them well) to be partnered parents who then bring Svetlana, a Russian prostitute, to live with them after V marries Svetlana so she can stay in the country. Oh, and they have three babies to raise among them—twin baby girls that Veronica's mom birthed from Kevin's sperm and one son that Svetlana had after getting pregnant by Mickey, Ian's former boyfriend who is now in prison (see: gay teens with guns above). A modern family, indeed. \nSeries regular Shanola Hampton was not thrilled about the idea at first. \n\"I hated it, to be honest with you,\" she said. \"I felt like Kevin and Veronica had been the stability throughout the show. Even when they were going through their marital difficulties and having a relationship, there was still something there that said they would only love one another. So when I saw that that love was sort of being divided or going some place else—wait a minute? Is that true for these characters? I don't know that that's right to me.\" Shanola Hampton as Veronica Fisher and Steve Howey as Kevin Ball in \"Shameless\" on Showtime Paul Sarkis / SHOWTIME \nIt was after she found a way to see how Veronica's love for Kevin wasn't diminished by their mutual relationship with Svetlana that she came to embrace the storyline. \n\"I had to make it make sense in my head,\" Hampton said. \"What happens is sometimes you just meet another person, and it doesn't take away the love that you have for your person—the person that you're in love with. But sometimes there's just this connection that you cannot deny, and a lot of people spend time denying it for all of the right reasons in their head, but it's still there, and something pulled us together.\" \n\"It's such an interesting dynamic between the three of us,\" Goreshter added. \"I think all three of them kind of understand that Kev and V are endgame, and nobody really wants to fuck with that. I think Svetlana has her own—she has her own agenda with what she wants. She's not there to break up a marriage. She's smarter than that.\" \nRELATED: The Pfeffermans Are Perfectly Imperfect in 'Transparent' Season 3 \nWhen season 7 returns, there appears to be a harmonious hum in the threesome's household. They take turns with chores (in all senses of the word) and work together at their dive bar, The Alibi. But the actresses tease that things won't stay sane for long. \n\"It's not as sexy for Kev,\" Hampton said. \"The sex is great, but you now have two women to tell you 'Why didn't you clean up the damn house?' And he's like 'Wait a minute—are ya'll ganging up on me?'\" \nShe likens it to being part of a \"threeway friendship\" at times. \n\"Imagine, you know, you're always like 'Well wait a minute—you didn't tell me that story. Are ya'll closer than we are? I thought we were all best friends!' And then this way it's like we're all married, so 'Why didn't we have this conversation?' And sometimes it comes up the other way where Kevin and Veronica agree on something, and Svetlana is like 'Wait a minute—we're supposed to be in a marriage, and we discuss and go through everything, but now you're not discussing this with me?'\" Hampton said. \"So yeah, a lot of that does come up in the dynamic of being with multiple partners.\" \nA sex worker until very recently, Svetlana seems to prefer women when she's not just using sex to get something specific that she wants. Her attraction to Veronica is made clear in very explicit scenes the women share in season 6, though Goreshter notes Svetlana is not necessarily in the relationship just for the sex. \n\"She's not a robot—she has feelings, and she's incredibly attracted to Veronica. I don't think she would put herself in these sexual positions of vulnerability if there wasn't some sort of element of emotion there,\" Goreshter explained. \"I'm not saying you're seeing the cracks of Svetlana open up, but there definitely is an emotional element to the situation or else she wouldn't be putting herself out there like she is for them.\" \nGoreshter, however, does acknowledge her character's limits: \"I don't know if she's capable of love, because she's been through so much damage, abuse, immigration, prostitution—but it's all part of her core and who she is, and she wouldn't be Svetlana without any of those things in her past.\" \nFor Veronica, the sexual interest in Svetlana may have been less of a surprise than the emotional. \n\"That moment where they're having a beer in bed, and Svetlana is smoking a cigarette, and of all people, Veronica was asking this Russian whore ... how to be a good parent and how to love her child, and that's when I think that you started to see the walls break down for Veronica—because it's hard for her to accept anyone in her life.\" (L-R) Isidora Goreshter as Svetlana, Shanola Hampton as Veronica Fisher and Steve Howey as Kevin Ball in \"Shameless\" on Showtime Cliff Lipson / SHOWTIME \nLast season, Kevin expressed his jealousy over the time Svetlana and Veronica spent together, but Hampton said there has yet to be a moment where V is unhappy with any attention Kevin is giving Svetlana. \n\"I think that she has such a love for the fact that Kevin has allowed this to come into their lives, and really he did it for them, which I think is so sweet and speaks to their love and loyalty that she doesn't [get upset],\" Hampton said. \"She hasn't really been jealous at all.\" \nHaving done some reading on real-life polyamorous relationships, Hampton said that she's found the situation of V, Kev and Svetlana might be a little different from real-life throuples. \n\"It's gotten to the point now where they don't all three have to have sex together, which is interesting, because when doing like research on these relationships, you have to really talk about boundaries and what's acceptable and what's not,\" Hampton explained. \"And a lot of times what's not acceptable is the hooking up when the other person is not there and doesn't know it.\" \nOn most shows that depict polyamory (most recently ABC's \"Mistresses\" and Audience Network's \"You Me Her\"), the drama comes from that very thing—the deceit, the cheating, the lying that most people assume will ultimately push a polyamorous partnership to implode. But on \"Shameless,\" it appears the threat comes in the form of a \"mysterious visitor\" who will clue viewers into Svetlana's past. \n\"That will definitely, definitely play out this season, and you'll definitely see a reaction that Veronica has, which you know she has a strong reaction to most things that don't fit into her structure,\" Hampton said. \"And you'll see Kev kind of go along with those reactions, so it'll be interesting. It's a really cool twist, and you'll get to see the babies' reactions to all of that as well.\" \n\"Shameless\" has the power to normalize situations that might otherwise appear sensational, and this storyline is no different. What might feel forced or provocative on another series is just another beautiful day in the working class neighborhood for the Gallaghers and their circle, who follow how they feel instead of what society dictates for them, and that's why it works so well and delivers so richly in previously unexplored comedy. \n\"My circumstances might be out of the ordinary and ridiculous, but the way we approach the material is so grounded in reality that people can't help but relate to it,\" Goreshter said. \"Even though what we're put through is outlandish, it's grounded, and I think that's why people relate to it so much.\" \nSeason 7 of \"Shameless\" premieres Sunday, Oct. 2, at 9 p.m. on Showtime. \nTrish Bendix is a writer in Los Angeles. Follow her work at trishbendix.com. \nFollow NBC OUT on Twitter , Facebook and Instagram . Trish Bendix ", "external_links": [], "published": "2016-10-01T08:00:00.000+03:00", "crawled": "2016-10-01T20:14:00.568+03:00", "highlightTitle": ""}