{"organizations": [], "uuid": "8c4235a48c0655c75804152978112d6df0d140c6", "thread": {"social": {"gplus": {"shares": 1}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 7}, "facebook": {"likes": 617, "shares": 617, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nbcnews.com", "main_image": "http://media2.s-nbcnews.com/j/newscms/2016_41/1753356/gabrielausa_dc_capitol_11f42139d809606a88e5b8ed49c0091b.nbcnews-fp-1200-800.jpg", "site_section": "", "section_title": "", "url": "http://www.nbcnews.com/news/asian-america/our-number-one-export-people-gabriela-usa-aims-end-human-n667286", "country": "US", "domain_rank": 478, "title": "'Our Number One Export Is People': GABRIELA USA Aims to End Human Trafficking in Philippines - NBC News", "performance_score": 6, "site": "nbcnews.com", "participants_count": 0, "title_full": "'Our Number One Export Is People': GABRIELA USA Aims to End Human Trafficking in Philippines - NBC News", "spam_score": 0.041, "site_type": "news", "published": "2016-10-17T08:00:00.000+03:00", "replies_count": 0, "uuid": "8c4235a48c0655c75804152978112d6df0d140c6"}, "author": "Taylor Weik", "url": "http://www.nbcnews.com/news/asian-america/our-number-one-export-people-gabriela-usa-aims-end-human-n667286", "ord_in_thread": 0, "title": "'Our Number One Export Is People': GABRIELA USA Aims to End Human Trafficking in Philippines - NBC News", "locations": [], "entities": {"persons": [{"name": "janet basilan", "sentiment": "negative"}, {"name": "basilian", "sentiment": "none"}, {"name": "rodriguez", "sentiment": "none"}, {"name": "taylor weik", "sentiment": "none"}, {"name": "isidro rodriguez", "sentiment": "none"}, {"name": "janet basilian", "sentiment": "none"}, {"name": "gabriela silang", "sentiment": "none"}, {"name": "bajar", "sentiment": "none"}, {"name": "basilan", "sentiment": "none"}, {"name": "irma salvatierra bajar", "sentiment": "none"}], "locations": [{"name": "united states", "sentiment": "none"}, {"name": "philippines", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "san jose", "sentiment": "none"}, {"name": "gabriela usa", "sentiment": "none"}, {"name": "the philippines", "sentiment": "none"}, {"name": "d.c.  basilan", "sentiment": "none"}, {"name": "maryland", "sentiment": "none"}, {"name": "d.c.", "sentiment": "none"}, {"name": "basilan", "sentiment": "none"}], "organizations": [{"name": "gabriela usa aims to end human trafficking", "sentiment": "negative"}, {"name": "nbc news", "sentiment": "negative"}, {"name": "aapi heritage month", "sentiment": "none"}, {"name": "nafcon", "sentiment": "none"}, {"name": "philippine overseas employment administration", "sentiment": "none"}, {"name": "gabriela usa  according", "sentiment": "none"}, {"name": "philippine embassy", "sentiment": "none"}, {"name": "nbc asian america on facebook", "sentiment": "none"}, {"name": "justice", "sentiment": "none"}, {"name": "migrante international", "sentiment": "none"}, {"name": "gabriela usa", "sentiment": "none"}, {"name": "nbc", "sentiment": "none"}, {"name": "nbc entertainment", "sentiment": "none"}, {"name": "bayan usa", "sentiment": "none"}, {"name": "national alliance", "sentiment": "none"}, {"name": "instagram", "sentiment": "none"}, {"name": "state department", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "advertisement \nJanet Basilan found herself on a plane to the United States in January 2009, reluctant to leave her son and husband behind in the Philippines, but eager, like the six other teachers on her flight, to begin working in the American public education system so that she could send money back home. Basilan told NBC News the person who recruited her had promised she would earn five times the amount she currently made as a high school science teacher in the Philippines. All she had to do was pay travel and settlement fees. \nBasilan said she borrowed close to $18,000 in loans from her bank and several loan sharks, certain she'd be able to pay everything back with her new job. But instead of going to work, Basilan spent two months confined to a house in Maryland with more than 20 other teachers before learning that there weren't any jobs waiting for them. \nThere never were, she said. Post by NBC News . \nBasilan's story is one of many similar stories documented by GABRIELA USA, the U.S.-based chapter of a grassroots association comprised of over 200 organizations fighting for the freedom of oppressed Filipino women. Named for the female Filipino revolutionary leader Gabriela Silang, GABRIELA USA campaigns on issues including gender discrimination, violence against women, women's reproductive rights, and human trafficking — which has become a growing concern for GABRIELA USA, especially as the organization began receiving calls for help from victimized teachers like Basilan. \n\"When we found out about these teachers who were tricked, it became a campaign to find others, and we were able to hold a press conference,\" Irma Salvatierra Bajar, GABRIELA USA chairperson, told NBC News. \"Then we started getting phone calls from D.C. and San Jose with women saying, 'I worked for the same recruiter. This happened to me too.'\" \"I've grown from a fearful victim to a strong survivor, whose aim right now is to help others who have been in the same situation as me.\" \nGABRIELA USA discovered that between 2009 to 2014, and operating under the guise of a recruiter for various employment agencies, Isidro Rodriguez lured more than 300 teachers, including Basilan, from the Philippines to the United States with promises of H-1B non-immigrant visas, full-time teaching jobs, and provided housing. \nInstead, Basilan alleged that he placed the teachers in cramped living quarters, confiscated their cell phones to cut them off from their families, set them up with sham job interviews, and failed to facilitate the processing of their visas, all while continuing to extract fees from their pockets. Like many others, Basilan was undocumented, unemployed, and over $30,000 in debt to the loan sharks who had already begun charging interest rates. \n\"I was forced to accept any job: cleaning the house, working as a dishwasher in a restaurant,\" Basilan told NBC News. \"I was forced to work from dawn to dusk just to get the money I needed to pay for my loans back home, because my family was being threatened by loan sharks to be sued and imprisoned. I don't ever want to go back to that time.\" \nWorking alongside organizations like BAYAN USA, Migrante International, and the National Alliance for Filipino Concerns (NAFCON), GABRIELA USA officially launched the Justice for Filipino Trafficked Teachers campaign in December 2014, and has worked since then to pursue justice for the women targeted by Rodriguez, who is reportedly still at large . The campaign has also helped trafficked teachers obtain T visas — which allows trafficked immigrants to stay in the United States if they comply in cases involving their traffickers — as well as protest the Philippine Labor Migration Policy of the Philippine government, which allows and encourages emigration. \n\"GABRIELA USA was the group to educate us on our rights,\" said Basilian, who formed GABRIELA USA's DC chapter in 2013 with other trafficked teachers. Janet Basilian was awarded the D.C. Mayor's Community Service Award at an AAPI Heritage Month celebration, May 2, 2016. Courtesy of GABRIELA USA \nAccording to the State Department's 2016 Trafficking in Persons Report , an estimated 10 million Filipinos work abroad. The Philippine Overseas Employment Administration has found that the number of Overseas Filipino Workers (OFWs) has grown, from 1.9 million in 2009 to 2.4 million in 2015 . \n\"Some countries export coconuts, coffee, or bananas, but for the Philippines, our number one export is people,\" Bajar said. \"It's easy to exploit Filipino migrants because they're vulnerable — they're impoverished and don't have opportunities to succeed at home.\" \"Justice is still so slow, and what we want is action.\" \nRecently in its efforts to raise awareness of the issue of human trafficking, GABRIELA USA partnered with other organizations to produce a Change.org petition protesting the development of a new comedy reportedly being developed by NBC that would center around the plot of a mail-order bride from the Philippines. The petition received over 10,000 signatures in less than 24 hours. \nNBC Entertainment executives clarified in a statement following the backlash that, while the script had been purchased, there would be no plans to develop a show. \n\"We purchased the pitch with the understanding that it would tell the creator's real-life experience of being raised by a strong Filipina stepmother after the loss of her own mother,\" an NBC spokesperson told NBC News in a statement last month . \"The writer and producers have taken the sensitivity to the initial concept to heart and have chosen not to move forward with the project at this time.\" \nBajar said it was important for advocates to speak up against the possibility of lighthearted portrayals of such a serious issue. \"The idea is to not normalize US imperialism to the Filipino and American communities — to say that this is okay,\" she said. \"Women aren't getting married because they want to; no woman wants to be away from their families. But it's a job, and the Philippines doesn't have a lot of those, so they leave.\" Post by NBC News . \nLike many trafficked Filipino women, Basilan hasn't been back to the Philippines since leaving in 2009, although she was able to sponsor her son to come to the U.S. and is currently working on bringing her husband soon. She's now GABRIELA USA's vice chair and works as a pre-K teacher at a community-based organization in D.C. \nBasilan said she's still paying off the loans she took out to pay Rodriguez. \n\"I've grown from a fearful victim to a strong survivor, whose aim right now is to help others who have been in the same situation as me,\" Basilan said. \"I want to provide education and awareness to the situation of those being trafficked. We've done so much as a group to collaborate with the Philippine Embassy and government, but justice is still so slow, and what we want is action.\" \nFollow NBC Asian America on Facebook , Twitter , Instagram , and Tumblr . Taylor Weik ", "external_links": [], "published": "2016-10-17T08:00:00.000+03:00", "crawled": "2016-10-17T21:52:30.487+03:00", "highlightTitle": ""}