{"organizations": [], "uuid": "ff74ae144b80df0c75e1360b383c4b7d4f9afc47", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nbcnews.com", "main_image": "http://media4.s-nbcnews.com/j/newscms/2016_40/1740751/161007-new-york-chinatown-mn-1030_dd35df8c4dae7c2ca0da3e2d71e183d5.nbcnews-fp-1200-800.jpg", "site_section": "", "section_title": "", "url": "http://www.nbcnews.com/news/asian-america/chinatown-responds-fox-reporter-defends-tongue-cheek-segment-n661356", "country": "US", "domain_rank": 478, "title": "Chinatown Responds as Fox Reporter Defends 'Tongue-In-Cheek' Segment - NBC News", "performance_score": 0, "site": "nbcnews.com", "participants_count": 0, "title_full": "Chinatown Responds as Fox Reporter Defends 'Tongue-In-Cheek' Segment - NBC News", "spam_score": 0.0, "site_type": "news", "published": "2016-10-07T08:00:00.000+03:00", "replies_count": 0, "uuid": "ff74ae144b80df0c75e1360b383c4b7d4f9afc47"}, "author": "Chris Fuchs", "url": "http://www.nbcnews.com/news/asian-america/chinatown-responds-fox-reporter-defends-tongue-cheek-segment-n661356", "ord_in_thread": 0, "title": "Chinatown Responds as Fox Reporter Defends 'Tongue-In-Cheek' Segment - NBC News", "locations": [], "entities": {"persons": [{"name": "ronny chieng", "sentiment": "none"}, {"name": "hai li", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "bill clinton", "sentiment": "none"}, {"name": "chris fuchs", "sentiment": "none"}, {"name": "watters", "sentiment": "none"}, {"name": "grace meng", "sentiment": "none"}, {"name": "assemblyman ron kim", "sentiment": "none"}, {"name": "qanta shimizu", "sentiment": "none"}, {"name": "bill o'reilly", "sentiment": "none"}, {"name": "traci lee", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "wong", "sentiment": "none"}, {"name": "shimizu", "sentiment": "none"}, {"name": "wei lun wong", "sentiment": "none"}, {"name": "li", "sentiment": "none"}, {"name": "kim", "sentiment": "none"}, {"name": "fox", "sentiment": "none"}, {"name": "meng", "sentiment": "none"}, {"name": "cheung", "sentiment": "none"}, {"name": "huang", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "paul cheung", "sentiment": "none"}, {"name": "karthick ramakrishnan", "sentiment": "none"}, {"name": "chieng", "sentiment": "none"}, {"name": "clinton", "sentiment": "none"}, {"name": "jesse watters", "sentiment": "none"}, {"name": "yan chen", "sentiment": "none"}, {"name": "charles lam", "sentiment": "none"}, {"name": "scott huang", "sentiment": "none"}, {"name": "peixian jiang", "sentiment": "none"}, {"name": "chen", "sentiment": "none"}], "locations": [{"name": "chinatown", "sentiment": "none"}, {"name": "manhattan", "sentiment": "none"}, {"name": "qanta shimizu", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "lower east side", "sentiment": "none"}, {"name": "midtown manhattan", "sentiment": "none"}, {"name": "riverside", "sentiment": "none"}, {"name": "manhattan chinatown", "sentiment": "none"}, {"name": "new york city", "sentiment": "none"}, {"name": "queens", "sentiment": "none"}, {"name": "museum of chinese", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "malaysia", "sentiment": "none"}], "organizations": [{"name": "nbc news", "sentiment": "negative"}, {"name": "chase bank", "sentiment": "negative"}, {"name": "news corp.", "sentiment": "none"}, {"name": "fox news", "sentiment": "none"}, {"name": "nbc news  reaction", "sentiment": "none"}, {"name": "aaja", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "new york state", "sentiment": "none"}, {"name": "diversity front", "sentiment": "none"}, {"name": "nbc asian america on facebook", "sentiment": "none"}, {"name": "big apple", "sentiment": "none"}, {"name": "presidential election forum  for shimizu", "sentiment": "none"}, {"name": "civil rights groups criticize fox news", "sentiment": "none"}, {"name": "university of california", "sentiment": "none"}, {"name": "ae company", "sentiment": "none"}, {"name": "instagram", "sentiment": "none"}, {"name": "pacific islanders", "sentiment": "none"}, {"name": "asian american journalists association", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "advertisement \nQanta Shimizu was leaving a Chase Bank in Manhattan's Chinatown last week , the day of the presidential debate, when he was approached by a television interviewer with a microphone. \"He just needs to understand, respect the culture. ... Don't taint the beautifulness of this country with your [disrespect].\" \n\"As a Chinese, what do you think about Donald Trump,\" asked Fox News correspondent Jesse Watters, according to Shimizu. \n\"I said, 'No, I'm Japanese, I don't think I'm qualified to answer that question,'\" Shimizu, who recalled his encounter during an interview with NBC News Thursday afternoon, said. \nShimizu said he was never asked a follow-up about how he, as a Japanese person, viewed Trump. But a question on karate was slipped in by Watters, who does on-street interviews for a segment called \"Watters' World,\" which airs on Fox News' \"The O'Reilly Factor.\" \nFortunately for Shimizu, he'd been studying the martial art with a Ukrainian karate master, he said. \n\"[Watters] asked me to punch, and that was taken in the picture,\" Shimizu said, adding that he wasn't happy with the resulting video, which opened with the song \"Kung Fu Fighting.\" Qanta Shimizu (right) was featured in a Fox News segment, Monday, Oct. 3, 2016, with correspondent Jesse Watters that many are criticizing for being offensive. \nRELATED: Civil Rights Groups Criticize Fox News for 'Racist and Offensive' Chinatown Segment \nShimizu was one of a number of Asian Americans who found themselves featured on the \"Chinatown Edition\" of \"Watters' World,\" a segment that has sparked outrage this week among people throughout the country, including members of civil rights organizations and elected officials. \nWhile the segment was billed as an attempt to understand the political views of people in Chinatown, what emerged, critics say, was a roughly three-and-a-half minute video montage that perpetuated entrenched stereotypes of Chinese and Asian Americans. Qanta Shimizu, who was featured in a Fox News segment set in Chinatown about Chinese-American voters that many have called \"offensive,\" told NBC News he tried to tell the correspondent he is Japanese, not Chinese. Traci Lee / NBC News \nReaction to the segment was swift from state and federally elected officials, including New York State Assemblyman Ron Kim (D-Queens) and U.S. Rep. Grace Meng (D-NY). Along with several dozen community members, Kim and Meng participated in a news conference Thursday afternoon outside Fox News headquarters in Manhattan, criticizing the news organization for broadcasting the video. \n\"This segment definitely crossed the line,\" Meng said. \"It was in bad taste and a very poor attempt at humor.\" \nKim used the words \"offensive\" and \"racist\" to describe the segment. U.S. Rep. Grace Meng (D-NY) speaks Thursday, Oct. 6, 2016, during a press conference outside of Fox, News Corp.'s headquarters in midtown Manhattan. Charles Lam / NBC News \n\"We are calling on Fox News to issue an official apology and completely retract this clip,\" Kim said. \"We are also prepared to take this fight to the next level by calling for public boycotts of all corporations who sponsor this show until they comply with our community's demands.\" \nThursday night on Comedy Central's \"The Daily Show,\" comedian Ronny Chieng delivered a profanity-laced message directed at Watters that included Chieng going to Manhattan's Chinatown to speak seriously with Asian Americans about politics. \nIn response to the backlash, Watters tweeted earlier this week that \"my man-on-the-street interviews are meant to be taken as tongue-in-cheek and I regret if anyone found offense.\" He added in a second message that \"as a political humorist, the Chinatown segment was intended to be a light piece, as all Watters World segments are.\" My man-on-the-street interviews are meant to be taken as tongue-in-cheek and I regret if anyone found offense. — Jesse Watters (@jessebwatters) October 5, 2016 \nAccording to the Asian American Journalists Association (AAJA), \"The O'Reilly Factor\" invited AAJA president Paul Cheung to appear on its Friday show — but Cheung declined. Instead, AAJA countered by inviting Watters, his producers, and Fox News staff to attend a town hall at the Museum of Chinese in America in Chinatown, scheduled for Sunday afternoon. \n\"We appreciate the invitation to educate Bill O'Reilly and his audience on the offensive nature of the 'Watters' World' segment,\" AAJA wrote on its webpage . \"However, we believe meaningful engagement can occur only if there is significant dialogue not just with us, but with the broader community.\" \nIt wasn't immediately clear if Fox News would issue an apology or plans to attend the town hall. UPDATE: AAJA extends invitation to @FoxNews to participate in a town hall with #AAPI community Sunday in Chinatown: https://t.co/cBEEXrjExU — AAJA National (@aaja) October 6, 2016 \nOn Thursday afternoon, NBC News visited the Manhattan Chinatown neighborhood where the \"Watters' World\" segment was filmed, speaking with more than a half-dozen Asian Americans in both English and Mandarin. \nMany expressed a range of views on the presidential race, some supporting Democratic nominee Hillary Clinton, some Republican nominee Donald Trump, and some neither. They named immigration, healthcare, job creation, and foreign policy as some of the key issues in this election season. All of them are topics of importance raised by respondents in a survey of Asian-American registered voters released on Wednesday. \nWhile most said they were ineligible to cast ballots this November — many explained that they were green-card holders or not citizens — their responses offered an alternative narrative to the one depicted in the \"Watters' World\" segment, which was roundly denounced for filming an elderly Chinese woman and man unable to answer questions on the candidates in English, presumably because of a language barrier. Asian American party identification by state. See https://t.co/1RqBs8rZ3T for more #NAAS2016 pic.twitter.com/C2St5X1NkW — Natl AsianAm Survey (@naasurvey) October 5, 2016 \nFor Scott Huang, a 28-year-old Taiwanese American from Queens, neither candidate makes a good choice for president, he said. Trump, on the one hand, comes off as a \"spoiled brat\" with a \"big mouth,\" Huang said. Clinton, on the other, is not \"amazing,\" but \"at least she has a team,\" he said. \n\"Her husband used to be president,\" added Huang. \"If something really goes wrong, I think Bill Clinton maybe can give her some advice.\" \nHuang continued, \"I think she has leadership. I like someone more calm. Trump is way too much.\" \"This segment definitely crossed the line. It was in bad taste and a very poor attempt at humor.\" \nPeixian Jiang, a 20-year-old working at a bakery, said in Mandarin that she wouldn't vote for either candidate. She called Clinton's rhetoric \"sharp\" at times, and said the former secretary of state's viewpoints can come across as \"too extreme,\" though she didn't offer specific examples. \nA few doors down at AE Company, which sells Chinese herbs, customer Hai Li also said he likes neither Trump nor Clinton. He said he feels Trump attacks all types of people, regardless of race or ethnicity. Asked whom he would vote for if he could, Li replied in Mandarin, \"There is no good choice.\" \nBut Yan Chen, a middle-aged woman behind the counter, quickly added in that she would cast a ballot for Trump. \n\"I like his policies on education, immigration, and the economy,\" Chen said in Mandarin, without getting into specifics. \nRELATED: Clinton Holds 41-Point Lead Over Trump Among Asian-American Voters: Survey \nThe Fall 2016 National Asian American Survey , conducted between Aug. 10 and Sept. 29 in 11 different languages, found that 14 percent of Asian-American registered voters intended to vote for Trump, compared to 55 percent for Clinton. Some 16 percent were still undecided, according to the survey. \nFor Chinese, in particular, 53 percent said they were behind Clinton, while 12 percent backed Trump, the survey reported. One in five didn't know or refused to answer. \nAsian Americans and Pacific Islanders account for roughly five percent of eligible voters and six percent of the United States resident population, according to Karthick Ramakrishnan, the director of the survey and a public policy professor at the University of California, Riverside. Courtesy of the National Asian American Survey \nFor those in Chinatown who spoke with NBC News, immigration was among the topics they said they were paying attention to this election season. Wei Lun Wong, a 20-year-old from Malaysia working at an ice cream shop in Manhattan's Lower East Side, said he believes in legal immigration and said he appreciated Trump's overall experience. \nAsked if he liked the real-estate mogul's attitude, however, he responded with a simple, \"No.\" \nWhile Wong acknowledged that he prefers Trump, he also said he worries he could be sent back to his native Malaysia if the billionaire becomes president. \n\"That's the irony,\" he said, laughing. \nRELATED: Immigration, Diversity Front and Center at 'Quad-Partisan' Presidential Election Forum \nFor Shimizu, the Japanese man who appeared on Watters' World, healthcare remains a serious issue, he said. He added that he's a Clinton supporter and wants to prevent a Trump presidency. \n\"Health insurance is horrible in this country compared with my country,\" said Shimizu, the founder and chief technology officer of a design firm with an office in Chinatown. \nWhen asked about the \"Watters' World\" segment, Asian Americans in Chinatown expressed mixed reaction over how the clip came across to them. \nChen, the AE Company employee, said simply that \"it wasn't fair,\" adding it \"discriminated against Chinese.\" Li, the customer, pointed out that freedom of speech exists in the U.S. \"However, we believe meaningful engagement can occur only if there is significant dialogue not just with us, but with the broader community.\" \nBut for Shimizu, who said he didn't know beforehand how his interview with Watters would be used, the segment was offensive and \"was more horrible than I thought,\" he said. \nHaving lived in New York City for three years, Shimizu said he's comfortable working in the Big Apple and enjoys its diversity, even though sometimes he has struggled to survive and has encountered some bad experiences. \nAsked what he would say to Watters if given the chance, Shimizu said, \"I [would] talk about, what is culture? ... He just needs to understand, respect the culture. ... Don't taint the beautifulness of this country with your [disrespect].\" \nFollow NBC Asian America on Facebook , Twitter , Instagram , and Tumblr . Chris Fuchs ", "external_links": [], "published": "2016-10-07T08:00:00.000+03:00", "crawled": "2016-10-07T22:20:13.057+03:00", "highlightTitle": ""}