{"organizations": [], "uuid": "52b2f7a8d6ac082553edf8ac72cac1cbe5de7a85", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 314, "shares": 314, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nbcnews.com", "main_image": "http://nodeassets.nbcnews.com/images/og-nbcnews200x200.gif", "site_section": "", "section_title": "", "url": "http://www.nbcnews.com/card/trump-says-clinton-wants-open-borders-she-doesnt-n669536", "country": "US", "domain_rank": 478, "title": "Trump Says Clinton Wants Open Borders. She Doesn't - NBC News", "performance_score": 3, "site": "nbcnews.com", "participants_count": 0, "title_full": "Trump Says Clinton Wants Open Borders. She Doesn't - NBC News", "spam_score": 0.023, "site_type": "news", "published": "2016-10-20T09:58:00.000+03:00", "replies_count": 0, "uuid": "52b2f7a8d6ac082553edf8ac72cac1cbe5de7a85"}, "author": "Irin Carmon", "url": "http://www.nbcnews.com/card/trump-says-clinton-wants-open-borders-she-doesnt-n669536", "ord_in_thread": 0, "title": "Trump Says Clinton Wants Open Borders. She Doesn't - NBC News", "locations": [], "entities": {"persons": [{"name": "clinton", "sentiment": "negative"}, {"name": "trump", "sentiment": "negative"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "ruth bader ginsburg", "sentiment": "none"}, {"name": "putin", "sentiment": "none"}, {"name": "zervos", "sentiment": "none"}, {"name": "hillary", "sentiment": "none"}, {"name": "natasha stoynoff", "sentiment": "none"}, {"name": "petraeus", "sentiment": "none"}, {"name": "clinton said", "sentiment": "none"}], "locations": [{"name": "trump misstates clinton", "sentiment": "none"}, {"name": "moscow", "sentiment": "none"}, {"name": "new mexico", "sentiment": "none"}, {"name": "maryland", "sentiment": "none"}, {"name": "utah", "sentiment": "none"}, {"name": "colorado", "sentiment": "none"}], "organizations": [{"name": "nbc news trump", "sentiment": "negative"}, {"name": "temple taggart mcdowell", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "guttmacher institute", "sentiment": "none"}, {"name": "partial birth abortion ban", "sentiment": "none"}, {"name": "claim about state department", "sentiment": "none"}, {"name": "supreme court", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Trump Says Clinton Wants Open Borders. She Doesn't \nTrump said of Clinton's immigration plan: \"Under her plan, you'd have open borders.\" \nClinton's plans call for comprehensive immigration reform and a secure border, not open borders. Oct 19 2016, 9:58 pm ET latest posts from WHAT ARE THE FACTS? 14 minutes ago PolitiFact: Trump is Right About Drugs Coming Across Border LIVE FACT-CHECK: Trump is right about heroin coming through the southern border https://t.co/Mt0QaQiKPX pic.twitter.com/ZSNAjrWX79 15 minutes ago Trump Says He Didn't Know Any of His Accusers. He Did \n\"I didn't know any of these women, I didn't see any of these women,\" Trump said of his accusers. \nTrump said months ago that Temple Taggart McDowell was a \"nice girl from Utah.\" Natasha Stoynoff interviewed Trump and his wife repeatedly. Summer Zervos was a contestant on his show. He knew several of his accusers . 30 minutes ago Clinton Said 'Open Borders' Remark Was About Energy. Context Bears That Out \nClinton said she was talking about energy markets when she was confronted with having said in a private speech that she dreamed of \"open borders.\" \nWe don't know for sure, as the WikiLeaks email that exposed her speech only included a small snippet, but context backs her up. In the leaked excerpt of the speech, Clinton goes on to refer to her hope for a \"future with energy that is as green and sustainable as we can get it, powering growth and opportunity for every person in the hemisphere.\" Trump Says He Doesn't Know Putin. That's Not What He Said Before \n\"I don't know Putin,\" Trump said. \"He is not my best friend.\" \nTrump repeatedly boasted of having a good relationship with Putin, though he now denies it. \nIn 2013, he tweeted , \" Do you think Putin will be going to The Miss Universe Pageant in November in Moscow - if so, will he become my new best friend?\" Do you think Putin will be going to The Miss Universe Pageant in November in Moscow - if so, will he become my new best friend? an hour ago PolitiFact: Trump Repeats 'Pants on Fire' Claim About State Department's Missing $6 Billion LIVE: The $6 billion lost? Shoddy paperwork, not lost money. Part of a previous Pants on Fire claim. https://t.co/Gd96otBsDx pic.twitter.com/VmKWMxHT7N an hour ago PolitiFact: Trump's Comparison Between Clinton and Petraeus Cases Doesn't Add Up LIVE FACT-CHECK: Trump’s comparison between Clinton and Petraeus cases doesn’t add up. https://t.co/r38C946kTQ pic.twitter.com/1DZdNe7Vju an hour ago Trump Says He Didn't Mock Disabled Reporter. He Did \nTrump said it's \"wrong\" to say he \"went after a disabled reporter, mocked him and mimicked him on national TV.\" an hour ago Trump Misstates Clinton's Position on Abortion \nTrump said: \"With what Hillary is saying, in the 9th month, you can take the baby and rip the baby out of the womb of the mother just prior to the birth of the baby. Now, you can say that that's okay, and Hillary can say that that's okay, but that's not okay with me.\" \nThis is mostly false. In 2003, then-Senator Hillary Clinton voted against the federal Partial Birth Abortion Ban, a ban on an abortion procedure known as dilation and extraction that happens later in pregnancy, because it lacked an exception for the woman's health and life. Though it marked a departure from Supreme Court precedent saying such exceptions were required, the law was narrowly upheld, 5-4 by the Supreme Court in 2007, over a bitter dissent by Justice Ruth Bader Ginsburg, who said the law put women's health at risk. \nLater abortions are extremely rare. According to the Guttmacher Institute, only 1.3 percent of abortions occur after 21 weeks. And 43 states ban abortion when the fetus is viable, or even earlier , some with exceptions for rape, incest, the health of the mother, or fetal abnormality. Even in the handful of states where third-trimester abortions are legal, there are only four publicly-known providers of the later procedure, in Colorado, Maryland and New Mexico. ", "external_links": [], "published": "2016-10-20T09:58:00.000+03:00", "crawled": "2016-10-20T06:15:07.436+03:00", "highlightTitle": ""}