{"organizations": [], "uuid": "959e3e783856898b6b615d01ee1ad991e1f7c4e4", "thread": {"social": {"gplus": {"shares": 5}, "pinterest": {"shares": 1}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 282, "shares": 282, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nbcnews.com", "main_image": "http://media1.s-nbcnews.com/j/newscms/2016_42/1758981/2016-10-20t050358z_517253041_s1beuhzqgkaa_rtrmadp_3_usa-lgbt-violence_87e3f48127a75604200c853c661dd3fa.nbcnews-fp-1200-800.jpg", "site_section": "", "section_title": "", "url": "http://www.nbcnews.com/feature/nbc-out/transgender-cop-weighs-dangers-walking-while-trans-n670096", "country": "US", "domain_rank": 478, "title": "Transgender Cop Weighs in on Dangers of 'Walking While Trans' - NBC News", "performance_score": 2, "site": "nbcnews.com", "participants_count": 0, "title_full": "Transgender Cop Weighs in on Dangers of 'Walking While Trans' - NBC News", "spam_score": 0.634, "site_type": "news", "published": "2016-10-20T08:00:00.000+03:00", "replies_count": 0, "uuid": "959e3e783856898b6b615d01ee1ad991e1f7c4e4"}, "author": "", "url": "http://www.nbcnews.com/feature/nbc-out/transgender-cop-weighs-dangers-walking-while-trans-n670096", "ord_in_thread": 0, "title": "Transgender Cop Weighs in on Dangers of 'Walking While Trans' - NBC News", "locations": [], "entities": {"persons": [{"name": "brendan mcdermid", "sentiment": "none"}, {"name": "brandi bledsoe", "sentiment": "none"}, {"name": "t.t. saffore", "sentiment": "none"}, {"name": "nicholas augustine", "sentiment": "none"}, {"name": "barack obama", "sentiment": "none"}, {"name": "corado", "sentiment": "none"}, {"name": "hawkins", "sentiment": "none"}, {"name": "jessica hawkins", "sentiment": "none"}, {"name": "milena rivera", "sentiment": "none"}, {"name": "gaby milena rivera", "sentiment": "none"}, {"name": "christopher allen", "sentiment": "none"}, {"name": "bamby salcedo", "sentiment": "none"}, {"name": "ruby corado", "sentiment": "none"}, {"name": "augustine", "sentiment": "none"}, {"name": "jonathan ernst", "sentiment": "none"}, {"name": "crystal edmonds", "sentiment": "none"}], "locations": [{"name": "united states", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "montgomery county", "sentiment": "none"}, {"name": "garfield park", "sentiment": "none"}, {"name": "cleveland", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}, {"name": "chicago", "sentiment": "none"}, {"name": "queens", "sentiment": "none"}, {"name": "baltimore", "sentiment": "none"}, {"name": "new york city", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "dupont circle", "sentiment": "none"}, {"name": "latina", "sentiment": "none"}, {"name": "north carolina", "sentiment": "none"}, {"name": "maryland", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "nbc news", "sentiment": "negative"}, {"name": "translatin@ coalition", "sentiment": "none"}, {"name": "reuters  washington", "sentiment": "none"}, {"name": "national coalition of anti-violence programs", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "trans woman and cop washington metropolitan police department", "sentiment": "none"}, {"name": "fbi", "sentiment": "none"}, {"name": "montgomery county police department", "sentiment": "none"}, {"name": "federal bureau of investigation", "sentiment": "none"}, {"name": "washington metropolitan police department", "sentiment": "none"}, {"name": "nbc", "sentiment": "none"}, {"name": "instagram", "sentiment": "none"}, {"name": "ncavp", "sentiment": "none"}, {"name": "lgbt", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Oct 20 2016, 11:44 am ET Transgender Cop Weighs in on Dangers of 'Walking While Trans' by Reuters advertisement Washington Metropolitan Police Department Sergeant Jessica Hawkins, a transgender woman who leads the department's LGBT unit, speaks about her work at her office in Washington on October 10, 2016. Jonathan Ernst / Reuters \nSergeant Jessica Hawkins was a male cop for 20 years but it was not until her transition to a woman in 2014 that she understood the trepidation that transgender women feel across the United States. \n\"Transitioning has made me understand the fears of other communities that I did not have as white male,\" said Hawkins, 43, noting a difference in the way she is treated when off duty and away from her relatively tolerant city of Washington. \n\"I don't feel as safe as I used to. It was never an issue before.\" \nHawkins became head of the Washington Metropolitan Police Department's lesbian, gay, bisexual and transgender (LGBT) liaison unit a year after her transition, at a time when transgender women, especially blacks and Latinas, are being assaulted and murdered at an alarming rate in America. \nAt least 22 transgender people have been killed so far this year, matching the previous recorded high in all of 2015, according to the National Coalition of Anti-Violence Programs (NCAVP). Eighteen of those killed this year have been black or Latina, up from 13 in all of last year. Sergeant Hawkins displays information about unsolved murders of LGBT victims at her office in Washington on October 10, 2016. Jonathan Ernst / Reuters \nOf the 22 killings in 2015, the NCAVP classified 18 as hate crimes. \nTransgender people have a name for the uneasiness they feel when they are in public, facing dirty looks, hateful insults from strangers, and a perceived presumption of guilt from police. It's called \"walking while trans,\" and it is particularly dangerous for minority transgender women. \n\"We are in a state of emergency because of the continuous attacks and murder of our community,\" said Bamby Salcedo, president of the TransLatin@ Coalition, an organization that advocates for transgender immigrants. \nTransgender rights have burst into U.S. awareness the past two years, extending the conflict between conservative and liberal values in America. \nUnder President Barack Obama, the U.S. government has issued regulations aimed at providing equal protection under the law, while state Republican officials, notably in Texas and North Carolina, have resisted in the courts, citing traditional values and accusing the federal government of overreach. \nIn the meantime, the death toll for black and Latina transgender women has climbed. Washington Metropolitan Police Department Sergeant Jessica Hawkins, a transgender woman who leads the department's LGBT unit, displays information about unsolved murders of LGBT victims at her office in Washington on October 10, 2016. Jonathan Ernst / Reuters \nOn Oct. 8 in Cleveland, a black transgender woman named Brandi Bledsoe, 32, was found dead behind a home with plastic bags over her head and hands and a gunshot wound to the chest. \nLast month, a black trans woman named T.T. Saffore, 28, was found dead with multiple stab wounds to the neck, chest, back and hands in Chicago's Garfield Park. \nA few days later, a black trans woman named Crystal Edmonds, 32, was shot dead in the back of the head on a street in northwest Baltimore. \nPolice have reported no arrests in those three cases. TRANS WOMAN AND COP Washington Metropolitan Police Department Sergeant Jessica Hawkins (C), a transgender woman who leads the department's LGBT unit, speaks with transgender activist Ruby Corado (L) at a home in Washington on October 10, 2016, where Corado shelters transgender women of color. Jonathan Ernst / Reuters \nWashington has taken a distinct approach by appointing Hawkins as what may be the only transgender cop to head an LGBT unit in the country. Hawkins knows of a handful of transgender officers elsewhere in the country through private, online networks, but believes she is the only LGBT liaison. \nShe has set out to meet every transgender person at risk of hate violence in the capital but says the dangers are greater for transgender people in the southern towns where she used to work as a cop. \n\"I'm head of the LGBT unit and I'm scared of law enforcement in other parts of the country,\" said Hawkins, who nonetheless enjoys violating North Carolina law by using public restrooms for women when she visits relatives there. \nActivists such as those at the NCAVP coalition, which tracks homicide cases in the media, say that for black or Latina transgender women, walking while trans is even more likely to get them killed. Gaby Milena Rivera poses for a portrait in New York City on September 27, 2016. Brendan McDermid / Reuters \nGaby Milena Rivera, 28, a Guatemalan immigrant living in the New York borough of Queens, was one of those to survive. In August she was hit in the head with a hammer by a man who yelled, \"This is what happens for being gay\" before striking. \nShe says she woke up in the hospital. \nShe is resentful that she cannot walk the streets alone without looking over her shoulder. \n\"Even when we're just going to the store, a lot people stare at us,\" Milena Rivera said. \"We have the right to go to the store. I don't know why they look at us that way. We're all human beings. We deserve respect, too.\" Gaby Milena Rivera (L) speaks with a friend in New York City on September 27, 2016. Brendan McDermid / Reuters \nThere are no official figures to track murders and assaults on transgender people, likely resulting in an undercount of cases. Advocates say police often misrepresent the gender of victims in reports and often presume the transgender victims or witnesses are the perpetrators when they arrive at the scene, creating a climate of mistrust. \nThe anti-violence coalition found less than half of LGBT victims of hate violence report their cases to police, and of the those who did 80 percent said police were indifferent or hostile. \nPolice need to incorporate transgender relations into their academies and on-the-job training, said Lieutenant Nicholas Augustine of Maryland's Montgomery County Police Department. \nAugustine said transgender Latinas in Montgomery County told him police kept profiling them as prostitutes, but none had filed a formal complaint. \n\"We need transgender people to be part of our training, so officers are not meeting a transgender person for the first time on the job and stuttering over their words, not knowing whether to call the person sir or ma'am,\" he said. HATE CRIMES UNDERREPORTED \nThe Federal Bureau of Investigation reported zero hate crime homicides against transgender people in 2014, the latest year of available data, when the anti-violence coalition reported at least 11 black or Latina transgender women were killed. \nAn FBI spokesman said the bureau has increased the number of hate crimes investigations to include such cases, but without quantifying them. \n\"Cases related to gender identity bias are difficult to identify. It is not always apparent a crime was motivated by the victim's gender and these crimes tend to be underreported,\" FBI spokesman Christopher Allen said in a statement. \nThe walls and shelves of Hawkins' office just off Washington's Dupont Circle are covered with awards for the unit's work, but one hallway also bears reminders of unsolved murders. Fliers advertise $25,000 rewards for information leading to the arrest and conviction of six cold cases, all involving black transgender women, from 2000 to 2011. Washington Metropolitan Police Department Sergeant Jessica Hawkins (R), a transgender woman who leads the department's LGBT unit, speaks with with one of her fellow officers at their office in Washington on October 10, 2016. Jonathan Ernst / Reuters \nWashington has added transgender relations to the curriculum at its police academy, providing four hours of instruction. \nBefore Hawkins could approach transgender women as a peer, though, she had to come out to her fellow cops, showing up as a woman one day before 400 officers at her station. Now, as both trans woman and cop, she says those two worlds often collide. \n\"I do see a lot of hate crimes and it does weigh on my personal life when I see bad things happen to transgender people.\" \nFollow NBC OUT on Twitter , Facebook and Instagram . Topics ", "external_links": [], "published": "2016-10-20T08:00:00.000+03:00", "crawled": "2016-10-21T02:19:43.955+03:00", "highlightTitle": ""}