{"organizations": [], "uuid": "49c2b69473c9db0e1dd66e6aafe48300d1dfd88a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 2}, "facebook": {"likes": 2, "shares": 2, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nbcnews.com", "main_image": "http://nodeassets.nbcnews.com/images/og-nbcnews200x200.gif", "site_section": "", "section_title": "", "url": "http://www.nbcnews.com/news/nbcblk/blk-reality-your-week-review-deal-or-new-deal-n674886", "country": "US", "domain_rank": 478, "title": "BLK to Reality: Your Week in Review: Deal or New Deal? - NBC News", "performance_score": 0, "site": "nbcnews.com", "participants_count": 0, "title_full": "BLK to Reality: Your Week in Review: Deal or New Deal? - NBC News", "spam_score": 0.16, "site_type": "news", "published": "2016-10-29T08:00:00.000+03:00", "replies_count": 0, "uuid": "49c2b69473c9db0e1dd66e6aafe48300d1dfd88a"}, "author": "Shane Paul Neil", "url": "http://www.nbcnews.com/news/nbcblk/blk-reality-your-week-review-deal-or-new-deal-n674886", "ord_in_thread": 0, "title": "BLK to Reality: Your Week in Review: Deal or New Deal? - NBC News", "locations": [], "entities": {"persons": [{"name": "jarrett hill", "sentiment": "negative"}, {"name": "deray", "sentiment": "none"}, {"name": "colin kaepernick", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "deray mckesson", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "kaepernick", "sentiment": "none"}, {"name": "shane paul neil", "sentiment": "none"}, {"name": "dj khaled", "sentiment": "none"}, {"name": "austen jaye", "sentiment": "none"}, {"name": "dara", "sentiment": "none"}, {"name": "khaled", "sentiment": "none"}, {"name": "robert galbraith", "sentiment": "none"}, {"name": "jarrett", "sentiment": "none"}, {"name": "austen", "sentiment": "none"}, {"name": "nicole tuck", "sentiment": "none"}, {"name": "jimmy kimmell", "sentiment": "none"}, {"name": "dara m. wilson", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "patti", "sentiment": "none"}, {"name": "michael bloomberg", "sentiment": "none"}, {"name": "labelle", "sentiment": "none"}, {"name": "patti labelle", "sentiment": "none"}, {"name": "clinton", "sentiment": "none"}, {"name": "andre chung", "sentiment": "none"}, {"name": "donald", "sentiment": "none"}, {"name": "thaddaeus mcadams", "sentiment": "none"}], "locations": [{"name": "reddit", "sentiment": "none"}, {"name": "fla", "sentiment": "none"}, {"name": "miami", "sentiment": "none"}, {"name": "san francisco", "sentiment": "none"}, {"name": "sanford", "sentiment": "none"}, {"name": "san diego", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "qualcomm stadium", "sentiment": "none"}, {"name": "orlando sanford international airport", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}], "organizations": [{"name": "nbc news", "sentiment": "negative"}, {"name": "nbcblk", "sentiment": "negative"}, {"name": "mckesson", "sentiment": "none"}, {"name": "abc photo archives / abc", "sentiment": "none"}, {"name": "nfl redzone", "sentiment": "none"}, {"name": "san diego chargers", "sentiment": "none"}, {"name": "nfl", "sentiment": "none"}, {"name": "nbc news  clinton", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "washington post oped mckesson", "sentiment": "none"}, {"name": "facebook live", "sentiment": "none"}, {"name": "social security", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "advertisement \nNBCBLK is collaborating with journalist Jarrett Hill and streaming his pop-culture-meets-politics podcast, Back 2 Reality via Facebook Live . This week Jarrett was joined by Dara M. Wilson , co-host and producer of TWiB! Prime and actor Austen Jaye who is currently performing in the play \"Belefonte UnAuthorized: A Shared Humanity \" to discuss the latest in campaign chronicles, Patti the Christmas Diva, and Snapchat revelations. \nSkim the recap below and check out this week's show here. Donald Trump at a rally Tuesday at Orlando Sanford International Airport in Sanford, Fla. Guzman/CSM/REX/Shutterstock / Shutterstock \nOh Donald… \nIt's been another banner week for the Trump campaign as we get ever closer to election day. Trump appeared to be particularly focused on the minority vote as he laid out his \" New Deal for Black America .\" \nAmong the highlights of the \"law and order\" candidate's new deal were designating \"blighted communities with \"disaster designations\" as well as holding on to his tried and true call for a wall at the Mexican border because \"Illegal immigration violates the civil rights of African-Americans,\" adding that tighter reigns on immigration would \"restore civil rights.\" \nIn addition to Trump's new deal the Republican candidate made what many are calling an awkward attempt to reach out to Indian American voters with his latest campaign ad where he attempts to speak a bit of Hindi . \nThe attempt was reminiscent of former New York Mayor Michael Bloomberg's less than graceful attempts to speak Spanish at multiple news conferences. ABC Photo Archives / ABC Photo Archives/Getty Images \nDon't Play With Patti! \nBecause the internet is magic we had to discuss this video . Queen diva Patti Labelle does her best to be a professional during a 1996 holiday performance at the White House but it's fairly apparent that she is the only one. \nAs Labelle begins her rendition of \"This Christmas\" the mysterious absence of her background singers and along with an all too slow cue card person leads to all kinds of improvisation and death stares. It's a safe bet that the shows manager is currently buried somewhere under the White House. A Reddit mascot is shown at the company's headquarters in San Francisco, Calif., April 15, 2014. ROBERT GALBRAITH / Reuters file \nThe Situationship: Men are Creepy! \nThe women of Reddit recently ran down a list of some of the sketchiest things men have done to meet and date women. Gems on the list include \"Showing up at my place of work and staring at me\", \"Calling me after a rapid fire of excessive texts that I don't answer\", and \"Married men sharing they haven't slept with their wife in a very long time.\" Jarrett, Dara, and Austen break down all the levels of ugh. Also in the News... On a short lunch break at home, DeRay has a conference call with staffers regarding budgeting on March 26. Andre Chung / for NBC News \nClinton Gets Some BLM Love \nWhile the Donald was on the prowl for Black votes Hillary Clinton was being endorsed by activist and former mayoral candidate Deray McKesson . In a Washington Post OpEd McKesson states, \"The next president will continue to shape the trajectory of justice and landscape of opportunity in this country. She will be responsible for how trillions of dollars in federal funding are spent, decide how to ensure both liberty and security in an increasingly interconnected world and determine the path forward on health care and Social Security. I am voting for Hillary Clinton.\" \nWhile McKesson's words are strong Clinton did not come by this endorsement easily. Clinton among other candidates failed to impress McKesson and other Black activists who demanded to hear more about candidates plans to address racial injustice, especially in regard to police brutality. Colin Kaepernick #7 of the San Francisco 49ers signs autographs for fans after a 31-21 win over the San Diego Chargers during a preseason game at Qualcomm Stadium on Sept. 1, 2016 in San Diego. Harry How / Getty Images \nIs Kaep Killing the NFL? \nIt's no secret that the NFL has been in the midst of a ratings slump . That said San Francisco 49er's quarterback Colin Kaepernick (as well as the league itself) doesn't believe the league wide protests during the national anthem are to blame. As Kaepernick puts it, \"I don't understand why ratings would go down, fighting for justice for people, to try to stop oppression, especially in a league that is predominantly black.\" \nWhile there is no way to tell for sure even if the protests sparked by Kaepernick has let some air out of the NFL's tires it's likely not the only reason. In addition to the leagues prime-time games running up against election coverage some have sighted lower quality of play, over-saturation (games are now on Thursday, Sunday, and Monday) as well as NFL viewing options like NFL Redzone and Sunday Ticket affecting the league's overall ratings. DJ Khaled poses at a miami high school on October 18, 2016 in Miami, Florida. Thaddaeus McAdams / FilmMagic \nDJ Khaled Snaps Son's Birth and Breaks Internet \nEvery proud father looks forward to announcing the birth of a child posting pictures of swaddled babies and exhausted moms all over social media. \nMr. \"We the Best\" took that pride to a whole new level by posting the birth of his son live to his six-million SnapChat followers . Not surprisingly the snaps included some of the DJ's biggest hits in the background. Before Nicole Tuck, Khaled's fiancee, gave birth to their new son Khaled was on Jimmy Kimmell discussing his plan to share the delivery on social media. \nWhen asked about Tuck's potentially not wanting to share the moment with the entire known universe Khaled responded \"The key is, I'm the king. And every queen should support the king.\" Because clearly DJ Khaled was the one who needed support at that moment. \nWatch the Back2Reality Podcast every Thurssday at 10pm EST on the NBCBLK Facebook page or listen via SoundCloud or Stitcher . Shane Paul Neil ", "external_links": [], "published": "2016-10-29T08:00:00.000+03:00", "crawled": "2016-10-29T19:23:43.962+03:00", "highlightTitle": ""}