{"organizations": [], "uuid": "b072a52d6aef84a1d2a0803d857b4c2b5d3e70cb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 18, "shares": 18, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nbcnews.com", "main_image": "http://nodeassets.nbcnews.com/images/og-nbcnews200x200.gif", "site_section": "", "section_title": "", "url": "http://www.nbcnews.com/card/so-true-says-trump-false-wikileaks-claim-n665921", "country": "US", "domain_rank": 478, "title": "'So True' Says Trump of False WikiLeaks Claim - NBC News", "performance_score": 0, "site": "nbcnews.com", "participants_count": 0, "title_full": "'So True' Says Trump of False WikiLeaks Claim - NBC News", "spam_score": 0.005, "site_type": "news", "published": "2016-10-14T03:33:00.000+03:00", "replies_count": 0, "uuid": "b072a52d6aef84a1d2a0803d857b4c2b5d3e70cb"}, "author": "Jane C. Timm", "url": "http://www.nbcnews.com/card/so-true-says-trump-false-wikileaks-claim-n665921", "ord_in_thread": 0, "title": "'So True' Says Trump of False WikiLeaks Claim - NBC News", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "jane c. timm", "sentiment": "negative"}, {"name": "john podesta", "sentiment": "none"}, {"name": "stevens", "sentiment": "none"}, {"name": "taggart mcdowell", "sentiment": "none"}, {"name": "clinton", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "blumenthal", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "sidney blumenthal", "sentiment": "none"}], "locations": [{"name": "united states", "sentiment": "none"}, {"name": "benghazi", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "libya", "sentiment": "none"}, {"name": "utah", "sentiment": "none"}, {"name": "pennsylvania", "sentiment": "none"}], "organizations": [{"name": "nbc news", "sentiment": "negative"}, {"name": "trump of false wikileaks claim", "sentiment": "negative"}, {"name": "newsweek", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "gop", "sentiment": "none"}, {"name": "trump completely misconstrues wikileaks email", "sentiment": "none"}, {"name": "justice department", "sentiment": "none"}, {"name": "daily mail", "sentiment": "none"}, {"name": "medicare and social security", "sentiment": "none"}, {"name": "u.s. immigration and customs enforcement", "sentiment": "none"}, {"name": "doj", "sentiment": "none"}, {"name": "state department", "sentiment": "none"}, {"name": "wikileaks", "sentiment": "none"}, {"name": "new york times", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "latest posts from WHAT ARE THE FACTS? Jane C. Timm 3 hours ago 'So True' Says Trump of False WikiLeaks Claim \n\"We've seen this first hand in the WikiLeaks documents, in which Hillary Clinton meets in secret with international banks to plot the destruction of U.S. sovereignty in order to enrich these global financial powers, her special interest friends and her donors. So true.\" \nClinton does not plot the destruction of the nation in any way during her paid speeches, which Trump inaccurately characterizes as secret. They were private. In one 2013 speech Clinton says her \"dream\" would be \"a hemispheric common market, with open trade and open borders.\" She does not say that is her goal in office, or that she believes it could ever be realistic. Her actual proposals identify increased border security as a key goal. 4 hours ago Trump Says He Doesn't Know Accuser, But Months Ago He Said He Did \n\"I don't know anything about her. I don't even know who she is. She claims this took place in a public area. I never kissed her. I emphatically deny this ridiculous claim,\" Trump told NBC News in a statement responding to the allegation that he'd kissed a former Miss Utah in 1997. \nBut back in May, when Temple Taggart McDowell's allegation was first made public in a New York Times story , Trump reportedly told the Daily Mail that she'd recanted her story and he'd he'd merely kissed her on the cheek. \n\"Then there was that nice girl from Utah,\" he said, according to the Daily Mail, \"the one who said I gave her a kiss.\" \n\"She recanted. She said it never happened,\" Trump told the Mail. \"You know what? She was a nice kid. She was in front of her parents. We had thousands of people there in the audience. She said, 'Hi, Mr. Trump.' And she came over and gave me a hug and I gave her a kiss on the cheek.\" \n\"This was done on television!\" he continued. \"This was just before the pageant. And they made it sound like it was some act that happened in a dark bedroom somewhere.\" 9 hours ago Fact Checking Trump and Clinton's New Campaign Ads \nBoth candidates offered up new campaign ads on Wednesday — Donald Trump released a television ad online just after 9 a.m., while Clinton released a new web ad just after 10 a.m. \nWe took a looked at both ads, side by side, and fact checked every line. Eight Whoppers from Trump's Tuesday Night \nHere's what Trump got wrong on Tuesday night. Trump said the Justice Department fed Clinton information about the email server investigation. We don't know that; we only know that a Clinton staffer said \"DOJ folks\" told them about a public hearing. Trump said the U.S. murder rate is the highest it's been in 45 years. It's not, though the murder rate hike is at its highest point in 45 years. Trump said, yet again, the U.S. Immigration and Customs Enforcement agency endorsed him. They didn't. Trump said Clinton \"smeared all of our police officers as essentially racist.\" She didn't. Trump said Clinton wants to cut Medicare and Social Security. She doesn't. Trump said Clinton wants to adopt single-payer healthcare. She's praised the Canadian system — as has Trump — but she's never said she wants to move to it. \"Hillary Clinton wants to really dismantle the Second Amendment,\" Trump said. She supports background checks for all gun purchases, not removing Americans' right to bear arms. \"She's also gonna raise your taxes big league, we're gonna lower your taxes,\" Trump claimed. He does want to lower taxes — mostly for the wealthy — but Clinton only wants to raise taxes on the nation's uber wealthy. Unless Trump's crowd is filled with very successful hedge fund managers, his statement is false. 2 days ago Trump Completely Misconstrues WikiLeaks Email \n\"So, Blumenthal writes—this just came out a little while ago. I have to tell you this. 'One important point has been universally acknowledged by the nine previous reports about Benghazi.' This is Sidney Blumenthal, the only one [Clinton] was talking to. She wasn't talking to Ambassador Stevens ...'The attack was almost certainly preventable.' Benghazi. 'Clinton was in charge of the State Department and it failed to protect the United States personnel at an American consulate in Libya.' He meant Benghazi. 'If the GOP wants to raise that as a talking point against her, it is legitimate.' In other words, he's now admitting that they could've done something about Benghazi,\" Trump said on 10/10/2016, at a Pennsylvania rally, supposedly revealing the private views of a Clinton ally on the deadly attack on an American consulate in Benghazi. \nThese are not Clinton ally Sidney Blumenthal's words; they are the words of a Newsweek report on the Benghazi attacks that Blumenthal emailed to Clinton campaign chairman John Podesta. \nThe original email, released by WikiLeaks , makes it quite clear that Blumenthal is quoting an article. Trump's characterizations of this interaction are inaccurate. 2 days ago Trump Boasts About Winning 'Every' Debate Poll. He Didn't. \nWhile boasting of winning a debate is a pretty routine political claim, it's a brazen falsehood to say the polls back you up when they don't. ", "external_links": [], "published": "2016-10-14T03:33:00.000+03:00", "crawled": "2016-10-14T01:46:54.225+03:00", "highlightTitle": ""}