{"organizations": [], "uuid": "466847ea46021ae1eb105c1516aabc9e1c810332", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 24, "shares": 24, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nbcnews.com", "main_image": "http://media3.s-nbcnews.com/j/newscms/2014_44/744231/141031-china-halloween-5a_3d8a59d5e48436d893baa5df551f44a9.nbcnews-fp-1200-800.jpg", "site_section": "http://feeds.nbcnews.com/feeds/business", "section_title": "NBC News Business", "url": "http://www.nbcnews.com/business/consumer/stay-safe-score-big-these-trick-or-treating-tips-n666441", "country": "US", "domain_rank": 478, "title": "Stay Safe, Score Big With These Trick-Or-Treating Tips", "performance_score": 0, "site": "nbcnews.com", "participants_count": 1, "title_full": "Stay Safe, Score Big With These Trick-Or-Treating Tips - NBC News", "spam_score": 0.58, "site_type": "news", "published": "2016-10-14T19:33:00.000+03:00", "replies_count": 0, "uuid": "466847ea46021ae1eb105c1516aabc9e1c810332"}, "author": "nbcnews.com", "url": "http://www.nbcnews.com/business/consumer/stay-safe-score-big-these-trick-or-treating-tips-n666441", "ord_in_thread": 0, "title": "Stay Safe, Score Big With These Trick-Or-Treating Tips", "locations": [], "entities": {"persons": [{"name": "robertson", "sentiment": "none"}, {"name": "garcia", "sentiment": "none"}, {"name": "mcmurty", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "felicia ramos-peters", "sentiment": "none"}, {"name": "saarah", "sentiment": "none"}, {"name": "razvan godja", "sentiment": "none"}, {"name": "rachel robertson", "sentiment": "none"}, {"name": "ramos-peters", "sentiment": "none"}, {"name": "kendra garcia", "sentiment": "none"}, {"name": "pamela mcmurty", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "immigration services", "sentiment": "none"}, {"name": "homeowners association", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Halloween is just around the corner, and if you have kids, it's time to get your Trick-or-Treat game plan on.\nParents will want to consider not only how to make the most of the event by helping their kids score lots of candy, but also what measures they should take to ensure that everyone stays safe.\nWe've rounded up a list of tips of what to look for, what to avoid, and types of activities you may want to check out if you're seeking an alternative to going door to door outside.\nDressed as Republican presidential candidate Donald Trump, 13-year-old Razvan Godja (C) and 26 other children wear Halloween costumes as they take the Oath of Allegiance during their naturalization ceremony at the U.S. Citizen and Immigration Services. Photo by Chip Somodevilla/Getty Images. Chip Somodevilla / Getty Images Map Your Route and Go Over It With Kids\nIf you want to get the best out of your Halloween outings, know exactly where you're going and how you're getting there.\n\"Map out a route a few days before, drive around and determine which streets look safe and well-lit,\" said Pamela McMurty, mom of seven, and the author of A Harvest and Halloween Handbook. \"Make a treasure map if you are really cool.\"\nHalloween is one of the most hectic of all the holidays, at least when it comes to children, who are decked out in costumes and bouncing off the walls thanks to all that sugar. This is why parents should sit down with their little ones ahead of the big day to discuss what their trick-or-treating plan is and highlight the importance of staying nearby at all times.\n\"Before trick-or-treating, talk with your children about where you are going and how many houses you plan to visit,\" said Rachel Robertson, VP of education and development at the child care provider Bright Horizons Family Solutions.\nAlso go over dos and don'ts. Robertson recommends sticking to sidewalks, and only crossing the streets at corners. Make sure kids know these and any other rules well before venturing out.\nCollaborate With Your Neighbors\nIf you live in a close-knit neighborhood or gated community, consider working with your neighbors to make a trick-or-treating experience everyone can enjoy. Garcia recommends hosting a \"Neighborhood Trunk-Or-Treat,\" a concept she says was developed by her Homeowners Association, and one that has taken off in her community.\n\"All of the neighbors in my gated community deck out their cars and SUVs with really cool Halloween decorations and hand out candy from their trunks,\" said Garcia. \"This is a great way to avoid your door bell from ringing all evening. Plus the added bonus is it's usually held between 5-7pm, which allows kids enough time to finish their homework and dinner.\"\nThere are other ways you can come together with neighbors. For instance, you can organize a group outing and designate other parents as supervisors, or if you can't go out with kids yourself, a trusted neighbor can take your place.\nGo Early\nChances are you'll want to be back home by a reasonable hour, but there are other incentives to head out early.\nFelicia Ramos-Peters, holiday expert and founder of the blog Get Holiday Happy, points out that many towns have curfews. Also, the later it gets the more likely that you will encounter people running out of candy. Early birds get the (gummy) worm...\nVisit Apartment Complexes and Malls\nIf you live or have access to an urban area, you can save time and maximize your candy earnings by visiting an apartment complex.\n\"I have always found apartment complexes to be the best for trick-or-treating,\" said Ramos-Peters. \"If you don't have much time or only want to be out for a little while, then an apartment complex is the best way to go.\"\nIf you're in a very rural area, or if you prefer a brightly lit, professional setting, go to your local mall. Hitting up retailers may not have that same cozy, nostalgic feel as dropping in on your neighbors, but your kids will likely have a blast, and you can get a lot accomplished in a short amount of time.\n\"The mall is a great place to take small children during Halloween,\" said Kendra Garcia, author and Autism mom advocate/speaker. \"They have the opportunity to go trick or treating 'door-door,' or should I say 'store-to-store.' It's fun, safe and it also allows mommy or daddy to do a little shopping at the same time.\"\nGo To Affluent Neighborhoods\nIf one thing has remained true about trick-or-treating over the course of time, it's that the wealthier neighborhoods will generally have the most generous candy offerings.\n\"I hate to be materialistic, but the best candy is often in the more affluent areas,\"said McMurty. \"I learned quickly as an adolescent that the upper-end neighborhoods were giving away full-size candy like Firestix and Snickers.\"\nLook For The Teal Pumpkins\nIf your child has any dietary allergies, you probably already know to be extremely vigilant on Halloween and to seek out residences that have teal pumpkins on display. These pumpkins mean they are giving out treats that are allergy-friendly.\nBeauty Momme blogger Saarah S. notes that these teal pumpkins can also represent homes that are giving out treats to appeal to health-focused parents — meaning no trans-fats, food dyes, or other chemical-heavy items.", "external_links": ["http://media4.s-nbcnews.com/j/newscms/2015_44/1284711/ss-151031-halloween-celebrations-05_2313f7bf2e1ae4f8d5307f0c021e1fb0.nbcnews-fp-360-360.jpg", "http://media4.s-nbcnews.com/j/newscms/2015_44/1284711/ss-151031-halloween-celebrations-05_2313f7bf2e1ae4f8d5307f0c021e1fb0.nbcnews-ux-2880-1000.jpg", "http://media4.s-nbcnews.com/j/newscms/2015_44/1284711/ss-151031-halloween-celebrations-05_2313f7bf2e1ae4f8d5307f0c021e1fb0.nbcnews-ux-320-320.jpg"], "published": "2016-10-14T19:33:00.000+03:00", "crawled": "2016-10-14T20:09:02.845+03:00", "highlightTitle": ""}