{"organizations": [], "uuid": "be502d9713aa535b6303d2fd0502788cd2275fe7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nbcnews.com", "main_image": "http://nodeassets.nbcnews.com/images/og-nbcnews200x200.gif", "site_section": "", "section_title": "", "url": "http://www.nbcnews.com/card/trump-unloads-scum-fact-checkers-we-checked-claim-too-n672751", "country": "US", "domain_rank": 478, "title": "Trump Unloads on 'Scum' Fact Checkers. We Checked That Claim Too - NBC News", "performance_score": 0, "site": "nbcnews.com", "participants_count": 0, "title_full": "Trump Unloads on 'Scum' Fact Checkers. We Checked That Claim Too - NBC News", "spam_score": 0.052, "site_type": "news", "published": "2016-10-26T05:14:00.000+03:00", "replies_count": 0, "uuid": "be502d9713aa535b6303d2fd0502788cd2275fe7"}, "author": "Kailani Koenig", "url": "http://www.nbcnews.com/card/trump-unloads-scum-fact-checkers-we-checked-claim-too-n672751", "ord_in_thread": 0, "title": "Trump Unloads on 'Scum' Fact Checkers. We Checked That Claim Too - NBC News", "locations": [], "entities": {"persons": [{"name": "clinton", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "breitbart", "sentiment": "none"}, {"name": "rasmussen", "sentiment": "none"}, {"name": "tim kaine", "sentiment": "none"}, {"name": "barack obama", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "kaine", "sentiment": "none"}], "locations": [{"name": "united states", "sentiment": "none"}, {"name": "north carolina", "sentiment": "none"}, {"name": "north carolina", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "pennsylvania", "sentiment": "none"}, {"name": "iowa", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}, {"name": "united kingdom", "sentiment": "none"}, {"name": "ohio", "sentiment": "none"}], "organizations": [{"name": "trump", "sentiment": "negative"}, {"name": "nbc news", "sentiment": "negative"}, {"name": "nbc news' meet the press", "sentiment": "none"}, {"name": "fox news", "sentiment": "none"}, {"name": "foreign affairs", "sentiment": "none"}, {"name": "trump cites police", "sentiment": "none"}, {"name": "loyola", "sentiment": "none"}, {"name": "trump cites pew study as proof of fraud", "sentiment": "none"}, {"name": "abc", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "isis", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}, {"name": "gop", "sentiment": "none"}, {"name": "nbc news/survey monkey", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "customs enforcement", "sentiment": "none"}, {"name": "trump claims media", "sentiment": "none"}, {"name": "trump unloads", "sentiment": "none"}, {"name": "la times", "sentiment": "none"}, {"name": "trump rewrites republican primary", "sentiment": "none"}, {"name": "wikileaks", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "latest posts from WHAT ARE THE FACTS? 7 hours ago Trump's Assessment of the Race Isn't Accurate \nTo hear Trump tell it, the presidential race is going great: he's winning everything, he'll likely be elected in just two short weeks. But based on the polls and facts at hand, that's just not right. \nHere's what he got right, and wrong, on the state of the race from Tuesday's Florida race. \n\"We're going to have a great victory. We're leading Iowa, we're leading Ohio, we're doing great in north Carolina, Pennsylvania we're going to a lot, I think we're going to do great there.\" \nUnlikely, true, true, false, and unlikely. Trump is polling poorly nationally, and his chances at winning in two weeks are slim. He is leading on average in Iowa and Ohio, but he's trailing by an average of two points in North Carolina and an average of nearly six points in Pennsylvania. \n\"Seventy-five percent of the American people think our country is on the wrong track. Every poll says it. We are going to fix it.\" \nThe polls don't say that: on average, 64 percent — not 75 percent — of people say the country is on the wrong track. \n\"There's going to be a lot of Brexit in two weeks.\" \nNope, and we already explained why here. 8 hours ago Trump Unloads on 'Scum' Fact Checkers. We Checked That Claim Too \n\"Even the so-called fact checkers, who are crooked as hell themselves, they'll check facts with me, and I'll be like 99 percent right, and they'll say therefore he lied! These people are bad….What a group of dishonest scum we have, I'm telling you,\" Trump said on Tuesday. \nWhile our moms would surely like to dispute the contention that we're \"scum\" and \"crooked as hell,\" let's focus instead on his claim that fact checkers exaggerate small errors. \nThis blog primarily focuses on large whoppers, and makes it clear when Trump's claims are rooted in fact. As this blog is just six weeks old, let's also take a look at the most comprehensive listing of Trump fact checks catalogued by our friends at PolitiFact. They have found 150 claims with significant inaccuracies earning them a \"false\" or \"pants on fire\" ruling. Just 78 claims earned the \"mostly true\" or \"half true\" rating that Trump might argue were an exaggeration. \nIn contrast, Hillary Clinton actually gets a lot more \"mostly true\" or \"half true\" claims\": half of her claims, 140, are rated as that. (Just 35 are \"false\" or \"pants on fire.\") \nBy the numbers, the fact checkers are focusing on Trump's biggest lies -- not exaggerating tiny errors. Trump Rewrites Republican Primary to Make His Win Sound Bigger, Better \nDonald Trump is re-imagining the Republican primary as a bigger battle and a bolder win. \nSpeaking in Florida Monday, he boasted, \"We got the most votes in the history of the primary system,\" by winning \"41 — sorry, 42 states\" in the lead up to the general election. On Tuesday, he told Fox News he didn't regret anything in his bid for the White House because he'd already beaten \"17 people.\" \n\"We had a total of 17 — really 18 — and won,\" he added. \nNone of that is true. Trump won 36 states, not 42. H e only beat 16 challengers on the way to the GOP ticket. And h e won the most votes in the history of Republican primaries, not the primary process overall: He was still millions behind Hillary Clinton's final tally in both 2016 and 2008, not to mention Barack Obama's 2008 tally. \nTrump won the Republican primary, but he didn't win it in the way he said. 12 hours ago No, the Presidential Election Will Not Be the Next 'Brexit' for Pollsters \nMonths after voters in the United Kingdom defied surveys and chose to leave the European Union — after pollsters had widely predicted the country would remain — Donald Trump is betting on the American electorate delivering another polling surprise. \n\"Believe me, this is Brexit times five,\" Trump said in Pennsylvania last week. \nBut experts say a polling upset on November 8th is incredibly unlikely, and that the Brexit comparison just doesn't hold water. 15 hours ago Trump Cites Police, Military, ICE Endorsements That Didn't Happen \nOn Monday, Donald Trump told News4Jax that the United States military \"conceptually\" endorsed him and that \"virtually every police department\" in the country backed his bid for the presidency. During last week's third debate, Trump said his hardline stance on immigration and pledge to build a border wall had earned him an endorsement from Immigration and Customs Enforcement. 2 days ago Trump Claims Media Isn't Asking Kaine About Catholics. They Are \nTrump asked on Twitter why Vice Presidential nominee Tim Kaine, a practicing Catholic, was not being asked about the hacked WikiLeaks emails that appear to show Clinton campaign staffers mocking Catholicism. \nKaine has been asked about them in nearly every national TV interview he's done in the last week. \nHe was asked about this twice last Sunday ABC's This Week and Fox News Sunday , CNBC two days later , and was pressed on the same issue on NBC News' Meet the Press yesterday. Why has nobody asked Kaine about the horrible views emanated on WikiLeaks about Catholics? Media in the tank for Clinton but Trump will win! 2 days ago No, ISIS Isn't Rooting for Clinton \nISIS is \"dreaming that Hillary Clinton becomes President. ISIS, their number one dream, Hillary Clinton, let her become President. She's the one that allowed it to form, she's the one that watched it go, now they say it's in 32 countries, worse than ever.\"A dozen interviews with ISIS extremists and a review of their social media networks by Foreign Affairs magazine found that the terrorist group has a strong preference in the 2016 election: they'd like to see Donald Trump elected, not Clinton. \nFact checkers have also reviewed Trump's repeated claim that ISIS' rise is directly Clinton's fault and declared it to be false . 3 days ago Trump Cites Pew Study as Proof of Fraud, But Study Doesn't Find It \n\"According to the highly respected Pew, there are 24 million voter registrations in the United States that are either invalid or significantly inaccurate ... There are 1.8 million dead people that are registered right now to vote. And folks, folks, some of them vote,\" Trump said Saturday night while calling the election \"rigged.\" \nThis 2012 Pew study notes that the voter rolls are wildly out of date and advocates for modernizing the system to save taxpayer money. It finds no proof of voter fraud; the study's only mention of voter fraud is merely that error-riddled voter logs lead to the \"perception\" of being susceptible to fraud. \nIn practice, experts say widespread voter fraud just doesn't exist. Poll observers say that if a voter moves to another state or dies, they don't vote twice and aren't likely to be impersonated. A Loyola researcher who reviewed a billion ballots found 31 credible cases of voter fraud . 4 days ago Yup, the Investor's Business Daily Poll Was the Most Accurate in 2012 \nDonald Trump likes to blur the polls. He's boasted of winning ones that didn't exist, and earlier this week he said he'd won every single post-debate online tally — not true, since our own NBC News/Survey Monkey showed Hillary Clinton winning and even Breitbart's survey said the same for a time — so when Trump started talking up the credentials of a lesser-known poll, our fact checker's ear was piqued. \n\"We're leading in three recent polls the last day: Rasmussen, LA Times, Investor's Business Daily. The last one was the most accurate poll of the last cycle, so that's a good sign!\" he said. \nSure enough, Trump's spot on here: Investor's Business Daily was indeed the most accurate poll of 2012 among the more prolific pollsters. He's leading Clinton by just one point in the national poll of 789 likely voters — within the margin of error to be sure — but leading nonetheless. ", "external_links": [], "published": "2016-10-26T05:14:00.000+03:00", "crawled": "2016-10-26T08:09:25.657+03:00", "highlightTitle": ""}