{"organizations": [], "uuid": "8de00462a5d26786c21940c17ea44aee64f2c67d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 402, "shares": 402, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nbcnews.com", "main_image": "http://media4.s-nbcnews.com/j/newscms/2016_39/1727731/gettyimages-610823332_6601b7819b54163d9a29b68a9036e1a4.nbcnews-fp-1200-800.jpg", "site_section": "", "section_title": "", "url": "http://www.nbcnews.com/storyline/hispanic-heritage-month-2016/these-latino-dishes-are-becoming-all-american-favorites-n656101", "country": "US", "domain_rank": 478, "title": "These Latino Dishes Are Becoming All-American Favorites - NBC News", "performance_score": 4, "site": "nbcnews.com", "participants_count": 0, "title_full": "These Latino Dishes Are Becoming All-American Favorites - NBC News", "spam_score": 0.99, "site_type": "news", "published": "2016-10-05T08:00:00.000+03:00", "replies_count": 0, "uuid": "8de00462a5d26786c21940c17ea44aee64f2c67d"}, "author": "Ana Sof A Pel Ez", "url": "http://www.nbcnews.com/storyline/hispanic-heritage-month-2016/these-latino-dishes-are-becoming-all-american-favorites-n656101", "ord_in_thread": 0, "title": "These Latino Dishes Are Becoming All-American Favorites - NBC News", "locations": [], "entities": {"persons": [{"name": "siri daly", "sentiment": "none"}, {"name": "deb lindsey", "sentiment": "none"}, {"name": "roberto machado noa", "sentiment": "none"}, {"name": "roberto machado", "sentiment": "none"}, {"name": "susan selasky", "sentiment": "none"}, {"name": "nathan congleton", "sentiment": "none"}, {"name": "roberto santibañez", "sentiment": "none"}, {"name": "ana sofía peláez", "sentiment": "none"}, {"name": "gastón acurio", "sentiment": "none"}, {"name": "susan selasky/detroit free", "sentiment": "none"}, {"name": "bill o'leary", "sentiment": "none"}], "locations": [{"name": "united states", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "philly", "sentiment": "none"}, {"name": "spain", "sentiment": "none"}, {"name": "latin america", "sentiment": "none"}, {"name": "tampa", "sentiment": "none"}, {"name": "toronto", "sentiment": "none"}, {"name": "caribbean", "sentiment": "none"}, {"name": "chicago", "sentiment": "none"}, {"name": "colombia", "sentiment": "none"}, {"name": "havana", "sentiment": "none"}, {"name": "ontario", "sentiment": "none"}, {"name": "washington, dc", "sentiment": "none"}, {"name": "bolivia", "sentiment": "none"}, {"name": "new york city", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "silver spring", "sentiment": "none"}, {"name": "peru", "sentiment": "none"}, {"name": "south florida", "sentiment": "none"}, {"name": "southwest", "sentiment": "none"}], "organizations": [{"name": "nbc news", "sentiment": "negative"}, {"name": "getty images", "sentiment": "none"}, {"name": "getty images  some", "sentiment": "none"}, {"name": "washington post", "sentiment": "none"}, {"name": "instagram", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "genoa", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "advertisement \nIf you grew up Latino in this country, you've probably seen some of your favorite dishes go mainstream.Let's face it — how great is that? \nIt might be something you only ate with your family or got teased over for bringing in your lunchbox, but suddenly it's filling up your social media feeds and feeding into the latest click-bait craze. \nHappy as you are to see it recognized, it's hard not to have mixed feelings when the food world's newest \"discovery\" hits close to home and you can only hope success doesn't change it too much. \nIn honor of Hispanic Heritage month, here are only a few Latino favorites that have successfully crossed over and changed our culinary landscape for the better. Ceviche \nCeviche may sound odd to the uninitiated — after all, it's seafood that is not cooked with heat but with acid from citrus fruits such as limes. But there's a reason it's become popular, it's a delicious dish. There's some debate as to whether ceviche originated in pre-Colombian times with the fishermen who marinated their catch with indigenous fruits and peppers or the escabeches of medieval Spain that many of us ate growing up. But there's no question that the fusion of both culinary cultures along with the knowledge and technique that came with Japanese migration in the 19th century led to its perfection in Peru, though it's also popular in central American and Caribbean coastal regions. TORONTO, ONTARIO, CANADA - 2012/07/08: Salsa on St. Saint Clair Festival Scenes: Peruvian Cebiche or Ceviche which is a food cooked with the lime acid. (Photo by Roberto Machado Noa/LightRocket via Getty Images) Roberto Machado Noa / LightRocket via Getty Images \nThough South American cevicherías can be fairly casual, stateside ceviche is synonymous with the introduction of the more hyper-refined and complex Peruvian cuisine. World-class chefs like Gastón Acurio have certainly helped propel and popularize this Peruvian classic in recent years. Arepas \nFor years you might have passed right by the bright yellow corn cakes oozing cheese onto a hot griddle at street fairs. But then arepa bars started popping up, offering the diversity of flavors and filling like reina pepiada, with seasoned chicken salad and avocado or the arepa domino, with black beans and guayanés cheese. That's when everyone understood what their Venezuelan and Colombian friends had been enjoying all along. An arepa stuffed with chicken and avocado at Arepas Pues, which combines Colombia, Cuban and Venezuelan dishes, for the $20 Diner column on September, 19, 2016 in Washington, DC. Bill O'Leary / The Washington Post/Getty Images \nTraditionally made with cracked corn that has been peeled and ground, most arepas are now prepared with pre-cooked and dehydrated corn flour blended with water, salt, and oil. Deceptively simple, the trick is to add just enough water to make them easily moldable but not dry, creating the perfect blank canvas. Tacos \nIn his book Tacos, Tortas, and Tamales , Roberto Santibañez describes a taco as \"anything eaten on a soft tortilla\". It may seem like a simple statement, but if you're old enough to remember when tacos were largely sold as hard, deep fried shells, then you appreciate how far we've come in the United States. While the West coast could always boast of authentic and varied regional Mexican food, it took its time working its way east. TODAY Show: Siri Daly's recipe for roasted veggie tacos and strawberry salsa on TODAY, August 31, 2016 Nathan Congleton / TODAY \nThe establishment of thriving Mexican immigrant communities in major U.S. cities coupled with the food world's rising interest in all things Mexican, means you can now choose between following the taco trail in south Philly or hustling a reservation at the newest destination Mexican restaurant to open its doors in New York City or Chicago. You don't need a taco truck on every corner to understand we've barely scratched the surface of everything Mexican cuisine has to offer. The Cubano \nThe Cubano may be the quintessential crossover. There's even a question about whether it originated with Havana's sandwich mixto or was invented by the Cuban and Italian immigrants working in Tampa's cigar factories at the turn of the century, who added Genoa salami for added smoke and pork flavor. \nWhat isn't up for debate is that ham, roasted pork, swiss cheese, vinegary mustard and pickles pressed and melted between the perfect eggshell crust is magic. SILVER SPRING, MD - NYC's Best Cubano sandwich at A.G. Kitchen photographed in Silver Spring, MD. (Photo by Deb Lindsey For The Washington Post via Getty Images). The Washington Post/Getty Images \nWhile Cuban bread is hard to find outside of South Florida, a good baguette and enough butter on the grill will get you close enough. But stay way from the chipotle mayo and other embellishments. Too much heat throws off the delicate balance between the sweet, the sharp, and the savory. It may taste like a perfectly good sandwich, but it's best not to mess with the Cubano. \nRELATED: Hispanic Heritage Month: Meet the Rising Latino Food Stars Quinoa \nOnce an overlooked grain-like seed sold in health food specialty stores, quinoa's vitamin-packed profile loaded with protein and essential amino acids elevated it to superfood status. Now quinoa is a fixture in fancy restaurants as well as salad bars across the U.S. With pre-Colombian roots that reach back to the Incan empire, it was largely cultivated in the Andean altiplano between Bolivia and Peru, though it's now also grown in parts of the American Southwest. Quinoa Tabbouleh. Known for its nutritional qualities, quinoa contains all nine essential amino acids, meaning it's a complete protein. (Susan Selasky/Detroit Free Press/TNS via Getty Images) Susan Selasky / TNS via Getty Images \nSome argue that the increase in international demand has raised the price for those in Latin America who are most dependent on it as a food staple and nutritional resource. Others believe it's bringing needed revenue and development to impoverished areas. Whatever the health benefits, quinoa's triumph also comes with a side of controversy, though we see it in our menus and our grocery shelves more and more. \nFollow NBC News Latino on Facebook , Twitter and Instagram . Ana Sofía Peláez ", "external_links": [], "published": "2016-10-05T08:00:00.000+03:00", "crawled": "2016-10-06T02:31:54.182+03:00", "highlightTitle": ""}