{"organizations": [], "uuid": "b6b1a7a5236b64a6d13c8a1ecbb1f1671eaddd83", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 394, "shares": 394, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nbcnews.com", "main_image": "http://media3.s-nbcnews.com/j/newscms/2016_39/1707886/160913-arizona-voting-rights-rally-2_bcde1cc2d7a5608a8bb7ea77ca0cbeb1.nbcnews-fp-1200-800.jpg", "site_section": "", "section_title": "", "url": "http://www.nbcnews.com/news/latino/can-latino-vote-help-end-gop-reign-arizona-n671896", "country": "US", "domain_rank": 478, "title": "Can Latino Vote Help End GOP Reign in Arizona? - NBC News", "performance_score": 3, "site": "nbcnews.com", "participants_count": 0, "title_full": "Can Latino Vote Help End GOP Reign in Arizona? - NBC News", "spam_score": 0.122, "site_type": "news", "published": "2016-10-24T08:00:00.000+03:00", "replies_count": 0, "uuid": "b6b1a7a5236b64a6d13c8a1ecbb1f1671eaddd83"}, "author": "Stephen A. Nu O", "url": "http://www.nbcnews.com/news/latino/can-latino-vote-help-end-gop-reign-arizona-n671896", "ord_in_thread": 0, "title": "Can Latino Vote Help End GOP Reign in Arizona? - NBC News", "locations": [], "entities": {"persons": [{"name": "stephen a. nuño advertisem", "sentiment": "neutral"}, {"name": "chavez", "sentiment": "none"}, {"name": "stephen a. nuño", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "ross perot", "sentiment": "none"}, {"name": "bill clinton", "sentiment": "none"}, {"name": "perot", "sentiment": "none"}, {"name": "cesar chavez", "sentiment": "none"}, {"name": "hugo chavez", "sentiment": "none"}, {"name": "fistler", "sentiment": "none"}, {"name": "brewer", "sentiment": "none"}, {"name": "arizona stephen a. nuño", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "william rehnquist", "sentiment": "none"}, {"name": "george h.w. bush", "sentiment": "none"}, {"name": "latina", "sentiment": "none"}, {"name": "jeff flake", "sentiment": "none"}, {"name": "stephen a. nuño  voting", "sentiment": "none"}, {"name": "russell pearce", "sentiment": "none"}, {"name": "reagan", "sentiment": "none"}, {"name": "bernie sanders rally", "sentiment": "none"}, {"name": "bernie sanders", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "chelsea clinton", "sentiment": "none"}, {"name": "laurie roberts", "sentiment": "none"}, {"name": "michelle obama", "sentiment": "none"}, {"name": "sanders", "sentiment": "none"}, {"name": "john mccain", "sentiment": "none"}, {"name": "clinton", "sentiment": "none"}, {"name": "joe arpaio", "sentiment": "none"}, {"name": "carolyn goldwater-ross", "sentiment": "none"}, {"name": "olivia cortes", "sentiment": "none"}, {"name": "ann kirkpatrick", "sentiment": "none"}, {"name": "scott michael fistler", "sentiment": "none"}, {"name": "barry goldwater", "sentiment": "none"}, {"name": "hillary", "sentiment": "none"}, {"name": "harry truman", "sentiment": "none"}], "locations": [{"name": "arizona", "sentiment": "none"}, {"name": "grand canyon", "sentiment": "none"}, {"name": "maricopa county", "sentiment": "none"}, {"name": "flagstaff", "sentiment": "none"}, {"name": "az", "sentiment": "none"}, {"name": "phoenix", "sentiment": "none"}, {"name": "tucson", "sentiment": "none"}, {"name": "vermont", "sentiment": "none"}], "organizations": [{"name": "nbc news", "sentiment": "negative"}, {"name": "senate", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "congress", "sentiment": "none"}, {"name": "gop", "sentiment": "none"}, {"name": "party", "sentiment": "none"}, {"name": "arizona jan brewer", "sentiment": "none"}, {"name": "brewer", "sentiment": "none"}, {"name": "northern arizona university", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Oct 24 2016, 3:48 pm ET Can Latino Vote Help End GOP Reign in Arizona? by Stephen A. Nuño advertisement \nFormer Governor of Arizona Jan Brewer recently raised the ire of Latinos by quickly dismissing that they could propel Hillary Clinton to victory in the state. \"Nah,\" she said, \"They don't get out and vote. They don't vote.\" She's right, but up to a point — 2016 might prove to be quite a different year in Arizona, and Latinos are part of it. \nUnsurprisingly, political scientists see voter participation in more complicated terms than the former governor. The SB1070 bill, which codified racial profiling against Latinos, was a wake up call to the minority community, but without any substantial infrastructure in place to recruit Latinos, it's been a difficult path to realizing the power of the Latino vote. Bernie Sanders Rally, Flagstaff, Arizona Stephen A. Nuño \nBut the Clinton campaign has long licked its lips over the potential presented by a young voting bloc that makes up over 30 percent of the population and will make up over 20 percent of the voters come this November. \nWith a perceptibly tight race for Senate that has left Sen. John McCain's image tattered with his refusal to denounce Donald Trump — combined with a strong moderate Democrat in Ann Kirkpatrick challenging him — Clinton seems to view the state ripe for the picking. \nLast week, the Clinton campaign sent crowd favorites to Arizona in Vermont Sen. Bernie Sanders and First Lady Michelle Obama, with a Chelsea Clinton rally sandwiched between the two megastars. One could also not ignore the persistent rumors at the rallies that Hillary Clinton will soon make an appearance in the Grand Canyon state as well. \nArizona is a stalwart Republican state, but it has always been made up of a testy electorate. The last time a Democrat won the Presidential vote in Arizona was in 1996 with Bill Clinton, but that required a tumultuous campaign and a third party candidate in Ross Perot who siphoned off about 8 percent of the voters. Clinton won the state with less than half the vote in Arizona, and not since Harry Truman in 1948 has a Democrat surpassed that mark with almost 54 percent. Clinton had lost the 1992 election to George H.W. Bush, with Perot slamming Arizona's two-party system with over 23 percent of the vote. \nSimilarly, Bernie Sanders was able to make waves in Arizona during the primary battle against Hillary Clinton earlier this year. Anchored by two bluish cities in Flagstaff in the north and Tucson in the south, Sanders garnered over 40 percent of the Democratic vote. At a rally in the picturesque mountain town of Flagstaff, Sanders stumped for Clinton and reeled in an overflowing crowd fueled by the university's substantial student population, which makes up about 25 thousand students in a city of about 65 thousand residents. Students overflow outside the Bernie Sanders rally for Hillary Clinton at Northern Arizona University, Flagstaff, Arizona Stephen A. Nuño \nA young Latina millennial who supported Sanders in the primary and preferred not to be named came to see Sanders at the rally; she said she was supporting Clinton in the election. \"This election has divided us, but we need to unite,\" she said. \nThroughout the state, the Clinton campaign is feeling out pressure points in the Arizona vote and has reportedly added 2 million dollars to their efforts. Michelle Obama has been a popular draw in Phoenix and hundreds were left standing outside of the convention center because the venue was overflowing. The diverse crowd responded to the First Lady with roaring applause as she asserted one policy after another that was aimed at the young, minorities, and women. \n\"Look at us, just look at us,\" she said pointing to the diverse crowd. From Muslims and undocumented immigrants to veterans and even Republicans, Michelle Obama made an appeal to the common decency and made a contrast with Trump's rhetoric — calling Mexicans rapists, mocking a disabled reporter or his now infamous comments admitting to sexually assaulting women. \nDemocrats have stressed these incidents as Trump's voter base continues to shrink. In Arizona, this also exposes the soft underbelly of a Republican strategy that has long depended on stressing divisions in its appeal to a dwindling white male electorate. \nBut the strength of white voters in Arizona has also long been bolstered by a system designed to minimize their impact on Election Day. Latinos are faced with a plethora of systemic barriers that contribute to historically low turnout rates. As one of the first states to implement voter identification laws, Arizona has long been seen as an innovator in voter suppression. Arizona's Long History with Latino Voters \nIt was in Arizona that former Chief Justice William Rehnquist was accused of actively working to challenge minority voters during the 1960's. Operation Eagle Eye , a Republican program designed to fan out poll watchers for the purposes of intimidating black and Hispanic voters on Election Day. \n\"Caging\" was another popular tactic employed by Republicans, where letters would be sent out to predominantly black neighborhoods and any discrepancies or undelivered mail would be used to place voters on a list that would be used to challenge their eligibility to vote, purging them from the rolls. \nLatinos are also disproportionately young and poor compared to their white counterparts, making them more difficult to reach by the system. Language barriers have also created problems in the past. Counties in Arizona consistently print the wrong information on Spanish-language ballots, and candidates have tried all sorts of tricks to confuse Latino voters. \nFor instance, Russell Pearce, a powerful state senator who came under attack by moderate Republicans for his role in crafting the anti-immigrant bill SB1070, was infamously accused of putting a \" sham\" candidate named Olivia Cortes on the ballot in the hopes that her name would split the Latino vote. \nThe tricks employed against Hispanics are legend. One Republican candidate, Scott Michael Fistler, not only changed his party affiliation to Democrat, but legally changed his name to Cesar Chavez , the revered civil rights activist. Fistler's website contained stock photos of crowds holding \"Chavez\" signs, which turned out to be rallies for Hugo Chavez, the Venezuelan President. \nThe response to Brewer's recent statement that Latinos don't vote was swift; local media and organizations moved to capitalize on Brewer's provocation. With two weeks to go before the election and with ballots already being cast in Arizona, Brewer's comments are the juicy bulletin board material opposing coaches look for to motivate their teams just before the big game. \nLaurie Roberts, a columnist for the largest paper in Arizona, wonders if the \"sleeping giant\" long talked about may be snoring no longer . However, if Brewer's statement woke anyone up, they'd be out of luck if they haven't registered; the deadline for this presidential election passed almost two weeks ago, October 10th. Latinos for Hillary cheers on Michelle Obama in Phoenix, AZ Stephen A. Nuño \nVoting has already begun in Arizona and will continue until November 8th. Early estimates show a promising outlook for the Democrats, and the latest polls out of Arizona have shown Clinton ahead of Trump. \nFor Latinos who haven't done early voting, long lines await them in a final obstacle to having their vote counted. During the primary election this year, Maricopa County decided to reduce the number of polling stations from 200 in 2012 to 60. With the reduction in polling sites, there was further confusion over which site voters could go to. For instance, in 2012 there were designated sites for voters, but in 2014, voters could go to any of the 60 polling sites. \nSurvey data from Latino Decisions continues to paint a favorable picture for historic Latino turnout across the nation. Their latest tracking poll has continued to trend favorably for Clinton. As if the GOP could not be less popular, since the tracking poll started, favorability of Republicans in Congress fell from 30 percent to just 21 percent in just the last six weeks. A Latina rallies for Clinton at Michelle Obama event in Phoenix, Arizona Stephen A. Nuño \nWith a record 3.4 million Arizonans registered to vote , popularity will be a huge factor when the votes get counted on November 8th. Republicans still outnumber Democrats by about one hundred sixty-six thousand voters, but independent voters are barking up the heels of the GOP, with just under 21 thousand voters less. \nBoth the GOP and Independent voters make up about 34 percent of Arizonans each, and if the polls are correct, Trump's implosion may take others with him. \nThe election seems to be pointing to the inevitable demise of notorious Sheriff Joe Arpaio. But it could also bring down Senator Jeff Flake, one of the most vocal Republicans to denounce Donald Trump for his rhetoric. \nOne of the most symbolic moments representing the problems facing Republicans into the future was when Barry Goldwater's granddaughter stood before the crowded auditorium waiting for Michelle Obama last week and said, \"This time, I'm with her.\" \nIn what must have felt like a tight cramp in the chest of Republican boomers, Carolyn Goldwater-Ross said, \"There is only one candidate that lives up to my grandfather's values.\" \nBarry Goldwater's pPresidential run in 1964 brings a mixed bag of emotions for Republicans. On the one hand the free market giant in the minds of Republicans marked a new beginning for the Party, and ushered in a newfound hope by the GOP to transform the nation into what ultimately became the Reagan presidency. Play ", "external_links": [], "published": "2016-10-24T08:00:00.000+03:00", "crawled": "2016-10-25T00:04:42.116+03:00", "highlightTitle": ""}