{"organizations": [], "uuid": "2fc5a568023da4acf3c95a315b60252ca107cf6c", "thread": {"social": {"gplus": {"shares": 3}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 33, "shares": 33, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nbcnews.com", "main_image": "http://media1.s-nbcnews.com/j/newscms/2016_42/1762521/snaps-mtp-still-about-meet-the-press-on-nbc-news-a-net-backup_yz_b0d10505d9e1c73c88f81107a0b5820c.nbcnews-fp-1200-800.jpg", "site_section": "", "section_title": "", "url": "http://www.nbcnews.com/meet-the-press/meet-press-october-23-2016-n671406", "country": "US", "domain_rank": 478, "title": "Meet the Press - October 23, 2016 - NBC News", "performance_score": 0, "site": "nbcnews.com", "participants_count": 0, "title_full": "Meet the Press - October 23, 2016 - NBC News", "spam_score": 0.111, "site_type": "news", "published": "2016-10-23T08:00:00.000+03:00", "replies_count": 0, "uuid": "2fc5a568023da4acf3c95a315b60252ca107cf6c"}, "author": "", "url": "http://www.nbcnews.com/meet-the-press/meet-press-october-23-2016-n671406", "ord_in_thread": 0, "title": "Meet the Press - October 23, 2016 - NBC News", "locations": [], "entities": {"persons": [{"name": "eliana johnson", "sentiment": "negative"}, {"name": "charlie", "sentiment": "none"}, {"name": "barack obama", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "tim kaine", "sentiment": "none"}, {"name": "alec baldwin", "sentiment": "none"}, {"name": "donald trum", "sentiment": "none"}, {"name": "bill clinton", "sentiment": "none"}, {"name": "ross douthat", "sentiment": "none"}, {"name": "chuck todd", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "chuck", "sentiment": "none"}, {"name": "ronald reagan", "sentiment": "none"}, {"name": "brad schneider", "sentiment": "none"}, {"name": "paul ryan", "sentiment": "none"}, {"name": "richard burr", "sentiment": "none"}, {"name": "tom hanks", "sentiment": "none"}, {"name": "joe biden", "sentiment": "none"}, {"name": "barack obama", "sentiment": "none"}, {"name": "bernie sanders", "sentiment": "none"}, {"name": "stuart", "sentiment": "none"}, {"name": "chuck", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "tom", "sentiment": "none"}, {"name": "mitt romney", "sentiment": "none"}, {"name": "stuart stevens", "sentiment": "none"}, {"name": "tom friedman", "sentiment": "none"}, {"name": "eisenhower", "sentiment": "none"}, {"name": "hillary cl", "sentiment": "none"}, {"name": "romney", "sentiment": "none"}, {"name": "stu", "sentiment": "none"}, {"name": "obama", "sentiment": "none"}, {"name": "yamiche alcindor", "sentiment": "none"}, {"name": "des moines", "sentiment": "none"}, {"name": "clinton", "sentiment": "none"}, {"name": "marco rubio", "sentiment": "none"}, {"name": "gutenberg", "sentiment": "none"}, {"name": "dave wasserman", "sentiment": "none"}, {"name": "joe heck", "sentiment": "none"}, {"name": "kate mckinnon", "sentiment": "none"}, {"name": "patrick", "sentiment": "none"}, {"name": "eliana", "sentiment": "none"}, {"name": "harry truman", "sentiment": "none"}, {"name": "pat toomey", "sentiment": "none"}, {"name": "terri", "sentiment": "none"}], "locations": [{"name": "kansas city", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "virginia", "sentiment": "none"}, {"name": "louisville", "sentiment": "none"}, {"name": "bloomington", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}, {"name": "iowa", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "kansas", "sentiment": "none"}, {"name": "north carolina", "sentiment": "none"}, {"name": "indiana", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "kentucky", "sentiment": "none"}, {"name": "ohio", "sentiment": "none"}], "organizations": [{"name": "nbc news", "sentiment": "negative"}, {"name": "united states golf association", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "congress", "sentiment": "none"}, {"name": "trump inc.", "sentiment": "none"}, {"name": "repub", "sentiment": "none"}, {"name": "house of representatives", "sentiment": "none"}, {"name": "n.r.s.c.", "sentiment": "none"}, {"name": "republican party", "sentiment": "none"}, {"name": "nevada senate", "sentiment": "none"}, {"name": "democratic party", "sentiment": "none"}, {"name": "targetsmart", "sentiment": "none"}, {"name": "democratic leadership council", "sentiment": "none"}, {"name": "senate", "sentiment": "none"}, {"name": "house", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "\nI've been, oh go ahead. \nELIANA JOHNSON: \nWell, I actually think that, that that's exactly right. And because the crisis in the Republican party is garnering all the headlines, that Democrats are overlooking the looming crisis in their party, because I think the primary between Bernie Sanders and Hillary Cl-- Hillary Clinton really showed that Hillary Clinton is where the head of the Democratic party is, but the people really are with Bernie Sanders, particularly on trade. \nAnd you saw Tim Kaine say, \"Well, no, I'm-- we're definitely not for T.P.P. An Asian trade agreement? Yeah, we're probably for that.\" But you know, the Democratic party's, their heart is against that. And it's going to be a bloody fight. And the same is true in the Republican party. \nYAMICHE ALCINDOR: \nI've been talking to Repub-- to progressives all week that are telling me that they're already organizing against Hillary Clinton as if she were a Republican president. They're looking at her saying, \"We're going to have to push her every step of the way. And we don't trust her.\" So this idea about T.P.P., they're not going to like Tim Kaine's answer. I watched him and listened to him and they're thinking to themselves that \"I don't-- I don't trust these people. I don't know what they're going to do when they get in there.\" \nCHUCK TODD: \nBoy, part-- \nTOM FRIEDMAN: \nThe irony Chuck is that T.P.P. represents the single greatest liberal achievement on trade since we've negotiated trade agreements. The first deal that has real labor protection and real environmental protection. And that's exactly what Obama will be selling the morning after. \nCHUCK TODD: \nIronically, Stu, and I've actually had some Democrats say this to me, and especially in this issue, if you are Hillary Clinton, secretly you may hope Paul Ryan is still the Speaker of the House. That you need one Republican majority to basically tell progressives, \"This is as far as I can go.\" \nSTUART STEVENS: \nWell, what's extraordinary about this debate on trade is that the Republican is really to the left of the Democrat. \nCHUCK TODD: \nRight. \nSTUART STEVENS: \nI mean, he's up there saying, \"Bernie Sanders was right, and he wants 45% tariffs.\" It's like, \"Well, whoa, whoa, whoa.\" So I don't-- I think it would be good to have someone like Paul Ryan there who can argue a more conservative viewpoint of why we need this. \nCHUCK TODD: \nAll right, let's go into some numbers. And Stuart, I really want to get your reaction to this. We got some early voting numbers here, it's a reminder people are already voting. Over four million people have already cast their ballot in this election so far. And we know the partisan breakdown of these voters. And you can see how the candidates are stacking up to years past. \nSo a data that was partially provided by a Democratic firm called TargetSmart, Florida's absentee vote so far, both Republicans and Democrats are pulling about the same numbers here, how the party's voted, Stuart, 42, 42, 39, 39. So at-- to 40, about the same. But look at these North Carolina numbers. Republicans accounted for 50 percent of all absentee vote in 2012, while Democrats accounted for just 28 percent of the absentee vote. Now it's much closer, 40 to 35. It's proof that it looks like the Democrats have the mechanic advantage. \nSTUART STEVENS: \nYeah, you know, all of our modeling in political politics, presidential politics breaks from basically two equal campaigns. We've never had a situation where-- the Trump campaign really doesn't have much of an organization. It's more of a concert tour. And it, it-- what are the implications of that? Now some have argued, as Trump did in the primary, it doesn't really matter. We're really going to see the first test of that. \nBecause say what you will about the Clinton campaign, they have designed a very effective machine with top people. And I think that Republicans are greatly disadvantaged in these states, because we never went through the steps to the presidential campaign of raising money and giving it to the states to bill this. So we'll see how it plays out. And these early numbers are the best indicator. \nCHUCK TODD: \nAnd Eliana, how, how much panic do you hear from Sen-- Senate candidates? I mean, if you're Richard Burr, that-- that's got to freak you out. \nELIANA JOHNSON: \nAbsolutely. You know, I would add one note of caution about these early-voting numbers in that all-- we don't know how any of these people went into the ballot box and actually pulled the lever. \nCHUCK TODD: \nOf course, this is just partisan-- Right. \nELIANA JOHNSON: \nThey're just based on the party somebody's affiliated with. And one of the things people have speculated about is are Democrat-- Democrats going to vote like traditional Democrats, union voters trending toward Trump, are Republicans going to vote like traditional Republicans? \nSo just a note of caution on that. But, you know, to Stu's point, this is like a political science experiment in whether ground game matters. And what I've heard from Senate candidates are they essentially have had to build up presidential-type ground games in each and every state. And that's tremendously difficult to do. \nCHUCK TODD: \nAll right, I'm going to wrap this up here. But we'll know on Election Day if, if her lead increases from what the national polls say, then it'll tell us I think that ground games do matter. All right, when we come back, it was the Beach Boys who sang, \"Catch a wave and you're sitting on top of the world.\" Well, if the Democrats catch a wave on Election Day, could they wind up sitting on top of the Senate and the House? That's next. But first, a little more from last night's S.N.L. \n(BEGIN TAPE) \nSo you're just never going to answer a question about your emails? \nKATE MCKINNON: \nNo, but it was very cute to watch you try. \n(END TAPE) \n* * *COMMERCIAL BREAK* * * \nCHUCK TODD: \nAnd we are back, data download time. Hillary Clinton is holding onto a solid lead in the presidential race. So Democrats are looking to run up the score down the ballot. Their chances to take back the Senate already look pretty good. But what would turn 2016 into an actual wave election that could help Democrats get the 30 seats they would need to win a House majority? \nWell, our pal Dave Wasserman of the Cook Political Report rated these 19 House districts across the country as pure toss-up races. Of these 19, 17 are currently held by Republicans, just two by Democrats. So if this does become a wave election, Democrats would probably win the lion's share of those races. \nSo, throw those in. Add in several seats that Democrats are likely to win largely because of redistricting that took place in Florida and Virginia and the Democrats could net 21 seats just in those two categories. However, for this truly to be a wave election, Democrats are going to have to score some upsets in places Republicans normally win. \nSo these are the 12 lean Republican races across the country. There are three that I'm going to pay special attention to on election night. They're my canaries in the coal mine. The House seats in Kansas City, Kansas, Des Moines, Iowa, and Indiana's ninth district, which includes Bloomington in Indiana and the suburbs around Louisville, Kentucky. These are going to be the, the races to watch to see if Democrats win two of these three or all three of them, then we will, it will tell you a lot about moderate Republican turnout that may have not been there, which could in turn mean a bad night for the Republicans across the board. \nWe did see big waves in 2006 when the Democrats took back the House and the Senate, and in 2010 when Republicans flipped the House back by a huge margin. Yet, despite of all of this, history may not be on the Democrats' side. The last time the House of Representatives changed hands in a presidential election year, 1952. So ask yourself, is this an Eisenhower wave that's coming? When we come back, we'll talk about whether there is a real possibility to rig a general election in the United States. But as we go to break, here's another light moment from last night's S.N.L. \n(BEGIN TAPE) \nAll of the newscasters are making me look so bad. \nTOM HANKS: \nAnd how are we doing that? \nALEC BALDWIN: \nBy taking all of the things I say and all of the things I do and putting them on TV. \n(END TAPE) \n* * *COMMERCIAL BREAK.* * * \nCHUCK TODD: \nBack now with our panel. Before we get to this election rigging stuff, I want to talk about what I just did in the Data Download, the House, it's a long shot. Not since 52 has the house changed hands in a presidential election year. So, if it does, who leads the Republican party, Tom? \nTOM FRIEDMAN: \nI think, you know, I find myself with two minds when I think of that Chuck. One is, you'd like to have Republicans have skin in the game. Both for the reasons you talked about, to discipline the left-wing of the Democratic party but also that we can't get anything big done without that. But I have another mind, that maybe this party needs to crash and burn. This version of the Republican party needs to die. So out of the ashes, just as a new Democratic party came out of the post-McGovern, post-Dukakis era, that we will get a Democratic leadership council movement, a sane Republican party. \nCHUCK TODD: \nThere you go. \nELIANA JOHNSON: \nThat is going to happen regardless, whether Republicans lose the House. You're seeing that happen right now. \nCHUCK TODD: \nBut seventy-five percent of the party are Trump voters, it's only 25 percent that think the way you think, right Eliana? \nELIANA JOHNSON: \nWell, what I think's going to happen is the party is crashing and burning right now and Donald Trump, I think, will preach to the converted after the election but the party is going to have to -- Trump supporters, I think, haven't gotten the attention that they deserve from the party. And the party's going to grapple with how to incorporate Trump supporters and parts of Trump-ism, on trade and immigration in particular, and I think that needs to happen. I think both parties have neglected these voters. Many of them are former Democrats. \nCHUCK TODD: \nWhat's best for the Republican party, total collapse? Or keep Paul Ryan there to be the guy that, sort of---- \nSTUART STEVENS: \nI think where the Republican party goes is totally up in the air. But it's got to be reality based. I mean I just keep going back to this, in 1980 when Ronald Reagan won 44 states with 56 percent white vote. Mitt Romney got 59 percent in 2012 and lost. So, you know, a lot of these conversations here about the Republican party are like -- on the interstate you've got to drive 100 miles, 40 miles of gas, and you're debating whether or not you should stop for gas. The car doesn't care. It's going to stop. And Republicans either have to decide that we can reach out to more non-white voters and win presidential elections or not. There's really no alternative. \nYAMICHE ALCINDOR: \nWhen I go to these rallies for Pence and for Donald Trump and I talk to people, they really don't feel as though the Republican party really stuck with them. They feel like the party just doesn't understand the anxiety that they're feeling, both about the economy and also about healthcare, and what they're going to take care of their families. And in some ways, they sound like people who voted for Obama. I was working on some things, talking to people about whether or not they voted for Obama, and people were like, even with him there was going to be change and the economy was going to be better. So the Republican party, 75 percent of them, don't sound like the people that the establishment says they are. \nCHUCK TODD: \nWell, it's interesting that you bring that up. Look, Iowa and Ohio are the two states that haven't sort of -- where Hillary Clinton hasn't taken off during this spell. That means, Eliana, there are Obama voters from '12, who when they painted Mitt Romney as the guy who fired you, you know, that voted Obama over him, and those people are with Trump, because he's talking the way Obama talked about Romney. \nELIANA JOHNSON: \nYeah, I think there's not an enormous segment, but a significant segment of the electorate that feels when Trump talks about a rigged election, that doesn't feel necessarily that the election is going to be rigged, but that the system is rigged against them, that they haven't gotten the attention from either party that they deserve. \nAnd I think that's scorned by at least in both parties. And I don't think to Stu's point that the debate is over whether or not the Republican party needs to reach out to minority voters or to these voters, but it's how to do that. It's is immigration reform the magic bullet or does moderating some of the party's stances on entitlement reform or the welfare state, is that a more constructive way to do it? \nCHUCK TODD: \nYou know, Tom, it does seem as if, and I thought one of your compatriots on the op-ed page this morning, Ross Douthat, I thought he had an interesting, he said, \"The risks with Hillary Clinton is this idea of group think about globalization.\" It was among the risks. And this is what some skeptical Trump people, who still may vote for him, are thinking about, that you know what, maybe she's not going to rethink how globalism works. \nTOM FRIEDMAN: \nWell, I would take it one step deeper, if I could Chuck. I think we're in the middle of the single greatest technological inflection point since Gutenberg invented the printing press. I think the workplace is fundamentally being transformed. And what Bill Clinton said back in 1992 just doesn't apply anymore. \nWhat did he say in that convention, \"If you work hard, play by the rules, you should be in the middle class.\" Well, good luck with that. Today you have to work harder, relearn faster, retool, reengineer. And, you know, Eliana went to daughter with my college-- college with my daughter, which shows how old I am. Okay? And I always used to say, \"When I graduate from college, I got to find a job.\" \nWhen my daughters graduate from college, they have to invent a job. That's what's new. All right? And then, you may get lucky and get your first job, but you've got to invent, reinvent. And nobody wants to trust the people with that truth. Because it's really scary. \nCHUCK TODD: \nDoes the Clinton campaign get this? \nYAMICHE ALCINDOR: \nIt's hard to say if they get this, because if you hear them talking about the economy, or like, and if you hear them talking about giving people opportunities, they still believe that if you go to college, or if you do this. It sounds like they're saying, \"You can have the--\" \nCHUCK TODD: \nSounds like Bill Clinton. \nYAMICHE ALCINDOR: \nIt sounds like Clinton-- This is an America that you can have. There is this American dream. But then when you talk to people who have four degrees or master's programs and they can't find jobs, or they're living in the basements of their parents' house, those are people who maybe voted for Bernie Sanders, or maybe those are people who are solid Trump supporters. Those people overlap in their life experiences. \nCHUCK TODD: \nAll right, let me take a quick pause here, 45 seconds with our endgame segment, including something that hasn't happened since Harry Truman's first year in office. \n***COMMERCIAL BREAK*** \nCHUCK TODD:Back now with End Game. Despite all the talk about Hillary Clinton wanting to work across the aisle or what we've been talking about here. About should Paul Ryan stay or go? What's better for the Republican party? It's clear politically, Hillary Clinton and Barack Obama both are looking for a wave. Look at how much President Obama is suddenly appearing in down ballot TV ads. Here's a little montage. \n(BEGIN TAPE) \nBARACK OBAMA:Terri's running for Congress and we need a lot more people like her in Washington. \nBARACK OBAMA: \nVote for Brad Schneider and the Democrats so we can keep America's promise to our seniors. \nBARACK OBAMA: \nSalga Y vote por Patrick. Su voto es muy importante. Gracias amigos. \nBARACK OBAMA: \nCharlie needs your vote. Please stand with him. I know he'll always stand with you. \n(END TAPE) \nCHUCK TODD: \nYou know, Stuart, this reminds me a little bit of Mitt Romney 2014. He became popular enough to use-- \nSTUART STEVENS: \nYep. \nCHUCK TODD: \n--in all of these down ballot ads. Barack Obama, sitting with anywhere from a 53 to 57 percent approval rating. He's suddenly popular in swing state ads. \nSTUART STEVENS:It's a, it's a huge advantage for any party to have a popular incumbent president. It's one of the few ways that you can elect a third term of someone in the White House. If you're a Clinton advance person, it's a sweet spot to be in for the next few weeks, because you can call up Bill Clinton. They say, \"Do you want the president, do you want the first lady, do you want Bernie Sanders, do you want Bill Clinton? How about Joe Biden?\" You can build a rally with those people. And they each have constituencies. And it's really starkly different when you see what's happening with the Trump campaign and who he's traveling with. It limits their audience appeal. \nCHUCK TODD: \nEliana, how are these Senate candidates handling this? That suddenly President Obama is playing a pretty mean-- he called out Marco Rubio at events, she's calling out Pat Toomey. I mean, this has to make that vice grip a little bit tighter. \nELIANA JOHNSON: \nWell, I think Republican candidates are constrained not only by Democratic strengths, but by Trump's weaknesses because a lot of polling shows that Republican voters and Democratic voters want a check on a Clinton presidency. But Republican candidates can't say that. There's a segment of Trump voters who will spurn them and vote against them, threaten to vote against them, if they do say that. So they cannot go out and campaign on, on essentially conceding the election to Hillary Clinton. The N.R.S.C. is now running ads on Republican Senate candidates being in check to Clinton. But I don't think that's going to be enough. I think if they were going to do that, they'd have to say it forthrightly. And they cannot do that. \nCHUCK TODD: \nLook, you-- Nevada Senate, Tom. Joe Heck, the Republican nominee, he came out against when Trump, when the sexual-assault language came out, he said, \"You know what, my--\" basically, he said it was personal for him. His wife had been a victim of sexual assault. And he just couldn't do it. Apparently he hasn't led in a poll since. That Trump voters are punishing him, I mean, that's a vice grip. \nTOM FRIEDMAN: \nYeah, and I think what is even scarier, Chuck, is what happens if Trump loses after the election? Which Donald Trum-- And people say he's going to start his own media company and be constantly then terrorizing the Republican party from the right. This should be very interesting. You see a real tension between Trump ink, I-N-K, and Trump Inc., I-N-C okay? Because look, the United States Golf Association next year I think is holding the women's U.S. Open at a Trump Golf Course. \nCHUCK TODD: ", "external_links": [], "published": "2016-10-23T08:00:00.000+03:00", "crawled": "2016-10-23T23:24:35.364+03:00", "highlightTitle": ""}