{"organizations": [], "uuid": "f4eda4be82e9793e5bbff1c78a79034d191af0a9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 48, "shares": 48, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nbcnews.com", "main_image": "http://media2.s-nbcnews.com/j/newscms/2016_40/1739681/cover_art-watched_b16488ae6ca53c637d7d94fe2ce0e296.nbcnews-fp-1200-800.jpg", "site_section": "http://www.nbcnews.com/News/asian-america", "section_title": "Asian America – Asian American News &amp; Top Stories - NBC News", "url": "http://www.nbcnews.com/news/asian-america/immigrant-teen-gets-swept-nypd-surveillance-marina-budhos-watched-n661171", "country": "US", "domain_rank": 478, "title": "An Immigrant Teen Gets Swept Into NYPD Surveillance in Marina Budhos' 'Watched'", "performance_score": 0, "site": "nbcnews.com", "participants_count": 1, "title_full": "An Immigrant Teen Gets Swept Into NYPD Surveillance in Marina Budhos' 'Watched' - NBC News", "spam_score": 0.001, "site_type": "news", "published": "2016-10-10T20:36:00.000+03:00", "replies_count": 0, "uuid": "f4eda4be82e9793e5bbff1c78a79034d191af0a9"}, "author": "Lakshmi Gandhi", "url": "http://www.nbcnews.com/news/asian-america/immigrant-teen-gets-swept-nypd-surveillance-marina-budhos-watched-n661171", "ord_in_thread": 0, "title": "An Immigrant Teen Gets Swept Into NYPD Surveillance in Marina Budhos' 'Watched'", "locations": [], "entities": {"persons": [{"name": "jackson heights", "sentiment": "negative"}, {"name": "naeem", "sentiment": "negative"}, {"name": "trevor aaronson", "sentiment": "none"}, {"name": "gerda taro", "sentiment": "none"}, {"name": "gawker", "sentiment": "none"}, {"name": "franck goldberg", "sentiment": "none"}, {"name": "marina budhos", "sentiment": "none"}, {"name": "robert capa", "sentiment": "none"}, {"name": "bebeto matthews", "sentiment": "none"}], "locations": [{"name": "marina budhos", "sentiment": "none"}, {"name": "new york city", "sentiment": "none"}, {"name": "queens", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "brooklyn", "sentiment": "none"}, {"name": "jackson heights", "sentiment": "none"}], "organizations": [{"name": "facebook twitter google", "sentiment": "none"}, {"name": "muslim surveillance", "sentiment": "none"}, {"name": "new york police department", "sentiment": "none"}, {"name": "nbc asian america on facebook", "sentiment": "none"}, {"name": "instagram", "sentiment": "none"}, {"name": "ap", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Like Naeem, you're also from Jackson Heights, a neighborhood with a large South Asian population. There are so many novels set in Brooklyn out right now, but there haven't been that many stories about Queens.\nI was born in Jackson Heights and I moved away when I was a little kid. This book is a love song in a lot of ways to Queens. There is definitely this new [literary] scene that's emerging. My prior novel \"Ask Me No Questions\" was also set in Queens but I don't think that I delved into the landscape as much until this book.\nThere are so many ways that Queens is a landscape and I feel like this is only the beginning.\nHow would you describe Naeem to someone who hasn't read your book?\nHe's a teenage boy who is very charming and tries to please everybody but he can't quite get it together. But for a boy like Naeem — he's a Muslim, he's an immigrant, his character is struggling, and there's a generational gap between him and his family — it sets him on more of an odyssey than what he's anticipated.\nMarina Budhos is also the author of the upcoming \"Eyes of the World: Robert Capa &amp; Gerda Taro &amp; The Invention of Modern Photojournalism,\" as well as \"Ask Me no Questions,\" the precursor to \"Watched.\" Franck Goldberg You don't really see a lot of working class people in YA. When we see stories about teenagers in New York, they are often Gossip Girl-esque books about very rich teens.\nThat's a great point. And it's not like I was setting out to write the YA working class novel. I saw as an odyssey story, where a young man has to travel away from his family and be shaped by the streets and then come back to his family and figure out who he is.\nNaeem is definitely more street, more working class, his parents are struggling. Those are the stories that move me. And what I like about writing about these themes is that they are stories of about ordinary striving and it isn't about these gilded and rarified worlds.\nYou mention in the acknowledgements that you read the AP's extensive, Pulitzer Prize-winning investigation into the NYPD's Muslim surveillance program. What was your first reaction when you read those stories?\nMy reaction was \"Oh my god.\" I feel like surveillance was something that was happening in a very profound way, but I didn't know it was happening at this level. When the story broke, I guess it sort of confirmed a hunch I had just started to follow. I think reading that investigation and also reading \"The Terror Factory\" by Trevor Aaronson kind of shocked me into wanting to do a novel about it.\nRELATED: New York City Settles Lawsuits Concerning Muslim Surveillance, Will Institute Reforms\nWhen Naeem was first approached by the cops, they immediately point out that his family can't help him if he were to get into trouble. Becoming an informant is presented to him as his only real choice.\nExactly. And I think he feels that way. Naeem is someone who's always dreamed big but he has a pretty vague sense of how he'd get there and he doesn't have the family background that can really help him. And the cops know that. They prey on that and some of that came out of research I had done with groups that work with immigrants that face this sort of interrogation.\nYou can tell Naeem is torn about agreeing to be an informant. What was it like getting into a character that knows he's doing something wrong, but keeps going?\nThe way I work as a writer, I don't have a story is until I have a character. The way I found my way to Naeem was a friend of mine was telling me about a young man who came into her law office who seemed to be boasting about the fact that he was an informant. He wasn't quite saying it, but his immigrant father ran a shop but he was like, \"But me, I am in the know. I am with the powers that be.\"\nI could have written this story where he's just a victim who is entrapped by the cops, but I think it's much more interesting to have a character that gets something out of this, who sees it as one more way of showing that he's a man and has a sense of power. I really wanted to explore a character who is drawn to it and who thinks that he is doing some good but then starts to have more misgivings.\nMuslim community members and supporters march near 1 Police Plaza to protest the New York Police Department surveillance operations of Muslim communities on Nov. 18, 2011, in New York. Bebeto Matthews / AP file You can see that in the scene where Naeem gives his stepmother two fifty dollar bills that he earned from his work. He's so proud that he's finally able to contribute to the household in a meaningful way.\nNaeem's conflict is that he really saw some heroics in it. And he's starting to gain a sense of strength being an informant, because he really had been a slacker before that. What I am also trying to portray is how confusing it is to be a young Muslim because of the question of what is the right form of protection. And this sent him down the road of betrayal, but it is a really difficult question.\nOne of the biggest revelations of the AP investigation was that there was this huge surveillance program, but it really didn't uncover information of any real importance.\nThe problem is that the program as it existed before — and we still don't know what's going on — I've spoken to various groups and they say that there is still some form of surveillance going on. And has you said, it came up with nothing except things like, \"they are watching soccer at the local cafe.\"\nOr there was that Gawker post about how the surveillance program revealed the best Muslim-owned restaurants in New York.\nRight. And there were thousands of these kinds of reports being produced and nothing came of the investigations.\nPlay Facebook Twitter Google Plus Embed What did NYPD Muslim unit actually uncover? 11:14 autoplay autoplay Copy this code to your website or blog Do you usually gravitate towards immigrant issues and social justice in your writing?\nSome of my instincts as a journalist, even though I'm not quite a practicing journalist, is that I kind of find this alchemy into fiction in a \"what if\" mode. But in a broader sense, I think I am drawn to immigrant stories and to young people. So I don't know if that falls into a social justice mode or into the mode of really wanting to tell those invisible stories that are not as seen.\nWhat are you working on next?\nThe next book I'm writing is going to set in the late 1960s, early 1970s. The date hasn't been yet, but it's going to be the Queens of the integration era. So before the Queens we know now. And it's about two mixed race girls who are kind of caught in between a clash of black and white. They have partially immigrant backgrounds as well, but it's more about the era when there was a bussing plan and they are caught in between that.\nSo their backgrounds are similar to yours. [Budhos is part Indo-Caribbean.]\nYes. I wanted to deal with what it was like to be mixed race at a time when the world was more polarized. So I haven't completely abandoned Queens yet.\nThis interview has been edited for length and clarity.\nFollow NBC Asian America on Facebook , Twitter , Instagram , and Tumblr .", "external_links": ["http://media1.s-nbcnews.com/j/newscms/2016_40/1739686/marina_budhos_author_photo_credit_franck_goldberg_78c1833de7b4fc88870335fcc53a3df9.nbcnews-fp-360-360.jpg", "http://www.facebook.com/nbcasianamerica", "https://www.facebook.com/sharer.php?u=http://www.msnbc.com/morning-joe/watch/what-did-nypd-muslim-unit-actually-uncover-228219459659&t=What", "http://www.instagram.com/nbcasianamerica", "http://www.twitter.com/nbcasianamerica", "http://media2.s-nbcnews.com/j/newscms/2014_16/326206/140415-muslim-protest-nypd-1935_9baff118dc45ac060ec7384fece561da.nbcnews-ux-600-480.jpg", "http://feed.theplatform.com/f/2E2eJC/nnd_18424787", "https://plus.google.com/share?url=http://www.msnbc.com/morning-joe/watch/what-did-nypd-muslim-unit-actually-uncover-228219459659", "http://media2.s-nbcnews.com/j/msnbc/components/video/__new/n_mj_toptalk3_140416.nbcnews-ux-1240-700.jpg", "http://www.msnbc.com/morning-joe/watch/what-did-nypd-muslim-unit-actually-uncover-228219459659&via=nbcnews", "http://media2.s-nbcnews.com/i/MSNBC/Components/Video/__NEW/n_mj_toptalk3_140416.jpg", "http://media2.s-nbcnews.com/j/msnbc/components/video/__new/n_mj_toptalk3_140416.nbcnews-ux-360-200.jpg", "http://media2.s-nbcnews.com/j/msnbc/components/video/__new/n_mj_toptalk3_140416.nbcnews-ux-1080-600.jpg", "http://link.theplatform.com/s/2E2eJC/O6okJvqQu0Tx", "http://link.theplatform.com/s/2E2eJC/tICPSl_ljO1n", "http://player.theplatform.com/p/2E2eJC/nbcNewsOffsite?guid=n_mj_toptalk1_140416", "http://media2.s-nbcnews.com/j/msnbc/components/video/__new/n_mj_toptalk3_140416.nbcnews-ux-800-440.jpg", "https://twitter.com/share?text=What", "http://media2.s-nbcnews.com/j/newscms/2014_16/326206/140415-muslim-protest-nypd-1935_9baff118dc45ac060ec7384fece561da.nbcnews-ux-2880-1000.jpg", "http://media1.s-nbcnews.com/j/newscms/2016_40/1739686/marina_budhos_author_photo_credit_franck_goldberg_78c1833de7b4fc88870335fcc53a3df9.nbcnews-ux-600-700.jpg", "http://media2.s-nbcnews.com/j/msnbc/components/video/__new/n_mj_toptalk3_140416.nbcnews-ux-440-240.jpg", "http://on.msnbc.com/1iZLkZd", "http://feed.theplatform.com/f/2E2eJC/nnd_20381145", "http://media1.s-nbcnews.com/j/newscms/2016_40/1739686/marina_budhos_author_photo_credit_franck_goldberg_78c1833de7b4fc88870335fcc53a3df9.nbcnews-ux-2880-1000.jpg", "http://link.theplatform.com/s/2E2eJC/h5hAPnAqBfhO", "http://media2.s-nbcnews.com/j/newscms/2014_16/326206/140415-muslim-protest-nypd-1935_9baff118dc45ac060ec7384fece561da.nbcnews-fp-360-360.jpg", "http://www.msnbc.com/morning-joe/watch/what-did-nypd-muslim-unit-actually-uncover-228219459659"], "published": "2016-10-10T20:36:00.000+03:00", "crawled": "2016-10-10T16:44:21.830+03:00", "highlightTitle": ""}