{"organizations": [], "uuid": "b00359a40106029201ff4784722577029683a666", "thread": {"social": {"gplus": {"shares": 1}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 517, "shares": 517, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nbcnews.com", "main_image": "http://media3.s-nbcnews.com/j/newscms/2016_40/1743336/161009-debate-clinton-trump-mn-2010_3f0394acf71889d47657ac31b5ba1853.nbcnews-fp-1200-800.jpg", "site_section": "", "section_title": "", "url": "http://www.nbcnews.com/news/latino/latino-pulse-how-did-clinton-trump-do-2nd-presidential-debate-n662851", "country": "US", "domain_rank": 478, "title": "Latino Pulse: How Did Clinton, Trump Do in 2nd Presidential Debate? - NBC News", "performance_score": 5, "site": "nbcnews.com", "participants_count": 0, "title_full": "Latino Pulse: How Did Clinton, Trump Do in 2nd Presidential Debate? - NBC News", "spam_score": 0.013, "site_type": "news", "published": "2016-10-10T08:00:00.000+03:00", "replies_count": 0, "uuid": "b00359a40106029201ff4784722577029683a666"}, "author": "Stephen A. Nu O", "url": "http://www.nbcnews.com/news/latino/latino-pulse-how-did-clinton-trump-do-2nd-presidential-debate-n662851", "ord_in_thread": 0, "title": "Latino Pulse: How Did Clinton, Trump Do in 2nd Presidential Debate? - NBC News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "ignore", "persons": [], "text": "Trump: 'I am Going to Instruct My Attorney General to Get a Special Prosecutor' 0:58 autoplay autoplay Copy this code to your website or blog <iframe src=\"http://www.nbcnews.com/widget/video-embed/782417987718\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen></iframe> \nIt was sad to see Donald Trump receive a question about healing national wounds over Islamophobia and respond with an answer that was essentially Islamophobic, stoking false narratives about refugees and immigrants. Trump continues to play the same hand he began his campaign with last year. \nRELATED: Trump's Pledge to 'Jail' Clinton Unprecedented \nAs a educator and a political scientist, I did not think this was not a good night for our democracy. Once again there was little discussion on student debt, our immigration problem, on economic policies beyond the tax codes readily available to the upper strata of society. Donald Trump was incoherent during much of the debate when he tried to talk about anything of substance, talking about a different policy on Syria than his vice presidential candidate. He even seemed sedated at times. Clinton's strategy seems to be to allow Trump to speak as much as possible when he loses control. Rather than engaging Trump, she seems to have calculated, correctly I believe, that Trump's greatest weakness is Donald Trump. \nLike each performance Trump has been a part of in this campaign, whatever value the Trump folks think they gained from this moment will rapidly deteriorate in the phalanx of news rooms now adept at picking his lies apart by placing them side by side with the almost endless film on Trump saying the exact opposite of his many false assertions and accusations. For her part, Clinton remained mostly calm and confident, despite her visible frustration in trying to keep up with Trump's many detours from reality. \nStephen Nuño is an Associate Professor in the Department of Politics and International Affairs at Northern Arizona University and an NBC Latino Contributor. Trump Spoke to Base, Clinton to Independents Victoria Defrancesco Soto \nThe Presidential candidates weren't just speaking past each other at the second presidential debate, they were speaking to completely different audiences. \nDonald Trump had his base as his sole target and he hit the bull's eye. There was no effort by Trump to win over undecided voters or even establishment Republicans. \nIn contrast, Hillary Clinton was seeking to lock in undecided voters as well as reel in establishment Republicans that have abandoned Trump either in the last 48 hours or earlier. Each candidate won their respective audience hands down. \nOver 13 million voters supported Trump in the primary elections. For the most part these are individuals who have a deep dislike and distrust of Hillary Clinton and like Donald Trump's street fighter style. He danced with the one that brought him. \nTrump began the debate by deflecting on the sexually lewd tape of him by turning to accusations of sexual misconduct of former President Bill Clinton. Trump then gave way to personal attacks on Hillary Clinton. Throughout the debate Trump would say \"she lies\" which is minor compared to him stating early on that Clinton should be sent to jail. And just to get under Clinton's skin, Trump threw in a remark about him seeing evidence that First Lady Michelle Obama has not said nice things about her. \nDonald Trump did not pull any punches. But then again we knew that was going to be the case before the debate when Trump hosted a Facebook Live panel with women who have accused Bill Clinton of sexual assault. \nAnd in terms of policy (or the few policy questions that were snuck in) Trump remained elusive on details and stuck to common talking points. \nHillary Clinton desperately wanted to appeal to the ever-shrinking base of Independents through both her substance and style. The style portion of it was the hardest given that she was visibly upset at various points in the debate and struggled to keep her cool. However in the end she did keep it together and then pivoted to detailed policy propositions such as on healthcare, taxes, and the situation in Syria. \nTwice Hillary Clinton highlighted her 30-year career, highlighting the work she has done with various groups - children, the disabled, Latinos, etc. She wanted to make sure the voting (hiring) public knows that she has the professional experience. She also threw in her ability to work across the aisle and touted her relationship with President George W. Bush after 9/11 - a little catnip for anti-Trump Republicans looking for a home. \nIt wasn't pretty, but Trump did what he needed to do as did Clinton. To say that either presidential candidate won outright would be comparing apples to oranges. But, in the end, this debate wasn't about a \"general\" American public but rather very specific sub-segments of them. \nVictoria Defrancesco Soto is a contributor to MSNBC and NBCNews.com, as well as a regular political analyst for Telemundo. Trump Failed the Essential Test of Tonight's Debate Raul Reyes John Makely / NBC News \nLatinos had clear reasons to tune into Sunday's presidential town hall with interest. Like other Americans, we wanted to see whether Donald Trump could manage any semblance of damage control for his recently-revealed lewd comments. Also, consider that Latinos have managed to figure prominently in the post-debate conversations. Remember Alicia Machado , and \"That Mexican thing?\" \nUnfortunately, this debate disappointed on several levels. Latino voters cite the economy, health care, and education as their top priorities. But only health care merited substantive discussion, as Clinton reminded viewers of the ways in which she believes the Affordable Care Act has worked, while Trump simply promised \"great coverage\" for everyone. And once again, there was no discussion of immigration reform. \nClinton stayed wisely on message with her mentions of everyone with whom Trump has feuded, from Judge Gonzalo Curiel to the Khan family, and she ably articulated various policy positions. \nYet it must have been frustrating for her to \"debate\" someone with so little command of the issues. Trump went so far as to threaten to have Clinton jailed if he were elected president, which indicates a fundamental lack of understanding about our judicial system (it's illegal to use the law to go after your political opponents). In addition, he falsely stated that, for minorities, the education system is \"a disaster\" and \"jobs are essentially nonexistent,\" two points that are contradicted by data . \nIn what can only be seen as another reason for Latinos not to vote for him, Trump stated that he would like to see a Supreme Court justice like Antonin Scalia - a justice who consistently voted against civil rights , affirmative action, and voting rights. Noted. \nThe big question of the night was whether Trump would make a full apology for his lewd comments. His defense that it was all \"locker room talk,\" along with his pivot to past allegations against Bill Clinton, were ineffective. \nNoting less than a full apology was called for, and he did not offer one. On these grounds alone, he failed the essential test of the evening. \nOn a personal note: As someone who has been involved with sports and athletics my entire adult life, I would like to point out that men do not speak that way in locker rooms. Occasionally, boys may. Men do not. \nRaul Reyes is an NBC Latino contributor, attorney, journalist and TV commentator. \nFollow NBC News Latino on Facebook , Twitter and Instagram . Stephen A. Nuño ", "external_links": [], "published": "2016-10-10T08:00:00.000+03:00", "crawled": "2016-10-10T12:15:25.157+03:00", "highlightTitle": ""}