{"organizations": [], "uuid": "be4657d71c7b38975d150ac4394e7d38ea89fa6d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 475, "shares": 475, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nbcnews.com", "main_image": "http://media2.s-nbcnews.com/j/newscms/2016_40/1737946/161005-flaprpoll-sg-1349_d47c009b554e5c39b0867c9f163bf8cd.nbcnews-fp-1200-800.jpg", "site_section": "", "section_title": "", "url": "http://www.nbcnews.com/news/latino/poll-florida-puerto-ricans-strongly-back-clinton-split-senate-race-n660421", "country": "US", "domain_rank": 478, "title": "Poll: Florida Puerto Ricans Strongly Back Clinton, Split on Senate Race - NBC News", "performance_score": 4, "site": "nbcnews.com", "participants_count": 0, "title_full": "Poll: Florida Puerto Ricans Strongly Back Clinton, Split on Senate Race - NBC News", "spam_score": 0.005, "site_type": "news", "published": "2016-10-05T08:00:00.000+03:00", "replies_count": 0, "uuid": "be4657d71c7b38975d150ac4394e7d38ea89fa6d"}, "author": "Suzanne Gamboa", "url": "http://www.nbcnews.com/news/latino/poll-florida-puerto-ricans-strongly-back-clinton-split-senate-race-n660421", "ord_in_thread": 0, "title": "Poll: Florida Puerto Ricans Strongly Back Clinton, Split on Senate Race - NBC News", "locations": [], "entities": {"persons": [{"name": "hillary clinton", "sentiment": "negative"}, {"name": "clinton", "sentiment": "negative"}, {"name": "flo", "sentiment": "negative"}, {"name": "suzanne gamboa", "sentiment": "none"}, {"name": "sylvia manzano", "sentiment": "none"}, {"name": "marco rubio", "sentiment": "none"}, {"name": "tim kaine", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "rhona", "sentiment": "none"}, {"name": "patrick murphy", "sentiment": "none"}, {"name": "murphy", "sentiment": "none"}, {"name": "manzano", "sentiment": "none"}, {"name": "rubio", "sentiment": "none"}], "locations": [{"name": "florida", "sentiment": "none"}, {"name": "miami", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "usa", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "puerto rico", "sentiment": "none"}, {"name": "florida  florida", "sentiment": "none"}], "organizations": [{"name": "nbc news", "sentiment": "negative"}, {"name": "epa", "sentiment": "none"}, {"name": "senate", "sentiment": "none"}, {"name": "florida international university", "sentiment": "none"}, {"name": "gop", "sentiment": "none"}, {"name": "sunshine state", "sentiment": "none"}, {"name": "center for american progress action fund", "sentiment": "none"}, {"name": "instagram", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "advertisement \nDemocratic presidential candidate Hillary Clinton is the overwhelming favorite of Florida's voters of Puerto Rican descent, who say they'll be turning out to vote this year, according to a first of its kind poll. \nAbout three quarters of those polled said they would vote for Clinton compared to 17 percent for Republican presidential candidate Donald Trump. \nThe poll also found strong turnout is likely among the Sunshine State's Puerto Ricans, whose numbers have swelled to more than 1 million. \nEighty-four percent said they will definitely vote and 14 percent said they will likely vote or are uncertain whether they'd vote. Only 2 percent said they wouldn't vote. epa05438607 A supporter holds a Puerto Rican and a US flag with a sign as she awaits the arrival of US Democratic presidential candidate Hillary Clinton and her Vice Presidential candidate Senator Tim Kaine during a campaign stop at Florida International University in Miami, Florida, USA, 23 July 2016. EPA/RHONA WISE RHONA WISE / EPA \nBut the Florida Puerto Ricans' bend toward Democrats is less certain down ballot. The vote was almost evenly split between Republican Sen. Marco Rubio, a Cuban-American seeking a return to the Senate, and his Democratic opponent Patrick Murphy. \nForty-four percent said they'd vote for Murphy and 42 percent supported Rubio. Seven percent were undecided. \nThe poll was conducted by Latino Decisions for the liberal Center for American Progress Action Fund . \nThe Puerto Rican population boom in Florida makes it possible for the deeper probe of the political preferences and behavior of Puerto Ricans in the swing state. The population has been growing for years, but took off more recently as Puerto Ricans relocated from the recession-wracked island to find jobs. \n\"I think the most important thing is that we even have the information,\" said Sylvia Manzano, a principal at Latino Decisions. This is the first time a poll specifically focuses on the state's growing numbers of Puerto Rican voters. \nThe political focus on Latinos in Florida has been \"for a long time on Cuban Americans, but now there is recognition Puerto Ricans are a sizable share of the electorate. The fact we have this information is just a gem in itself,\" said Manzano said. \nNot only do Puerto Ricans' numbers in Florida rival New York's Puerto Rican population, but they've also signaled a potential shift in Puerto Rican political influence within the state, which is considered a crucial battleground state. \nRELATED: Puerto Ricans Flex Their Political Muscle in Florida \nFlorida's Cuban Americans have been a reliably Republican voting electorate for years, although that has been changing and there has been more of a partisan and generational split in recent elections. \nDespite their overwhelming preference for Clinton, only about 37 percent of Puerto Ricans polled said they had been contacted by a campaign, political party or community organization and asked to support their candidate or register to vote. \nIn a separate poll released last month and also conducted by Latino Decisions, 47 percent of all Latinos in Florida said they had had such contact. \nManzano said the poll's findings show that this is a ripe electorate for Democrats, but that the party needs to find them. \n\"They can take nothing for granted when the margins are this narrow. They should be talking to their base,\" she said. \nOther findings from the poll: Even though Puerto Ricans are U.S. citizens and don't have to worry about deportation, those polled said immigration was the third most important issue facing Puerto Ricans and Latinos that politicians should address. The top issue was jobs/economy and No. 2 was health care. Puerto Ricans born on the island preferred Murphy in the Senate race over Rubio, 46 percent to 37 percent, while Puerto Ricans born on the mainland were evenly split, 40 percent to 40 percent. Rubio sought the GOP presidential nomination but bowed out after failing to win his home state in the primary. More than half of the Florida Puerto Ricans polled, whether born on the island or on the mainland, said that when they vote, they consider a candidate's views on Puerto Rico and issues on the island. Of those born on the island, 61 percent said they took those views into account; among those born on the mainland it was 46 percent. \n\"People don't think of Puerto Rican voters as considering homeland politics. People think of Cubans in that way,\" Manzano said. \nFollow NBC News Latino on Facebook , Twitter and Instagram . Suzanne Gamboa ", "external_links": [], "published": "2016-10-05T08:00:00.000+03:00", "crawled": "2016-10-06T02:12:30.763+03:00", "highlightTitle": ""}