{"organizations": [], "uuid": "fe821983861c93175ec9e76f43b83d59e0976047", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nbcnews.com", "main_image": "http://media2.s-nbcnews.com/j/newscms/2016_43/1771206/agan_satya001_6235df0f47a2c7d2393130f4a505c5bf.nbcnews-fp-1200-800.jpg", "site_section": "", "section_title": "", "url": "http://www.nbcnews.com/news/asian-america/essay-toddler-turban-little-lesson-confidence-n674581", "country": "US", "domain_rank": 478, "title": "Essay: A Toddler, A Turban, and a Little Lesson In Confidence - NBC News", "performance_score": 0, "site": "nbcnews.com", "participants_count": 0, "title_full": "Essay: A Toddler, A Turban, and a Little Lesson In Confidence - NBC News", "spam_score": 0.93, "site_type": "news", "published": "2016-10-28T08:00:00.000+03:00", "replies_count": 0, "uuid": "fe821983861c93175ec9e76f43b83d59e0976047"}, "author": "Raakhee Mirchandani", "url": "http://www.nbcnews.com/news/asian-america/essay-toddler-turban-little-lesson-confidence-n674581", "ord_in_thread": 0, "title": "Essay: A Toddler, A Turban, and a Little Lesson In Confidence - NBC News", "locations": [], "entities": {"persons": [{"name": "singh", "sentiment": "none"}, {"name": "jagjit singh", "sentiment": "none"}, {"name": "satya", "sentiment": "none"}, {"name": "raakhee mirchandani", "sentiment": "none"}, {"name": "jay z", "sentiment": "none"}, {"name": "agan singh", "sentiment": "none"}], "locations": [{"name": "california", "sentiment": "none"}, {"name": "new jersey", "sentiment": "none"}, {"name": "delhi", "sentiment": "none"}, {"name": "bombay", "sentiment": "none"}, {"name": "asian america", "sentiment": "none"}], "organizations": [{"name": "agan", "sentiment": "negative"}, {"name": "nbc news", "sentiment": "negative"}, {"name": "nbc", "sentiment": "none"}, {"name": "sikh", "sentiment": "none"}, {"name": "instagram", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "advertisement \nIt's the same sweet scene most morning: Agan stands over the sink, fabric in hand, stretching it and then wrapping it, carefully placing the thick black cotton in perfect folds on his head. Agan Singh with his three-year-old daughter, Satya. For Halloween 2016, Satya told her parents she wanted to be her \"dada.\" Courtesy of Raakhee Mirchandani \nIt's methodical, deliberate, and badass. \nNext to him, our little daughter Satya is perched on a stool. She's too tiny to reach the sink by herself, but she's determined to stand shoulder-to-shoulder with her father, inspecting the process. Without saying a word — he can't talk because he has a strange habit of holding one end of the turban in his mouth while he's putting it on — they share in a breathtaking ritual, a daily reminder of his Sikh faith, strength, and commitment. \nEveryday when he leaves home, Agan is boldly telling the world who he is and what he stands for. And, even in the face of fear (there have been both verbal and physical assaults) he stands firm in who he is and what he's about. \nBut the turban isn't a statement. It's a command that he respect himself and his family, that he serve the community, and that he treat all people fairly and equally. \nSo it's no surprise that my husband is all sorts of #dadgoals. He's patient, disciplined, and kind. He'll read four books a night (even when he promises \"just two\"), never yells when she's squashing what seems like our last nerve, and rarely complains when she wakes up early — unreasonable toddler demands in full effect that often involve oatmeal, a rubber glove, and her doctor's kit. (It sounds creepier than it is, it's actually pretty cute.) \nI can't help but marvel at the sight of them — watching their two faces in the mirror every morning, or their heads bent over a crayon canvas in the evening. Satya likes me just fine, but she's obsessed with her \"dada.\" Again Singh and Raakhee Mirchandani with their daughter, Satya. Courtesy of Raakhee Mirchandani \nSo as October approached, we asked Satya about Halloween. Last year we picked her costume (pizza rat) because she was almost two years old and had no preferences. But the last year has brought with it opinions by the millions, intense feelings about everything from the pattern on the toilet paper (she likes dogs) to the amount of flare in her hair (we've done everything from three buns to five ponytails). So when she declared that she was going to be her \"dada\" for Halloween, I knew that was it. Nothing we could say would change her mind, and why would we even want to? \"In a year where the anti-immigrant sentiment seems deeper than ever, it made us proud that this second-generation American toddler seems to know exactly who she is and what she stands for.\" \nLet me break it down for you: Satya is an adorable almost three-year-old girl with more personality than can fit in her tiny little frame. She likes animal print, cat sweatshirts, and unicorn sneakers. Agan is a handsome six-foot-tall Sikh man, complete with a beard, mustache and turban. Everything about him is on the straight and narrow, including his uniform of plaid shirts, jeans, and Converse. How exactly would this work? \nWardrobe was easy enough, but she was determined to wear a turban. The thing is, for the most part, Sikh women don't wear patkas or turbans, certainly not the kind of style you find a three-year-old girl eager to sport. Her choice was peculiar, but it was also passionate, purposeful, and pretty damn amazing. And in a year where the anti-immigrant sentiment seems deeper than ever, it made us proud that this second-generation American toddler seems to know exactly who she is and what she stands for. \nI often struggle with how to share our Indian heritage with Satya. Agan and I are both first-generation American, our parents are immigrants. Our connection to the motherland was direct — heard in our parents' accents, tasted in our moms' cooking, and felt in the prayers they said for their families in Delhi and Bombay. It was the '80s and landline phone calls were exorbitant, travel was pricey, and money was tight. And they were a long ways from home. I was raised in New Jersey, Agan in California. We're a little Jay Z and a little Jagjit Singh, pizza and paneer. We speak English at home, watch football on Sundays, and are constantly in search of where we'll get our next tan. The truth is, my Sindhi isn't as good as my dad's, my cooking is a poor imitation of my mother's and, well, I worry that the hybrid faith we offer Satya (I'm Hindu, Agan is Sikh) is too free spirited to be meaningful. Agan Singh with his three-year-old daughter, Satya. Courtesy of Raakhee Mirchandani \nSo when Satya put on that turban — her idea, her choice — even though it was just for a Halloween party, it gave us faith that something we were doing was clicking, that the values we were living and also trying to share with her were sticking. Most importantly, she's marching to her own beat, not afraid to stand out, and comfortable in her own skin, in a way that I still struggle with. And that's how it goes with toddlers: just when you think you're dropping something deep on them, they turn it around and teach you a lesson. \nFollow NBC Asian America on Facebook , Twitter , Instagram , and Tumblr . Raakhee Mirchandani ", "external_links": [], "published": "2016-10-28T08:00:00.000+03:00", "crawled": "2016-10-29T07:03:49.724+03:00", "highlightTitle": ""}