{"organizations": [], "uuid": "84337694e237ad3fcc1b6caffc44944c8b909127", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 186, "shares": 186, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nbcnews.com", "main_image": "http://media1.s-nbcnews.com/j/newscms/2016_40/1736511/161004-vp-debate-mbe-903p_4_d3fe7fa85cdf579cad9b7487f78fe08c.nbcnews-fp-1200-800.jpg", "site_section": "http://www.nbcnews.com/News/latino", "section_title": "Latino - NBC News", "url": "http://www.nbcnews.com/news/latino/how-did-vp-candidates-do-debate-our-latino-panel-weighs-n659066", "country": "US", "domain_rank": 478, "title": "How Did VP Candidates Do in the Debate? Our Latino Panel Weighs In", "performance_score": 1, "site": "nbcnews.com", "participants_count": 1, "title_full": "How Did VP Candidates Do in the Debate? Our Latino Panel Weighs In - NBC News", "spam_score": 0.0, "site_type": "news", "published": "2016-10-05T13:12:00.000+03:00", "replies_count": 0, "uuid": "84337694e237ad3fcc1b6caffc44944c8b909127"}, "author": "Stephen A. Nuño", "url": "http://www.nbcnews.com/news/latino/how-did-vp-candidates-do-debate-our-latino-panel-weighs-n659066", "ord_in_thread": 0, "title": "How Did VP Candidates Do in the Debate? Our Latino Panel Weighs In", "locations": [], "entities": {"persons": [{"name": "mike pence", "sentiment": "negative"}, {"name": "tim kaine", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "gonzalo curiel", "sentiment": "none"}, {"name": "barack obama", "sentiment": "none"}, {"name": "tehama lopez bunyasi", "sentiment": "none"}, {"name": "kaine", "sentiment": "none"}, {"name": "clinton", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "john mccain", "sentiment": "none"}, {"name": "tom perez", "sentiment": "none"}, {"name": "raul reyes", "sentiment": "none"}, {"name": "elaine quijano", "sentiment": "none"}, {"name": "stephen nuño", "sentiment": "none"}, {"name": "mike pence stephen a. nu?o stephen a. nu?o tim kaine", "sentiment": "none"}, {"name": "julián castro", "sentiment": "none"}], "locations": [{"name": "cuba", "sentiment": "none"}, {"name": "latin america", "sentiment": "none"}, {"name": "indiana", "sentiment": "none"}], "organizations": [{"name": "public religion research institute", "sentiment": "none"}, {"name": "stanford", "sentiment": "none"}, {"name": "nbc latino", "sentiment": "none"}, {"name": "newsweek", "sentiment": "none"}, {"name": "norwood university", "sentiment": "none"}, {"name": "gop", "sentiment": "none"}, {"name": "harvard", "sentiment": "none"}, {"name": "school for conflict analysis", "sentiment": "none"}, {"name": "customs enforcement", "sentiment": "none"}, {"name": "labor", "sentiment": "none"}, {"name": "northern arizona university", "sentiment": "none"}, {"name": "george mason university", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "itemprop=\"articleBody\"> Vice presidential candidates Tim Kaine and Mike Pence squared off in Tuesday's 2016 vice presidential debate. Who pulled off a victory? Who disappointed? Our Latino panel points out the hits and misses and whether the two men made their case.\nMike Pence Refused to Defend the Indefensible Raul Reyes / Raul Reyes Live from what Mike Pence mistakenly referred to as \"Norwood University,\" on Tuesday night it was Feisty vs. Folksy. Tim Kaine mounted an aggressive attack on Donald Trump, while Mike Pence attempted the seemingly impossible task of defending his running mate's controversial comments. If the goal were to make this matchup a referendum on Trump, Kaine came away the winner.\nUnlike the last debate, this one featured a spirited discussion of immigration. Kaine drove home the point that he and Clinton support immigration reform with a path to citizenship, though he might have added that this is supported by majorities of Americans too. Kaine smartly reminded viewers of Trump's remarks about Mexicans and immigrants, and even worked in a mention of his unfounded allegations of bias against Judge Gonzalo Curiel. In response, Pence mentioned what he called an \"endorsement\" by Immigration and Customs Enforcement (ICE). But ICE is a federal agency and cannot \"endorse\" any candidate. In fact, Trump was endorsed by an ICE officers union - which in any case is unlikely to win him more support among Hispanic voters.\nNeither moderator Elaine Quijano nor Kaine brought up Pence's support for Indiana's Religious Freedom Restoration Act, which originally allowed discrimination against LGBT people on so-called religious grounds. LGBT rights is an issue that resonates with Latinos; a Public Religion Research Institute poll found that three-quarters of Hispanics support laws that protect LGBT people from discrimination. So here Kaine missed a shot at drawing another distinction between the two tickets.\nAlso not mentioned: Trump's alleged violations of the Cuba trade embargo (recently outlined in Newsweek ), which could have consequences among Cuban-American voters. Any why didn't Kaine break out just a little of his español, which would have guaranteed him marquee coverage in Spanish-language media?\nThat said, Kaine fulfilled his responsibility in this debate, because he succeeded in keeping Pence on the defensive about his running mate. \"He's (Pence) asking everybody to vote for somebody that he cannot defend,\" Kaine noted . Many viewers at home were probably thinking the same thing.\nRaul Reyes is an NBC Latino contributor, attorney, journalist and TV commentator.\nTim Kaine was a Slugger, Mike Pence a Bunter If tonight's vice presidential debate were to be described in baseball terminology, Senator Tim Kaine would be a 'slugger,' and Governor Mike Pence would be a 'bunter.' Kaine came out swinging with a full-throated endorsement of Hillary Clinton's candidacy, and branded Donald Trump as self-interested, untrustworthy, and frightening.\nPence, on the other hand, took a subdued approach, just barely stepping up to the plate, and doing what he could to lay down the barrage of critiques leveled at his presidential nominee. Pence kept the ball in play, but he never seemed to get off a 'line drive.'\nThroughout the night, Kaine championed Clinton's credentials and was refreshingly direct in the way he addressed criticism against her. More impressive was his ability to flip almost any script Pence issued to drag her down.\nWhen Pence suggested that Clinton was capitalizing on fraught relations between police and the Black community, Kaine confidently stated that the nation shouldn't be afraid to talk about bias in law enforcement. When Pence described Trump as 'brilliantly' using the tax code to avoid paying federal taxes, Kaine asked whether it was smart to not pay for the military, veterans and teachers, then topped off his retort with, \"So, does that make the rest of us stupid?\" With frequent sighs and head shaking, Pence never seemed to fully wrest the terms of the debate from Kaine's control.\nIf Pence's performance tonight was lackluster, his unexcitable demeanor should at least appeal to that portion of the GOP who under no circumstances will vote for Hillary Clinton, but who are also wondering how they could vote for a man so many have come to see as rude, narcissistic, and reckless. By painting Kaine as overly prepared with his \"pre-done lines,\" (a depiction that will nicely compliment their perception of Clinton as staged and inauthentic) Pence will assure the anti-Clinton camp that her running mate is more of the same.\nA vice presidential candidate should be able to defend the person at the top of the ticket. Kaine not only defended Clinton, he made a thoughtful case for her. But, when Kaine asked Pence to defend the litany of offensive statements Trump has made about Mexicans, women, Senator John McCain, Indiana-born judge Gonzalo Curiel, President Barack Obama, and the African American community, Pence simply didn't, and it is on this point where he most clearly 'struck out.'\nTehama Lopez Bunyasi is an Assistant Professor in the School for Conflict Analysis and Resolution at George Mason University.\nIt's Form Over Substance for Mike Pence Stephen A. Nu?o Stephen A. Nu?o Tim Kaine and Mike Pence did as good of a job as possible at minimizing any damaging moments for their candidates' campaigns. With Pence clearly facing the tallest order of defending Trump, he took a tack instead by sidestepping Trump's opaque policies on nuclear policy and abortion, and turning Trump's own offensive remarks against Kaine, as if repeating Trump's statements was itself offensive.\nWhatever success Pence was able to garner from the initial optics of his performance in contrast to Kaine, who seemed anxious, shifty, and often talking over the female moderator, I get the sense that Pence's performance will deteriorate in utility as his statements are matched with those of Donald Trump's.\nIt sometimes felt like a Cold War debate in the 1980s, with Russian invasions, Middle Eastern strife, and nuclear proliferation taking center stage for much of the debate. It's worth noting that the Latino Decisions tracking poll showed that almost 70 percent of Latinos trusted Clinton to keep Americans safe from domestic and international terrorism, and only 11 percent of Latinos saying they trust Trump. Similarly, over 70 percent of Latinos trust Clinton with strengthening relations with Latin America. Unfortunately, foreign policy with Latin America was ignored.\nWith two white men taking center stage, it would have been nice to tease out greater contrast between the two on social and cultural issues. The question about religion was awkward, where the two competed to demonstrate which was more virtuous. Instead of asking a question on their personal religious beliefs, it would have been much more informative to discuss their views on LGBT issues, abortion (beyond it's religious value), and equal opportunity.\nOverall, Kaine was defective with the sound bites, like touting Trump as the \"you're fired administration\", but strong on policy details.\nPence was the opposite, hitting hard and repeatedly on soundbites and phrases like \"higher taxes\", which nonetheless will look immensely awkward given Trump's continued insistence on not releasing his taxes. Yet Pence was practically non-existent on policy details.\nWhile Kaine is sufficient, I'm left wondering what this debate would have looked like with a more fiery Tom Perez , the Secretary of Labor who was considered for the job, or a more cerebral Julián Castro , whose education at Stanford and Harvard would have surely been a visual and substantive contrast that could not be ignored and would continue to be a focal point in light of Trump's inflammatory remarks on immigration, Muslims, and policing policies.\nStephen Nuño is an Associate Professor at Northern Arizona University and a regular contributor to NBC Latino.\nFollow NBC News Latino ", "external_links": ["http://www.latinodecisions.com/files/5814/7542/1879/Wk3_Toplines_NALEO.Telemundo.LD_Tracker.pdf", "https://www.google.com/url?hl=en&q=http://www.politico.com/blogs/2016-presidential-debate-fact-check/2016/09/trump-misspeaks-claims-he-was-endorsed-by-ice-228732&source=gmail&ust=1475727782009000&usg=AFQjCNFbyJLQUtZDz4xFVZ-vBfEyyKvVMQ", "http://www.usatoday.com/story/news/politics/onpolitics/2016/10/04/video-mike-pence-flubs-host-universitys-name-vp-debate-opener/91584308/", "http://media3.s-nbcnews.com/j/newscms/2015_42/1261706/tehama_lopez_bunyasi_1_png_ded619cd3c96116677a568420ed9897e.nbcnews-fp-360-360.png", "https://www.google.com/url?hl=en&q=http://www.cnn.com/2016/06/03/politics/donald-trump-tapper-lead/&source=gmail&ust=1475727782009000&usg=AFQjCNGoRMySXSTsWK2kTVYZ8xFo6iTtJQ", "http://www.prri.org/research/beyond-same-sex-marriage-attitudes-on-lgbt-nondiscrimination-and-religious-exemptions-from-the-2015-american-values-atlas/", "http://media3.s-nbcnews.com/j/newscms/2016_10/1453986/raul_png_0038c5a3e649da3af85bbc15a8acc185.nbcnews-fp-360-360.png", "http://media3.s-nbcnews.com/j/newscms/2016_10/1453986/raul_png_0038c5a3e649da3af85bbc15a8acc185.nbcnews-ux-320-320.png", "http://www.politico.com/states/florida/story/2016/09/report-trump-violated-cuba-embargo-105927", "http://media1.s-nbcnews.com/j/newscms/2016_40/1735026/profile_nbc_a88ed22c144c0feff6bfd24ba036fbfd.nbcnews-ux-320-320.png", "https://www.google.com/url?hl=en&q=http://www.newsweek.com/2016/10/14/donald-trump-cuban-embargo-castro-violated-florida-504059.html&source=gmail&ust=1475727782010000&usg=AFQjCNH-jN-R97KESCD6ySI4Ov77SaHe7Q", "http://www.raulareyes.com/RaulAReyes/Home.html", "https://twitter.com/NBCLatino", "http://scar.gmu.edu/people/tehama-lopez-bunyasi", "https://www.google.com/url?hl=en&q=http://www.usatoday.com/story/news/politics/onpolitics/2016/10/04/video-mike-pence-flubs-host-universitys-name-vp-debate-opener/91584308/&source=gmail&ust=1475727782009000&usg=AFQjCNHVukffkO-ZNu4Zt2qRKc8ZcX52Pg", "http://www.politico.com/blogs/2016-presidential-debate-fact-check/2016/09/trump-misspeaks-claims-he-was-endorsed-by-ice-228732", "http://www.cnn.com/2016/06/03/politics/donald-trump-tapper-lead/", "http://www.nytimes.com/interactive/2016/09/15/us/politics/september-poll.html", "https://www.washingtonpost.com/politics/the-vp-debate-will-be-all-about-clinton-and-trump/2016/10/04/957a6f62-8a1f-11e6-b24f-a7f89eb68887_story.html", "https://www.facebook.com/NBCLatino", "http://media1.s-nbcnews.com/j/newscms/2016_40/1735026/profile_nbc_a88ed22c144c0feff6bfd24ba036fbfd.nbcnews-ux-2880-1000.png", "https://www.google.com/url?hl=en&q=http://www.prri.org/research/beyond-same-sex-marriage-attitudes-on-lgbt-nondiscrimination-and-religious-exemptions-from-the-2015-american-values-atlas/&source=gmail&ust=1475727782009000&usg=AFQjCNGaADfX1ObgVeIHs9uKLsDcPpyf-Q", "http://media3.s-nbcnews.com/j/newscms/2015_42/1261706/tehama_lopez_bunyasi_1_png_ded619cd3c96116677a568420ed9897e.nbcnews-ux-600-700.png", "https://instagram.com/nbclatino/", "http://www.univision.com/univision-news/why-it-matters-that-tim-kaine-speaks-spanish", "http://media3.s-nbcnews.com/j/newscms/2016_10/1453986/raul_png_0038c5a3e649da3af85bbc15a8acc185.nbcnews-ux-2880-1000.png", "http://www.newsweek.com/2016/10/14/donald-trump-cuban-embargo-castro-violated-florida-504059.html", "https://twitter.com/stephenanuno", "https://www.google.com/url?hl=en&q=http://www.univision.com/univision-news/why-it-matters-that-tim-kaine-speaks-spanish&source=gmail&ust=1475727782010000&usg=AFQjCNGhVPLIe_pUtf0ITMIqRvyXy5pJtQ", "https://www.google.com/url?hl=en&q=https://www.washingtonpost.com/politics/the-vp-debate-will-be-all-about-clinton-and-trump/2016/10/04/957a6f62-8a1f-11e6-b24f-a7f89eb68887_story.html&source=gmail&ust=1475727782010000&usg=AFQjCNH8AvtLd62-nQCyR6TrRe_7FtMpgw", "http://media3.s-nbcnews.com/j/newscms/2015_42/1261706/tehama_lopez_bunyasi_1_png_ded619cd3c96116677a568420ed9897e.nbcnews-ux-2880-1000.png", "https://www.google.com/url?hl=en&q=http://www.nytimes.com/interactive/2016/09/15/us/politics/september-poll.html&source=gmail&ust=1475727782009000&usg=AFQjCNHViMHFO2y82Odz06nnP-mnfdaD1A", "https://www.google.com/url?hl=en&q=http://www.politico.com/states/florida/story/2016/09/report-trump-violated-cuba-embargo-105927&source=gmail&ust=1475727782010000&usg=AFQjCNFIvvxF7ro2kfQKbmOYzWRSXfRNQg", "http://media1.s-nbcnews.com/j/newscms/2016_40/1735026/profile_nbc_a88ed22c144c0feff6bfd24ba036fbfd.nbcnews-fp-360-360.png"], "published": "2016-10-05T13:12:00.000+03:00", "crawled": "2016-10-05T11:42:30.929+03:00", "highlightTitle": ""}