{"organizations": [], "uuid": "4e7433d5222c281d52d79334f1bfa55bbe1c3c9d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 6, "shares": 6, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nbcnews.com", "main_image": "http://media4.s-nbcnews.com/i/newscms/2016_39/1729736/og-decision2016-200x200_e5e64fd467d815608f9a82df824d6560.gif", "site_section": "", "section_title": "", "url": "http://www.nbcnews.com/card/clinton-campaign-unveils-two-new-ads-closing-weeks-n673081", "country": "US", "domain_rank": 478, "title": "Clinton Campaign Unveils Two New Ads for Closing Weeks - NBC News", "performance_score": 0, "site": "nbcnews.com", "participants_count": 0, "title_full": "Clinton Campaign Unveils Two New Ads for Closing Weeks - NBC News", "spam_score": 0.014, "site_type": "news", "published": "2016-10-26T19:55:00.000+03:00", "replies_count": 0, "uuid": "4e7433d5222c281d52d79334f1bfa55bbe1c3c9d"}, "author": "Monica Alba", "url": "http://www.nbcnews.com/card/clinton-campaign-unveils-two-new-ads-closing-weeks-n673081", "ord_in_thread": 0, "title": "Clinton Campaign Unveils Two New Ads for Closing Weeks - NBC News", "locations": [], "entities": {"persons": [{"name": "monica alba", "sentiment": "negative"}, {"name": "clinton", "sentiment": "negative"}, {"name": "bill bradley", "sentiment": "none"}, {"name": "morgan freeman", "sentiment": "none"}, {"name": "bernie", "sentiment": "none"}, {"name": "chuck schumer", "sentiment": "none"}, {"name": "mary", "sentiment": "none"}, {"name": "charlyn", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "bill clinton", "sentiment": "none"}, {"name": "george w. bush", "sentiment": "none"}, {"name": "colin powell", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "bradley", "sentiment": "none"}, {"name": "mitch mcconnell", "sentiment": "none"}, {"name": "ian prior", "sentiment": "none"}, {"name": "sheldon adelson", "sentiment": "none"}, {"name": "clintons", "sentiment": "none"}, {"name": "sue minter", "sentiment": "none"}, {"name": "phil scott", "sentiment": "none"}, {"name": "powell", "sentiment": "none"}, {"name": "tom steyer", "sentiment": "none"}, {"name": "gerald daugherty", "sentiment": "none"}, {"name": "skyping", "sentiment": "none"}, {"name": "daugherty", "sentiment": "none"}, {"name": "bernie sanders", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "clinton  colin powell", "sentiment": "none"}, {"name": "lyndon johnson", "sentiment": "none"}, {"name": "obama", "sentiment": "none"}, {"name": "bill", "sentiment": "none"}, {"name": "johnson", "sentiment": "none"}, {"name": "minter", "sentiment": "none"}, {"name": "barry goldwater", "sentiment": "none"}, {"name": "hillary", "sentiment": "none"}, {"name": "rudy giuliani", "sentiment": "none"}, {"name": "anti-donald trump", "sentiment": "none"}, {"name": "peter shumlin", "sentiment": "none"}, {"name": "giuliani", "sentiment": "none"}, {"name": "chris matthews", "sentiment": "none"}], "locations": [{"name": "missouri", "sentiment": "none"}, {"name": "toledo", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}, {"name": "vermont", "sentiment": "none"}, {"name": "new hampshire", "sentiment": "none"}, {"name": "cincinnati", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "columbus", "sentiment": "none"}, {"name": "north carolina", "sentiment": "none"}, {"name": "indiana", "sentiment": "none"}, {"name": "new jersey", "sentiment": "none"}, {"name": "pennsylvania", "sentiment": "none"}, {"name": "wisconsin", "sentiment": "none"}, {"name": "long island", "sentiment": "none"}, {"name": "nevada", "sentiment": "none"}, {"name": "ohio", "sentiment": "none"}], "organizations": [{"name": "nbc news", "sentiment": "negative"}, {"name": "wcax", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "house  texas' travis county", "sentiment": "none"}, {"name": "new six-figure digital ad says trump", "sentiment": "none"}, {"name": "save senate", "sentiment": "none"}, {"name": "now-gop", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "pac", "sentiment": "none"}, {"name": "msnbc", "sentiment": "none"}, {"name": "senate", "sentiment": "none"}, {"name": "nba", "sentiment": "none"}, {"name": "state", "sentiment": "none"}, {"name": "ny1", "sentiment": "none"}, {"name": "nextgen climate change", "sentiment": "none"}, {"name": "politico", "sentiment": "none"}, {"name": "fox & friends", "sentiment": "none"}, {"name": "senate leadership pac", "sentiment": "none"}, {"name": "senate gop pac massive", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "latest posts from DECISION 2016 Monica Alba 30 minutes ago Clinton Campaign Unveils Two New Ads for Closing Weeks \nHillary Clinton's campaign is up with two new ads as the campaign heads into its final 13 days. \nOne of the ads, narrated by actor Morgan Freeman, draws a contrast of between the Democratic nominee and Donald Trump. \"Our children,\" the ad starts, \"they look up to us, what we value, how we treat others. And not they're looking to see what kind of leaders we choose, who we'll entrust our country and their future to. Will it be the one respected around the world, or the one who frightens our allies and emboldens our enemies? The one with the deep understanding of the challenges we face, or the one who is unprepared for them? A steady hand, or a loose cannon?\" \nThe second features Clinton on-camera talking about her proposals to help working families. \"Kids and families have been the passion of my life and they will be the heart of my presidency,\" Clinton says. The ads will run on national cable and in battleground states. 10 hours ago New Six-Figure Digital Ad Says Trump Will Break Up Families \nA Democratic super PAC, For Our Future, is releasing Wednesday a new digital ad in five critical states that uses an emotional plea to knock Donald Trump's immigration plan. \nThe six-figure digital ad buy is meant to complement a large grassroots voter mobilization effort targeting the Obama coalition of young voters, minorities and women. \nIn the ad , \"Isabel,\" a mother and teenage daughter are Skyping when the daughter says she has to help her friend. \n\"You have to go so soon,\" the mom says, saddened. \"Yeah, sorry mom, but I'm already late,\" the daughter responds to a heartbroken mom. \nOn the screen flashes the words: \"Under Donald Trump's deportation plan, millions of immigrant families could be torn apart.\" \nIt will run in Nevada, Ohio, Pennsylvania, Florida and Wisconsin. Those states also have competitive Senate races. \nThe super PAC is a coalition of unions who have teamed up with Democratic donor Tom Steyer of NextGen Climate Change. 11 hours ago Senate GOP PAC Massive, Last-Minute Spree to Save Senate \nThe Sen. Mitch McConnell linked Senate Leadership PAC is throwing an additional $25 million into Senate races. \nThis Hail Mary move comes in the final two weeks of the election, and on the day that the Cook Political Report determined that Dems could pick up five to seven Senate seats , effectively switching control of the Senate from Republican to Democrat. \nThe $25 million is going to run television advertisements in six states: Nevada, Pennsylvania, North Carolina, New Hampshire, Missouri and Indiana. All seats except Nevada are held by a Republican and at risk of a Democrat winning. The news was first reported by Politico . \nIan Prior, spokesperson for the super PAC, told NBC News, \"Holding the Senate in this environment is going to be tough, but if Hillary Clinton and Chuck Schumer want the majority they're going to have a hell of a fight on their hands for the next two weeks.\" \nThey would not detail who their last-minute donors are, and it's notable that the super PAC got a huge infusion of cash last month when Sheldon Adelson gave the super PAC $20 million. 17 hours ago Colin Powell Says He Will Vote for Clinton \nColin Powell said Tuesday that he is endorsing and voting for Hillary Clinton, NBC News has confirmed. \nPowell, who served under both Republican and Democratic presidents, most recently as President George W. Bush's Secretary of State, endorsed President Obama in both 2008 and 2012. \nHe has been highly critical of Trump, calling him a \"national disgrace\" but has also been critical of Clinton. But unlike many Republicans who say they can't vote for Trump but have also said they can neither back Clinton, Powell has come out for Clinton. \nHe has been a tangential figure this election cycle as hacked emails show that Powell told Clinton when she was beginning her tenure as secretary of State that he used his personal email while at State. Colin Powell will vote for Hillary Clinton, he tells @mitchellreports after saying same at Long Island luncheon this afternoon 17 hours ago Texas Politician's Wife Urges Voters To Help Get Her Husband Out of the House \nTexas' Travis County Commissioner Gerald Daugherty \"really doesn't have any hobbies,\" according to his wife, Charlyn. \nThat's why he spends nearly all of his time talking about the issues facing his constituents, much to his wife's frustration and annoyance. \nIn a tongue-in-cheek political ad, the badgered commissioner's wife begs voters to re-elect her Republican husband, just to get him out of the house. Daugherty rolls her eyes and sighs throughout the ad as her husband talks business nonstop. \nThe ad has been viewed nearly 2 million times on Facebook, and shared by more than 11,000 viewers who, judging from the comments, appear frustrated by the negativity that has characterized the 2016 campaign season 19 hours ago A Republican is Winning in Bernie's Vermont \nPoll after poll over the last several weeks has contained good news for Democrats. But not this one - in deep-blue Vermont. \nA poll from local news station WCAX shows Republican Lt. Gov. Phil Scott leading Democrat Sue Minter in Vermont's gubernatorial race by seven points among likely voters, 47%-40%. \nIncumbent Gov. Peter Shumlin (D) is retiring. \nIs there a Bernie Sanders Effect going on? The pollster who conducted the survey think so, saying Hillary Clinton \"may have burned some Vermont voters in her race against Bernie Sanders, dampening Clinton's support, with a trickle down effect for Minter,\" per WCAX. 19 hours ago New Dem anti-Trump Ad Features Mushroom Cloud \nA new super PAC started by former senator Bill Bradley is behind an intense new anti-Donald Trump ad that mysteriously started appearing on Ohio local television this week, the group announced Tuesday. \nTaking a page from President Lyndon Johnson's 1964 campaign against Republican Barry Goldwater, the ad features images of a mushroom cloud and nuclear test footage, intermixed with Trump telling MSNBC host Chris Matthews that he doesn't understand why the U.S. builds nuclear weapons if it's not willing to use them. \n\"One nuclear bomb can kill a million people,\" says the narrator of the new ad , which is running in the Columbus, Toledo, and Cincinnati media markets, supported by a $750,000 buy. \"That's more than all the men, women, and children living in Columbus, Ohio.\" \nBradley, a former NBA player and New Jersey senator who ran unsuccessfully for president in 2000, called his new group the 52nd Street Fund. The name is a reference to a WH Auden poem Johnson referenced in his famous \"Daisy\" ad, which also featured a mushroom cloud. \n\"During these final days of the campaign, it's important to focus on the real stakes for America. Donald Trump's finger on the nuclear button is a horrifying prospect. His temperament and absence of experience makes him a danger to all Americans,\" Bradley said in a statement. 20 hours ago Rudy Giuliani Says Voters Should Expect 'a Couple of Surprises' \nFormer New York Mayor Rudy Giuliani told \"Fox & Friends\" Tuesday that voters should be ready for \"a couple of surprises\" heading their way from the Donald Trump campaign. \nWithout offering specifics, Giuliani said the surprises \"would turn Trump's campaign in a little bit of a different way\" and \"get their message out there.\" \n\"I think it will be enormously effective, and I do think that all of these revelations against Hillary Clinton finally are beginning to have an impact,\" he said. Rudy Giuliani: Trump campaign has a couple of surprises left pic.twitter.com/vVT8sElzox a day ago Cook Political Report: Democrats Poised to Win Senate \nThe nonpartisan Cook Political Report, one of the country's most respected political forecasters, believes Democrats are poised to gain between five and seven Senate seats, more than enough to win control of the chamber in November. \n\"Since the release of the Access Hollywood tape, Senate Republicans have seen their fortunes dip, particularly in states like Florida, North Carolina, New Hampshire, Nevada and Pennsylvania where Clinton has established a lead. In fact, of the Senate seats in the Toss Up column, Trump only leads in Indiana and Missouri where both Republicans are running a few points behind him,\" the Cook Political Report says . \nIt adds, \"Early voting is underway in 27 states, so Republicans don't really have much time to turn things around, and Trump won't be any help, especially his campaign doesn't really have a ground game to speak of.\" \nTo win control of the Senate, Democrats must gain a net of four seats if Clinton wins the presidency (because the vice president would break a 50-50 tie). If Trump wins, Democrats would need to pick up five seats to win back the chamber. a day ago Trump in 2008: Clinton 'Is a Great Woman\" \nDonald Trump has maintained throughout the campaign that his past support for Democrats was due to his business interests and has argued that as a former player in the politics game, he's in the best position to change the rules. Recently though, NY1 re-upped an interview from 2008 in which the now-GOP nominee has glowing praise for his Democratic opponent. \n\"I think she's going to go down, at a minimum, as a great senator,\" Trump said. He called Bill Clinton a \"great president,\" adding, \"Hillary Clinton is a great woman.\" You can find the full interview below: Trump on Clintons: \"Bill was a great president, Hillary is a great woman and a good woman.\" (2008 @NY1 ) #NYDebate https://t.co/rGTxNdADAm ", "external_links": [], "published": "2016-10-26T19:55:00.000+03:00", "crawled": "2016-10-26T15:21:49.925+03:00", "highlightTitle": ""}