{"organizations": [], "uuid": "4a5c3b5be561ef72d99a67e9be877a98b317bd8e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nbcnews.com", "main_image": "http://nodeassets.nbcnews.com/images/og-nbcnews200x200.gif", "site_section": "", "section_title": "", "url": "http://www.nbcnews.com/card/i-never-said-im-perfect-trump-claims-apology-he-did-n662426", "country": "US", "domain_rank": 478, "title": "'I Never Said I'm Perfect,' Trump Claims in Apology. But He Did. - NBC News", "performance_score": 0, "site": "nbcnews.com", "participants_count": 0, "title_full": "'I Never Said I'm Perfect,' Trump Claims in Apology. But He Did. - NBC News", "spam_score": 0.178, "site_type": "news", "published": "2016-10-08T23:23:00.000+03:00", "replies_count": 0, "uuid": "4a5c3b5be561ef72d99a67e9be877a98b317bd8e"}, "author": "", "url": "http://www.nbcnews.com/card/i-never-said-im-perfect-trump-claims-apology-he-did-n662426", "ord_in_thread": 0, "title": "'I Never Said I'm Perfect,' Trump Claims in Apology. But He Did. - NBC News", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "clinton", "sentiment": "none"}, {"name": "putin", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "clintons", "sentiment": "none"}, {"name": "bill clinton", "sentiment": "none"}, {"name": "mike pence", "sentiment": "none"}, {"name": "kaine", "sentiment": "none"}, {"name": "- trump", "sentiment": "none"}, {"name": "cooper", "sentiment": "none"}, {"name": "vladimir putin", "sentiment": "none"}, {"name": "obamacare", "sentiment": "none"}], "locations": [{"name": "saudi arabia", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "oklahoma", "sentiment": "none"}, {"name": "virginia", "sentiment": "none"}, {"name": "tim kaine", "sentiment": "none"}, {"name": "harrisonburg", "sentiment": "none"}, {"name": "north korea", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}, {"name": "arkansas", "sentiment": "none"}, {"name": "south korea", "sentiment": "none"}], "organizations": [{"name": "nbc news", "sentiment": "neutral"}, {"name": "trump falsely claims federal agency", "sentiment": "none"}, {"name": "pence overstates trump remarks", "sentiment": "none"}, {"name": "fox news", "sentiment": "none"}, {"name": "tax foundation", "sentiment": "none"}, {"name": "pence wildly understates clinton foundation charitable work", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "customs enforcement", "sentiment": "none"}, {"name": "cnn", "sentiment": "none"}, {"name": "congressional", "sentiment": "none"}, {"name": "pence denies trump", "sentiment": "none"}, {"name": "clinton foundation", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "latest posts from WHAT ARE THE FACTS? 42 minutes ago 'I Never Said I'm Perfect,' Trump Claims in Apology. But He Did. \n\"I never said I'm a perfect person,\" Trump claimed in a video recording apologizing for the vulgar remarks revealed in a hot mic video on Friday. \nBut Trump said just that two years ago in a tweet. @Helena_Torry I consider myself too perfect and have no faults. a day ago Pence Says Bill Clinton Called for Obamacare Repeal. He Didn't \n\"Bill Clinton has said what millions of Americans have known for years, and that is that we need to repeal Obamacare, lock, stock and barrel.\" -- Gov. Mike Pence, Fox News, October 6th. \nThe former president's criticism of Obamacare was an uncomfortable news story for Democrats, but the vice presidential nominee is wildly exaggerating here. \nBill Clinton criticized Obamacare -- calling it \"the craziest thing in the world\" on Monday -- but he did not call for its repeal. On Tuesday, he specifically said repealing it would be a \"terrible mistake.\" 3 days ago Again (and Again) Trump Falsely Claims Federal Agency Endorsed Him \nTrump said Wednesday he was \"endorsed by ICE, the first item they've ever endorsed anybody for president.\" \nFederal agencies cannot endorse candidates, and Immigration and Customs Enforcement did not endorse Donald Trump. A union of some of the agency's employees did. This might have been a simple slip of the tongue when he first said this a week ago during the first presidential debate, but, at this point, it's a lie. \nLater in the day, he said it again: \"I CE great people, ICE, just announced they were endorsing Donald Trump.\" For the third time today: it's a union of some ICE employees, not the federal agency. #factcheck2016 https://t.co/a6e5uRVLAG No, Clinton Doesn't Accuse All Police of Racism \n\"Clinton basically accuses our police of all being racist.\" - Trump 10/5/2016 \nThis is a baseless claim. Hillary Clinton has argued for reform to root out implicit, and statistically proven, biases. Here's just one of the ways she called for police reform without accusing all officers of \"being racist.\" \n\"We've got to do everything possible to improve policing, to go right at implicit bias,\" Clinton said in the wake of the shooting of an unarmed man in Oklahoma last month. \"There are good, honorable, cool-headed police officers... We can do better. We have got to rein in what is absolutely inexplicable, and we've got to have law enforcement respect communities and communities respect law enforcement because they have to work together.\" 'Clinton Has Been There For 30 Years, and Hasn't Fixed Anything' \n\"Clinton has been there for 30 years, and hasn't fixed anything.\" - Trump, 10/5/2016 \nDonald Trump says this constantly, and it's worth some scrutiny, as Clinton held elected or appointed office for just 13 years. \nThirty years ago, Clinton was first lady of Arkansas; she went on to be the nation's first lady when husband Bill Clinton was elected to the White House 24 years ago. These roles carry clout, but no direct governing ability. Hillary Clinton was able to rally support around Congressional efforts to enact healthcare initiatives for children, but the bills weren't hers. \nShe was first sworn into office herself as a New York senator in 2001, and was later appointed secretary of state in 2009. She left that office in 2013, and hasn't held elected office since. \nWith just 13 years in elected or appointed office to her name, it's an overstatement to blame three decades of problems on her. 3 days ago Pence Says Clinton Will Raise Crowd's Taxes. She Won't. \n\"And I said to him all you need to know about taxes this election is simple: Hillary Clinton's gonna raise your taxes and Donald Trump and I are gonna cut taxes across the board for working families, small businesses and family farms.\" - Pence 10/5/2016 \nPence was speaking in Harrisonburg, Virginia when he made these remarks. The latest Census found the median household income to be $38,807, so his claim about Clinton raising the crowd's taxes is wrong — her plan has only called for hiking taxes on the nation's wealthiest Americans, and no one else. \nThe conservative Tax Foundation's analysis of Trump's latest plan found that it would indeed lower taxes, though Pence seems to overstate how big those cuts would be. Everyone would get cuts of at least 0.8 percent more after-tax income, but it mostly boosts corporations and wealthy Americans like Trump himself: They would see 10 percent to 16 percent more income after taxes. 3 days ago Pence Denies Trump's Nuclear Views, While Kaine Oversimplifies It \n\"Don't put words in my mouth. Well, he never said\" that more nations should get nuclear weapons, Mike Pence fired back at Tim Kaine when pressed on Donald Trump's views on the topic or proliferation. \nTrump didn't exactly say he wanted more countries to get nuclear weapons, but flirted with it and came extremely close. Here's the exchange on CNN that Kaine is referring to. \nTRUMP At some point we have to say, you know what, we're better off if Japan protects itself against this maniac in North Korea, we're better off, frankly, if South Korea is going to start to protect itself, we have… \nCOOPER: Saudi Arabia, nuclear weapons? \nTRUMP: Saudi Arabia, absolutely. \nCOOPER: You would be fine with them having nuclear weapons? \nTRUMP: No, not nuclear weapons, but they have to protect themselves or they have to pay us. Here's the thing, with Japan, they have to pay us or we have to let them protect themselves. \nCOOPER: So if you said, Japan, yes, it's fine, you get nuclear weapons, South Korea, you as well, and Saudi Arabia says we want them, too? \nTRUMP: Can I be honest with you? It's going to happen, anyway. It's going to happen anyway. It's only a question of time. They're going to start having them or we have to get rid of them entirely. \nThe exchange continues here , and Trump waffles a bit, but overall Trump seems awfully close to embracing a world with a lot more nuclear weapons. 4 days ago Pence Overstates Trump Remarks on Mexican Immigrants \n\"He also said and 'and many of them are good people,' you keep leaving that out of your quote,\" Pence fired back when c onfronted repeatedly about Trump's remark in his campaign announcement that some Mexican immigrants were \"rapists\" and criminals. \nTrump never said \"many of them are good people,\" he said \"some, I assume, are good people.\" 4 days ago Pence Wildly Understates Clinton Foundation Charitable Work \nIn discussing the work of the Clinton Foundation, Mike Pence said \"less than 10 cents on the dollar has gone to charitable causes, it has been a platform for the Clintons to travel the world, to have staff.\" \nPence is absolutely wrong here: 80-90 percent of Clinton Foundation funding goes to program services, which our friends at PolitiFact found is the best measure of charitable work while checking a similar claim two months ago. It is true that less than 10 percent of their funds go to third-party charities, because most of its money goes directly to their projects. 4 days ago Pence Insists He and Trump Haven't Praised Putin. They Have \n\"No, we haven't\" said Russian President Vladimir Putin is a great leader Pence claimed on Tuesday night, later insisting it's \"absolutely inaccurate\" for Kaine to say he and Trump have called Putin a strong leader. ", "external_links": [], "published": "2016-10-08T23:23:00.000+03:00", "crawled": "2016-10-08T18:45:42.193+03:00", "highlightTitle": ""}