{"organizations": [], "uuid": "38d5bb45153ece0e96df76fb9307909d91fbd4c2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nbcnews.com", "main_image": "http://media1.s-nbcnews.com/j/msnbc/components/video/201610/f_lat_zepeda_161009.nbcnews-fp-1200-800.jpg", "site_section": "", "section_title": "", "url": "http://www.nbcnews.com/storyline/hispanic-heritage-month-2016/young-latinos-obama-white-house-meet-mario-moreno-zepeda-n663941", "country": "US", "domain_rank": 478, "title": "Young Latinos of the Obama White House: Meet Mario Moreno Zepeda - NBC News", "performance_score": 0, "site": "nbcnews.com", "participants_count": 0, "title_full": "Young Latinos of the Obama White House: Meet Mario Moreno Zepeda - NBC News", "spam_score": 0.04, "site_type": "news", "published": "2016-10-11T08:00:00.000+03:00", "replies_count": 0, "uuid": "38d5bb45153ece0e96df76fb9307909d91fbd4c2"}, "author": "Raul A. Reyes", "url": "http://www.nbcnews.com/storyline/hispanic-heritage-month-2016/young-latinos-obama-white-house-meet-mario-moreno-zepeda-n663941", "ord_in_thread": 0, "title": "Young Latinos of the Obama White House: Meet Mario Moreno Zepeda - NBC News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "ignore", "persons": [], "text": "Young Latinos of the White House: Meet Mario Zepeda 2:21 autoplay autoplay Copy this code to your website or blog <iframe src=\"http://www.nbcnews.com/widget/video-embed/782910019921\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen></iframe> \nMario Moreno Zepeda, 27, was born in Monterrey, Mexico, but his family moved to the U.S. when his parents came to pursue graduate degrees. Zepeda, who serves as press secretary for the White House Office of National Drug Control Policy , says being raised in an Illinois college town in Illinois gave Moreno Zepeda a unique perspective on his potential. \n\"I grew up seeing all these Latinos who were highly educated, who were doing work on biomedical engineering, industrial engineering, and civil engineering. So I always grew up with the expectation that just because you are Latino doesn't mean you can't be at the pinnacle of academic achievement, or that you can't do certain things,\" he said. \nRELATED: Young Latinos of the Obama White House: Witnesses, Participants in History \nWhen Moreno Zepeda would return to Mexico for family visits, he saw the increasing evidence of the drug trade along the border. This inspired him to do research on immigration and drug policy while attending Duke University . \nAs a Latino, Moreno Zepeda believes it important to have a voice in the administration's drug control policy. \"Addiction does not discriminate, not on socio-economic status, race, or gender; it is an issue that affects the Hispanic community.\" \nOne of his most rewarding moments was when he spoke to a woman who had gone through one of the drug treatment programs the administration had pushed for and funded. The woman had remade her life after being drug-free for a few years. \nThe young Latino said working with the Obama administration has been a \"dream job.\" For now, he is focused on the work they are doing to help people who are struggling with substance abuse disorders. \nMoreno Zepeda is certain that he wants to stay in public service. \n\"And I will say this; if the next five years look anything like the last five years have looked...Then I am really excited to find out what it is I'll be doing.\" \nFollow NBC Latino on Facebook , Twitter and Instagram . Raul A. Reyes ", "external_links": [], "published": "2016-10-11T08:00:00.000+03:00", "crawled": "2016-10-11T18:24:40.444+03:00", "highlightTitle": ""}