{"organizations": [], "uuid": "e2d9bf97fb6c76cae6c178d81d13580fbc59049b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nbcnews.com", "main_image": "http://media3.s-nbcnews.com/j/newscms/2016_42/1757601/05591779_f97a604224503c2b0246f3b535994adf.nbcnews-fp-1200-800.jpg", "site_section": "http://www.nbcnews.com/News/world", "section_title": "World News: The Latest Global News Stories - NBC News", "url": "http://www.nbcnews.com/news/world/powerful-typhoon-hits-philippines-potential-widespread-damage-n669106", "country": "US", "domain_rank": 478, "title": "Powerful Typhoon Hits Philippines With Potential for 'Widespread Damage'", "performance_score": 0, "site": "nbcnews.com", "participants_count": 5, "title_full": "Powerful Typhoon Hits Philippines With Potential for 'Widespread Damage' - NBC News", "spam_score": 0.0, "site_type": "news", "published": "2016-10-20T03:10:00.000+03:00", "replies_count": 4, "uuid": "0c10ff1107f869897b5ac00f2c0885be55668682"}, "author": "Palmer", "url": "http://www.nbcnews.com/news/world/powerful-typhoon-hits-philippines-potential-widespread-damage-n669106#post-2", "ord_in_thread": 2, "title": "", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Typhoons are everyday events for these Filipinos, and when one hits, those in unaffected areas do nothing to aid their countrymen. The average Filipino spends every spare peso on getting drunk, starting in the early teens and continuing throughout their shortened lives. They pop babies like machines and those children are born alcoholics and often abandoned to the streets and government garbage dumps to squander an existence on pure degradation. It is a sex destination for many in Asia as frolicking is cheap and without limits and very dangerous because of the cleaver entrapment mindset of the culture. Internally it is all smiles and joking and gouging with rice. Fat belly cops intimidate anyone they can, wrestling any peso they can from self administered 'law'. Men proudly urinate on the street as though a statement of their 'nature'. Women display their skin and bones babies outside the lavish malls of SM and Robinson's, the dominate players, an employment criteria of which you must be young and good looking and which malls sport a vast variety of Western Brands with prices far exceeding the same goods in the West. The non-tourists areas are scathing pagan-istic cultures where eyes watch from every direction to detect a source of advantage over another or one for gossip. The typical dwelling is a remnant of Spanish occupation, steel bars and concrete walls, little cages that lock up the monkeys at night. No one trusts anyone. A national phrase, \\\"never trust a Filipino\\\" echoes silently well beyond its 700 islands and many foreigners have fallen victim to their devious mindset. Albeit, there are many hellholes on earth, this is just one of the more tantalizing ones. For sure, if you send aid, whether money or goods, it will never reach those needing it. Just like the considerable money which sponsored the Manny Pacquiao\\/George Foreman in Vegas fight following the Yolanda super-typhoon event is rumored to have been squandered international relief funds. And after the storm passes and the bodies used to beg for funeral funding, the idiots will rebuild in the same spots to welcome the next storm. \\\"Hell is more fun in the Philippines\\\" If you ever decide to visit, be prepared for one of the most grueling immigration schemes on earth.", "external_links": [], "published": "2016-10-20T05:57:00.000+03:00", "crawled": "2016-10-20T13:07:21.931+03:00", "highlightTitle": ""}