{"organizations": [], "uuid": "8678dbfd7291e8dc48cbaead68e3cd5e695ed3ef", "thread": {"social": {"gplus": {"shares": 1}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 932, "shares": 932, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nbcnews.com", "main_image": "http://media1.s-nbcnews.com/j/newscms/2016_42/1755901/andrea_and_alvin_22c1c742dd2b6a0c6f15325b644f9d68.nbcnews-fp-1200-800.jpg", "site_section": "", "section_title": "", "url": "http://www.nbcnews.com/news/asian-america/panda-express-celebrates-origin-originality-american-chinese-campaign-n667921", "country": "US", "domain_rank": 478, "title": "Panda Express Celebrates 'Origin and Originality' With 'American Chinese' Campaign - NBC News", "performance_score": 9, "site": "nbcnews.com", "participants_count": 0, "title_full": "Panda Express Celebrates 'Origin and Originality' With 'American Chinese' Campaign - NBC News", "spam_score": 0.573, "site_type": "news", "published": "2016-10-18T08:00:00.000+03:00", "replies_count": 0, "uuid": "8678dbfd7291e8dc48cbaead68e3cd5e695ed3ef"}, "author": "Stephany Bai", "url": "http://www.nbcnews.com/news/asian-america/panda-express-celebrates-origin-originality-american-chinese-campaign-n667921", "ord_in_thread": 0, "title": "Panda Express Celebrates 'Origin and Originality' With 'American Chinese' Campaign - NBC News", "locations": [], "entities": {"persons": [{"name": "peggy", "sentiment": "none"}, {"name": "peggy cherng", "sentiment": "none"}, {"name": "stephany bai", "sentiment": "none"}, {"name": "andrew", "sentiment": "none"}, {"name": "jennifer 8 lee", "sentiment": "none"}, {"name": "gene luen yang", "sentiment": "none"}, {"name": "cherng", "sentiment": "none"}, {"name": "melvin mar", "sentiment": "none"}, {"name": "tso", "sentiment": "none"}, {"name": "andrea cherng", "sentiment": "none"}, {"name": "alvin huang", "sentiment": "none"}, {"name": "lisa ling", "sentiment": "none"}], "locations": [{"name": "united states", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "taiwan", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "cherng", "sentiment": "none"}], "organizations": [{"name": "et panda express", "sentiment": "negative"}, {"name": "nbc news", "sentiment": "negative"}, {"name": "panda restaurant group cmo", "sentiment": "none"}, {"name": "panda restaurant group", "sentiment": "none"}, {"name": "american dream", "sentiment": "none"}, {"name": "panda express", "sentiment": "none"}, {"name": "duy duong / panda restaurant group", "sentiment": "none"}, {"name": "panda restaurant group / panda restaurant group  she", "sentiment": "none"}, {"name": "nbc asian america on facebook", "sentiment": "none"}, {"name": "instagram", "sentiment": "none"}, {"name": "panda restaurant group / panda restaurant group  cherng", "sentiment": "none"}, {"name": "aia", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Oct 18 2016, 4:12 pm ET Panda Express Celebrates 'Origin and Originality' With 'American Chinese' Campaign by Stephany Bai advertisement \nAndrea Cherng may only have started her role as chief marketing officer of Panda Restaurant Group three years ago, but her ties to the company, which operates the Panda Express chain, run much deeper. Cherng, whose parents Andrew and Peggy grew the company from a single restaurant in 1973, told NBC News that she has been a \"student of the brand\" for most of her life. \n\"At Panda, we purposefully chose to describe our food as American Chinese, to separate the Chinese-American identity, the personhood, from the food type of American Chinese,\" she said. \"We try to have thoughtfulness as to how we approach describing the duality of identity in both people in terms of the Asian-American community as well as food.\" Panda Restaurant Group founders Andrew and Peggy Cherng with Andrew's father (center). Panda Restaurant Group / Panda Restaurant Group \nCherng noted that thoughtfulness extends to how they approach their food as well. When Panda Express launched its new menu item — General Tso's chicken — this August, their team took care to trace its origins , mapping its journey from its beginnings in Taiwan to its introduction in New York, where it quickly became a staple of American Chinese food. \n\"Dishes like General Tso's and orange chicken are the reasons why Chinese immigrant families in the U.S. were able to provide for their families,\" said Cherng. \"The beauty of it now is that this American Chinese cuisine, instead of it being a means of survival for one family, can be celebrated as incredible entrepreneurship.\" \nRELATED: Panda Express Touts 'American Chinese Classic' with New General Tso's Chicken \nWith this spirit in mind, Cherng and the Panda Express team earlier this month launched the \"American Chinese\" campaign, which features discussions with Chinese-American creative leaders including \"Fresh Off The Boat\" producer Melvin Mar, journalist Lisa Ling, graphic novelist Gene Luen Yang , filmmaker Jennifer 8 Lee , architect Alvin Huang, and Andrea Cherng herself. A photo posted by NBC News (@nbcnews) \n\"If you think about food and if you think about culinary, it is a creative expression. An aspect of what we do and what we want to do at Panda is celebrating both origin as well as originality,\" Cherng said. \"Creative thought leaders paired very well with celebrating both.\" \nThe campaign's videos aim to tell the American Dream story from an \"American Chinese perspective,\" according to Cherng. In their interviews, the creatives share stories of their parents and their own struggle and success. Panda Restaurant Group CMO Andrea Cherng and architect Alvin Huang, AIA. DUY DUONG / Panda Restaurant Group \n\"Struggle is part of who we are and struggle is something that's beautiful and we can make it through those things to become something much better,\" architect Alvin Huang says in his interview. \nOne thing each interviewee shares is an appreciation and gratitude for the generations that came before them. \"I always credit my grandmother with whatever success I've achieved,\" Lisa Ling says in her interview. \"America is an amalgam of so many things, so many struggles far and near. Not only am I incredibly proud of being American, I'm proud of being Chinese American specifically.\" A photo posted by NBC News (@nbcnews) \nAndrea Cherng notes that as chefs and home cooks experiment with different ethnic cuisines, Panda emphasizes respecting the culinary origin and \"food memory\" of the dishes they serve. \n\"I think that what's really important in some ways is this idea of respect and memory, the connection to food,\" she said. \"Many of the dishes that we grew up with in our home as Asian Americans, as immigrants, have stories attached to them that have so much to do with our cultural identity.\" \nRELATED: Graphic Novelist Gene Luen Yang: Stories Are Mirrors, Windows to Life \nCherng continued, \"A part of who we are at Panda Express is, we are American Chinese. And it's a story we tell, much like the food we serve, that is meant for a broader national audience.\" From left, Panda Restaurant Group CMO Andrea Cherng with Alvin Huang, Lisa Ling, Melvin Mar, Jennifer 8 Lee, and Gene Luen Yang for the \"American Chinese\" campaign. Panda Restaurant Group / Panda Restaurant Group \nShe observed that the stories and experiences that are highlighted in \"American Chinese\" are universal in theme, and likely familiar to anyone who's known or descended from immigrants. \n\"Our hope is in that telling stories that celebrate origin and originality — the immigrant journey, the American dream's success, the opportunities that have been a part of the fabric of the United States — that those stories will resonate and remind us of what is best about our dual identities,\" she said. \nFollow NBC Asian America on Facebook , Twitter , Instagram , and Tumblr . Stephany Bai ", "external_links": [], "published": "2016-10-18T08:00:00.000+03:00", "crawled": "2016-10-19T04:21:03.823+03:00", "highlightTitle": ""}