{"organizations": [], "uuid": "e89c06118f891525bc372576ca41be62cd2caae3", "thread": {"social": {"gplus": {"shares": 7}, "pinterest": {"shares": 1}, "vk": {"shares": 1}, "linkedin": {"shares": 3}, "facebook": {"likes": 908, "shares": 908, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nbcnews.com", "main_image": "http://media1.s-nbcnews.com/j/newscms/2016_43/1763141/161024-world-france-calais-jungle-angry-line-0414_68cecc6a1a8b90360fdd3fb32f314c0a.nbcnews-fp-1200-800.jpg", "site_section": "", "section_title": "", "url": "http://www.nbcnews.com/storyline/europes-border-crisis/france-begins-evicting-6-000-migrants-jungle-near-calais-n671636", "country": "US", "domain_rank": 478, "title": "France Begins Evicting 6,000 Migrants From 'Jungle' Near Calais - NBC News", "performance_score": 9, "site": "nbcnews.com", "participants_count": 0, "title_full": "France Begins Evicting 6,000 Migrants From 'Jungle' Near Calais - NBC News", "spam_score": 0.604, "site_type": "news", "published": "2016-10-24T08:00:00.000+03:00", "replies_count": 0, "uuid": "e89c06118f891525bc372576ca41be62cd2caae3"}, "author": "Alastair Jamieson", "url": "http://www.nbcnews.com/storyline/europes-border-crisis/france-begins-evicting-6-000-migrants-jungle-near-calais-n671636", "ord_in_thread": 0, "title": "France Begins Evicting 6,000 Migrants From 'Jungle' Near Calais - NBC News", "locations": [], "entities": {"persons": [{"name": "alastair", "sentiment": "negative"}, {"name": "alastair jamieson", "sentiment": "none"}, {"name": "tariq shinwari", "sentiment": "none"}, {"name": "emilio morenatti", "sentiment": "none"}, {"name": "ellie swinton", "sentiment": "none"}, {"name": "denis charlet", "sentiment": "none"}, {"name": "francois hollande", "sentiment": "none"}, {"name": "salamin", "sentiment": "none"}, {"name": "jamieson", "sentiment": "none"}, {"name": "richard pallot", "sentiment": "none"}, {"name": "christian salome", "sentiment": "none"}, {"name": "fabienne buccio", "sentiment": "none"}], "locations": [{"name": "france", "sentiment": "none"}, {"name": "calais", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "calais", "sentiment": "none"}, {"name": "u.k.", "sentiment": "none"}], "organizations": [{"name": "nbc news", "sentiment": "negative"}, {"name": "auberge des migrants", "sentiment": "none"}, {"name": "afp", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "associated press", "sentiment": "none"}, {"name": "the associated press", "sentiment": "none"}, {"name": "google", "sentiment": "none"}, {"name": "interior ministry", "sentiment": "none"}, {"name": "itv news", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Oct 24 2016, 6:47 am ET France Begins Evicting 6,000 Migrants From 'Jungle' Near Calais by Alastair Jamieson advertisement \nCALAIS, France — Thousands of migrants lined up at dawn Monday as French authorities backed by armed police began the evacuation and destruction of the vast, squalid camp nicknamed \"The Jungle.\" \nRefugees gathered their few possessions and abandoned rows of tents and makeshift shacks ready to be taken to new locations across the country. Migrants line up at the processing center in \"The Jungle\" near Calais on Monday. Emilio Morenatti / AP \nMost of those in line — who made treacherous journeys to escape war or grinding poverty and dreamed of making a life in Britain — had no idea where they were going next. \n\"There are rumors that they are taking them to warehouses,\" Tariq Shinwari, a 26-year old Afghan, told The Associated Press. \nNearly 6,500 migrants remain at the camp, on the outskirts of the port town of Calais, trying to sneak aboard ferries or freight trains heading across the English Channel to Britain. Fourteen migrants died in the area this year trying to stow away on wagons or trucks. \nTheir nightly cat-and-mouse game with border police became a symbol of European governments inability to get to grips with the migrant crisis. The existence of the camp has also become an issue in France's presidential election. \nIn Britain, concern over immigration was one of the main drivers of this year's \"Brexit\" vote to leave the European Union. \nFrench President Francois Hollande earlier this year announced authorities would clear \"The Jungle\" and officials began planning a complex operation to relocate migrants in hundreds of reception centers and shelters across the country. \nOn Monday, 60 buses were set to transport 3,000 migrants to an unknown future. \nBy week's end, the camp is expected to be emptied and destroyed. \nRelated: Trump Wants Border Wall, But U.K. Is Already Building One \nClashes broke out overnight as some migrants fled the camp early to avoid arrest or deportation, many of them setting fire to shelters and portable toilets in a final act of protest. Smoke billows as migrants start fires during overnight clashes ahead of Monday's evacuation. DENIS CHARLET / AFP - Getty Images \nAt first light, refugees formed snaking lines outside a huge temporary processing center where they were split into four groups — men over 18, families, minors and other vulnerable groups — then given wristbands that assign them to a new destination. \nMotels and even disused castles are among the hundreds of centers officials have been converting to migrant housing. The Operation to clear jungle camp in Calais has begun. 3 days long - these are the first migrants heading to centres unknown across France pic.twitter.com/IgqnaxnQjX — Richard Pallot (@richpallotitv) October 24, 2016 \nMany of those waiting told NBC News' partner ITV News that they had no idea where they were going. A Sudanese refugee said he would rather sleep on the streets of a \"big city\" than be resettled in a rural town or village with fewer job opportunities. \nFrance's interior ministry tweeted pictures of packed buses leaving the site, and said it had distributed leaflets in 9 languages explaining that the camp would be dismantled. \n\"It's going well. We knew this morning that there would be a lot of people, and that's what's happening,\" regional Prefect Fabienne Buccio said. \"There was no pushing, the minors arrived. We had a particular concern for the minors, paid them particular attention, but it went well,\" she added. Map showing the location of Calais, France. Google Maps \nAid workers advised those waiting to register together as they believe it will give groups of friends or communities the best chance of not being separated. \nOthers warned that many migrants who remained determined to reach Britain would simply scatter into the countryside, only to regroup in Calais at a later date. \n\"Each time they dismantle part of the camp it's the same thing. You're going to see them go into hiding and then come back. The battles will continue,\" said Christian Salome, president of non-profit Auberge des Migrants. \nClearing the camp will be no easy task for authorities. In addition to tents and shacks for sleeping, the Jungle has sprouted makeshift restaurants, kitchens, stores and even a mosque and a church. \nAt the church, which was built by Ethiopian migrants, there was a special 4-hour service Sunday. \n\"This is a special service. The people are really fearing,\" Salamin, a man who acts as church keeper and activity planner, told The Associated Press. And so it begins. Queues to get on buses from Calais to centres around France #Calais #JungleEviction @itvnews pic.twitter.com/sGEgHSvh2a — Ellie Swinton (@EllieSwintonITV) October 24, 2016 Calais at first light. People split into over 18s, minors, families and the most vulnerable @itvnews #JungleEviction pic.twitter.com/S7Ee2N0PiT — Ellie Swinton (@EllieSwintonITV) October 24, 2016 Buses line up ready to transport the Jungle evictees to centre around France #calais #JungleEviction @itvnews pic.twitter.com/4N0Z4GaBdp — Ellie Swinton (@EllieSwintonITV) October 24, 2016 Les flyers sont traduits en 9 langues et une BD présente aux migrants le dispositif d'accueil en CAO. Des interprètes sont aussi présents. pic.twitter.com/V1JsWEXqk8 — Ministère Intérieur (@Place_Beauvau) October 23, 2016 Alastair Jamieson ", "external_links": [], "published": "2016-10-24T08:00:00.000+03:00", "crawled": "2016-10-24T13:58:37.812+03:00", "highlightTitle": ""}