{"organizations": [], "uuid": "1358428561ed4315782a5c63ccf26941299fc693", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 5}, "facebook": {"likes": 47, "shares": 47, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nbcnews.com", "main_image": "http://media1.s-nbcnews.com/j/newscms/2016_40/1739376/jobs_12_3be366dfae38770e9b6f5bb1a4020dbf.nbcnews-fp-1200-800.jpg", "site_section": "http://www.nbcnews.com/business", "section_title": "Business - NBC News", "url": "http://www.nbcnews.com/business/business-news/biggest-worry-we-have-about-our-jobs-not-immigration-it-n661041", "country": "US", "domain_rank": 478, "title": "The Biggest Worry We Have About Our Jobs Is Not Immigration, It's Irrelevance", "performance_score": 0, "site": "nbcnews.com", "participants_count": 2, "title_full": "The Biggest Worry We Have About Our Jobs Is Not Immigration, It's Irrelevance - NBC News", "spam_score": 0.954, "site_type": "news", "published": "2016-10-07T01:06:00.000+03:00", "replies_count": 1, "uuid": "1358428561ed4315782a5c63ccf26941299fc693"}, "author": "Martha C. White", "url": "http://www.nbcnews.com/business/business-news/biggest-worry-we-have-about-our-jobs-not-immigration-it-n661041", "ord_in_thread": 0, "title": "The Biggest Worry We Have About Our Jobs Is Not Immigration, It's Irrelevance", "locations": [], "entities": {"persons": [{"name": "zoe baird", "sentiment": "none"}, {"name": "reuters/shannon stapleton", "sentiment": "none"}, {"name": "smith", "sentiment": "none"}, {"name": "blustein", "sentiment": "none"}, {"name": "nicole smith", "sentiment": "none"}, {"name": "baird", "sentiment": "none"}, {"name": "david blustein", "sentiment": "none"}, {"name": "kim parker", "sentiment": "none"}, {"name": "parker", "sentiment": "none"}], "locations": [{"name": "united states", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "nassau veterans memorial coliseum", "sentiment": "none"}, {"name": "uniondale", "sentiment": "none"}, {"name": "nassau county", "sentiment": "none"}], "organizations": [{"name": "department of education", "sentiment": "none"}, {"name": "pew research center", "sentiment": "none"}, {"name": "boston college's lynch school of education", "sentiment": "none"}, {"name": "pew", "sentiment": "none"}, {"name": "institute for college access", "sentiment": "none"}, {"name": "pew research", "sentiment": "none"}, {"name": "markle foundation", "sentiment": "none"}, {"name": "georgetown university center on education", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "itemprop=\"articleBody\"> The biggest worry Americans have about their jobs isn't immigration; it's irrelevance.\nIn a new Pew Research report , 80 percent of survey respondents said outsourcing hurts American workers, and 54 percent said continual training will be \"essential\" to advancing their careers, including more than 60 percent of the youngest workers.\nPeople enter the Nassau County Mega Job Fair at Nassau Veterans Memorial Coliseum in Uniondale, New York. REUTERS/Shannon Stapleton \"It's a positive story on the impact of skills and up-skilling on the American workforce,\" said Georgetown University Center on Education and the Workforce chief economist, Nicole Smith. The report found that employment growth is most rapid in high-skill jobs and in ones where continued training is imperative, in fields like education, professional services and health care.\nAccording to the survey of more than 5,000 Americans, including nearly 3,100 in the workforce, which was conducted by Pew in conjunction with the Markle Foundation, people are roughly split on whether immigration helps or hurts American workers, at 42 percent and 45 percent, respectively. This is a significant shift from a decade earlier, when only 28 percent said immigrants contribute positively to the American labor market.\n\"That's a really significant finding,\" said David Blustein, a counseling psychology professor at Boston College's Lynch School of Education. \"What politicians have been telling us about immigrants taking our jobs is not shared by the American people,\" he said.\n\"It seems to me that people see that diversity helps the American worker,\" said Zoe Baird, president of the Markle Foundation.\nIn fact, 85 percent of survey respondents of all ages said it was either extremely or very important for employees to be able to work with colleagues from different backgrounds, with 62 percent adults under the age of 30 saying that continual training and educational will be essential to their career advancement.\n\"It definitely is a very linear relationship there,\" said Kim Parker, director of social trends research at Pew Research Center and one of the lead authors of the report.\nIt's a learning economy\nThese findings reflect the extent to which the most promising jobs are grounded in or depend on constantly evolving technology, Parker said. \"So many of them are technologically based and the technology is constantly changing,\" she said.\nToday's millennials grew up with rapid obsolescence as an expected part of the technological life cycle, which shapes their expectations, Parker added. \"It's a little more part of their DNA. Also, they have a longer trajectory ahead of them,\" Baird said.\n\"People are recognizing that we have a learning economy and that they will be learning and training throughout their lives, and people are embracing this,\" said.\nAutomation fears\nThe survey also found that Americans today are leery of foreign imports but think that exporting to other countries is a plus, and welcome technological improvements in the workplace but worry about robots replacing human workers.\n\"We're seeing a lot of the jobs at the lower-middle level being replaced with automation or outsourced,\" Blustein said.\nThis development is a double-edged sword, Blustein said. \"Automation in general will reduce the amount of tedium at work; however, for people with lower-level skills, these are often the options they might have.\"\nMore than 70 percent of survey respondents think workers themselves bear a lot of the responsibility for keeping abreast of the skills and training they need to acquire over the course of their careers, but the rising cost of this education — and the question of who ultimately will bear it — is one that vexes students, workers and policymakers alike.\n\"They're doing this and taking responsibility for it,\" Baird said, but right now, people's individual efforts aren't being matched on a bureaucratic or corporate scale. \"Now we need to catch up in our institutions,\" she said.\nThe learning tree\nSince the Great Recession, \"The relationship of who pays for higher education has changed,\" Smith said, with more of the burden shifted from government and employers and onto the individual.\nA recent analysis of Department of Education data by The Institute for College Access and Success found that the percentage of students with loans who default on that debt is inching down, but the total number of borrowers in default, 8.1 million, is at a record high.\n\"The challenge is I think that we need to think carefully and creatively how we can train people who might not want to go to college,\" Blustein said. He and other labor market experts point to pilot programs in the United States and abroad that incorporate apprenticeships, individualized learning modalities and job-training that targets skills rather than academic tracks.\nThese experts say this needs to be a multifaceted effort, though. \"Part of the burden should fall on the community, on the employers and on the government,\" Smith said. \"It's my opinion that most recently, employers have shirked on that responsibility,\" she said, an observation borne out by the booming \"gig\" economy and the proliferation of contract and temporary employment.\n\"Employers have the other hand,\" Smith said, but this is likely to change as labor market demand grows. \"As jobs get tight again and employers find themselves competing again, the upper hand will shift,\" she predicted.\nAlready, a shortage of workers in some industries is prompting employers to provide more robust training for workers, Parker said. \"There does seem to be a sense, just anecdotally, that the more they can accommodate the needs of their workers, they more they'll have loyalty and retention,\" she said.", "external_links": ["http://media4.s-nbcnews.com/j/newscms/2016_40/1739371/jobs_11_8280231db007455e0b2feff8d0fa20ac.nbcnews-ux-2880-1000.jpg", "http://www.pewsocialtrends.org/2016/10/06/the-state-of-american-jobs", "http://media4.s-nbcnews.com/j/newscms/2016_40/1739371/jobs_11_8280231db007455e0b2feff8d0fa20ac.nbcnews-fp-360-360.jpg", "http://media4.s-nbcnews.com/j/newscms/2016_40/1739371/jobs_11_8280231db007455e0b2feff8d0fa20ac.nbcnews-ux-320-320.jpg", "http://ticas.org/sites/default/files/pub_files/cdr_2016_nr.pdf"], "published": "2016-10-07T01:06:00.000+03:00", "crawled": "2016-10-06T20:53:03.526+03:00", "highlightTitle": ""}