{"organizations": [], "uuid": "f6a4866b01f68d7a5a528761556584d06979c7ee", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 13, "shares": 13, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nbcnews.com", "main_image": "http://media4.s-nbcnews.com/j/newscms/2016_42/1752911/161016-flaelex3-sg-0619_00e9b4e4aaedd27b13589f4f2f36a9a1.nbcnews-fp-1200-800.jpg", "site_section": "", "section_title": "", "url": "http://www.nbcnews.com/news/latino/more-democrat-leaning-miami-cubans-latinos-could-help-clinton-win-n666046", "country": "US", "domain_rank": 478, "title": "More Democrat-Leaning Miami Cubans, Latinos Could Help Clinton Win Fla. - NBC News", "performance_score": 0, "site": "nbcnews.com", "participants_count": 0, "title_full": "More Democrat-Leaning Miami Cubans, Latinos Could Help Clinton Win Fla. - NBC News", "spam_score": 0.015, "site_type": "news", "published": "2016-10-17T08:00:00.000+03:00", "replies_count": 0, "uuid": "f6a4866b01f68d7a5a528761556584d06979c7ee"}, "author": "Carmen Sesin", "url": "http://www.nbcnews.com/news/latino/more-democrat-leaning-miami-cubans-latinos-could-help-clinton-win-n666046", "ord_in_thread": 0, "title": "More Democrat-Leaning Miami Cubans, Latinos Could Help Clinton Win Fla. - NBC News", "locations": [], "entities": {"persons": [{"name": "carlos alfonso", "sentiment": "negative"}, {"name": "clinton", "sentiment": "negative"}, {"name": "gutierrez", "sentiment": "none"}, {"name": "jeb bush", "sentiment": "none"}, {"name": "cristobal herrera", "sentiment": "none"}, {"name": "arrizurieta", "sentiment": "none"}, {"name": "tim kaine", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "george w. bush", "sentiment": "none"}, {"name": "joli", "sentiment": "none"}, {"name": "blaise ingoglia", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "jorge l. arrizurieta", "sentiment": "none"}, {"name": "ingoglia", "sentiment": "none"}, {"name": "reuters/lucy nicholson lucy nicholson", "sentiment": "none"}, {"name": "herrera cristobal herrera", "sentiment": "none"}, {"name": "alfonso", "sentiment": "none"}, {"name": "ronald reagan", "sentiment": "none"}, {"name": "eduardo gamarra", "sentiment": "none"}, {"name": "carlos gimenez", "sentiment": "none"}, {"name": "carlos gutierrez", "sentiment": "none"}, {"name": "joe raedle", "sentiment": "none"}, {"name": "tomas regalado", "sentiment": "none"}, {"name": "rubio", "sentiment": "none"}, {"name": "amandi", "sentiment": "none"}, {"name": "gimenez", "sentiment": "none"}, {"name": "fernand amandi", "sentiment": "none"}, {"name": "reina menoza", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "mitt romney", "sentiment": "none"}, {"name": "al gore", "sentiment": "none"}, {"name": "kennie silva", "sentiment": "none"}, {"name": "obama", "sentiment": "none"}, {"name": "john mccain", "sentiment": "none"}, {"name": "mike fernandez", "sentiment": "none"}, {"name": "marco rubio", "sentiment": "none"}, {"name": "mayra joli", "sentiment": "none"}, {"name": "carlos curbelo", "sentiment": "none"}, {"name": "carmen sesin", "sentiment": "none"}, {"name": "ileana ros-lehtinen", "sentiment": "none"}, {"name": "maria", "sentiment": "none"}, {"name": "gamarra", "sentiment": "none"}, {"name": "wilfredo lee", "sentiment": "none"}, {"name": "hillary", "sentiment": "none"}, {"name": "mike pence", "sentiment": "none"}], "locations": [{"name": "miami", "sentiment": "none"}, {"name": "miami", "sentiment": "none"}, {"name": "win fla.", "sentiment": "none"}, {"name": "sarasota", "sentiment": "none"}, {"name": "cuba", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "latin america", "sentiment": "none"}, {"name": "south florida fair expo center", "sentiment": "none"}, {"name": "miami dade college", "sentiment": "none"}, {"name": "orlando", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}, {"name": "west palm beach", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "usa", "sentiment": "none"}, {"name": "miami-dade", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "miami-dade county", "sentiment": "none"}, {"name": "miami-dade county", "sentiment": "none"}, {"name": "el salvador", "sentiment": "none"}, {"name": "pennsylvania", "sentiment": "none"}, {"name": "south florida", "sentiment": "none"}], "organizations": [{"name": "nbc news", "sentiment": "negative"}, {"name": "republican", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "congress", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "miami dade college", "sentiment": "none"}, {"name": "republican national committee", "sentiment": "none"}, {"name": "latino public opinion forum", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "latin builders association", "sentiment": "none"}, {"name": "epa", "sentiment": "none"}, {"name": "bendixen & amandi", "sentiment": "none"}, {"name": "florida international university", "sentiment": "none"}, {"name": "reuters  juan cuba", "sentiment": "none"}, {"name": "rnc", "sentiment": "none"}, {"name": "gop", "sentiment": "none"}, {"name": "miami-dade democratic party", "sentiment": "none"}, {"name": "trump  u.s. gop", "sentiment": "none"}, {"name": "republican party of florida", "sentiment": "none"}, {"name": "commerce", "sentiment": "none"}, {"name": "epa  trump", "sentiment": "none"}, {"name": "instagram", "sentiment": "none"}, {"name": "democratic", "sentiment": "none"}, {"name": "democratic party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "\nMIAMI -- During the primaries, Cuban American Carlos Alfonso, a 39-year-old cardiologist from Miami, decided he would not vote for Donald Trump. \n\"His platform which continues to be fear mongering … is divisive and dangerous to the country,\" Alfonso said. \nBorn and raised in Miami, Alfonso doesn't claim a party, but has voted Republican in almost every presidential election since he was 18, just like his parents have done since they fled the communist island in the 1960s. \nThis year, he will vote for the Democratic nominee, Hillary Clinton, although he's not too excited about her. \"I'll choose the least of two evils,\" he said. \nLike Alfonso, a growing number of Cuban-Americans and other Latinos in Miami have been leaning more towards the Democratic ticket over the past decade. This year, the trend may be exacerbated by Trump's statements about Mexicans and immigrants, his lewd sexual language captured by a hot mic, and other controversies. \nFor either of the candidates to win Florida, they must win the Latino vote, now 15 percent of the state's electorate. And winning Florida's Latino vote means winning it in Miami-Dade County, home to the state's largest Hispanic population, 66.7 percent of its residents. \nRelated: Polls: Clinton Ahead In Florida, Pennsylvania \nWith Latinos statewide, polls show Clinton has a strong advantage. She's campaigned heavily in the state, run Spanish language ads and Hispanic focused ads. \nOn Sunday her vice presidential candidate Tim Kaine gave a whole speech en español , urging evangelicals to support Clinton. \nBut some of the support has come from shifting demographics and a general aging out of once GOP supporting Cubans. epaselect epa05581369 Supporters of the Democratic Presidential candidate Hillary Clinton chant slogans before the start of Clinton's Presidential campaign event at the Miami Dade College, in Miami, Florida, USA, 11 October 2016. EPA/CRISTOBAL HERRERA CRISTOBAL HERRERA / EPA Cubans Are Exiting GOP As Florida's Latino Demographic Shifts \nWinning the Latino vote in Florida used to be a breeze for Republican candidates because of the large Cuban bloc. Cuban-Americans traditionally felt an affinity towards Republicans, whose ideology was the most distant to the communist party they left behind. Ronald Reagan galvanized that support with his fierce anti-Castro stands and the election of the first Cuban American to Congress. \"We saw things change around 2007 and now it has solidified. I don't know in one or two more electoral cycles where Cuban American support will be.\" - professor Eduardo Gamarra. \nBut through the years, these older 'historic\" Cubans have become fewer in number. Some of their offspring have become Democrats and some of the more recently arrived Cubans have been registering as Democrats. \n\"We saw things change around 2007 and now it has solidified. I don't know in one or two more electoral cycles where Cuban American support will be,\" said Eduardo Gamarra, a political science professor at Florida International University and director of the Latino Public Opinion Forum. \nMeanwhile, South Florida has had an influx of immigration from all over Latin America, which began with Nicaraguans in the 1980s fleeing from their country's civil war. Reina Menoza, center, puts a patriotic scarf on her mother Maria as they wait in line to attend a rally for Democratic presidential candidate Hillary Clinton where she will be joined by former vice president Al Gore, Tuesday, Oct. 11, 2016, in Miami. Wilfredo Lee / AP \nEven though a little more than half of the state's population is still Cuban American, Florida now has large numbers of Venezuelans, Colombians, Hondurans, Brazilians, Dominicans, Mexicans, and others. \nMost recently, there has been a huge wave of Puerto Ricans moving to Florida who strongly back Clinton . Though the majority have moved to the I-4 Corridor in Central Florida, Miami is also seeing growing numbers, with more Puerto Rican Spanish accents heard in in the city's malls, supermarkets. \nRelated: Puerto Ricans Flex Their Political Muscle in Florida \nSome groups such as Nicaraguans and Venezuelans have voted or leaned Republican. But according to pollster and Democrat Fernand Amandi, of Bendixen & Amandi, exit polls conducted after the 2012 elections indicated that Nicaraguans and Venezuelans were switching to the Democratic Party. \nThese voter trends are what allowed Obama to win the Latino vote in Miami-Dade County and carry the state of Florida ; Obama won Florida's Hispanic vote 60 percent to 39 percent for Mitt Romney. More Latino diversity has made immigration a bigger issue \nSome may dismiss the importance of the immigration issue here, because U.S. policy grants expedited citizenship to Cubans who arrive on U.S. soil. But again, the increasingly diverse Latino population here has changed that. Republican presidential candidate Donald Trump speaks during a campaign rally at the South Florida Fair Expo Center in West Palm Beach, Florida on Oct. 13, 2016. Joe Raedle / Getty Images \nAmong Latinos that have participated in focus groups organized by Gamarra, immigration is an important topic, even for those Latinos who are citizens. \nIn Miami, it's difficult not to know someone who is undocumented or isn't affected by immigration laws. Gamarra who is a U.S. citizen has students who arrived or stayed in the country illegally, often because their parents did not have the legal permission to be here. \n\"Immigration is more than just a public policy issue to us. We look at immigration as an emotional, cultural status,\" Gamarra said. \nBut opinions are as diverse as the Latinos in Miami. \nMayra Joli, a Dominican-American immigration attorney, is a registered Democrat and a Trump supporter. She said she wants the country to go back to the values it had in the 1990s when she immigrated here. She says too much political correctness is destroying the nation's values, such as the removal of the Confederate flag from state and federal buildings. She does not see Trump as anti-immigrant like some in the Latino community. \n\"I know it doesn't work to have immigration reform for everyone and it doesn't work to deport everyone, which means those extremes have to come to a middle ground,\" Joli said. epa05585554 Cubans living in exile shout slogans supporting US Republican presidential nominee Donald Trump's candidacy in Miami, Florida, USA, 14 October 2016. Trump campaigns in the general election battleground state of Florida. EPA/CRISTOBAL HERRERA CRISTOBAL HERRERA / EPA \nShe said immigrants believe the promises that Democrats make and while they \"are waiting for things to happen, ICE is deporting people.\" \nHowever for Trump to win Florida, he has a lot of catching up to do among Hispanics. He is \"the least popular among Hispanic voters in modern election history,\" Amandi said. \nRepublican Jorge L. Arrizurieta, who was chair of the Jeb Bush campaign in South Florida, said \"the reason why he [Trump] may have some acceptance in some pockets on the Cuban-American community is because there is a strong anti-Hillary sentiment.\" \nArrizurieta is not voting for Trump and said he \"personifies everything you raise your children not to be.\" On the Ground, Clinton is Leading \nThe Clinton campaign is ahead, as far as the ground game in Miami-Dade. \nThe campaign has nine offices throughout Miami-Dade, dozens of staffers and hundreds of volunteers working throughout the county to register voters and turn out the vote, according to a campaign aide. U.S. Democratic presidential nominee Hillary Clinton poses with supporters after talking about climate change with former Vice President Al Gore at a rally at Miami Dade College in Miami, Florida, U.S. October 11, 2016. REUTERS/Lucy Nicholson LUCY NICHOLSON / Reuters \nJuan Cuba, the executive director of the Miami-Dade Democratic Party, said they are in full registration mode until the end of the extended registration deadline on Oct. 18. A federal judge recently extended the deadline because of the havoc Hurricane Matthew has caused. \n\"I know Trump is spiraling, but Florida is always a close election and we're not taking any vote for granted,\" Cuba said. \nThe party has found the majority of people to register outside of post offices, bus stops, supermarkets and other areas, finding many Latinos and African-Americans to sign up. Supporters listen to U.S. Democratic presidential nominee Hillary Clinton and former Vice President Al Gore talk about climate change at a rally at Miami Dade College in Miami, Florida, U.S. October 11, 2016. REUTERS/Lucy Nicholson LUCY NICHOLSON / Reuters \nThis year, Hispanic voters make up a larger share of Miami-Dade's registered voters compared to previous election cycles. There were 745,380 Hispanic registered voters as of August, which is an increase of almost 40,000 since 2012 when there were 709,445 registered voters before the general election. \nThe number of Latino voters claiming no party affiliation also has grown. But Republicans still outnumber Democrats among Hispanic registered voters in Miami-Dade. There were 267,881 Hispanic Republicans and 230,517 Hispanic Democrats as of August 2016, according to the Florida Division of Elections . \nTrump has relied heavily on the Republican National Committee (RNC) and the state party for registering people to vote and for knocking door-to-door. In mid-September, the Florida headquarters were moved from Sarasota to Orlando, which is more centrally located. At that point, it had been the only Trump campaign office in Florida. \n\"We are the ones who have been on the ground talking to the voters for the better part of two years. While they were out campaigning, we were out setting it up for the general elections,\" Republican Party of Florida Chairman Blaise Ingoglia said. Cuban Americans support US Republican presidential nominee Donald Trump's candidacy in Miami, Florida, USA, 14 October 2016. CRISTOBAL HERRERA / EPA \nTrump now has 23 field offices in the state of Florida - two are in Miami-Dade county, according to his campaign website . Ingoglia said the highest number of staff and volunteers are located in Miami-Dade and the I-4 corridor. \nIn contrast, during the last election cycle, when Mitt Romney was nominated, around 20 campaign offices were opened by May in Florida, according to a Florida Republican speaking on background. \nWith Trump, \"it's difficult to show up last minute to engage people - if it weren't for the RNC's efforts, there would have been a void before September,\" said the Florida Republican. Most Miami GOP Cuban-American leaders don't support Trump \nU.S. GOP Senator Marco Rubio still supports Trump, though in an appearance over the weekend with vice presidential candidate Mike Pence he didn't mention Trump by name. Rubio is in the minority, though. \nTrump doesn't have strong support among the mostly Cuban-American Republican leadership in Miami-Dade. Many of these leaders didn't endorse Trump from the beginning. \nU.S. Reps. Ileana Ros-Lehtinen and Carlos Curbelo have said they will not support Trump, though they have stopped short of endorsing Clinton. \nCarlos Gutierrez, a Cuban-American Republican who was Commerce Secretary under George W. Bush endorsed Clinton. Her campaign created an advertising campaign in September around his endorsement. \nIn it, Gutierrez says in Spanish he has been Republican all his life, but he's an American before anything else, a common sentiment among Cuban Americans. He goes on to say he cannot vote for Trump because he's dangerous. \nCuban-American Miami billionaire Mike Fernandez, who was a top donor for Jeb Bush during the primaries, has called Trump an \"abysmally unfit candidate.\" He has donated over $2 million to help Clinton's campaign with Latino outreach in Florida. \nIn an op-ed at the end of August he wrote: \"As a Republican who has contributed millions of dollars to the party's causes, I ask: Why has our party not sought a psychological evaluation of its nominee?\" \nMayors Tomas Regalado of Miami and Carlos Gimenez of Miami-Dade County - both Republican - have refused to support Trump. Gimenez, who is up for re-election said during a mayoral debate that he would vote for Clinton and that Trump should step down as his party's nominee. \nThe Latin Builders Association, which touts itself as the largest Hispanic construction group in the country, endorsed Clinton this week. It was the first time the mostly Cuban-American and conservative-leaning group has backed a Democrat for president. \nClinton Must Energize Florida Latinos to Turn Out \nIt's not enough for Clinton to have an edge among Latino registered voters in Florida. To win the state, Latinos need to turn out in force for her to win Florida's crucial 29 electoral votes. \nArrizurieta thinks Clinton might get an extra push during the coming weeks. \n\"In the next 30 days whoever has been anti-Trump and not been pro-Hillary will gravitate towards Hillary,\" he said. \nTraditionally, Latinos vote in much lower numbers than blacks and other minority groups. Only 48 percent of Hispanic eligible voters actually cast ballots in the 2012 election. \nKennie Silva, 36, an office manager at a Miami dance school, was born in California after her parents fled the civil war that ravaged El Salvador in the 1980s. She's Republican and prefers Trump, but she said chances are, she won't vote for him Nov. 8. \n\"I'm of the mindset that at the end, my vote doesn't really count,\" she said. \nIn Florida, almost half of the population is under 29. Millennials, generally 18-35, are not reliable when it comes to voting. In the 2014 midterm elections, only 41 percent of registered voters cast a ballot in Miami-Dade. \nMany analysts agree that for Trump to win Florida he must garner more support from Hispanics than John McCain and Mitt Romney did in their failed presidential bids in 2008 and 2012, respectively. \nArrizurieta is not optimistic about voter turnout this year. \n\"You will sure have a greater number of abstentions staying at home,\" he said. \"That number might be greater than people think. And we won't know that until after the elections.\" \nFollow NBC Latino on Facebook , Twitter and Instagram . Carmen Sesin ", "external_links": [], "published": "2016-10-17T08:00:00.000+03:00", "crawled": "2016-10-17T13:27:00.767+03:00", "highlightTitle": ""}