{"organizations": [], "uuid": "654f50c3414feb8fd65086f456063bdaa9c49f99", "thread": {"social": {"gplus": {"shares": 1}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 615, "shares": 615, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nbcnews.com", "main_image": "http://media4.s-nbcnews.com/j/newscms/2016_40/1732826/161002-nevada-sg-844_0_e714db6080b7ec9698e814a784e12e2a.nbcnews-fp-1200-800.jpg", "site_section": "", "section_title": "", "url": "http://www.nbcnews.com/news/latino/nevada-race-heats-potential-1st-latina-u-s-senator-n656421", "country": "US", "domain_rank": 478, "title": "Nevada Race Heats Up with Potential First Latina U.S. Senator - NBC News", "performance_score": 6, "site": "nbcnews.com", "participants_count": 0, "title_full": "Nevada Race Heats Up with Potential First Latina U.S. Senator - NBC News", "spam_score": 0.712, "site_type": "news", "published": "2016-10-04T08:00:00.000+03:00", "replies_count": 0, "uuid": "654f50c3414feb8fd65086f456063bdaa9c49f99"}, "author": "Alexandra Jaffe", "url": "http://www.nbcnews.com/news/latino/nevada-race-heats-potential-1st-latina-u-s-senator-n656421", "ord_in_thread": 0, "title": "Nevada Race Heats Up with Potential First Latina U.S. Senator - NBC News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Oct 4 2016, 8:48 am ET Nevada Race Heats Up with Potential First Latina U.S. Senator by Alexandra Jaffe The \"Welcome to Fabulous Las Vegas\" sign is seen in Las Vegas, Nevada in this file photo taken September 10, 2011. STEVE MARCUS / Reuters Share advertisement \nDemocrats are hoping to make history by electing the first Latina U.S. senator in a hotly-contested race to replace Senate Minority Leader Harry Reid in Nevada. Their prospects may be looking up: Polls have tightened over the past week following some local developments that have complicated the GOP's pitch to minority voters. \nFormer Nevada Attorney General Catherine Cortez Masto is their candidate, and on paper, she seems ideal: The granddaughter of Mexican and Italian immigrants, she makes personal pitches to first- and second-generation immigrants on the stump. Like many other multi-generation U.S. Hispanics, she does not speak Spanish fluently but can understand it. She has made outreach to Nevada's sizable Latino community a centerpiece of her campaign and touts her support for progressive policies such as a higher minimum wage and immigration reform. U.S. Democratic presidential candidate Hillary Clinton (L) appears on stage with Nevada Senate candidate Catherine Cortez Masto at a campaign rally at the Laborers International Union hall in Las Vegas, Nevada February 18, 2016. REUTERS/David Becker/File Photo DAVID BECKER / Reuters \nRepublicans have nominated Congressman Joe Heck, who was elected as part of the Tea Party wave in 2010 and has won his two subsequent re-election fights by increasing his margins. That electoral strength — Heck's district includes much of Clark County, one of the state's two most populous counties, with a demographic makeup that mirrors Nevada's population — is part of what's given Republicans high hopes for his chances at a statewide bid. \nHeck has been winning in the polls, and both Republicans and Democrats involved in the race say that's because, despite Cortez Masto's attractive profile, $15.3 million in attack ads from GOP outside groups have helped her opponents. U.S. Rep. Joe Heck, R-Nev., who is running for the U.S. Senate seat being left vacant by the retiring Democratic Sen. Harry Reid, addresses a Republican rally and barbecue on a northern Nevada ranch south of Carson City, Nev., Saturday, Aug. 20, 2016. (AP Photo/Scott Sonner) Scott Sonner / AP \n\"It's clear that Republicans, and their outside groups, have spent a lot of money trying to define her,\" said Chris Wicker, first vice chair of the Nevada Democratic Party. \n\"We need to make her unelectable,\" said Ian Prior, spokesman for the billionaire Koch Brothers-backed Senate Leadership Fund super PAC, which has already spent over $2.1 million in the race. The Koch brothers fund many conservative causes and have backed the LIBRE Initiative, a group that works in the Latino community for conservative ideals and those who back them. \nBut Democrats point to a trio of bad news developments last week — adding up to what veteran Nevada political reporter Jon Ralston called Heck's \"Terrible Thursday\" — as a potential turning point in the race. \nThat day, a GOP operative mistook one African American elected official for another in attempting to attack Cortez Masto and BuzzFeed published a collection of racist and sexist postings Heck's son made on social media; Rep. Heck subsequently apologized . Moreover, two of Heck's former advisers questioned Cortez Masto's Mexican heritage, including one who said the Las Vegas-born Cortez Masto, whose father is from Mexico but who also has Italian roots, \"is about as Mexican as I am.\" Catherine is about as Mexican as I am. It's relevant when applying for scholarhsips...or running for #nvsen https://t.co/18RzjRbDnY — Tom McAllister (@TMAC702) September 22, 2016 \nHe also asked whether she speaks Spanish, drawing allegations he was questioning whether she was truly Latina based on her language skills. — Tom McAllister (@TMAC702) September 22, 2016 \nAnother former Heck adviser, Mark Ciavola, said of her references to her heritage as \"Hispandering at its finest,\" in a Facebook comment, according to The Las Vegas Sun. Ralston speculated this could drive Latino turnout against Heck, likening it to Trump's attacks on a Mexican-American judge overseeing a lawsuit against him, which even some Republicans decried as racist. Cortez Masto's campaign said the developments were \"huge news,\" and while they won't be airing any ads pushing the issue, they expect them to be a long-term problem for Heck. \nAt a recent press conference, Cortez Masto didn't mince words in hammering Heck for his former aides' comments. \n\"For long-time aides of Congressman Heck to attack my Mexican heritage, claiming that it is only useful for a college application is disgusting,\" Cortez Masto said. \"Joe Heck does not stand for Nevadan values and we cannot afford to have him in office.\" \nAnd a new survey conducted by Bendixen Amandi International for the Las Vegas Review-Journal shows just a narrow, two-point lead for Heck, 47 percent to 45 percent for Cortez Masto — making the two statistically tied in the race. \nRELATED: Koch-Backed Group Spends Millions in Ohio, Nevada Races \nPrior to the \"Terrible Thursday\" developments, however, some Democrats in the state said they were concerned about Heck's lead in the polls. \nYvanna Cancela, political director of the state's powerful Culinary Union, which has endorsed Cortez Masto, , described those polls as \"unnerving, especially in what is definitely going to be a very close race.\" \nCancela said she was particularly concerned that Cortez Masto's lack of name recognition may leave some Latino votes on the table. \n\"There's still a lot of getting to know the candidates that needs to happen,\" she said, pointing to a mid-September Univision News poll that showed 38 percent of Nevada Hispanics aren't familiar enough with Cortez Masto to have an opinion on her; 41 percent said the same of Heck. \nAmong Latinos who did know the candidates, however, Cortez Masto led 58 percent to Heck's 24 percent. \nBut Cancela said that GOP messaging in particular is dampening Latino enthusiasm for the election, a trend that, if it continues, could spell trouble for Democrats up and down the ballot on Election Day. \n\"To say the level of [Latino] excitement is going to reach what it did in 2008 or even 2012 is not fair, because the political climate that Trump & the Republican Party have created doesn't allow for it,\" she said. \nNevada remains one of the GOP's top pickup opportunities, and they're not ceding anything to Democrats — including the Latino vote. Heck's campaign is targeting them with Spanish-language ads, and a number of Koch-backed groups are also actively working to win over Latinos and turn them out to the polls in November. Play ", "external_links": [], "published": "2016-10-04T08:00:00.000+03:00", "crawled": "2016-10-04T16:51:13.315+03:00", "highlightTitle": ""}