{"organizations": [], "uuid": "326b7a5c7d5a72c9eecc271252844e68b1be0e5a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nbcnews.com", "main_image": "http://media3.s-nbcnews.com/j/newscms/2016_07/1427351/dem_2016_clinton-jpeg-03ed2_5b864ce61e1f2bebbd2c3b7ec67e6f2a.nbcnews-fp-1200-800.jpg", "site_section": "", "section_title": "", "url": "http://www.nbcnews.com/news/asian-america/clinton-holds-41-point-lead-over-trump-among-asian-american-n659416", "country": "US", "domain_rank": 478, "title": "Clinton Holds 41-Point Lead Over Trump Among Asian-American Voters: Survey - NBC News", "performance_score": 0, "site": "nbcnews.com", "participants_count": 0, "title_full": "Clinton Holds 41-Point Lead Over Trump Among Asian-American Voters: Survey - NBC News", "spam_score": 0.014, "site_type": "news", "published": "2016-10-06T02:40:00.000+03:00", "replies_count": 0, "uuid": "326b7a5c7d5a72c9eecc271252844e68b1be0e5a"}, "author": "Charles Lam", "url": "http://www.nbcnews.com/news/asian-america/clinton-holds-41-point-lead-over-trump-among-asian-american-n659416", "ord_in_thread": 0, "title": "Clinton Holds 41-Point Lead Over Trump Among Asian-American Voters: Survey - NBC News", "locations": [], "entities": {"persons": [{"name": "clinton", "sentiment": "negative"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "damian dovarganes", "sentiment": "none"}, {"name": "ramakrishnan", "sentiment": "none"}, {"name": "barack obama", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "mitt romney", "sentiment": "none"}, {"name": "charles lam", "sentiment": "none"}, {"name": "karthick ramakrishnan", "sentiment": "none"}], "locations": [{"name": "united states", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}, {"name": "virginia", "sentiment": "none"}, {"name": "pacific islander", "sentiment": "none"}, {"name": "north carolina", "sentiment": "none"}, {"name": "san gabriel", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}, {"name": "nevada", "sentiment": "none"}, {"name": "asian america", "sentiment": "none"}, {"name": "ohio", "sentiment": "none"}], "organizations": [{"name": "presidential election forum  when", "sentiment": "none"}, {"name": "nbc news", "sentiment": "none"}, {"name": "national asian american survey", "sentiment": "none"}, {"name": "nbc", "sentiment": "none"}, {"name": "diversity front", "sentiment": "none"}, {"name": "instagram", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "pacific islanders", "sentiment": "none"}, {"name": "ap", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Why the Latino and Asian American vote matters 10:15 autoplay autoplay Copy this code to your website or blog <iframe src=\"http://www.nbcnews.com/widget/video-embed/690579011652\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen></iframe> \nWhen taking into account voters leaning one way or the other, Clinton's lead grows to 43 points, with 59 percent of registered voters intending to or leaning toward voting for Clinton compared to 16 percent for Trump and 16 percent who were undecided or refused to answer. \nRELATED: Asian-American Voters Tip Toward Dems Headed into 2016 Election: Study \n\"The big takeaway is a continuation of what we saw in the Spring 2016 survey — an Asian-American population that was become more Democratic over time,\" Karthick Ramakrishnan, the survey's director, told NBC News. \"We see that Trump is likely a significant reason for that shift. Trump's unfavorables are like nothing we've seen before.\" A chart from the Fall 2016 National Asian American Survey detailing who respondents intended to or leaned toward voting for. Courtesy of the National Asian American Survey \nThe survey found that 67 percent of surveyed voters had a \"very unfavorable\" or \"unfavorable\" opinion of Trump, compared to 36 percent for Clinton. \nRELATED: Immigration, Diversity Front and Center at 'Quad-Partisan' Presidential Election Forum \nWhen asked about what the most important issue facing the United States was, 26 percent of respondents said that the economy was most important, followed by 12 percent saying national security, and 10 percent saying racism, with 23 percent of Asian-American voters under the age of 34 said that racism was the most important issue facing the country. Fifty-eight percent of respondents has a \"very unfavorable\" or \"unfavorable\" opinion of the Republican party, while nine percent held \"somewhat favorable\" or \"very favorable\" views. Regarding the Democratic party, 30 percent of respondents held \"very unfavorable\" or \"somewhat unfavorable\" views compared to 60 percent who had \"somewhat favorable\" or \"very favorable\" views. Democratic presidential candidate Hillary Clinton is welcomed by Asian American and Pacific Islander supporters in San Gabriel, Calif., on Thursday, Jan. 7, 2016. Damian Dovarganes / AP \nThe survey also polled respondents on a variety of issues, including the Affordable Care Act, federal assistance for college, allowing Muslims into the United States, Syrian refugees, and marijuana legalization. \"Even in states with a smaller Asian-American population like Ohio and Florida, they could play a role given how close those races are.\" \nWhen asked about the most important issues facing them personally, 19 percent of respondents said the economy, followed by healthcare at 13 percent, and both national security and education at seven percent. \nIn 2012, 68 percent of Asian-American voters cast ballots for Pres. Barack Obama, compared to 31 percent for Mitt Romney, according to a 2012 post-election review by the National Asian American Survey. As of 2014, Asian Americans and Pacific Islanders represented five percent of eligible voters and six percent of the United States resident population, according to Ramakrishnan. \nRELATED: Asian-American Population Surges, But Voter Turnout Still Lacks \n\"The electorate is important, one, for the presidential election, there are a few states like Virginia and Nevada and North Carolina where they will likely help to determine the outcome,\" Ramakrishnan said. \"Even in states with a smaller Asian-American population like Ohio and Florida, they could play a role given how close those races are.\" \nFollow NBC Asian America on Facebook , Twitter , Instagram , and Tumblr . Charles Lam ", "external_links": [], "published": "2016-10-06T02:40:00.000+03:00", "crawled": "2016-10-05T21:41:40.608+03:00", "highlightTitle": ""}