{"organizations": [], "uuid": "b4e462b5a80c56d455f91310248dee22ddc08cc2", "thread": {"social": {"gplus": {"shares": 2}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 152, "shares": 152, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nbcnews.com", "main_image": "http://media3.s-nbcnews.com/j/newscms/2016_41/1747851/ss-161003-webb-calle-05_e940d1c63fec2046d72813f4dbec3c6b.nbcnews-fp-1200-800.jpg", "site_section": "", "section_title": "", "url": "http://www.nbcnews.com/slideshow/street-photographer-alex-webb-captures-mexicos-complexity-over-30-years-n665186", "country": "US", "domain_rank": 478, "title": "Street Photographer Captures Mexico's Complexity Over 30 Years - NBC News", "performance_score": 1, "site": "nbcnews.com", "participants_count": 0, "title_full": "Street Photographer Captures Mexico's Complexity Over 30 Years - NBC News", "spam_score": 0.062, "site_type": "news", "published": "2016-10-12T08:00:00.000+03:00", "replies_count": 0, "uuid": "b4e462b5a80c56d455f91310248dee22ddc08cc2"}, "author": "Natalia Jimenez", "url": "http://www.nbcnews.com/slideshow/street-photographer-alex-webb-captures-mexicos-complexity-over-30-years-n665186", "ord_in_thread": 0, "title": "Street Photographer Captures Mexico's Complexity Over 30 Years - NBC News", "locations": [], "entities": {"persons": [{"name": "natalia ji", "sentiment": "negative"}, {"name": "— octavio paz  throughout mexico", "sentiment": "none"}, {"name": "menez  alex webb", "sentiment": "none"}, {"name": "alex webb", "sentiment": "none"}, {"name": "webb", "sentiment": "none"}], "locations": [{"name": "mexico", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "brooklyn", "sentiment": "none"}, {"name": "new england", "sentiment": "none"}, {"name": "indianapolis", "sentiment": "none"}, {"name": "guanajuato", "sentiment": "none"}, {"name": "oaxaca", "sentiment": "none"}], "organizations": [{"name": "nbc news", "sentiment": "negative"}, {"name": "la calle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Oct 12 2016, 6:09 pm ET Street Photographer Captures Mexico's Complexity Over 30 Years by Natalia Jimenez \nAlex Webb's vibrant Mexican street scenes, taken over three decades, are published in his new book \"Alex Webb: La Calle.\" 12 Photos Comment 1. \n\"The truth is that the history of Mexico is a history in the image of its geography: abrupt and tortuous. Each historical period is like a plateau surrounded by tall mountains and separated from the other plateaus by precipices and divides.\" — Octavio Paz \nThroughout Mexico, life spills onto the streets, as sidewalks and avenues become a place to gather, learn or entertain. Alex Webb was first drawn to the richness and complexity that plays out in the country's \"calles,\" or streets, over three decades ago. \n\"I was startled and fascinated by this country, so close to the United States and yet so far culturally,\" Webb, who grew up in New England, told NBC News. \"I was intrigued by the vibrancy — the sense of energy — of life on the street in Mexico.\" \nAfter early visits to border towns where the influence of American culture was unavoidable, Webb continued to return, each time venturing deeper into the country and always letting his curiosity guide his camera. \n\"Between 1975 and 2007, I photographed in Mexico more consistently than any other place in the world,\" he said. \nThe increasing violence Mexico has recently faced from the drug cartels prompted Webb to revisit his work in the country. \n\"Though the Mexico that I have experienced over the years has sometimes had a violent edge, the level of brutality — beheadings, bodies hung from road overpasses —in the current drug wars seems alien to the world of Mexico that I encountered when I first started making trips to Oaxaca in the early 1980s,\" he said. \nWebb's visual explorations from his time in Mexico come together in \"La Calle,\" published this fall by Aperture. Essays by Mexican authors accompany Webb's images, articulating what the country's streets mean to them. Together they create a glimpse of a country fighting to balance its rich history with a modern culture. \nThe allure of Mexico's culture may never fade for Webb, despite fewer recent visits. \n\"Interestingly enough, now that I am trying to photograph more in the United States, I find myself drawn to the vibrant street life in Mexican communities in such disparate places as Indianapolis and Brooklyn.\" \nAbove: León, Guanajuato, 1987 ", "external_links": [], "published": "2016-10-12T08:00:00.000+03:00", "crawled": "2016-10-13T01:45:36.961+03:00", "highlightTitle": ""}