{"organizations": [], "uuid": "169d902f6d7bf25fb8842699d438a96b825a83c5", "thread": {"social": {"gplus": {"shares": 2}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 510, "shares": 510, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nbcnews.com", "main_image": "http://media2.s-nbcnews.com/j/newscms/2016_40/1737466/161005-world-uk-foreign-workers-rudd-1055_a9aae3857746e4921232dbba940e1542.nbcnews-fp-1200-800.jpg", "site_section": "", "section_title": "", "url": "http://www.nbcnews.com/storyline/brexit-referendum/british-plan-force-employers-list-foreign-workers-faces-backlash-n660251", "country": "US", "domain_rank": 478, "title": "British Plan to Force Employers to List Foreign Workers Faces Backlash - NBC News", "performance_score": 5, "site": "nbcnews.com", "participants_count": 0, "title_full": "British Plan to Force Employers to List Foreign Workers Faces Backlash - NBC News", "spam_score": 0.033, "site_type": "news", "published": "2016-10-05T08:00:00.000+03:00", "replies_count": 0, "uuid": "169d902f6d7bf25fb8842699d438a96b825a83c5"}, "author": "Alexander Smith", "url": "http://www.nbcnews.com/storyline/brexit-referendum/british-plan-force-employers-list-foreign-workers-faces-backlash-n660251", "ord_in_thread": 0, "title": "British Plan to Force Employers to List Foreign Workers Faces Backlash - NBC News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Oct 5 2016, 11:02 am ET British Plan to Force Employers to List Foreign Workers Faces Backlash by Alexander Smith UK Will Begin Process to Leave EU by March 2017 0:28 autoplay autoplay Copy this code to your website or blog <iframe src=\"http://www.nbcnews.com/widget/video-embed/777681987787\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen></iframe> \nLONDON — Britain's government has announced controversial plans that would force businesses to declare how many foreign workers they employ, amid concern over immigration. \nU.K. minister Amber Rudd faced accusations of xenophobia and even racism Wednesday after revealing the plans at the annual conference of the country's ruling Conservative Party. \n\"The purpose of this review is whether [businesses are] doing enough to train people locally,\" Rudd told the BBC early Wednesday. Without giving a timetable for the consultation, Rudd said she wanted to \"flush out\" businesses that looked abroad rather than employing or training British workers. Amber Rudd delivers her speech to at the conference of Britain's Conservative Party. James Gourley/REX/Shutterstock / Shutterstock \nThe proposal is one of several measures designed to reduce annual net migration from more than 300,000 to the government's long-stated goal of \"tens of thousands.\" Immigration was one of the main concerns of people who voted to leave the European Union during June's Brexit referendum . \nOf the 31.7 million workforce at the end of June, 5.4 million were born outside the country, according to Reuters. \nThe plan has angered some business leaders, with Adam Marshall, acting director-general of the British Chambers of Commerce, telling the BBC that he thought firms would be \"saddened if they felt that having a global workforce was somehow seen as a badge of shame.\" \nJames O'Brien, a talk shot host on radio station LBC, likened the proposals to \"Mein Kamf,\" the 1925 book by Adolf Hitler in which he outlined his nationalist ideology. O'Brien read out what he said was a line from Rudd's conference speech before revealing it was in fact a passage by Hitler. \nRudd defended her plans Wednesday. \"We should be able to have a conversation about immigration,\" she told the BBC. \"If we do talk about immigration, don't call me a racist.\" Alexander Smith ", "external_links": [], "published": "2016-10-05T08:00:00.000+03:00", "crawled": "2016-10-06T02:12:30.661+03:00", "highlightTitle": ""}