{"organizations": [], "uuid": "8caf549b3684b79734a17735c50661d5a7bb7664", "thread": {"social": {"gplus": {"shares": 1}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 708, "shares": 708, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nbcnews.com", "main_image": "http://media3.s-nbcnews.com/j/newscms/2016_42/1757866/gook2_ec42f4320ee5766083d39006b2054464.nbcnews-fp-1200-800.jpg", "site_section": "http://www.nbcnews.com/News/asian-america", "section_title": "Asian America – Asian American News &amp; Top Stories - NBC News", "url": "http://www.nbcnews.com/news/asian-america/justin-chon-explores-untold-aspect-la-riots-short-film-called-n669286", "country": "US", "domain_rank": 478, "title": "Justin Chon Explores 'Untold Aspect' of LA Riots in Short Film Called 'Gook'", "performance_score": 7, "site": "nbcnews.com", "participants_count": 1, "title_full": "Justin Chon Explores 'Untold Aspect' of LA Riots in Short Film Called 'Gook' - NBC News", "spam_score": 0.337, "site_type": "news", "published": "2016-10-20T21:04:00.000+03:00", "replies_count": 0, "uuid": "8caf549b3684b79734a17735c50661d5a7bb7664"}, "author": "Stephany Bai", "url": "http://www.nbcnews.com/news/asian-america/justin-chon-explores-untold-aspect-la-riots-short-film-called-n669286", "ord_in_thread": 0, "title": "Justin Chon Explores 'Untold Aspect' of LA Riots in Short Film Called 'Gook'", "locations": [], "entities": {"persons": [{"name": "justin chon", "sentiment": "negative"}, {"name": "david so", "sentiment": "none"}, {"name": "kamilla", "sentiment": "none"}, {"name": "kickstarter", "sentiment": "none"}, {"name": "kim", "sentiment": "none"}, {"name": "kamal", "sentiment": "none"}], "locations": [], "organizations": [{"name": "la riots", "sentiment": "negative"}, {"name": "nbc news", "sentiment": "none"}, {"name": "youtube", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "I do make the distinction in my film. Not only is there African American and Korean American relations, it also talks about the inter-generational conflicts. There's a [character] named Mr. Kim who owns the liquor store across the street, and he's constantly fighting with the two brothers. That's how it is. They think, especially amongst Koreans, we're one team , but even within our culture there's a huge disparity between immigrants and the second generation that gets born here. I think that gets overlooked and we get grouped into \"Koreans.\" At that time I think the cultural disparity was even bigger. I think it's become a little better in terms of communication between parents and kids, but back then it was old country versus new country. That's a big part of the film as well.\nIf I didn't take it upon myself, these stories would not get told. What was the most difficult aspect of creating this movie?\nThe whole thing was really difficult. As you know, we're still trying to raise money on Kickstarter, so the financing was really difficult. But in terms of writing it, I was really sensitive with the Korean aspect of it and how Koreans were going to be portrayed, and also how African Americans were going to be portrayed. And gender! The main character is Kamilla, an 11-year-old African-American girl. Originally [the character] was a boy Kamal. I actually had other female characters in the film, but I had to cut some stuff away because of length and focusing on the real story. When I did that I didn't feel [the female perspective] got enough either, so I reworked Kamal into Kamilla and I think it was the best choice I could have made.\nKamilla, one of the characters in Justin Chon's \"Gook\" Birthday Soup Films It seems like a lot of thought went into making sure you had a range of voices represented in the movie.\nAbsolutely. I can't be perfect, and you know, it's a film. People are going to get mad, no matter what. Even the nature of the title, \"Gook,' is going to arouse some backlash and argument, I'm sure. I can't service everybody, but I was really conscious of what I was doing. I did try as best as I could. It is still from the Korean-American standpoint because it's a film. It needs to be from a point of view.\nYour op-ed for us in March got a great response in that a lot of people identified and thanked you for speaking out about a widespread problem in the industry. How do you feel the industry is changing with regards to representation, and how can we help continue improvement?\nI do feel it's very important that when there's a project worth investing in that we should speak with our wallets — which is kind of taboo for Asians, to talk about money, but it's so important. Film is the most expensive art form, but it's also the most wide-reaching art form. It has a life, where, after it comes out, future generations can come back and look at it. In terms of speaking out, I think that's also starting to change. There are people who are very vocal about their opinions on the industry and everything. I'm hopeful, but we still have a tremendously long way to go.\nI think people were really scared about losing their jobs or being the one that was going to be in the spotlight for speaking out. And it's valid. You don't want to jeopardize your career. It's sort of like a power in numbers, though, and if we don't band together and be vocal then how will they will acknowledge or be aware that anything is wrong in the first place.\nRelated: ' April's Way' Captures Stories of Korean-American Merchants During L.A. Riots\nIt seems like you've been making more of a push into a behind-the-scenes role, whether it's directing or writing or producing.\nI do it out of necessity. It's a lot of work. You have to worry about a lot of stuff that I don't want to worry about. You're kind of like the CEO of a company, you have to manage a lot of different personalities. It's not something I really enjoy doing. I'm also responsible for everything: how it looks, the music that gets used, the message. And if something goes wrong, I get the flak. Being in that position isn't the best.\nTruthfully I love being an actor. Being an actor is the best because I get to express myself through my instrument. But if I don't [tell this story], it won't get told. Truthfully I love being an actor. Being an actor is the best because I get to express myself through my instrument. But if I don't [tell this story], it won't get told. This is a cross section of people, like these two brothers, who I've never seen in a movie, ever.\nI've never seen this type of Korean American ever represented in a film. They're not smart, they're just trying to make it work, they're really blue collar. Most films about Korean Americans are about a kid who's trying to get into college, or their parents are pressuring them into being a doctor or lawyer, or their mom is a tiger mom. It has nothing to do with that in this film. These two brothers are just trying to survive.\nRelated: Editorial: I Walked Out On a Racist Audition\nThey got left this store, and their dad got shot outside their store. They're left with this thing they feel an obligation towards, that their dad worked so hard for. At the same time, that's not their dream, but they didn't go to college. A lot of my friends are like that. And then you have Mr. Kim, who's more of the de facto Korean immigrant who opened a liquor store and all that.\nIf I didn't take it upon myself, these stories would not get told. I feel like no one should have an excuse, because I'm doing it. I want to hear different perspectives. That's what's so great about art. I think people are so worried about what other people will think, but I think that's the beauty of it. That we all come from different experiences. I would just implore people to create and put their voices out there. If you're aspiring to some artistic endeavors, you should do it. If you wait to support other people, it will take longer.\nActor David So in a still from \"Gook.\" Birthday Soup Films I was also surprised to see David So, who's known on YouTube for his comedy, taking on a dramatic role.\nI rehearsed with him for a month and a half to make sure he was ready for it. I wrote the part for him, so it was tailored for him. The power of YouTube is self-creation, and I wanted to include someone like that to show that they can cross lines and do things beyond what they're just comfortable with.\nA photo posted by NBC News (@nbcnews)\nWhy was the Kickstarter started, and what will the funds go towards?\nWe did the principal photography for so little, you'd be shocked. For so, so, so, little, and we got so many people to donate their services and time. We were able to get it in the can, and it is an amazing movie. This Kickstarter will help us finish everything, because there's music we'd like to buy, we need to mix the sound, we need to do additional dialogue recording, graphics and all that stuff. At least in this phase, I think everyone's being a lot more supportive and I'm really thankful for that.\nJustin Chon in \"Gook.\" Birthday Soup Films And the goal is, this is a really festival-type movie. I think it's a beautiful movie, not just because it's my movie, but I think it's dynamic and the storylines are so compelling. The biggest thing for me in this film is the characters. The characters are so fully fleshed out and compelling, I think that's what the biggest strength is. They're not caricatures. And that's important for Asian Americans, that these are real people.\nWe're basically at our goal, but the way Kickstarter works is that you don't get anything if you don't make your goal. We actually need a lot more, so every dollar really does help make the film better. It exponentially makes the film better and better. The thirty grand lets us finish the bare minimum. I really feel this is an opportunity to put something out in this world that's really unique, and I can bet on that for sure.\nThis interview has been edited for length and clarity.\n ", "external_links": ["http://media1.s-nbcnews.com/j/newscms/2016_42/1757871/justin_chon_286917154d57b92d2420aad5100b6489.nbcnews-ux-600-480.jpg", "http://media1.s-nbcnews.com/j/newscms/2016_42/1757871/justin_chon_286917154d57b92d2420aad5100b6489.nbcnews-ux-2880-1000.jpg", "https://instagram.com/p/BJ53-i9gxDf/", "http://media1.s-nbcnews.com/j/newscms/2016_42/1757846/david_so_bd358e86e9af6000cd8c4dc698ecfc90.nbcnews-ux-600-480.jpg", "http://media2.s-nbcnews.com/j/newscms/2016_42/1757851/gook_3_bfca5a8bc1f939900835af0532ccf0f1.nbcnews-ux-2880-1000.jpg", "http://media1.s-nbcnews.com/j/newscms/2016_42/1757846/david_so_bd358e86e9af6000cd8c4dc698ecfc90.nbcnews-fp-360-360.jpg", "http://www.facebook.com/nbcasianamerica", "http://nbcasianamerica.tumblr.com/", "http://www.instagram.com/nbcasianamerica", "http://media4.s-nbcnews.com/i/newscms/2016_11/1458981/gyi0058419704_5d3c808c039af97b223162a1b251406b.jpg", "http://www.twitter.com/nbcasianamerica", "http://media1.s-nbcnews.com/j/newscms/2016_42/1757871/justin_chon_286917154d57b92d2420aad5100b6489.nbcnews-fp-360-360.jpg", "http://media1.s-nbcnews.com/j/newscms/2016_42/1757846/david_so_bd358e86e9af6000cd8c4dc698ecfc90.nbcnews-ux-2880-1000.jpg", "http://media2.s-nbcnews.com/j/newscms/2016_42/1757851/gook_3_bfca5a8bc1f939900835af0532ccf0f1.nbcnews-fp-360-360.jpg", "http://media2.s-nbcnews.com/j/newscms/2016_42/1757851/gook_3_bfca5a8bc1f939900835af0532ccf0f1.nbcnews-ux-600-480.jpg"], "published": "2016-10-20T21:04:00.000+03:00", "crawled": "2016-10-20T23:12:03.827+03:00", "highlightTitle": ""}