{"organizations": [], "uuid": "58b34d5e07f52713c2aaf2172ac83f1e57a00038", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 92, "shares": 92, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nbcnews.com", "main_image": "http://media4.s-nbcnews.com/j/newscms/2016_40/1738366/kkv-uscis_voting_2_f1db687ab48856c3ad2a202e45cd60c3.nbcnews-fp-1200-800.jpg", "site_section": "", "section_title": "", "url": "http://www.nbcnews.com/news/asian-america/hawaii-s-kokua-kalihi-valley-health-nonprofit-turning-new-citizens-n660461", "country": "US", "domain_rank": 478, "title": "Hawaii's Kokua Kalihi Valley Health Nonprofit Is Turning New Citizens into New Voters - NBC News", "performance_score": 0, "site": "nbcnews.com", "participants_count": 0, "title_full": "Hawaii's Kokua Kalihi Valley Health Nonprofit Is Turning New Citizens into New Voters - NBC News", "spam_score": 0.004, "site_type": "news", "published": "2016-10-06T08:00:00.000+03:00", "replies_count": 0, "uuid": "58b34d5e07f52713c2aaf2172ac83f1e57a00038"}, "author": "Chris Fuchs", "url": "http://www.nbcnews.com/news/asian-america/hawaii-s-kokua-kalihi-valley-health-nonprofit-turning-new-citizens-n660461", "ord_in_thread": 0, "title": "Hawaii's Kokua Kalihi Valley Health Nonprofit Is Turning New Citizens into New Voters - NBC News", "locations": [], "entities": {"persons": [{"name": "hillary clinton", "sentiment": "none"}, {"name": "acido", "sentiment": "none"}, {"name": "ashley galacgac", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "ronald reagan", "sentiment": "none"}, {"name": "jeffrey tangonan acido", "sentiment": "none"}, {"name": "chris fuchs", "sentiment": "none"}], "locations": [{"name": "hawaii", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "philippines", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "federated states of micronesia", "sentiment": "none"}, {"name": "oahu", "sentiment": "none"}, {"name": "galacgac", "sentiment": "none"}, {"name": "honolulu", "sentiment": "none"}, {"name": "d.c.", "sentiment": "none"}, {"name": "asian america", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "kalihi", "sentiment": "none"}, {"name": "west virginia", "sentiment": "none"}], "organizations": [{"name": "kokua kalihi valley health nonprofit is turning new citizens", "sentiment": "negative"}, {"name": "nbc news oct", "sentiment": "negative"}, {"name": "state office of elections", "sentiment": "none"}, {"name": "u.s. citizenship and immigration services", "sentiment": "none"}, {"name": "pew research", "sentiment": "none"}, {"name": "u.s. census", "sentiment": "none"}, {"name": "american samoa", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "health organizations focus on voter push", "sentiment": "none"}, {"name": "kkv", "sentiment": "none"}, {"name": "nbc news", "sentiment": "none"}, {"name": "acido", "sentiment": "none"}, {"name": "kkv  acido", "sentiment": "none"}, {"name": "nbc", "sentiment": "none"}, {"name": "association of asian pacific community health organizations", "sentiment": "none"}, {"name": "american samoans", "sentiment": "none"}, {"name": "kokua kalihi valley comprehensive family services", "sentiment": "none"}, {"name": "instagram", "sentiment": "none"}, {"name": "united states election project", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Oct 6 2016, 8:33 am ET Hawaii's Kokua Kalihi Valley Health Nonprofit Is Turning New Citizens into New Voters by Chris Fuchs The oath of citizenship is administered at a U.S. Citizenship and Immigration Services swearing-in ceremony in Honolulu, Hawaii, on June 7, 2016. Courtesy of KKV Share advertisement \nIn the 2012 general election, Hawaii had the lowest percentage of registered voters and the lowest voter turnout in all 50 states, according to the U.S. Census and the United States Election Project . Those numbers have led one organization on the island of Oahu to visit local festivals and citizenship swearings-in, in an effort to bring more Hawaiians to the polls come November. \nKokua Kalihi Valley Comprehensive Family Services (KKV), a community health nonprofit in Honolulu founded in the 1970s, began its voter registration push last March, with staff first talking about how they and their communities feel about voting, Ashley Galacgac, program coordinator of community education and civic engagement, told NBC News. KKV is a member of the Association of Asian Pacific Community Health Organizations (AAPCHO), which has done similar work with its \"My Health, My Vote\" initiative. \"The first act as an American citizen is voting or registering to vote, which I think is significant considering many Americans who are born here don't even vote as a first act.\" \nHawaii's deadline to register to vote in the general election is Oct. 10, according to the state Office of Elections website. \n\"The first act as an American citizen is voting or registering to vote, which I think is significant considering many Americans who are born here don't even vote as a first act,\" Jeffrey Tangonan Acido, KKV program manager of community education and civic engagement, told NBC News. \nRELATED: Health Organizations Focus on Voter Push with 'My Health, My Vote' \nLooking to register new voters, KKV both last and this summer attended the Crop Shop Food Festival in Kalihi, a program to connect farmers and their local products to the community, Galacgac and Acido said. But complicating the group's efforts, Acido said, is the fact that 30 to 40 percent of residents living in Kalihi, a Honolulu neighborhood, are ineligible to vote. \nAcido said that's because Kalihi has a large population from the Federated States of Micronesia, American Samoa, and the Philippines. The Compact of Free Association , signed into law by President Ronald Reagan in 1986, allows Micronesian residents to live, work, and study in the U.S. without visas. Many, in turn, migrate to nearby Hawaii and, according to Acido, live in Kalihi's public housing. \nAmerican Samoans can vote in presidential primaries, though not in the general election. Filipinos, who Acido said make up at least 25 percent of Kalihi's population, are often not citizens or are undocumented and thus cannot cast ballots. Post by NBC News . \nKKV, Acido said, has had better success registering voters after citizenship ceremonies in Honolulu, the capital of Oahu. Those are often held twice a month, with as many as 50 to 100 people taking the oath, he said. At those events, KKV can sometimes get up to 60 percent of new citizens to fill out voter paperwork, according to Acido. \nBut the rub, community activists say, is translating voter registrations into voter turnout, both of which in Hawaii have been among the country's lowest. \nThe U.S. Census reported that in 2012, 54.1 percent of Hawaii's then 1,013,000 residents were registered to vote. On Election Day that year, just 44.5 percent of Hawaiians cast ballots, according to the United States Election Project, placing the state last in getting voters to the polls. ( West Virginia was about tied with Hawaii for that distinction.) \"I think that's the reflection of the low voter turnout that we're experiencing, that's really complicated in Hawaii, [and] that many people don't understand, including ourselves.\" \nAcido, a Filipino immigrant and naturalized U.S. citizen, said he believes many Native Hawaiians prefer to be left alone and not engage with the government. \n\"I think that's the reflection of the low voter turnout that we're experiencing, that's really complicated in Hawaii, [and] that many people don't understand, including ourselves,\" he said. \nThe physical distance between Hawaii and Washington, D.C., Acido added, also serves to sharpen the political disconnect. \nIt's unclear how this year's presidential race between Donald Trump and Hillary Clinton will affect registration and voter turnout rates in Hawaii. Pew Research reported in June that nationwide participation this primary season was high, with 28.5 percent of estimated eligible voters casting ballots. But it still fell short of record turnout in 2008, when 30.4 percent of voting-age citizens went to the polls for both Republican and Democratic primaries, according to Pew. Jeffrey Tangonan Acido signs up a new citizen to vote after a U.S. Citizenship and Immigration Services swearing-in ceremony in Honolulu on June 7, 2016. Courtesy of KKV \nAcido said his organization doesn't have the funding to follow up to see whether KKV's voter registration initiative has paid off. While not all Asian Americans, Native Hawaiians, and Pacific Islanders might be sold on voting, Acido added that doing so does have benefits. \n\"It gets money towards our community, it gets resources toward our community, it passes policies like marriage equality, it passes policies that improve housing, it raises the minimum wage,\" he said, noting that empowering a community to solve its own problems is also important. \nFollow NBC Asian America on Facebook , Twitter , Instagram , and Tumblr . Chris Fuchs ", "external_links": [], "published": "2016-10-06T08:00:00.000+03:00", "crawled": "2016-10-06T20:03:10.013+03:00", "highlightTitle": ""}