{"organizations": [], "uuid": "4093739a9cff3d33fd0384f29880b383c2bc40a0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 21, "shares": 21, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nbcnews.com", "main_image": "http://media1.s-nbcnews.com/j/newscms/2015_37/1218416/hispanics_vote_3761c70d0084fa2d949870d350c12aa5.nbcnews-fp-1200-800.jpg", "site_section": "", "section_title": "", "url": "http://www.nbcnews.com/storyline/election-day-2016/early-latino-turnout-numbers-give-reason-optimism-concern-n673341", "country": "US", "domain_rank": 478, "title": "Early Latino Turnout Numbers Give Reason for Optimism and Concern - NBC News", "performance_score": 0, "site": "nbcnews.com", "participants_count": 0, "title_full": "Early Latino Turnout Numbers Give Reason for Optimism and Concern - NBC News", "spam_score": 0.329, "site_type": "news", "published": "2016-10-26T08:00:00.000+03:00", "replies_count": 0, "uuid": "4093739a9cff3d33fd0384f29880b383c2bc40a0"}, "author": "Stephen A. Nu O", "url": "http://www.nbcnews.com/storyline/election-day-2016/early-latino-turnout-numbers-give-reason-optimism-concern-n673341", "ord_in_thread": 0, "title": "Early Latino Turnout Numbers Give Reason for Optimism and Concern - NBC News", "locations": [], "entities": {"persons": [{"name": "stephen", "sentiment": "negative"}, {"name": "stephen a. nuño", "sentiment": "none"}, {"name": "bernie sanders", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "george p. bush", "sentiment": "none"}, {"name": "catherine cortez masto", "sentiment": "none"}, {"name": "chelsea clinton", "sentiment": "none"}, {"name": "arturo vargas", "sentiment": "none"}, {"name": "cortez masto", "sentiment": "none"}, {"name": "michelle obama", "sentiment": "none"}, {"name": "sanders", "sentiment": "none"}, {"name": "clinton", "sentiment": "none"}, {"name": "sanchez", "sentiment": "none"}, {"name": "joe heck", "sentiment": "none"}, {"name": "loretta sanchez", "sentiment": "none"}, {"name": "stephen nuño", "sentiment": "none"}, {"name": "kamala harris", "sentiment": "none"}, {"name": "harry reid", "sentiment": "none"}, {"name": "barbara boxer", "sentiment": "none"}], "locations": [{"name": "california", "sentiment": "none"}, {"name": "lone star state", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "north carolina", "sentiment": "none"}, {"name": "arizona", "sentiment": "none"}, {"name": "flagstaff", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}, {"name": "phoenix", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}, {"name": "nevada", "sentiment": "none"}], "organizations": [{"name": "nbc news", "sentiment": "negative"}, {"name": "congress", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "national association of elected", "sentiment": "none"}, {"name": "northern arizona university", "sentiment": "none"}, {"name": "senate", "sentiment": "none"}, {"name": "texas monthly", "sentiment": "none"}, {"name": "state", "sentiment": "none"}, {"name": "isis", "sentiment": "none"}, {"name": "gop", "sentiment": "none"}, {"name": "naleo", "sentiment": "none"}, {"name": "nbc latino contributor", "sentiment": "none"}, {"name": "department of politics and international affairs", "sentiment": "none"}, {"name": "instagram", "sentiment": "none"}, {"name": "u.s. senate", "sentiment": "none"}, {"name": "democratic party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Oct 26 2016, 4:24 pm ET Early Latino Turnout Numbers Give Reason for Optimism and Concern by Stephen A. Nuño advertisement \nWith early voting already underway in key battleground states, outreach and education organizations focused on the Latino community are responding to surveys of early voters with a mix of cautious optimism and concern over the disproportionate turnout numbers between states. \nThe National Association of Elected and Appointed Officials and conducted by the polling firm Latino Decisions conclude in a report that, \"Latino voter contact rates in California, New York and Texas [are] much lower than in battleground states of Arizona, Florida, Nevada and North Carolina.\" \nWith competitive states ripe for picking in a tumultuous Republican campaign headed by Donald Trump, Democrats and the Clinton camp appear to be focused on putting pressure on the GOP in Latino-heavy states that have the greatest potential for electoral gains. \nThe Clinton campaign sent Bernie Sanders, Chelsea Clinton, and Michelle Obama to Arizona last week. Among their hopes were to mobilize the young Latino population. \nRELATED: Can Latino Vote Help End GOP Reign in Arizona? \n\"We will not elect a president who objectifies women, who boasts about sexual assault…and this is a candidate who says to our Mexican brothers and sisters, you are rapists and you are criminals,\" Sanders said to an enthusiastic crowd in Flagstaff, Arizona. Play Michelle Obama's Delivers Impassioned Speech in Phoenix 1:39 autoplay autoplay Copy this code to your website or blog <iframe src=\"http://www.nbcnews.com/widget/video-embed/790424643562\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen></iframe> \nHeavy investment in battleground states appears to be paying off in votes in Nevada, North Carolina, Arizona, and Florida. \nWith the Democratic Party practically conceding the election in Texas, state party officials continue to struggle with Latino turnout throughout the Lone Star State. The report finds that 70 percent of Latinos in Texas have yet to be contacted with just two weeks to go before Election Day. \nTexas doesn't track voters' ethnicity, but the Texas Secretary of State has reported an increase in Spanish-surname voters, according to Texas Monthly. Spanish surname is not a certain indication of Latino voters as some Latinos have names that would not fit the category, such as George P. Bush and others have married Hispanics and taken their spouse's Spanish surname. Also, Hispanics in Texas vote Republican in higher rates than in many other states. \nArturo Vargas, executive director of NALEO said, \"It is time that the political and funding communities finally put their money where their mouths are by making the investments necessary now to engage Latinos for 2020, 2024 and beyond if we want the nation's second largest population group to realize its true political potential once and for all.\" \nOther key finds from the poll: Top issues for Latino voters varies state-by-state. While immigration ranked first for Latino voters in three states (California, Nevada and North Carolina), Latino voters in the remaining four states viewed other issues as more important. In Arizona and New York, improving wages and incomes was the top issue, while Florida Latino voters were most concerned about combatting terrorism and ISIS. For Texan Latino voters, lowering the cost of health care was the most important issue this election. Latino voters are supporting the Senate bids of U.S. Rep. Loretta Sanchez and former Nevada Attorney General Catherine Cortez Masto. Cortez Masto, a Democrat, has the support of Latino voters (54 percent) in her battle against Republican U.S. Rep. Joe Heck (24 percent) for the seat being vacated by Senate Minority Leader Harry Reid, a Democrat. In the two-way race for the Senate seat being vacated by U.S. Sen. Barbara Boxer, also a Democrat, Latino voters are supporting U.S. Rep. Loretta Sanchez (47 percent) over current California Attorney General Kamala Harris (30 percent). Both are Democrats. If elected, Sanchez and Cortez Masto would be the first Latinas in the U.S. Senate, and the first Latinos from their respective states to serve in Congress' upper chamber. \nStephen Nuño is an Associate Professor in the Department of Politics and International Affairs at Northern Arizona University and an NBC Latino Contributor. \nFollow NBC Latino on Facebook , Twitter and Instagram . Stephen A. Nuño ", "external_links": [], "published": "2016-10-26T08:00:00.000+03:00", "crawled": "2016-10-27T04:17:40.260+03:00", "highlightTitle": ""}