{"organizations": [], "uuid": "bed6a8ffc73dc3be630e69543dffd332c3f2fa74", "thread": {"social": {"gplus": {"shares": 1}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 151, "shares": 151, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nbcnews.com", "main_image": "http://media4.s-nbcnews.com/i/newscms/2016_39/1729736/og-decision2016-200x200_e5e64fd467d815608f9a82df824d6560.gif", "site_section": "", "section_title": "", "url": "http://www.nbcnews.com/card/fla-voter-registration-will-not-be-extended-south-carolina-will-n661371", "country": "US", "domain_rank": 478, "title": "Fla. Voter Registration Will Not Be Extended, South Carolina Will - NBC News", "performance_score": 1, "site": "nbcnews.com", "participants_count": 0, "title_full": "Fla. Voter Registration Will Not Be Extended, South Carolina Will - NBC News", "spam_score": 0.023, "site_type": "news", "published": "2016-10-07T09:40:00.000+03:00", "replies_count": 0, "uuid": "bed6a8ffc73dc3be630e69543dffd332c3f2fa74"}, "author": "Chelsea Bailey", "url": "http://www.nbcnews.com/card/fla-voter-registration-will-not-be-extended-south-carolina-will-n661371", "ord_in_thread": 0, "title": "Fla. Voter Registration Will Not Be Extended, South Carolina Will - NBC News", "locations": [], "entities": {"persons": [{"name": "chelsea bailey", "sentiment": "negative"}, {"name": "kate mckinnon", "sentiment": "none"}, {"name": "alec baldwin", "sentiment": "none"}, {"name": "myers", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "robby mook", "sentiment": "none"}, {"name": "bill clinton", "sentiment": "none"}, {"name": "rick scott", "sentiment": "none"}, {"name": "andrea mitchell", "sentiment": "none"}, {"name": "chelsea clinton", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "clinton", "sentiment": "none"}, {"name": "aj calloway", "sentiment": "none"}, {"name": "mckinnon", "sentiment": "none"}, {"name": "page six", "sentiment": "none"}, {"name": "mook", "sentiment": "none"}, {"name": "jesse ferguson", "sentiment": "none"}, {"name": "scott", "sentiment": "none"}, {"name": "ali vitali", "sentiment": "none"}], "locations": [{"name": "fla", "sentiment": "none"}, {"name": "south carolina", "sentiment": "none"}, {"name": "new hampshire", "sentiment": "none"}, {"name": "panama city", "sentiment": "none"}, {"name": "jacksonville", "sentiment": "none"}, {"name": "miami", "sentiment": "none"}, {"name": "tallahassee", "sentiment": "none"}, {"name": "sunshine state", "sentiment": "none"}, {"name": "pennsylvania", "sentiment": "none"}, {"name": "orlando", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}, {"name": "west palm beach", "sentiment": "none"}], "organizations": [{"name": "nbc news", "sentiment": "negative"}, {"name": "advertising analytics", "sentiment": "none"}, {"name": "pac rebuilding america now", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "latest posts from DECISION 2016 Chelsea Bailey 2 hours ago Fla. Voter Registration Will Not Be Extended, South Carolina Will \nRepublican Florida Governor Rick Scott on Thursday evening said the state will not extend an October 11 voter registration deadline. \n\"I'm not going to extend it,\" Scott said at a news conference on the storm. \"Everybody has had plenty of time to register. I don't intend to make any changes.\" \nSpeaking to NBC News' Andrea Mitchell earlier Thursday, Hillary Clinton campaign spokesman Robby Mook had said they hoped Scott would move the deadline. \n\"We'll get back to campaigning when it is appropriate,\" Mook said. \"Our hope would be that a little bit more time will be given for people who were expecting to be able to get registered before the election.\" \nScott currently serves as national chairman of pro-Trump Super PAC Rebuilding America Now. \nMeanwhile, South Carolina officials extended their voter registration deadline to October 11. 6 hours ago Clinton: 'SNL' Debate Parody Was 'Perfect' \nHillary Clinton told Extra's AJ Calloway that she thought the \"Saturday Night Live\" spoof of her first debate with Republican nominee Donald Trump was \"perfect.\" \n\"When Kate McKinnon came out with the walker I thought I was going to fall off my chair,\" Clinton said. \nHow did the Democratic nominee feel about Alec Baldwin's take on Trump? \"He was amazing. It looks like he had been almost shadowing Trump! I mean his look, his scowling, his staring down and muttering his responses. It was perfect!,\" she told Extra. \nLast October, Clinton appeared alongside McKinnon on \"SNL\" for the sketch \"Bar Talk.\" Asked if she'd consider returning to the show, Clinton quipped that her schedule is pretty full for the next month or so, \"but I'm always up for standing around in a bar.\" 7 hours ago Trump Says He Won't Bring Up Bill Clinton's Past in Next Debate \nDespite alluding to Bill Clinton's infidelity during the first presidential debate, Donald Trump said he will not bring up the former president's past during their second showdown on Sunday. \n\"I want to win this election on my policies for the future, not on Bill Clinton's past,\" Trump told Page Six. \"Jobs, trade, ending illegal immigration, veteran care, and strengthening our military is what I really want to be talking about.\" \nTrump's campaign confirmed the quote to NBC News' Ali Vitali. \nDuring the first debate, the Republican presidential nominee said he refrained from saying \"something extremely rough\" to Hillary Clinton because daughter Chelsea Clinton was in the audience. 9 hours ago Clinton Camp Delays Ads on Weather Channel in Florida \nHillary Clinton's campaign purchased and then suspended ads on the Weather Channel in Florida markets that would have run as the potentially devastating storm hit the Sunshine State. \nThe Clinton campaign purchased $63,000 on the channel in Ft. Myers, Jacksonville, Miami, Orlando, Panama City, Tallahassee, and West Palm Beach from Oct. 6 to 10, according to ad-spending data from Advertising Analytics. \nThe ads would likely have gotten plenty of eyeballs as Floridians prepare for Hurricane Matthew, a Category 4 storm that is expected to hit the state on Friday. But it also opened the Democratic nominee's campaign up for criticism for airing political ads during what could be a deadly storm. \n\"Earlier in the week we made changes to our TV ad reservations across hundreds of stations in several battleground states including Florida,\" Clinton spokesman Jesse Ferguson said. \"Less than 1 percent of those changes included the Weather Channel. We have requested that stations in Florida delay any of those ads on the Weather Channel until after the storm passes.\" \nThe campaign also has added Weather Channel-specific buys in Pennsylvania ($27,000) and New Hampshire ($18,000) during this same timeframe, according to ad-tracking data. Politico first reported Clinton's Florida buy. ", "external_links": [], "published": "2016-10-07T09:40:00.000+03:00", "crawled": "2016-10-07T04:40:17.357+03:00", "highlightTitle": ""}