{"organizations": [], "uuid": "8c3c3782b4f205b99217ac7a0a47984c02de85d9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nbcnews.com", "main_image": "http://nodeassets.nbcnews.com/images/og-nbcnews200x200.gif", "site_section": "", "section_title": "", "url": "http://www.nbcnews.com/card/trump-claims-clinton-might-triple-u-s-population-week-n675676", "country": "US", "domain_rank": 478, "title": "Trump Claims Clinton Might Triple U.S. Population in a Week - NBC News", "performance_score": 0, "site": "nbcnews.com", "participants_count": 0, "title_full": "Trump Claims Clinton Might Triple U.S. Population in a Week - NBC News", "spam_score": 0.001, "site_type": "news", "published": "2016-11-01T00:31:00.000+02:00", "replies_count": 0, "uuid": "8c3c3782b4f205b99217ac7a0a47984c02de85d9"}, "author": "", "url": "http://www.nbcnews.com/card/trump-claims-clinton-might-triple-u-s-population-week-n675676", "ord_in_thread": 0, "title": "Trump Claims Clinton Might Triple U.S. Population in a Week - NBC News", "locations": [], "entities": {"persons": [{"name": "hillary clinton", "sentiment": "none"}, {"name": "clinton", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "george stephanopoulos", "sentiment": "none"}, {"name": "mike mccaul", "sentiment": "none"}, {"name": "clinton said", "sentiment": "none"}], "locations": [{"name": "washington", "sentiment": "none"}, {"name": "new mexico", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}, {"name": "iowa", "sentiment": "none"}, {"name": "d.c.", "sentiment": "none"}, {"name": "south america", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "north carolina", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "north carolina", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}, {"name": "pennsylvania", "sentiment": "none"}, {"name": "ohio", "sentiment": "none"}], "organizations": [{"name": "trump claims clinton might triple u.s. population", "sentiment": "negative"}, {"name": "trump hotel", "sentiment": "none"}, {"name": "fbi", "sentiment": "none"}, {"name": "falsehoods just from trump", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "trump unloads", "sentiment": "none"}, {"name": "american bridge", "sentiment": "none"}, {"name": "pac", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "latest posts from WHAT ARE THE FACTS? 3 hours ago Trump Claims Clinton Might Triple U.S. Population in a Week \n\"She wants to let people just pour in… You could have 650 million people pour in and we'd do nothing about it. Think of that,\" Trump said last night in New Mexico. \"That's what could happen. You triple the size of our country in one week.\" \nThis is a baseless claim, so much so that it's hard to pick out an accurate portion of Clinton's policy platform to correct it with. But here's a start: Clinton has called for comprehensive immigration reform and for the resettling for 10,000-60,000 Syrian refugees. She would offer a pathway to citizenship to many of the nation's 11 million undocumented immigrants already living in the country, and she vows to strengthen American borders. She has not called for open borders or tripling the nation's size. \nIt's also unclear clear where Trump believes all these people would come from; there aren't that many people in Mexico, Canada, or even all of South America. 2 days ago Fact Checking Everything Trump and Clinton Said About the FBI's Email Review \nDonald Trump championed the news that the FBI is reviewing additional emails \"pertinent\" to previous investigations into Hillary Clinton's private email server as a game changer on Friday. But much of Trump's rhetoric about the Clinton emails is riddled with errors, while the Democratic nominee herself obscured how the news of the additional email review was released. \nWe fact checked everything both candidates said on Friday, and will continue doing so. 3 days ago 18 Falsehoods Just From Trump's Thursday Night \nFrom extreme Obamacare tax hikes to allegations of widespread corruption by Hillary Clinton and her allies, Donald Trump's Thursday night offered up 18 inaccuracies — an impressive feat even for a campaign that has spawned an cottage industry of fact checkers. 4 days ago Trump is Presented With Facts About Recent Hacks — Ignores Them \nGood Morning America's George Stephanopoulos fact checked Donald Trump in real time Thursday morning over connections between Russia and hacks of Democratic operatives. Despite evidence that both parties have been briefed by U.S. officials about the Russian government's attempts to interfere with the 2016 election, Trump largely ignored him. Take a read. \nABC: All 17 U.S. intelligence agencies believe the Russians are behind that leak, why don't you believe it? \nTrump: I don't know if they're behind it and I think it's a public relations frankly. You know what does bother me? I have nothing— \nABC: But you were even told that by the Republican head of the homeland security committee, Mike McCaul. He said the same thing. \nTrump: I don't know what he said. \nABC: He told you that he thought the Russians were behind it. \nTrump: Hacking is very interesting. Hacking is very hard to determine who did what, okay. You know that. People are hacking all over the place, nobody knows. They don't know if it's Russia. They can't guarantee it's Russia and it may be. 5 days ago Clinton Slams Trump Hotel, Assuming Intent Along the Way \n\"If you have friends who are thinking of voting for Trump, I want you to tell them that he relied on undocumented workers to make his project cheaper, and most of the products in the rooms were made overseas, and he even sued to get his taxes lowered. But we know he's used undocumented workers, and that's one of the things that he has run his campaign on, about deporting undocumented workers. Well, he's used undocumented. He's made his products in foreign countries. He's used Chinese steel instead of American steel. So, you know, you can talk a good game but let's look at the facts, and the facts show he has stiffed American workers, he has stiffed American businesses,\" Hillary Clinton said on Wednesday while criticizing her rival for attending the ribbon-cutting at his new luxury hotel in Washington, D.C. \nThere's no evidence that Trump purposefully hired undocumented workers to make his project cheaper, though there is evidence that some workers are indeed undocumented. We also don't know whether \"most\" of the products in the rooms were made overseas, though American Bridge, a Democratic super PAC, does appear to have photos showing that many of the products were made elsewhere . \nThe rest of her statement, however, is true. 6 days ago Trump's Assessment of the Race Isn't Accurate \nTo hear Trump tell it, the presidential race is going great: he's winning everything, he'll likely be elected in just two short weeks. But based on the polls and facts at hand, that's just not right. \nHere's what he got right, and wrong, on the state of the race from Tuesday's Florida race. \n\"We're going to have a great victory. We're leading Iowa, we're leading Ohio, we're doing great in north Carolina, Pennsylvania we're going to a lot, I think we're going to do great there.\" \nUnlikely, true, true, false, and unlikely. Trump is polling poorly nationally, and his chances at winning in two weeks are slim. He is leading on average in Iowa and Ohio, but he's trailing by an average of two points in North Carolina and an average of nearly six points in Pennsylvania. \n\"Seventy-five percent of the American people think our country is on the wrong track. Every poll says it. We are going to fix it.\" \nThe polls don't say that: on average, 64 percent — not 75 percent — of people say the country is on the wrong track. \n\"There's going to be a lot of Brexit in two weeks.\" \nNope, and we already explained why here. 6 days ago Trump Unloads on 'Scum' Fact Checkers. We Checked That Claim Too \n\"Even the so-called fact checkers, who are crooked as hell themselves, they'll check facts with me, and I'll be like 99 percent right, and they'll say therefore he lied! These people are bad….What a group of dishonest scum we have, I'm telling you,\" Trump said on Tuesday. \nWhile our moms would surely like to dispute the contention that we're \"scum\" and \"crooked as hell,\" let's focus instead on his claim that fact checkers exaggerate small errors. \nThis blog primarily focuses on large whoppers, and makes it clear when Trump's claims are rooted in fact. As this blog is just six weeks old, let's also take a look at the most comprehensive listing of Trump fact checks catalogued by our friends at PolitiFact. They have found 150 claims with significant inaccuracies earning them a \"false\" or \"pants on fire\" ruling. Just 78 claims earned the \"mostly true\" or \"half true\" rating that Trump might argue were an exaggeration. \nIn contrast, Hillary Clinton actually gets a lot more \"mostly true\" or \"half true\" claims\": half of her claims, 140, are rated as that. (Just 35 are \"false\" or \"pants on fire.\") \nBy the numbers, the fact checkers are focusing on Trump's biggest lies -- not exaggerating tiny errors. ", "external_links": [], "published": "2016-11-01T00:31:00.000+02:00", "crawled": "2016-10-31T22:03:18.107+02:00", "highlightTitle": ""}