{"organizations": [], "uuid": "6fb0bfb23f4b7fa9eb7f602b46495c9d9df01605", "thread": {"social": {"gplus": {"shares": 4}, "pinterest": {"shares": 0}, "vk": {"shares": 1}, "linkedin": {"shares": 0}, "facebook": {"likes": 17, "shares": 17, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nbcnews.com", "main_image": "http://media2.s-nbcnews.com/j/newscms/2016_42/1757891/161019-trace-gas-orbiter-space-636p_830423eff46f7247e20697493bf2a16c.nbcnews-fp-1200-800.jpg", "site_section": "http://news.google.com.na/news?cf=all&hl=en&pz=1&ned=en_na&topic=h&num=3&output=rss", "section_title": "Top Stories - Google News", "url": "http://www.nbcnews.com/science/space/european-spacecraft-reaches-mars-orbit-lander-s-fate-uncertain-n669296", "country": "NA", "domain_rank": 478, "title": "European Spacecraft Reaches Mars Orbit, But Lander's Fate Uncertain - NBCNews.com", "performance_score": 0, "site": "nbcnews.com", "participants_count": 0, "title_full": "European Spacecraft Reaches Mars Orbit, But Lander's Fate Uncertain - NBCNews.com", "spam_score": 0.0, "site_type": "news", "published": "2016-10-20T06:47:00.000+03:00", "replies_count": 0, "uuid": "6fb0bfb23f4b7fa9eb7f602b46495c9d9df01605"}, "author": "", "url": "http://www.nbcnews.com/science/space/european-spacecraft-reaches-mars-orbit-lander-s-fate-uncertain-n669296", "ord_in_thread": 0, "title": "European Spacecraft Reaches Mars Orbit, But Lander's Fate Uncertain - NBCNews.com", "locations": [], "entities": {"persons": [{"name": "mike", "sentiment": "negative"}, {"name": "schiaparelli", "sentiment": "none"}, {"name": "mars  schiaparelli", "sentiment": "none"}, {"name": "paolo ferri", "sentiment": "none"}, {"name": "roscosmos", "sentiment": "none"}, {"name": "michel denis", "sentiment": "none"}, {"name": "ferri", "sentiment": "none"}, {"name": "mike wall", "sentiment": "none"}], "locations": [{"name": "meridiani planum", "sentiment": "none"}, {"name": "pune", "sentiment": "none"}, {"name": "space.com", "sentiment": "none"}, {"name": "earth", "sentiment": "none"}, {"name": "red planet", "sentiment": "none"}, {"name": "martian equator", "sentiment": "none"}, {"name": "kazakhstan", "sentiment": "none"}, {"name": "mars", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}, {"name": "india", "sentiment": "none"}], "organizations": [{"name": "epa", "sentiment": "none"}, {"name": "tgo", "sentiment": "none"}, {"name": "european space agency", "sentiment": "none"}, {"name": "nasa", "sentiment": "none"}, {"name": "giant metrewave radio telescope", "sentiment": "none"}, {"name": "esa's mars express", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "google", "sentiment": "none"}, {"name": "esa", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Oct 19 2016, 6:47 pm ET European Spacecraft Reaches Mars Orbit, But Lander's Fate Uncertain by Mike Wall, Space.com advertisement \nEurope succeeded in placing a methane-sniffing spacecraft in orbit around Mars Wednesday, but it's still unclear if that probe's piggyback lander made it safely down to the planet's surface as planned. \nThe Trace Gas Orbiter (TGO), part of the European-Russian ExoMars 2016 mission, slipped into orbit around the Red Planet late this morning after completing a crucial engine burn, European Space Agency (ESA) officials said. \n\"It's all good,\" ExoMars Flight Operations Director Michel Denis said at a news conference this afternoon. \"It's a good spacecraft at the right place, and we have a mission around Mars.\" \nRelated: Europe's ExoMars 2016 Landing Complete Coverage \nBut that's just half of the story. An artist's rendering of the ExoMars 2016 Trace Gas Orbiter (TGO), with its thrusters firing, beginning its entry into Mars orbit. European Space Agency via EPA \nExoMars 2016's lander, called Schiaparelli, hit the Martian atmosphere as expected at 10:42 a.m. EDT (1442 GMT); however, mission team members are still waiting for a signal to confirm that the craft survived its touchdown six minutes later. \nSchiaparelli's signal came in loud and clear as the lander streaked through the Martian atmosphere but stopped shortly before the lander was scheduled to hit the ground, said Paolo Ferri, head of ESA's mission operations department. \n\"It's clear that these are not good signs, but we will need more information, and that's what's going to happen tonight,\" Ferri said. \"I'm quite confident that tomorrow morning we will know\" what happened, he added. \nIf Schiaparelli did stick its landing, the maneuver would mark the first fully successful Mars touchdown by Europe or Russia — by any entity other than NASA, as a matter of fact. Tag-teaming Mars \nSchiaparelli and TGO launched together in March, lifting off atop a Russian Proton rocket from Baikonur Cosmodrome in Kazakhstan. \nThe two spacecraft represent the first phase of the two-part ExoMars program, which is led by ESA with Russia's space agency, Roscosmos, as chief partner. The second phase of ExoMars will launch a life-hunting rover in 2020, if all goes according to plan. \nEurope is spending 1.3 billion euros ($1.43 billion at current exchange rates) on the ExoMars program, ESA officials have said. \nSchiaparelli and TGO traveled together until Sunday (Oct. 16), when they separated ahead of their divergent Mars arrivals. \nSchiaparelli reached the Red Planet first, hitting the thin Martian atmosphere at the blistering speed of 13,050 mph (21,000 km/h). Mission team members tracked the lander's progress this far, but they weren't able follow it all the way down to the surface. \n\"Initial signals [from Schiaparelli] were received via the Giant Metrewave Radio Telescope (GMRT) as Schiaparelli descended to the surface of Mars, but no signal indicating touchdown yet,\" ESA officials wrote in a blog post this morning, referring to an array of dishes near Pune, India. \n\"This is not unexpected due to the very faint nature of the signal received at GMRT,\" they added. \"A clearer assessment of the situation will come when ESA's Mars Express [orbiter] will have relayed the recording of Schiaparelli's entry, descent and landing.\" \nBut the data from Mars Express — which has been circling the Red Planet since 2003 — were inconclusive, ESA officials later said, so Schiaparelli's fate remains uncertain. The situation should clear up by tomorrow, after mission team members have had more time to search for signals coming from the lander using GMRT, Mars Express and two other orbiters — NASA's Mars Reconnaissance Orbiter (MRO) and MAVEN (Mars Atmosphere and Volatile Evolution) spacecraft. \nSchiaparelli came down in the Meridiani Planum, a highland region just south of the Martian equator. NASA's Opportunity rover touched down in Meridiani Planum back in January 2004 and is still going strong today. \nBut Schiaparelli won't come close to Opportunity's longevity, even if the probe survived today's touchdown intact: The ExoMars 2016 lander is powered by nonrechargeable batteries that should die in just a few days, ESA officials have said. That's because Schiaparelli is a landing demonstrator whose primary purpose is proving out technology required to get the ExoMars 2020 rover down on Mars safely. \nThe data Schiaparelli gathers would therefore be limited. The lander does feature a meteorological station to measure temperature, wind speed, humidity and other weather conditions on the Martian surface. Schiaparelli also was programmed to do some science work during its brief descent through the planet's atmosphere — for example, measuring air density, pressure and temperature from an altitude of 81 miles (130 km) down to the planet's surface, ESA officials said. \nThe plan also called for Schiaparelli to capture 15 black-and-white images as it fell. The lander's camera was not designed to take photos from the surface. \nInfographic: How Europe's ExoMars Missions to Mars Work Searching for signs of life \nTGO didn't have to withstand the \" six minutes of terror \" that confronted Schiaparelli, but the orbiter's arrival was harrowing in its own way. The spacecraft had to fire its main engine for 139 minutes beginning at 9:05 a.m. EDT (1305 GMT) today, or else go sailing past Mars and into orbit around the sun. \nBut TGO did its job, and the probe settled into a highly elliptical orbit around the Red Planet at 11:24 a.m. EDT (1524 GMT), ESA officials said. TGO's current four-day orbital path takes the spacecraft as close as 186 miles (300 km) to Mars and as far away as 60,000 miles (96,000 km), if the mission team's pre-arrival calculations reflect reality. \nBut TGO won't stay in this orbit forever. In March 2017, the spacecraft will begin a yearlong \"aerobraking\" campaign, shifting into a circular, 250-mile-high (400 km) orbit by zipping through the Martian atmosphere at high altitudes. (This will create drag that slows TGO and lowers its orbit.) \nBy March 2018, TGO should be ready to start its science mission, which involves searching the Martian atmosphere for methane and other gases that could be signs of alien life. (While methane can be produced by geological processes, the vast majority of the methane in Earth's atmosphere was generated by living organisms.) \nTGO will also hunt for deposits of water ice on or just below the Martian surface and serve as a communications relay for Opportunity, NASA's Curiosity rover and the ExoMars 2020 rover, ESA officials have said. TGO's mission is scheduled to end in December 2022. \nExploring Mars \nThe arrival of TGO brings the tally of active spacecraft at Mars up to eight. Two of them are surface craft — Opportunity and Curiosity — while the other six are orbiters: NASA's Mars Odyssey, MRO and MAVEN; Mars Express; India's Mars Orbiter Mission; and TGO. \nSchiaparelli could still be added to this list, though its inclusion would last just a few days (until its batteries run out). And more robotic explorers are headed to the Red Planet in the near future. NASA plans to launch a lander called InSight in 2018, to probe the interior structure of Mars. And two life-hunting rovers should follow in 2020: the ExoMars vehicle and NASA's 2020 Mars rover . \nFollow Mike Wall on Twitter @michaeldwall and Google+ .Follow us @Spacedotcom , Facebook or Google+ . Originally published on Space.com . Mike Wall, Space.com", "external_links": [], "published": "2016-10-20T06:47:00.000+03:00", "crawled": "2016-10-20T02:03:27.085+03:00", "highlightTitle": ""}