{"organizations": [], "uuid": "a508eef5c69d7318f9939d8304846a5157717e72", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 21}, "facebook": {"likes": 10, "shares": 10, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nbcnews.com", "main_image": "http://media4.s-nbcnews.com/j/newscms/2016_42/1754271/161017-tech-scam-jpo-1225p_e60fc7ef1dd41fa8d458961c11f0fb07.nbcnews-fp-1200-800.jpg", "site_section": "", "section_title": "", "url": "http://www.nbcnews.com/politics/2016-election/silicon-valley-tech-companies-vote-along-policy-lines-n671711", "country": "US", "domain_rank": 478, "title": "Silicon Valley Tech Companies Vote Along Policy Lines - NBC News", "performance_score": 0, "site": "nbcnews.com", "participants_count": 0, "title_full": "Silicon Valley Tech Companies Vote Along Policy Lines - NBC News", "spam_score": 0.0, "site_type": "news", "published": "2016-10-24T08:00:00.000+03:00", "replies_count": 0, "uuid": "a508eef5c69d7318f9939d8304846a5157717e72"}, "author": "Didi Martinez", "url": "http://www.nbcnews.com/politics/2016-election/silicon-valley-tech-companies-vote-along-policy-lines-n671711", "ord_in_thread": 0, "title": "Silicon Valley Tech Companies Vote Along Policy Lines - NBC News", "locations": [], "entities": {"persons": [{"name": "didi martinez", "sentiment": "negative"}, {"name": "stewart kantor", "sentiment": "none"}, {"name": "wikileaks", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "barack obama", "sentiment": "none"}, {"name": "moah", "sentiment": "none"}, {"name": "obama", "sentiment": "none"}, {"name": "kantor", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "clinton", "sentiment": "none"}, {"name": "aye moah", "sentiment": "none"}, {"name": "marco rubio", "sentiment": "none"}, {"name": "andrew rubin", "sentiment": "none"}, {"name": "hillary", "sentiment": "none"}, {"name": "rubin", "sentiment": "none"}], "locations": [{"name": "united states", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "san francisco", "sentiment": "none"}, {"name": "silicon", "sentiment": "none"}, {"name": "burma", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "silicon valley", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}], "organizations": [{"name": "et silicon valley tech companies vote along policy lines", "sentiment": "negative"}, {"name": "nbc news", "sentiment": "negative"}, {"name": "silicon valley tech companies vote along policy lines", "sentiment": "negative"}, {"name": "white house", "sentiment": "none"}, {"name": "apple", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "illumio", "sentiment": "none"}, {"name": "center for responsive politics", "sentiment": "none"}, {"name": "pac", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Oct 24 2016, 8:58 am ET Silicon Valley Tech Companies Vote Along Policy Lines by Didi Martinez advertisement \nIn the midst of the most technologically-driven election to date, Silicon Valley companies are eyeing how both presidential candidates' approaches to cybersecurity, energy and immigration will affect the rapidly-changing technology sector. \nSilicon Valley giants like Apple and Facebook have largely supported Hillary Clinton through company head endorsements and employee donations. And Clinton has garnered more than $2.4 million worth of PAC and individual contributions from Internet companies, compared to just $31,738 to Trump, according to the Center for Responsive Politics. \nBut for those employed by smaller-scale operations in California's technological hub, issues like cybersecurity, foreign policy and immigration have become more urgent than ever before during this presidential cycle. \n\"Cyber is sort of the center of our universe,\" said Andrew Rubin, the founder and CEO of tech security company Illumio. \"There is a massive need to find new and better solutions to our nation's problems. What we are looking for and who we are talking about is that whoever wins this election is going to be walking into a vastly different world than President Obama did.\" \nWith the White House linking the series of election-year cyberattacks to Russia -- and with Wikileaks making scores of government emails public -- learning how to deal with a new type of warfare needs to be a U.S. priority, Rubin said. \n\"The government and private industry are going to have to find ways to work together,\" Rubin said. \"We need to acknowledge that fighting a cyber warfare is fundamentally different than fighting a physical war. A lot of times in cyber, the attackers have a lot of leverage. The leverage is vastly different than in the physical war. I would argue those plans do not exist in a well-formatted way today.\" \nAs information from data breaches become a growing concern for many inside and outside of the national security community, including Florida Sen. Marco Rubio who has said he fears that hacks will soon be used by foreign agents as blackmail, Trump and Clinton have both mentioned how they will deal with issues of cybersecurity. \n\"Hillary will support efforts to strengthen cybersecurity, both for government networks and for the private sector,\" reads a statement from Clinton's campaign factsheet on technology and innovation.\" Cybersecurity is essential to our economic and national security, and it will only become increasingly important as more commercial, consumer and government devices are networked.\" \nOn the Trump side, his web team recently added a section outlining how he will deal with cybersecurity. One of his recommendations includes creating a \"Cyber Review Team,\" which would advise federal departments. \nCampaign contributions from Silicon Valley workers is nothing new. After all, President Barack Obama's 2012 campaign saw even more support than Clinton is getting now from this very group. But the reason tech donors are so keen on placing their bets on a presidential outcome may lie in the nature of the job, according to Full Spectrum CEO Stewart Kantor. \n\"It's our responsibility to be thinking 15 to 20 years out,\" said Kantor, whose company works closely with providing private data networks to utility companies. \"So a lot of this innovation is about going forward. My feeling is that we are hearing more about the future and about the modernization of the [electrical] grid from one side.\" \nThough Kantor said Clinton's proposal to build a new electrical grid has resonated with him the most, he admits that the issues his clients grapple with on a daily basis -- solar adoption and renewable energy-- will have to be addressed regardless of which candidate is in office. \n\"There's no way to avoid it,\" Kantor said. \"Whoever wins will have to deal with this issue. You are often going to have to run to plug the phone in. Well, the utility [company] has to think 'How am I going to get the energy in?' We are going to put pressure on the government to have them figure this out. This issue is going to have to be confronted.\" \nFor one Silicon Valley start-up, labor policy was a deciding factor. \n\"Number one issue is immigration,\" said Aye Moah, co-founder of email management company Boomerang and an immigrant from Burma herself. \"There are a lot of highly qualified candidates that we cannot hire because we can't deal with the mess of the situation.\" \nThe H-1B program, which allows companies to temporarily employ foreign workers within certain fields, has served as a dividing line between the two campaigns. Clinton often says that the United States should \"staple\" a green card to the diplomas of science, technology, engineering and math (STEM) masters and phD recipients. Trump's position has been more unclear; he's given conflicting statements about whether or not he supports the program, although he has generally lamented \"uncontrolled foreign worker admissions.\" \nMoah and her husband, who both work for the company, have already donated $5,400 to the Clinton campaign and attended one of the nominee's San Francisco events last week. \n\"It's really hard to advocate for a candidate that doesn't believe in science and doesn't believe in an economy where everybody have a chance,\" said Moah, referring to Trump. \"In Silicon valley, we believe in the American Dream. We advocate for the American Dream.\" Didi Martinez ", "external_links": [], "published": "2016-10-24T08:00:00.000+03:00", "crawled": "2016-10-24T18:20:07.846+03:00", "highlightTitle": ""}