{"organizations": [], "uuid": "1753c1dcff57787c0da722a41a3eb57c0a2446a4", "thread": {"social": {"gplus": {"shares": 6}, "pinterest": {"shares": 7}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 287, "shares": 287, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nbcnews.com", "main_image": "http://media2.s-nbcnews.com/j/newscms/2016_42/1755591/161018-trump_clinton_debate-1126_33a016139983d299a78f676726bff7ae.nbcnews-fp-1200-800.jpg", "site_section": "http://feeds.nbcnews.com/feeds/usnews", "section_title": "NBC News U.S. News", "url": "http://www.nbcnews.com/storyline/2016-presidential-debates/10-big-issues-still-table-ahead-final-presidential-debate-n668151", "country": "US", "domain_rank": 478, "title": "10 Big Issues Still on the Table Ahead of the Final Presidential Debate", "performance_score": 2, "site": "nbcnews.com", "participants_count": 1, "title_full": "10 Big Issues Still on the Table Ahead of the Final Presidential Debate - NBC News", "spam_score": 0.0, "site_type": "news", "published": "2016-10-19T15:32:00.000+03:00", "replies_count": 0, "uuid": "1753c1dcff57787c0da722a41a3eb57c0a2446a4"}, "author": "nbcnews.com", "url": "http://www.nbcnews.com/storyline/2016-presidential-debates/10-big-issues-still-table-ahead-final-presidential-debate-n668151", "ord_in_thread": 0, "title": "10 Big Issues Still on the Table Ahead of the Final Presidential Debate", "locations": [], "entities": {"persons": [{"name": "caitlyn jenner", "sentiment": "none"}, {"name": "bernie sanders", "sentiment": "none"}, {"name": "roe", "sentiment": "none"}, {"name": "ferguson", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "tim kaine", "sentiment": "none"}, {"name": "david bossie", "sentiment": "none"}, {"name": "bill clinton", "sentiment": "none"}, {"name": "kaine", "sentiment": "none"}, {"name": "paul j. richards", "sentiment": "none"}, {"name": "michael brown", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "clinton", "sentiment": "none"}, {"name": "ted cruz", "sentiment": "none"}, {"name": "kyle sherman", "sentiment": "none"}, {"name": "mike pence", "sentiment": "none"}, {"name": "pence", "sentiment": "none"}], "locations": [{"name": "new hampshire", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "missouri", "sentiment": "none"}, {"name": "indiana", "sentiment": "none"}, {"name": "north carolina", "sentiment": "none"}, {"name": "st. louis", "sentiment": "none"}, {"name": "flowhub", "sentiment": "none"}, {"name": "maine", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}, {"name": "nevada", "sentiment": "none"}], "organizations": [{"name": "facebook twitter google plus embed trump", "sentiment": "negative"}, {"name": "afp", "sentiment": "none"}, {"name": "nbc news", "sentiment": "none"}, {"name": "immigration and customs enforcement", "sentiment": "none"}, {"name": "las vegas debate trump", "sentiment": "none"}, {"name": "facebook twitter google", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "nbc", "sentiment": "none"}, {"name": "gop", "sentiment": "none"}, {"name": "medicare", "sentiment": "none"}, {"name": "citizens united", "sentiment": "none"}, {"name": "washington university", "sentiment": "none"}, {"name": "social security", "sentiment": "none"}, {"name": "supreme court", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Play Facebook Twitter Google Plus Embed Trump's last chance to get back in the race 4:13 autoplay autoplay Copy this code to your website or blog Final presidential debates are rarely game-changers . The contours of the race have usually solidified and knock-out punches are hard to land. With the end in site, candidates stick to talking points and do their best to motivate their established supporters to turn out.\nThis, however, is no ordinary election, and the debates between Donald Trump and Hillary Clinton have been anything but predictable. Their second debate was largely overshadowed by an unearthed 2005 tape of Trump making lewd comments about sexually assaulting women, and Trump's decision to bring as his guests women who had alleged the inappropriate conduct of former President Bill Clinton.\nRelated: Poll: Clinton Maintains Solid National Lead\nThe race has devolved into a personality contest between two historically unpopular nominees, and the issues voters care about the most have often been downplayed or overlooked altogether.\nHere are 10 major topics that have yet to be addressed substantively, but might still come up Wednesday when Clinton and Trump share the stage one last time:\n1. Immigration — Trump's campaign has been bolstered from the beginning by his audacious (and some have argued racially prejudiced) positions on immigration. The issue has long been a top concern for voters, yet it's barely been mentioned in the debates so far. Surprisingly, the vice presidential debate was the one debate during which a direct question on immigration policy was asked.\nPlay Facebook Twitter Google Plus Embed Preview of final presidential debate showdown 12:45 autoplay autoplay Copy this code to your website or blog During the first presidential debate, Trump boasted the he was endorsed by the Immigration and Customs Enforcement agency (he wasn't , but he did get seal of approval from a union that represents 5,000 of its staff), and in the second debate Clinton called out Trump for some of the offensive language he used at immigrants' expense in the past. But there has been no question or discussion about the Republican nominee's signature immigration policy proposals — the building of border wall that will supposedly by funded by Mexico, and the forced deportation of millions of undocumented immigrants living in the U.S.\n2. LGBT rights — The issue bubbled up consistently during the primaries (Ted Cruz bet big on bathroom paranoia) and has become a major national issue in aftermath of states like North Carolina passing bills that many believe infringe on the civil liberties of LGBT people. But it never made its way to the debate stage, which was especially surprising during the VP debate, since GOP nominee Mike Pence signed one of the first so-called \"religious freedom\" bills as governor of Indiana.\nLGBT rights is one of the few areas where Trump actually seems to be on the left of Republican party orthodoxy. He's said in the past that Caitlyn Jenner, a transgender woman, should be able to use the bathroom of her choice. On the other hand, he has said he opposes same-sex marriage. Clinton, who opposed same-sex marriage during the 2008 election, has evolved on that issue. For some, LGBT equality is the civil rights issue of our time, so for it to get no mention during the 2016 debates would be a huge oversight.\nPlay Facebook Twitter Google Plus Embed Trump Calls For Drug Test Ahead of Third, Final Debate 0:42 autoplay autoplay Copy this code to your website or blog 3. Drugs — Although Donald Trump is keen to have his opponent drug tested, his actually position on both the waning 'war on drugs' and efforts to legalize both medicinal and recreation marijuana is murky at best. This year several states — including California, Nevada, Florida and Maine — are going to have drug reform laws on the ballot, which could either minimize penalties for possession or legalize medicinal use. Where do the candidates stand on this issue? It hasn't been discussed. Considering how much attention was paid to the heroin epidemic in states like New Hampshire, the candidates haven't been asked about their plans to combat addiction or crack down on the illegal drug trade.\n\"It's concerning to me that cannabis legalization hasn't received much attention during this election cycle. Six states have full adult-use legalization on the ballot, yet what do the candidates have to say?\" Kyle Sherman, co-founder and CEO of Flowhub , told NBC News. \"There is an obvious surge in public concern around the issue, yet this election cycle has seen much less coverage on the topic than others in the past. The questions are certainly there, there just hasn't been enough discussion on the issue to see anything remotely close to an answer.\"\n4. Medicare and Social Security — There is a great deal of anxiety about solvency and future of the two most popular so-called entitlement programs, particularly among the generation of Americans poised to enter into the system. Both Trump and Clinton have pledged to leave Social Security and Medicare untouched as president, but neither was pressed during the first two debates about how they would make sure each program remains solvent. Curiously, this was yet another topic that was addressed in the VP debate, where Democrat Tim Kaine pointed out that Trump had compared Social Security in the past to a \"Ponzi scheme,\" while Republican Mike Pence stated that his ticket would \"meet the obligations\" of both programs.\nDemocratic presidential candidate Hillary Clinton makes a point during the second presidential debate at Washington University in St. Louis, Missouri on Oct. 9, 2016. PAUL J. RICHARDS / AFP - Getty Images 5. Reproductive Rights — Although Hillary Clinton did say she wanted to appoint a Supreme Court justice who would preserve Roe v. Wade , there hasn't been a deep dive into one of the most divisive social issues in America. Donald Trump's controversial assertion — later retracted — that women should be \"punished\" if they get an abortion was only revisited in the VP debate when Pence insisted that neither he nor his running mate would support legislation that punished women. Kaine, who is personally opposed to the procedure, asked rhetorically: \"Why doesn't Donald Trump trust women to make this choice for themselves?\"\n6. Sexual Assault (on Colleges Campuses and in the Military) — To the shock of many voters, allegations of sexual assault levied at Donald Trump and Hillary Clinton's husband, Bill Clinton, have sucked much of the oxygen out of presidential debates so far. But there has been no discussion about the epidemic of sexual assaults on college campuses or the outbreak of sexual violence in the military.\nRelated: Hillary Clinton to Spend 5 Days Preparing for Las Vegas Debate\nTrump has tweeted that \"no one\" has more respect for women than he does, and has linked incidents of sexual assault in the military to the fact that men and women serve together. When pressed on this controversial position at NBC's Commander-in-Chief Forum last month, he doubled down . Both candidates should probably make plain their positions on women in combat, including whether or not they can or should serve alongside men, and also how they intend to address threats and violence directed towards women in environments where the public presumes a reasonable degree of safety and security, like our institutions of higher education.\nPlay Facebook Twitter Google Plus Embed Are colleges equipped to handle sexual assault allegations? 7:37 autoplay autoplay Copy this code to your website or blog 7. College Affordability — Speaking of higher educatoin, although Trump has recently rolled out a 'plan' to reduce college debt and Clinton has named-checked her proposal for \"debt-free\" college in the first debate, the substance of how to really tackle this problem has been completely overlooked so far — which may be detrimental to Democrats who are hoping to capitalize on their historic advantages with younger voters, and hoping to motivate them to the polls with a focus on this, one of their biggest concerns.\n8. Campaign Finance Reform — With his largely self-funded primary campaign, Donald Trump (alongside Democrat Bernie Sanders, who differentiated himself by refusing corporate donations) helped put campaign finance reform back in the center of political debates.\nAlthough Trump has criticized the controversial Citizens United case in the past, which allowed corporations to make unlimited donations to Super PACs, he has since hired David Bossie , former president of Citizens United, as his deputy campaign manager. This raises questions about his commitment to overhauling a system he has referred to as \"rigged.\"\nMeanwhile, Clinton did say in the second debate that she would seek to appoint Supreme Court justices that would overturn the ruling, but she has yet to outline how else she would or could pursue reform should that option not present itself.\nPlay Facebook Twitter Google Plus Embed The voting wars 8:50 autoplay autoplay Copy this code to your website or blog 9. Voting Rights — In the second debate, on the same answer regarding the Supreme Court, Clinton said she would appoint a justice who recognized \"voting rights are still a big problem in many parts of our country.\" But she didn't speak specifically to the gutting of the 1965 Voting Rights Act in 2014, which many critics believe could open up the floodgates for more voter suppression.\nTrump, a big proponent of voter ID laws, has made the credibility of the vote a major talking point on the campaign trail this week, so this topic will likely be raised on Wednesday, albeit with regards to potential cheating and fraud, as opposed to access.\n10. Gun Control — Many viewers found it ironic that although the second presidential debate took place in St. Louis, not far from Ferguson , where the death of Michael Brown galvanized the Black Lives Matter movement, that gun violence hasn't been a bigger factor in the early clashes between Trump and Clinton.\nThe two candidates have discussed their different policies when it comes to policing and addressing racial tensions with law enforcement, but neither has been pressed as to what, if anything, can be done about mass shootings or about guns falling into the hands of unstable people. As concerns about potential post-election violence have spiked in the aftermath of a firebombing of a Trump campaign office in North Carolina, it will be curious to see if either candidate talks about strategic solutions on Wednesday.", "external_links": ["http://media4.s-nbcnews.com/j/msnbc/components/video/201610/tdy_ronan_students_161012.nbcnews-ux-1240-700.jpg", "http://www.today.com/video/are-colleges-equipped-to-handle-sexual-assault-allegations-784133699714", "https://www.washingtonpost.com/news/fact-checker/wp/2016/09/07/fact-checking-clinton-and-trump-in-nbcs-commander-in-chief-forum/", "http://media1.s-nbcnews.com/j/msnbc/components/video/201610/2016-10-18t00-18-04-766z--1280x720.nbcnews-ux-1080-600.jpg", "http://link.theplatform.com/s/2E2eJC/ZHTVyL5eCHwI", "http://media1.s-nbcnews.com/j/msnbc/components/video/201610/2016-10-18t00-18-04-766z--1280x720.nbcnews-ux-360-200.jpg", "http://www.msnbc.com/all-in/watch/the-voting-wars-787947587957", "https://twitter.com/share?text=Trump", "http://media1.s-nbcnews.com/j/msnbc/components/video/201610/2016-10-16t15-01-22-033z--1280x720.nbcnews-ux-440-240.jpg", "http://link.theplatform.com/s/2E2eJC/DQIpkCwXH5EJ", "http://www.today.com/video/are-colleges-equipped-to-handle-sexual-assault-allegations-784133699714&via=nbcnews", "https://plus.google.com/share?url=http://www.today.com/video/are-colleges-equipped-to-handle-sexual-assault-allegations-784133699714", "http://media1.s-nbcnews.com/j/msnbc/components/video/201610/2016-10-18t23-02-36-466z--1280x720.nbcnews-ux-800-440.jpg", "http://media4.s-nbcnews.com/i/MSNBC/Components/Video/201610/tdy_ronan_students_161012.jpg", "https://plus.google.com/share?url=http://www.msnbc.com/hardball/watch/trump-s-last-chance-to-get-back-in-the-race-788715075666", "http://media.snappytv.com/captions/928000/885p885/2016-10-16T15-01-04.233Z--765.567.mp4.srt", "http://link.theplatform.com/s/2E2eJC/aOMrymBKEWkr?mbr=true", "http://link.theplatform.com/s/7wvmTC/pdvTT2vBuw0Q?mbr=true", "http://tve_static-snappytvpoc.nbcuni.com/snappy/caption/MSNBC/1020/978/2016-10-16T15-01-04.233Z--765.567.mp4.vtt", "http://www.politico.com/story/2016/09/trump-bossie-citizens-united-227662", "http://media1.s-nbcnews.com/j/msnbc/components/video/201610/2016-10-16t15-01-22-033z--1280x720.nbcnews-ux-800-440.jpg", "http://media1.s-nbcnews.com/i/MSNBC/Components/Video/201610/2016-10-18T23-02-36-466Z--1280x720.jpg", "http://media.snappytv.com/captions/928000/806p806/2016-10-12T11-40-07.6Z--457.6.mp4.srt", "http://media1.s-nbcnews.com/j/msnbc/components/video/201610/2016-10-18t23-02-36-466z--1280x720.nbcnews-ux-1240-700.jpg", "http://media3.s-nbcnews.com/j/newscms/2016_41/1747331/161012-clinton-cr-0739_01_e3f6f71e9c14db587ed36344bcb2166f.nbcnews-fp-360-360.jpg", "http://media4.s-nbcnews.com/j/msnbc/components/video/201610/tdy_ronan_students_161012.nbcnews-ux-800-440.jpg", "http://media4.s-nbcnews.com/j/msnbc/components/video/201610/insta_trump_drug_test_161015.nbcnews-ux-800-440.jpg", "http://link.theplatform.com/s/2E2eJC/snF1z2U3WTz4", "http://link.theplatform.com/s/2E2eJC/Vz60mXw2kiIm?mbr=true", "http://www.motherjones.com/politics/2014/04/republican-voting-rights-supreme-court-id", "https://plus.google.com/share?url=http://www.nbcnews.com/video/trump-calls-for-drug-test-ahead-of-third-final-debate-786746947732", "https://twitter.com/realDonaldTrump/status/331907383771148288?ref_src=twsrc%5Etfw", "http://media4.s-nbcnews.com/j/msnbc/components/video/201610/insta_trump_drug_test_161015.nbcnews-ux-360-200.jpg", "http://www.msnbc.com/am-joy/watch/preview-of-final-presidential-debate-showdown-787048515527&via=nbcnews", "http://player.theplatform.com/p/2E2eJC/nbcNewsOffsite?guid=f_trump_drug_test_161015", "http://link.theplatform.com/s/2E2eJC/Ugy7cYZg6r6T?mbr=true", "http://feed.theplatform.com/f/2E2eJC/nnd_29411569", "http://player.theplatform.com/p/2E2eJC/nbcNewsOffsite?guid=tdy_ronan_students_161012", "http://media3.s-nbcnews.com/j/newscms/2016_41/1747331/161012-clinton-cr-0739_01_e3f6f71e9c14db587ed36344bcb2166f.nbcnews-ux-600-480.jpg", "http://media4.s-nbcnews.com/j/msnbc/components/video/201610/tdy_ronan_students_161012.nbcnews-ux-1080-600.jpg", "http://media1.s-nbcnews.com/j/msnbc/components/video/201610/2016-10-16t15-01-22-033z--1280x720.nbcnews-ux-360-200.jpg", "http://www.politifact.com/truth-o-meter/statements/2016/oct/10/donald-trump/trump-says-ice-endorsed-him/", "http://media3.s-nbcnews.com/j/newscms/2016_41/1747331/161012-clinton-cr-0739_01_e3f6f71e9c14db587ed36344bcb2166f.nbcnews-ux-2880-1000.jpg", "http://on.msnbc.com/2dK4bLW", "http://player.theplatform.com/p/2E2eJC/nbcNewsOffsite?guid=n_hardball_debate_161018", "https://www.facebook.com/sharer.php?u=http://www.msnbc.com/hardball/watch/trump-s-last-chance-to-get-back-in-the-race-788715075666&t=Trump&#x27;s", "http://www.msnbc.com/hardball/watch/trump-s-last-chance-to-get-back-in-the-race-788715075666&via=nbcnews", "http://link.theplatform.com/s/2E2eJC/gFuFzuohGavB", "http://media1.s-nbcnews.com/j/msnbc/components/video/201610/2016-10-18t23-02-36-466z--1280x720.nbcnews-ux-1080-600.jpg", "http://link.theplatform.com/s/2E2eJC/ktxLY80zn99W?mbr=true", "http://www.msnbc.com/am-joy/watch/preview-of-final-presidential-debate-showdown-787048515527", "http://nbcnews.to/2e6BlsI", "http://media1.s-nbcnews.com/i/MSNBC/Components/Video/201610/2016-10-16T15-01-22-033Z--1280x720.jpg", "https://twitter.com/share?text=The", "http://media1.s-nbcnews.com/i/MSNBC/Components/Video/201610/2016-10-18T00-18-04-766Z--1280x720.jpg", "http://link.theplatform.com/s/7wvmTC/rrqtcWgOi3ol?mbr=true", "https://twitter.com/share?text=Trump&#x27;s", "https://twitter.com/share?text=Are", "http://tve_static-snappytvpoc.nbcuni.com/snappy/caption/NBC_News/289/175/2016-10-12T11-40-07.6Z--457.6.mp4.vtt", "http://player.theplatform.com/p/2E2eJC/nbcNewsOffsite?guid=n_hayes_bvotingwars_161017", "http://www.msnbc.com/all-in/watch/the-voting-wars-787947587957&via=nbcnews", "http://www.politifact.com/truth-o-meter/statements/2015/jun/17/hillary-clinton/hillary-clinton-change-position-same-sex-marriage/", "http://link.theplatform.com/s/2E2eJC/6VXt1wMRxfZ6?mbr=true", "http://link.theplatform.com/s/2E2eJC/MePBsOwc8HTv?mbr=true", "http://media4.s-nbcnews.com/i/MSNBC/Components/Video/201610/insta_trump_drug_test_161015.jpg", "http://media4.s-nbcnews.com/j/msnbc/components/video/201610/insta_trump_drug_test_161015.nbcnews-ux-1080-600.jpg", "http://media1.s-nbcnews.com/j/msnbc/components/video/201610/2016-10-18t23-02-36-466z--1280x720.nbcnews-ux-440-240.jpg", "http://on.msnbc.com/2efv4v3", "https://www.bostonglobe.com/opinion/2016/10/14/enough-enough-scrap-third-debate/32oyCuhCjolz9ptFt3Ty0H/story.html", "http://media4.s-nbcnews.com/j/msnbc/components/video/201610/insta_trump_drug_test_161015.nbcnews-ux-1240-700.jpg", "http://link.theplatform.com/s/2E2eJC/_V6Grh6MbORY", "http://link.theplatform.com/s/2E2eJC/v1kndT2WQ2De?mbr=true", "http://link.theplatform.com/s/2E2eJC/wLFig9MjA4_t?mbr=true", "http://media4.s-nbcnews.com/j/msnbc/components/video/201610/tdy_ronan_students_161012.nbcnews-ux-440-240.jpg", "http://www.bloomberg.com/politics/articles/2015-08-04/trump-the-developer-loves-low-interest-rates-trump-the-candidate-sees-a-bubble-", "http://media1.s-nbcnews.com/j/msnbc/components/video/201610/2016-10-16t15-01-22-033z--1280x720.nbcnews-ux-1240-700.jpg", "http://feed.theplatform.com/f/2E2eJC/nnd_20381145", "http://link.theplatform.com/s/2E2eJC/gcaaFBUC80n7?mbr=true", "http://media1.s-nbcnews.com/j/msnbc/components/video/201610/2016-10-18t00-18-04-766z--1280x720.nbcnews-ux-440-240.jpg", "http://link.theplatform.com/s/2E2eJC/oZSzbzPnMvIF?mbr=true", "http://media1.s-nbcnews.com/j/msnbc/components/video/201610/2016-10-16t15-01-22-033z--1280x720.nbcnews-ux-1080-600.jpg", "http://link.theplatform.com/s/2E2eJC/TkGoWGW4MIQd?mbr=true", "http://link.theplatform.com/s/7wvmTC/advWi9PZquwL?mbr=true", "http://player.theplatform.com/p/2E2eJC/nbcNewsOffsite?guid=n_joy_debatepreview_161016", "https://plus.google.com/share?url=http://www.msnbc.com/am-joy/watch/preview-of-final-presidential-debate-showdown-787048515527", "https://www.facebook.com/sharer.php?u=http://www.today.com/video/are-colleges-equipped-to-handle-sexual-assault-allegations-784133699714&t=Are", "https://www.facebook.com/sharer.php?u=http://www.nbcnews.com/video/trump-calls-for-drug-test-ahead-of-third-final-debate-786746947732&t=Trump", "http://mashable.com/2016/10/10/ferguson-debate-questions-race-policing/#uktLXdZTDZqn", "http://link.theplatform.com/s/7wvmTC/u632eZmM9GBr?mbr=true", "http://on.msnbc.com/2dYwQ5k", "http://feed.theplatform.com/f/2E2eJC/nnd_21427708", "http://media1.s-nbcnews.com/j/msnbc/components/video/201610/2016-10-18t23-02-36-466z--1280x720.nbcnews-ux-360-200.jpg", "http://media1.s-nbcnews.com/j/msnbc/components/video/201610/2016-10-18t00-18-04-766z--1280x720.nbcnews-ux-1240-700.jpg", "http://feed.theplatform.com/f/2E2eJC/nnd_58534155", "https://twitter.com/share?text=Preview", "https://www.theweedblog.com/states-voting-on-marijuana-reform-in-november-2016/", "http://link.theplatform.com/s/2E2eJC/fVnLC0q7WKtu?mbr=true", "https://plus.google.com/share?url=http://www.msnbc.com/all-in/watch/the-voting-wars-787947587957", "http://media4.s-nbcnews.com/j/msnbc/components/video/201610/insta_trump_drug_test_161015.nbcnews-ux-440-240.jpg", "http://media1.s-nbcnews.com/j/msnbc/components/video/201610/2016-10-18t00-18-04-766z--1280x720.nbcnews-ux-800-440.jpg", "http://media4.s-nbcnews.com/j/msnbc/components/video/201610/tdy_ronan_students_161012.nbcnews-ux-360-200.jpg", "https://www.facebook.com/sharer.php?u=http://www.msnbc.com/am-joy/watch/preview-of-final-presidential-debate-showdown-787048515527&t=Preview", "http://www.msnbc.com/hardball/watch/trump-s-last-chance-to-get-back-in-the-race-788715075666", "http://on.today.com/2dvJ4wU", "https://www.facebook.com/sharer.php?u=http://www.msnbc.com/all-in/watch/the-voting-wars-787947587957&t=The"], "published": "2016-10-19T15:32:00.000+03:00", "crawled": "2016-10-19T19:07:52.955+03:00", "highlightTitle": ""}