{"organizations": [], "uuid": "240ff6b47e27cb87df2df38e49463bbcc2b31fe8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nbcnews.com", "main_image": "http://media4.s-nbcnews.com/j/newscms/2016_35/1692636/supeme_court_whats_left-jpeg-089e8_8cd9d5692b90c94c5639d18b5abee6a3.nbcnews-fp-1200-800.jpg", "site_section": "", "section_title": "", "url": "http://www.nbcnews.com/news/us-news/supreme-court-begins-new-term-marked-uncertainty-n657751", "country": "US", "domain_rank": 478, "title": "Supreme Court Begins New Term Marked by Uncertainty - NBC News", "performance_score": 0, "site": "nbcnews.com", "participants_count": 0, "title_full": "Supreme Court Begins New Term Marked by Uncertainty - NBC News", "spam_score": 0.19, "site_type": "news", "published": "2016-10-03T16:52:00.000+03:00", "replies_count": 0, "uuid": "240ff6b47e27cb87df2df38e49463bbcc2b31fe8"}, "author": "Pete Williams", "url": "http://www.nbcnews.com/news/us-news/supreme-court-begins-new-term-marked-uncertainty-n657751", "ord_in_thread": 0, "title": "Supreme Court Begins New Term Marked by Uncertainty - NBC News", "locations": [], "entities": {"persons": [{"name": "pete williams", "sentiment": "negative"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "alex brandon", "sentiment": "none"}, {"name": "joe biden", "sentiment": "none"}, {"name": "barack obama", "sentiment": "none"}, {"name": "erik stanley", "sentiment": "none"}, {"name": "tom goldstein", "sentiment": "none"}, {"name": "garland", "sentiment": "none"}, {"name": "elena kagan", "sentiment": "none"}, {"name": "antonin scalia", "sentiment": "none"}, {"name": "merrick garland", "sentiment": "none"}, {"name": "obama", "sentiment": "none"}], "locations": [{"name": "washington", "sentiment": "none"}, {"name": "virginia", "sentiment": "none"}, {"name": "missouri", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "capitol hill", "sentiment": "none"}, {"name": "colorado", "sentiment": "none"}, {"name": "portland", "sentiment": "none"}], "organizations": [{"name": "nbc news oct", "sentiment": "negative"}, {"name": "et supreme court", "sentiment": "negative"}, {"name": "supreme court", "sentiment": "negative"}, {"name": "senate judiciary committee", "sentiment": "none"}, {"name": "the supreme court", "sentiment": "none"}, {"name": "senate", "sentiment": "none"}, {"name": "nfl", "sentiment": "none"}, {"name": "harvard", "sentiment": "none"}, {"name": "alliance defending freedom", "sentiment": "none"}, {"name": "ap", "sentiment": "none"}, {"name": "u.s. supreme court", "sentiment": "none"}, {"name": "washington redskins", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Oct 3 2016, 4:36 am ET Supreme Court Begins New Term Marked by Uncertainty by Pete Williams advertisement \nThe U.S. Supreme Court begins its new term Monday with just eight justices and the prospect that it may operate for several more months at less than full strength. \nSo far, the docket is short of the kind of blockbuster cases that draw long lines for a spot in the marble courtroom. \n\"The justices are really at sea about what's going to happen with their own court,\" says Tom Goldstein, publisher of SCOTUSblog and a lawyer who argues before the Supreme Court. \n\"Nobody knows when they'll get a ninth vote and what that vote will be like. So they're stuck on taking cases and deciding them.\" In this June 20, 2016, photo, The Supreme Court is seen in Washington. The eight-justice court has eight cases to resolve in the waning days of a trying and mournful term since the death of Justice Antonin Scalia in February. Alex Brandon / AP \nFour-four ties prevented decisions last term on some of the most important questions, dealing with President Obama's immigration program, contraceptive requirements for religious institutions, and the future of public-sector unions. \nEven some of the justices have gone public about the need for a full bench. \n\"A tie does nobody any good,\" Elena Kagan told a Harvard audience last month. \"We're there to resolve cases that need deciding and answer hotly contested issues that need resolving. You can't do that with a tie vote.\" \nMerrick Garland, the federal appeals court judge nominated to succeed Antonin Scalia, has been waiting six and a half months for a Senate Judiciary Committee hearing. In repeated visits to Capitol Hill, he shook hands with every Democratic senator. But he met only 16 Republicans, who insist that the choice should be the next president's. President Barack Obama and Vice President Joe Biden walk with Supreme Court nominee Merrick Garland at the White House on March 16, 2016. AP \nIf the Senate continues to deny Garland a hearing this year, even if Hillary Clinton is elected president, the Supreme Court could go through the entire term with just eight members. \nNonetheless the court is open for business, facing an array of challenging issues. \nA Lutheran church in Missouri is fighting a decision by the state that omitted its preschool from a program to resurface playgrounds with rubber from scrap tires. The Missouri constitution bars giving money, directly or indirectly, to churches. \n\"When you have a neutral, generally available public benefit, religious people should be allowed to participate to the same degree as everyone else,\" says Erik Stanley of Alliance Defending Freedom, a Christian-oriented legal group representing the church. \nThe court will decide if what happens in a jury room can be ever be questioned. A Colorado man is seeking a new trial because a juror expressed racial bias during deliberations. \nFor well over a century, the Supreme Court has said that allowing such challenges could inhibit frankness in the jury room. But two years ago, the court said extreme cases of juror bias could deprive a defendant of a fair trial. \nRelated: Supreme Court to Hear The Slants' Trademark Case That Could Affect NFL Team \nAsian-Americans musicians from Portland urge the Supreme Court to declare that the government cannot block a trademark for their dance-rock band, The Slants. A federal law bars granting trademarks for terms considered offensive, but a lower court found that provision unconstitutional. A decision will affect the legal battle waged by the NFL's Washington Redskins after its trademark was revoked on similar grounds. \nThe court has yet to decide whether to hear appeals in some other cases that have generated headlines. \nRelated: Federal Judge Blocks Federal Action on Transgender Students' Bathroom Access \nA rural Virginia school board is asking the Supreme Court to take up its challenge to a ruling that it must allow students to use bathrooms matching their gender identity. It would be a surprise if the justices agreed to hear the case, because they generally prefer to see how emerging issues play out in the lower courts before stepping in. \nAnother pending appeal comes from a Colorado baker who refused to prepare a custom cake for a gay couple's wedding. He argues that the state cannot compel him to express his support for same-sex marriage, but lower courts said a reasonable observer would assume the message on the cake was the couple's, not the baker's. Pete Williams ", "external_links": [], "published": "2016-10-03T16:52:00.000+03:00", "crawled": "2016-10-03T11:52:53.947+03:00", "highlightTitle": ""}