{"organizations": [], "uuid": "08c2e4776bc813cf5cdcb3c62e8ea37e0e0d6ecf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nbcnews.com", "main_image": "http://media2.s-nbcnews.com/j/newscms/2016_39/1731806/160930-aleppo-operation-mbe-451p_2_b419d7da8773b80c5a49fba655cc5577.nbcnews-fp-1200-800.jpg", "site_section": "http://news.google.com/news?ned=us&topic=h&output=rss", "section_title": "Top Stories - Google News", "url": "http://www.nbcnews.com/storyline/syria-peace-talks/russia-warns-terrible-consequences-if-u-s-attacks-syrian-government-n657946", "country": "US", "domain_rank": 478, "title": "Russia Warns of 'Terrible' Consequences if US Attacks Syrian Government Forces - NBCNews.com", "performance_score": 0, "site": "nbcnews.com", "participants_count": 0, "title_full": "Russia Warns of 'Terrible' Consequences if US Attacks Syrian Government Forces - NBCNews.com", "spam_score": 0.0, "site_type": "news", "published": "2016-10-02T02:56:00.000+03:00", "replies_count": 0, "uuid": "08c2e4776bc813cf5cdcb3c62e8ea37e0e0d6ecf"}, "author": "", "url": "http://www.nbcnews.com/storyline/syria-peace-talks/russia-warns-terrible-consequences-if-u-s-attacks-syrian-government-n657946", "ord_in_thread": 0, "title": "Russia Warns of 'Terrible' Consequences if US Attacks Syrian Government Forces - NBCNews.com", "locations": [], "entities": {"persons": [{"name": "deir", "sentiment": "none"}, {"name": "ahrar al-sham", "sentiment": "none"}, {"name": "georges ourfalian", "sentiment": "none"}, {"name": "ahmad alkhatib", "sentiment": "none"}, {"name": "deir el-zour", "sentiment": "none"}, {"name": "bashar assad", "sentiment": "none"}, {"name": "suleiman al-halabi", "sentiment": "none"}, {"name": "john kerry", "sentiment": "none"}, {"name": "maria zakharova", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "bustan al-basha", "sentiment": "none"}, {"name": "syria", "sentiment": "none"}, {"name": "abdalrhman ismail", "sentiment": "none"}, {"name": "euphrates", "sentiment": "none"}, {"name": "handarat", "sentiment": "none"}, {"name": "sakhour", "sentiment": "none"}, {"name": "midan", "sentiment": "none"}, {"name": "rebel-held aleppo  opposition", "sentiment": "none"}, {"name": "aleppo", "sentiment": "none"}, {"name": "middle east", "sentiment": "none"}], "organizations": [{"name": "us attacks syrian government forces - nbcnews.com oct", "sentiment": "negative"}, {"name": "et russia warns", "sentiment": "negative"}, {"name": "local coordination committees", "sentiment": "none"}, {"name": "syrian observatory for human rights", "sentiment": "none"}, {"name": "nbc news", "sentiment": "none"}, {"name": "islamic state", "sentiment": "none"}, {"name": "sana", "sentiment": "none"}, {"name": "civil defense", "sentiment": "none"}, {"name": "associated press", "sentiment": "none"}, {"name": "directorate of health", "sentiment": "none"}, {"name": "foreign ministry", "sentiment": "none"}, {"name": "reuters  state", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Oct 1 2016, 2:55 pm ET Russia Warns of 'Terrible' Consequences if U.S. Attacks Syrian Government Forces by Associated Press advertisement \nRussia warned the United States Saturday against carrying out any attacks on Syrian government forces, saying it would have repercussions across the Middle East as government forces captured a hill on the edge of the northern city of Aleppo under the cover of airstrikes. \nRussian news agencies quoted Foreign Ministry spokeswoman Maria Zakharova as saying that a U.S. intervention against the Syrian army \"will lead to terrible, tectonic consequences not only on the territory of this country but also in the region on the whole.\" Play Copy this code to your website or blog <iframe src=\"http://www.nbcnews.com/widget/video-embed/776056899688\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen></iframe> \nShe said regime change in Syria would create a vacuum that would be \"quickly filled\" by \"terrorists of all stripes.\" \nU.S.-Russian tensions over Syria have escalated since the breakdown of a cease-fire last month, with each side blaming the other for its failure. Syrian government forces backed by Russian warplanes have launched a major onslaught on rebel-held parts of the northern city of Aleppo. \nSyrian troops pushed ahead in their offensive in Aleppo on Saturday capturing the strategic Um al-Shuqeef hill near the Palestinian refugee camp of Handarat that government forces captured from rebels earlier this week, according to state TV. The hill is on the northern edge of the Aleppo, Syria's largest city and former commercial center. \nRelated: John Kerry to Russia: Stop 'Grandstanding' Over Syria \nThe powerful ultraconservative Ahrar al-Sham militant group said rebels regained control Saturday of several positions they lost in Aleppo in the Bustan al-Basha neighborhood. People inspect a damaged site after airstrikes on the rebel held Sheikh Fares neighborhood of Aleppo, Syria, on Saturday. ABDALRHMAN ISMAIL / Reuters \nState media said 13 people were wounded when rebels shelled the central government-held neighborhood of Midan. \nAirstrikes on Aleppo struck a hospital in the eastern rebel-held neighborhood of Sakhour, putting it out of service, according to the Britain-based Syrian Observatory for Human Rights and the Local Coordination Committees. They said one person was killed in the airstrike. NBC News was not able to immediately confirm the fatality. \nRelated: Bombs Hit Hospital in Rebel-Held Aleppo \nOpposition activist Ahmad Alkhatib described the hospital, known as M10, as one of the largest in Aleppo. He posted photographs on his Twitter account showing the damage including beds covered with dust, a hole in its roof and debris covering the street outside. Syrian pro-government forces take part in an operation to take control of Aleppo's Suleiman al-Halabi neighborhood. GEORGES OURFALIAN / AFP - Getty Images \nOpposition activists have blamed the President Bashar Assad's forces and Russia for airstrikes that hit Civil Defense units and clinics in the city where eastern rebel-held neighborhoods are besieged by government forces and pro-government militiamen. \nRelated: Syrian Rebels Guardedly Agree on Truce, but Battles Persist \nOn Friday, the international medical humanitarian organization Doctors Without Borders demanded that the Syrian government and its allies \"halt the indiscriminate bombing that has killed and wounded hundreds of civilians —many of them children,\" over the past week in Aleppo. \nIt said from Sept. 21 to 26, hospitals still functioning in Aleppo reported receiving more than 822 wounded, including at least 221 children, and more than 278 dead bodies, including 96 children, according to the Directorate of Health in east Aleppo. \nIn the eastern province of Deir el-Zour, warplanes of the U.S.-led coalition destroyed several bridges on the Euphrates river, according to Syrian state news agency SANA and Deir el-Zour 24, an activist media collective. The province is a stronghold of the Islamic State group. Associated Press", "external_links": [], "published": "2016-10-02T02:56:00.000+03:00", "crawled": "2016-10-01T22:25:45.681+03:00", "highlightTitle": ""}