{"organizations": [], "uuid": "687c0de54e8e388bd57d12b61009a63f8601bf4b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 190, "shares": 190, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nbcnews.com", "main_image": "http://media2.s-nbcnews.com/j/newscms/2016_42/284961/140327-healthy-choices-jms-1804_66380e494969c46f0d6d6a97ba236d1c.nbcnews-fp-1200-800.jpg", "site_section": "", "section_title": "", "url": "http://www.nbcnews.com/news/asian-america/early-childcare-needs-take-focus-immigrant-workers-left-without-opportunity-n667621", "country": "US", "domain_rank": 478, "title": "As Early Childcare Needs Take Focus, Immigrant Workers Left Without Opportunity - NBC News", "performance_score": 1, "site": "nbcnews.com", "participants_count": 0, "title_full": "As Early Childcare Needs Take Focus, Immigrant Workers Left Without Opportunity - NBC News", "spam_score": 0.044, "site_type": "news", "published": "2016-10-19T08:00:00.000+03:00", "replies_count": 0, "uuid": "687c0de54e8e388bd57d12b61009a63f8601bf4b"}, "author": "Janine Wolf", "url": "http://www.nbcnews.com/news/asian-america/early-childcare-needs-take-focus-immigrant-workers-left-without-opportunity-n667621", "ord_in_thread": 0, "title": "As Early Childcare Needs Take Focus, Immigrant Workers Left Without Opportunity - NBC News", "locations": [], "entities": {"persons": [{"name": "opportun", "sentiment": "negative"}, {"name": "giles li", "sentiment": "none"}, {"name": "ed", "sentiment": "none"}, {"name": "janine wolf", "sentiment": "none"}, {"name": "li", "sentiment": "none"}, {"name": "kathy cheng", "sentiment": "none"}, {"name": "paul sakuma", "sentiment": "none"}], "locations": [{"name": "chinatown", "sentiment": "none"}, {"name": "massachusetts", "sentiment": "none"}, {"name": "boston", "sentiment": "none"}, {"name": "greater boston", "sentiment": "none"}], "organizations": [{"name": "acorn center for early education", "sentiment": "none"}, {"name": "migration policy institute", "sentiment": "none"}, {"name": "ecec", "sentiment": "none"}, {"name": "u.s. department of education", "sentiment": "none"}, {"name": "nbc asian america on facebook", "sentiment": "none"}, {"name": "bcnc", "sentiment": "none"}, {"name": "boston chinatown neighborhood center", "sentiment": "none"}, {"name": "national institute of child health and human development", "sentiment": "none"}, {"name": "acorn center for early education and care", "sentiment": "none"}, {"name": "nbc news", "sentiment": "none"}, {"name": "mpi", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "instagram", "sentiment": "none"}, {"name": "ap", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Oct 19 2016, 5:43 pm ET As Early Childcare Needs Take Focus, Immigrant Workers Left Without Opportunity by Janine Wolf American children are increasingly coming from immigrant backgrounds, but low wages and few pathways to advancement are pushing multilingual childcare workers out of the field. Paul Sakuma / AP file Share advertisement \nGiles Li knows what it's like to grow up in an immigrant family. \nGrowing up, Li watched as his immigrant parents worked hard to provide for himself and his sister with limited access to resources. Born in Boston, his upbringing forged a deep bond with the community in and beyond the city's Chinatown, where he currently works as the executive director of the Boston Chinatown Neighborhood Center, the largest social service provider for Asian families in the Greater Boston area. \"If implementing higher standards you are unintentionally pushing immigrant and other underrepresented providers out of the workforce. That's not good for children.\" \nThe center's services include education and career support, family engagement, as well as a dual-language child care center that fills the needs his parents once had when he was young. \nBut as government focus on early childhood education and care (ECEC) has sharpened and standards have risen , Li said he has witnessed an increasing number of multilingual workers forced to leave the field due to low wages and little hope for advancement. Additional training and education that would allow such workers to meet new standards is also lacking, according to a report from the Migration Policy Institute (MPI). \n\"If implementing higher standards you are unintentionally pushing immigrant and other underrepresented providers out of the workforce,\" Li told NBC News. \"That's not good for children.\" Sorry Adult Ed, but Acorn Center for Early Education is the cutest graduation ceremony at @BCNCInc this month! pic.twitter.com/nHPAm1evSl — Giles Li (@GilesLiBCNC) June 24, 2016 \nAs of 2015, one in four of the nation's 23 million children under age 6 were born to immigrant parents, according to the MPI (MPI). The growth in diversity among the young-child population — with a doubling of those with an immigrant parent from 2.9 million in 1990 to 5.8 million in 2015 — has been accompanied by increasingly diverse ECEC workers. \nNationally, close to 1.8 million people are employed in the ECEC workforce, according to the MPI. Of them, immigrants make up 18 percent, or approximately 321,000, of all ECEC workers. Post by NBC News . \nHistorically, the low barrier of entry into many early-childhood care and education positions has been beneficial to immigrant workers with less formal education, according to the MPI. However, the growing shift of focus on quality has resulted in immigrant being stuck in the lowest-paying jobs. \nIn 2015, 22 percent of immigrant ECEC workers made below the poverty line, the MPI found. In Massachusetts, where the Boston Chinatown Neighborhood Center operates, the average annual income is for an ECEC worker is $32,000 — just $9,000 higher than the federal poverty level. \n\"Without well-designed education and training support to make advanced credentials more accessible, policies that raise the education requirements for entry and advancement in the field may indirectly result in reduced diversity in the workforce, given the high proportion of immigrant workers who are [limited English proficient] or have low education levels,\" the MPI report reads. A chart, taken from a 2016 Department of Education report, showing the average hourly salary of ECEC workers. \nKathy Cheng, director of BCNC's Acorn Center for Early Education and Care, said the center has seen a lot of directors and teachers leaving for higher paying jobs, saying it's \"not because they want to do it but because they have to.\" \nThe struggle to find high-quality childcare caused by low wages has drawn the attention of the White House, which has proposed a $75 billion expansion of a federal program that would increase the funding of preschool programs for children of low- to moderate-income families. \"Without well-designed education and training ... policies that raise the education requirements for entry and advancement in the field may indirectly result in reduced diversity in the workforce.\" \nThe U.S. Department of Education found that high-quality providers and educators are the single most important factors in these early childhood experiences. \nStudies by the National Institute of Child Health and Human Development found that children in high-quality care are happier and perform better on social and cognitive measures, though \"less than 10 percent\" of child care arrangements actually meet those standards. \n\"It's important,\" Li said. \"It shouldn't be a field that is looked at as a stepping stone to public schools.\" \nIn the future, he hopes for a more holistic approach to policy-making, one that takes both ECEC workers and the children impacted into account. \n\"I'd hope moving forward there's an active effort to engage communities like ours in the decision making,\" he said. \nFollow NBC Asian America on Facebook , Twitter , Instagram , and Tumblr . Janine Wolf ", "external_links": [], "published": "2016-10-19T08:00:00.000+03:00", "crawled": "2016-10-20T06:14:44.511+03:00", "highlightTitle": ""}