{"organizations": [], "uuid": "b51bc8141d2463fbe14843e8a55a2e5c4c82b34e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nbcnews.com", "main_image": "http://media4.s-nbcnews.com/j/newscms/2016_39/1725681/160927-trump-0449_31b2966ea773b6a2bdbd593cbcef8fbe.nbcnews-fp-1200-800.jpg", "site_section": "http://www.nbcnews.com/politics", "section_title": "Politics - NBC News", "url": "http://www.nbcnews.com/politics/2016-election/full-list-donald-trump-s-rapidly-changing-policy-positions-n547801", "country": "US", "domain_rank": 478, "title": "A Full List of Donald Trump's Rapidly Changing Policy Positions", "performance_score": 0, "site": "nbcnews.com", "participants_count": 6, "title_full": "A Full List of Donald Trump's Rapidly Changing Policy Positions - NBC News", "spam_score": 0.0, "site_type": "news", "published": "2016-10-26T03:03:00.000+03:00", "replies_count": 5, "uuid": "b51bc8141d2463fbe14843e8a55a2e5c4c82b34e"}, "author": "Jane C. Timm", "url": "http://www.nbcnews.com/politics/2016-election/full-list-donald-trump-s-rapidly-changing-policy-positions-n547801", "ord_in_thread": 0, "title": "A Full List of Donald Trump's Rapidly Changing Policy Positions", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "negative"}, {"name": "jeb bush", "sentiment": "none"}, {"name": "anderson cooper", "sentiment": "none"}, {"name": "ku klux", "sentiment": "none"}, {"name": "saddam hussein", "sentiment": "none"}, {"name": "obamacare", "sentiment": "none"}, {"name": "katrina pierson", "sentiment": "none"}, {"name": "blitzer", "sentiment": "none"}, {"name": "wade", "sentiment": "none"}, {"name": "ted cruz", "sentiment": "none"}, {"name": "hussein", "sentiment": "none"}, {"name": "obama was born", "sentiment": "none"}, {"name": "lesley stahl", "sentiment": "none"}, {"name": "roe", "sentiment": "none"}, {"name": "larry kudlow", "sentiment": "none"}, {"name": "john dickerson", "sentiment": "none"}, {"name": "gadhafi", "sentiment": "none"}, {"name": "chris wallace", "sentiment": "none"}, {"name": "hope hicks", "sentiment": "none"}, {"name": "jr.", "sentiment": "none"}, {"name": "obama", "sentiment": "none"}, {"name": "clinton", "sentiment": "none"}, {"name": "paul krugman", "sentiment": "none"}, {"name": "marco rubio", "sentiment": "none"}, {"name": "steven mnuchin", "sentiment": "none"}, {"name": "anderson", "sentiment": "none"}, {"name": "hillary", "sentiment": "none"}, {"name": "jack kingston", "sentiment": "none"}, {"name": "elizabeth warren", "sentiment": "none"}, {"name": "savannah guthrie", "sentiment": "none"}, {"name": "manafort", "sentiment": "none"}, {"name": "chris christie", "sentiment": "none"}, {"name": "kellyanne conway", "sentiment": "none"}, {"name": "donald j. trump", "sentiment": "none"}, {"name": "barack obama", "sentiment": "none"}, {"name": "obama", "sentiment": "none"}, {"name": "tom barrack", "sentiment": "none"}, {"name": "howie carr", "sentiment": "none"}, {"name": "chuck todd", "sentiment": "none"}, {"name": "megyn kelly", "sentiment": "none"}, {"name": "bill o'reilly", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "david", "sentiment": "none"}, {"name": "bob", "sentiment": "none"}, {"name": "fox", "sentiment": "none"}, {"name": "christie", "sentiment": "none"}, {"name": "duke", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "david duke", "sentiment": "none"}, {"name": "conway", "sentiment": "none"}, {"name": "sean hannity", "sentiment": "none"}, {"name": "muammar gadhafi", "sentiment": "none"}, {"name": "mike pence", "sentiment": "none"}, {"name": "laura ingraham", "sentiment": "none"}, {"name": "wolf blitzer", "sentiment": "none"}, {"name": "jake tapper", "sentiment": "none"}, {"name": "paul manafort", "sentiment": "none"}, {"name": "chris matthews", "sentiment": "none"}], "locations": [{"name": "united states", "sentiment": "none"}, {"name": "iran", "sentiment": "none"}, {"name": "saudi arabia", "sentiment": "none"}, {"name": "syria", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "north korea", "sentiment": "none"}, {"name": "megyn kelly", "sentiment": "none"}, {"name": "phoenix", "sentiment": "none"}, {"name": "orlando", "sentiment": "none"}, {"name": "iowa", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}, {"name": "iraq", "sentiment": "none"}, {"name": "new hampshire", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "sacramento", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "seattle", "sentiment": "none"}, {"name": "massachusetts", "sentiment": "none"}, {"name": "middle east", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "ohio", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "atlanta", "sentiment": "none"}, {"name": "libya", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}, {"name": "vermont", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "benghazi", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "silicon valley", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}, {"name": "san bernardino", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}, {"name": "south korea", "sentiment": "none"}], "organizations": [{"name": "goldman sachs", "sentiment": "none"}, {"name": "fox news", "sentiment": "none"}, {"name": "ku klux klan", "sentiment": "none"}, {"name": "trump touts childcare deductions", "sentiment": "none"}, {"name": "bloomberg news", "sentiment": "none"}, {"name": "national rifle association", "sentiment": "none"}, {"name": "republican party", "sentiment": "none"}, {"name": "cnn", "sentiment": "none"}, {"name": "supreme court", "sentiment": "none"}, {"name": "cbsn", "sentiment": "none"}, {"name": "msnbc", "sentiment": "none"}, {"name": "kkk", "sentiment": "none"}, {"name": "tax foundation", "sentiment": "none"}, {"name": "gop", "sentiment": "none"}, {"name": "nbc", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}, {"name": "nato", "sentiment": "none"}, {"name": "bloomberg", "sentiment": "none"}, {"name": "nra", "sentiment": "none"}, {"name": "committee for a responsible federal budget", "sentiment": "none"}, {"name": "fox business", "sentiment": "none"}, {"name": "duke", "sentiment": "none"}, {"name": "republican", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "congress", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "usa today", "sentiment": "none"}, {"name": "new york times", "sentiment": "none"}, {"name": "wall street journal", "sentiment": "none"}, {"name": "abc", "sentiment": "none"}, {"name": "fortune", "sentiment": "none"}, {"name": "nbc news", "sentiment": "none"}, {"name": "isis", "sentiment": "none"}, {"name": "ystem", "sentiment": "none"}, {"name": "rnc", "sentiment": "none"}, {"name": "politico", "sentiment": "none"}, {"name": "harvard", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "tax policy center", "sentiment": "none"}, {"name": "crfb", "sentiment": "none"}, {"name": "national debt", "sentiment": "none"}, {"name": "washington post", "sentiment": "none"}, {"name": "trump international golf links & hotel ireland", "sentiment": "none"}, {"name": "democratic", "sentiment": "none"}, {"name": "cbs", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Current position: If I win the presidency, I don't see a problem with our electoral system.\nRIGGED SYSTEM 1. It's rigged!\nLocked in a heated primary battle with Ted Cruz, Trump said the political system was a \"rigged, disgusting, dirty system.\"\n2. I won so it's OK.\n\"You've been hearing me say it's a rigged system, but now I don't say it anymore because I won. It's true. Now I don't care. I don't care,\" Trump said in May when he secured the nomination.\n3. Be careful though, it's still rigged.\n\"Nov. 8, we'd better be careful, because that election is going to be rigged,\" he said August 1st in Ohio in a claim PolitiFact rated 'pants on fire' wrong. \"People are going to walk in and they're going to vote 10 times, maybe, who knows?\"\n3. It's rigged by the media.\nWith polls showing Trump trailing Clinton consistently, he challenged the legitimacy of the election and the polls he once championed.\n\"The election is being rigged by corrupt media pushing completely false allegations and outright lies in an effort to elect her president,\" Trump said October 15th.\n4. It's rigged by voter fraud and the media!\n\"The election is absolutely being rigged by the dishonest and distorted media pushing Crooked Hillary - but also at many polling places - SAD,\" he tweeted.\n5. Everything's rigged!\n\"When the people who control the political power in our society can rig investigations like her investigation was rigged, can rig polls, you see these phony polls, and rig the media, they can wield absolute power over your life, your economy, and your country, and benefit big time by it. They control what you hear and what you don't hear. What is covered, how it's covered, even if it's covered at all,\" Trump said at a Florida rally on October 24th.\nIMMIGRATION 1. Build a wall, deport all undocumented immigrants.\nTrump's campaign began with a promise to build a wall across the United States' southern border and deport the country's 11 million undocumented immigrants.\n2. Deport all undocumented immigrants but bring the \"good\" ones back legally.\nIn a CNN interview in July 2015, Trump said, \"I want to move them out, and we're going to move them back in and let them be legal, but they have to be in here legally.\"\n FROM AUG. 15, 2015: Obama's Immigration Executive Order Will Be 'Rescinded,' Trump Vows 0:27 3. Build the wall, deport criminals, triple the number of ICE officers, end birthright citizenship. In August 2015, Trump released a detailed, sprawling immigration plan that included a wide variety of ideas: Build the wall, make Mexico pay for it, deport criminal aliens, enhance penalties for overstaying visas, triple the number of ICE officers, pause immigration to try and employ unemployed Americans, cut worker visas and more. Trump's plan didn't detail how he'd enact most of his proposals, or how he'd pay for them. He's walked back or modified much of it since. 4. Use a deportation force to implement policy.\nIn November 2015, Trump said he'd use a mass deportation force in order to remove the 11 million people.\n\"You're going to have a deportation force. And your going to do it humanely,\" Trump said in November on MSNBC.\n5. Trump might be flexible on actually deporting 11 million undocumented immigrants.\nBuzzFeed report ed in February 2016 that in off-the-record talks with The New York Times , Trump admitted this was just bluster and a starting point for negotiations, saying he might not deport the undocumented immigrants as he's promised. Trump has refused calls to release the transcript, despite furious requests from his rival candidates.\n6. Deport undocumented immigrants, but don't call it \"mass deportations.\"\n\"President Obama has mass deported vast numbers of people — the most ever, and it's never reported. I think people are going to find that I have not only the best policies, but I will have the biggest heart of anybody,\" Trump told Bloomberg News in June 2016 when pressed about his immigration policies.\nWhen asked more about how he'd characterize the deportations at the center of his immigration policy, Trump said he \"would not call it mass deportations.\"\n7. A deportation force is \"TBD.\"\nTrump's newly hired campaign manager, Kellyanne Conway, dodged questions on the deportation force in August 2016 before saying that Trump's much-talked about deportation force from the primary was \"to be determined.\"\n8. \"I'm gonna do the same\" as past presidents.\nTrump championed President Obama's immigration strategy — deporting criminals first — in an interview with Fox News on Monday, August 22 when asked about how he'd deport 11 million illegal immigrants. He declined to answer questions of how he'd handle those who aren't criminals.\n9. I'm open to \"softening.\"\nThe next day, Trump told attendees of a town hall hosted by Fox News in Texas that he was open to \"softening\" laws to help immigrants already living in the United States peacefully. However, he followed that by saying that those who had overstayed visas — one of the key ways undocumented immigrants get into the U.S. — had to leave. \"You have to get them out. You have to get them out,\" Trump said.\nIt's unclear what or how he's softening his policy.\n10. \"There's no amnesty\" but \"we work with them.\"\nIn an interview with Fox News' Sean Hannity that aired Wednesday, August 24, Trump outlined an immigration plan that sounded an awful lot like the kind of path to legalization championed by Gov. Jeb Bush and Sen. Marco Rubio — the very people Trump excoriated for weak immigration plans while he campaigned on a promise of mass deportations.\n\"No citizenship. Let me go a step further — they'll pay back-taxes, they have to pay taxes, there's no amnesty, as such, there's no amnesty, but we work with them,\" Trump said.\n11. Deport \"criminal illegal immigrants\" within one hour of being sworn in.\nTrump worked to sound strong on illegal immigration at an event in Iowa on Saturday, August 27 — even if he was simply presenting a warp-speed version of current policy.\n\"On day one, I am going to begin swiftly removing criminal illegal immigrants from this country,\" he said . \"We are going to get rid of the criminals, and it will happen within one hour\" of being sworn in.\nTrump did not discuss how he would approach the millions of other undocumented immigrants, nor did he explain how he could accomplish implementing current policy so quickly.\n12. What's the plan again?\nOn Sunday, August 28, three Trump surrogates took to the airwaves to insist that Trump's immigration plan hadn't changed. But their answers on what that plan actually was — and is — only added to the confusion.\nRunning mate Gov. Mike Pence said there would be no path to citizenship, while Gov. Chris Christie said there would be no legalization at all. Campaign manager Kellyanne Conway dodged answering the question completely, simply saying he'd be humane.\n\"The question is what to do,\" she said.\n13. A deportation force is not currently being discussed.\nConway built on her August 28 interview when she said a deportation force was to be decided by saying it wasn't presently being discussed.\n\"He is not talking about a deportation force,\" she said.\n14. The plan — whatever the plan is — has never changed.\n\"Absolutely consistent,\" said Pence.\n\"Completely consistent,\" said Christie.\n\"Pretty consistent,\" said Conway.\n15. Deport all undocumented immigrants in due time, using a deportation force.\nTwo more surrogates muddled Trump's immigration policy just days later.\nSon Donald Trump, Jr. told CNN on August 30 that his father hoped to deport everyone.\n\"That's been the same, correct. But again, you have to start with baby steps. You have to let ICE do their job, you have to eliminate sanctuary cities, you have to get rid of the criminals certainly first and foremost, you have to secure the border. These are common sense things, Anderson,\" he said.\nMeanwhile, Trump surrogate Jack Kingston told MSNBC that a deportation force \"is part of it. We are going to learn more Wednesday.\"\n16. Don't worry, hardliners. There's no amnesty and Mexico will pay!\nIn a speech in Phoenix on September 1 Trump eased base concerns and re-upped his harsh immigration rhetoric by insisting that he would create a deportation task force, and there would be no \"amnesty.\"\nMere hours after meeting with the Mexican president who later said he'd told Trump that Mexico wouldn't pay for the wall, Trump reiterated that he still planned to make Mexico pay for the wall.\n17. But \"there's really quite a bit of softening.\"\nLater the day, Trump was pressed by conservative commentator Laura Ingraham about what had happened to \"the softening\" of his policy. He said \"there's softening,\" but didn't indicate what, exactly, was softening.\n\"Look, we do it in a very humane way, and we're going to see with the people that are in the country. Obviously I want to get the gang members out, the drug peddlers out, I want to get the drug dealers out. We've got a lot of people in this country that you can't have, and those people we'll get out,\" Trump said. \"And then we're going to make a decision at a later date once everything is stabilized ... I think you're going to see there's really quite a bit of softening.\"\n18. I won't rule out a path to citizenship.\nAsked September 6 if he'd rule out a pathway to citizenship for undocumented immigrants, Trump declined.\n\"I'm not ruling out anything,\" Trump said. \"We're going to make that decision into the future. OK?\" 19. We'll pay for the wall, Mexico will pay us back, OK?\n\"The End Illegal Immigration act fully funds the construction of a wall on our southern border,\" Trump said on October 22nd, outlining the plans for his first 100 days in office. \"With the full understanding that the country of Mexico will be reimbursing the United States for the full cost of such a wall, OK?\"\nCurrent position: Trump says he will deport millions, but he has not ruled out creating a pathway to citizenship. He'll build a wall, pay for said wall, but later he'll get reimbursed by Mexico.\nYOUNG UNDOCUMENTED IMMIGRANTS AND CHILDREN OF ILLEGAL IMMIGRANTS 1. Dreamers can maybe stay.\nTrump wavered on what to do with the Dreamers — young undocumented immigrants who were brought to this country by their parents as children who are now afforded limited protection from deportation via the DREAM Act but no path to citizenship.\nWhen asked if Dreamers would have to go back, he said, \"It depends.\"\n2. Nope, they can't stay.\nBy August 2015, that ambiguity was gone: \"They have to go,\" he said on \"Meet the Press.\"\n3. End birthright citizenship.\nTrump first proposed ending the 14th Amendment — the Constitutional provision that grants citizenship to those born in the country — last August. This is something few in his party agree on, and it's even more unclear how it would be applied: Does it apply to children of mixed status parents, where one parent is illegal? Or simply those with two undocumented immigrant parents? Would he revoke the citizenship of the estimated 4.5 million children born to illegal immigrants already here?\nThe Trump campaign did not answer questions from reporters at the time.\n4. \"American children\" also deserve dreams.\n\"Where is the sanctuary for American children?\" Trump asked during a late August rally while alluding Dreamers.\n\"The dreamers we never talk about are the young Americans. Why aren't young Americans dreamers also? I want my dreamers to be young Americans,\" he said, offering up a rhetorical device in place of policy.\nCurrent position: Deport children benefiting for the DREAM Act and repeal the 14th Amendment to end birthright citizenship.\nPROPOSED MUSLIM BAN 1. No Muslims should be allowed to enter the United States —as immigrants or visitors.\nDonald Trump called for \"a total and complete shutdown of Muslims entering the United States\" in a statement about \"preventing Muslim immigration\" in December.\n2. Ban Muslims from entering but make an exception for friends and Muslims serving in the US military.\nHe later amended his stance in an interview with Fox News, saying the 5,000 Muslims serving the United States military would be exempt from the ban and allowed to return home from overseas deployments. He also suggested that current Muslim residents — like his \"many Muslim friends\" — would be exempt, too, and able to come and go freely.\n3. The Muslim ban was just an suggestion.\n\"We have a serious problem, and it's a temporary ban - it hasn't been called for yet, nobody's done it, this is just a suggestion until we find out what's going on,\" Trump said on in mid-May, softening for the first time in months on the ban.\n4. Ban Muslims as a matter of policy, as well as people from countries with a history of terrorism.\nIn a national security address after the terror attack in Orlando, Trump said that if he's elected he would \"suspend immigration from areas of the world where there's a proven history of terrorism against the United States, Europe or our allies until we fully understand how to end these threats.\"\n5. Ban people from countries with a history of terrorism.\nWhen a reporter asked Trump how he'd feel about a Muslim Scot entering the U.S. while on a trip to visit his golf courses in Scotland, Trump said it \"wouldn't bother me.\" He then went on to emphasize that he did not want \"people coming in from the terror countries.\" When asked, Trump would not name one such country.\n6. Ban Muslims from countries with a history of terrorism, and potentially also other Muslims.\nThat same day, when pressed about how his statement in Scotland jived with Trump's proposal to ban all Muslims from entering the country, spokesman Hope Hicks said that the ban would just apply to Muslims from countries with a history of terrorism. She would not, however, confirm that Muslims residing in peaceful countries would be exempt.\n7. The Muslim ban was never about Muslims.\nThe next week, one spokesperson wrongly said the initial ban was not about Muslims.\n\"I know the news media has been reporting that the initial ban was against all Muslims, and that simply was not the case. It's simply for Muslim immigration, and Mr. Trump is adding specifics to clarify what his position is,\" Katrina Pierson told CNN, though advisers at the time said it was indeed about religion exclusively.\n8. Nothing has changed, nothing to see here.\n\"This is not accurate,\" spokesperson Hope Hicks said when asked if the policies were changing and removing the word \"Muslim.\" \"There has been no change from the exchanges over the weekend.\"\n9. The ban is negotiable.\nThen-campaign manager Paul Manafort in late May said the Muslim ban was negotiable, and how Trump initially articulated it was not what it would turn out in the end. Manafort said the policy is currently that \"where there is terrorist activity — Syria or Iraq — we will temporarily suspend immigration until we can establish a vetting system in which we can identify who people are who are coming in.\"\nThe government already has a rigorous, nine-step vetting process in place for refugees. Trump has previously included all Syrian refugees, including children and non-Muslims, in the ban.\n10. The ban would call for \"extreme vetting.\"\nMid July, Trump told \"60 Minutes\" that people from suspicious \"territories\" would receive \"a thing called 'extreme vetting.'\" He did not describe how \"extreme vetting\" would differ from the current vetting process.\n\"Call it whatever you want,\" Trump told CBS when asked if he was changing his previously released policy.\n11. The ban hasn't changed, I just don't like saying the word \"Muslim.\"\nOn Fox News in late July , Trump told Sean Hannity his position hadn't changed from his initial ban on Muslims entering the country.\n\"I think my position's gotten bigger, I'm talking about territories now. People don't want me to say Muslim—I guess I'd prefer not saying it, frankly, myself. So we're talking about territories.\"\n12. There's a ban, plus \"extreme vetting\" that includes an ideological test.\n\"The time is overdue to develop a new screening test for the threats we face today,\" Trump said in a speech in mid-August that reiterated his call for \"extreme vetting\" and reiterated that he'd temporarily ban immigration from some countries that he declined to identify.\nHe then proposed an ideological test for immigration.\n\"In addition to screening out all members or sympathizers of terrorist groups, we must also screen out any who have hostile attitudes toward our country or its principles ― or who believe that Sharia law should supplant American law,\" he said.\n13. There's no way to really do an ideological test.\n\"We don't know if they have love or hate in their heart,\" Trump said in September, articulating the problem many onlookers have expressed about his ban. \"There's no way to tell.\"\n14. Only people who love America are allowed.\nLater, despite acknowledging the impossibility of the task, Trump maintained that an ideological test is key to the nation's immigration system.\n\"We want to make sure we're only admitting those into our country who support our values and love - and I mean love - our people,\" he said.\n15. The ban has \"morphed.\"\nTrump was pressed on whether or not the Muslim ban still exists during the second presidential debate, and insisted that it was now only extreme vetting.\n\"The Muslim ban is something that in some form has morphed into an extreme vetting from certain areas of the world,\" Trump said, without actually saying whether or not the ban on travel still stands. \"It's called extreme vetting.\"\n FROM OCTOBER 9: Trump: Muslim Ban Has Morphed Into 'Extreme Vetting' 0:57 Current position: Trump will not say whether or not he intends to ban people of Muslim faith from the U.S., but he will say that \"extreme vetting\" will apply to people from certain countries. It's unclear where those countries are, what \"extreme vetting\" entails or how he intends to institute an ideological test for entry.\nWHETHER PRESIDENT OBAMA WAS BORN IN AMERICA 1. I don't know.\n\"I really don't know. I mean, I don't know why he wouldn't release his records. But you know, honestly, I don't want to get into it,\" Trump said in July 2015, asked about his inaccurate, years-long insistence that the president wasn't born in the United States. (President Obama had released his long form birth certificate in 2011.)\n2. I don't want to answer the question.\n\"I don't talk about that anymore,\" Trump said on MSNBC in December 2015 in response to a question about whether or not he believed President Obama was born in the United States.\n3. I'll explain my theory one day.\n\"Who knows [if Obama is a natural-born citizen]? Who knows? Who cares right now? We're talking about something else, OK? I'm going to have my own theory on Obama. Someday I'll write a book, I'll do another book that will do successfully,\" Trump said in January 2016.\n4. I'll only answer that question at the \"right time.\"\n\"I'll answer that question at the right time,\" Trump said mid-September 2016. \"I just don't want to answer it yet.\"\n5 . The president was born in the United States. \"Period.\"\n\"President Barack Obama was born in the United States, period,\" Trump said after a lengthy press conference touting his new hotel and veteran support.\n FROM SEPTEMBER 16: Trump: Obama Was Born in the United States, Period 0:43 6. She started it, I finished it by getting the birth certificate.\nIn his dismissal of the conspiracy theory he'd championed, Trump inaccurately claimed that Democratic nominee Hillary Clinton started the conspiracy theory.\n7. I only said it to \"get on\" with the campaign.\nAsked what changed to prompt his reversal after nurturing a conspiracy theory for five years, Trump said he acknowledged the president's birthplace to \"get on with — I wanted to get on with the campaign.\"\n8. I didn't say Obama was American because no one was asking.\nPressed in the first debate on September 26 on why Trump didn't lay the birther conspiracy to rest in the five years after Obama released his long-form birth certificate, the Republican candidate falsely claimed he didn't publicly affirm his belief that Obama is an American citizen because he wasn't asked.\n\"Well, nobody was pressing it, nobody was caring much about it,\" Trump said. \"I figured you'd ask the question tonight, of course. But nobody was caring much about it\"\n9. Clinton started it, and she's the one who should apologize, not me.\nTrump inaccurately insisted, again, that Clinton's campaign started the rumor, and said she should apologize to the president for it.\nCurrent position: Trump said he believes Obama was born in the United States because it is better for his campaign, but he continues to inaccurately argue Clinton started the birther movement — and that she should apologize for it.\nDEFEATING ISIS 1. Maybe send troops in. Definitely go after the oil fields.\nIn Trump's first interview after announcing his bid, he signaled that he'd both send in ground troops to Iraq and not send in ground troops.\n\"You bomb the hell out of them, and then you encircle it, and then you go in,\" he told Bill O'Reilly, who remarked that the plan necessitated ground forces. \"I disagree, I say that you can defeat ISIS by taking their wealth — their wealth is the oil.\"\n2. Bomb the oil fields. Send some troops in.\nOn CNN, Trump said, \"I would bomb the hell out of those oil fields. I wouldn't send many troops because you won't need them by the time I'm finished.\"\n FROM MARCH 30: Trump Declines to Rule Out Using Nuclear Weapons Against ISIS 1:59 3. Send troops to defeat ISIS. Don't forget about the oil fields.\nIn a single August interview on NBC's \"Meet the Press,\" he offered three solutions for what to do with the oil field profits: keep them, give them to veterans and their families, or, when pressed, perhaps give some to the Iraqi people.\nMonths later, in a March debate, Trump ballparked the number of troops he would need to send in to defeat ISIS.\n\"We really have no choice, we have to knock out ISIS,\" Trump said. \"I would listen to the generals, but I'm hearing numbers of 20,000-30,000.\"\n4. I've got this! I know more than the generals.\n\"I know more about ISIS than the generals do,\" Trump said in November in Iowa. \"Believe me.\"\n5. Destroy the oil. Let our regional allies send ground troops. If they don't, stop buying their oil.\nIn a foreign-policy focused interview with the New York Times published March 26, Trump said that the U.S. should \"take\" ISIS' oil, but then said the U.S. should \"knock the hell out of the oil and do it because it's a primary source of money for ISIS.\" Trump also ruled out sending in U.S. troops, saying that other countries in the region — \"regional Arab partners\" such as Saudi Arabia — should provide the ground troops. If these countries did not, the United States would stop buying their oil and withhold \"protection\" in the region.\n6. Declare war, send in some troops.\n\"We're going to declare war against ISIS. We have to wipe out ISIS,\" Trump said in his first interview with running mate Gov. Mike Pence. \"I am going to have very few troops on the ground. We're going to have unbelievable intelligence, which we need; which, right now, we don't have. We don't have the people over there.\"\nTrump said he'd involve NATO, despite the fact that he has said the U.S. should withdraw from NATO, and the surrounding states, as well. He added that Hillary Clinton created ISIS. ( PolitiFact deemed this statement to be false .)\n7. I'm going to ask the generals.\nMonths after saying he knew more than the generals, Trump said in early September that he'd ask them to map out a plan for defeating ISIS.\n\"Immediately after taking office, I will ask my generals to present to me a plan within 30 days to defeat and destroy ISIS,\" he said. \"This will require military warfare, but also cyber warfare, financial warfare, and ideological warfare.\"\n8. He's got a plan, and he'll tell you if asked.\n\"I've heard it,\" Trump campaign manager Kellyanne Conway said on MSNBC. \"He'll tell you if that question is asked. He'll be happy to offer specifics without telling the enemy exactly what we're going to do.\"\n9. Do more with computers.\nTrump cited his 10-year-old's proficiency with computers to argue that the U.S. needed to better fight ISIS using the internet.\n\"When you look at what ISIS is doing with the Internet, they're beating us at our own game, ISIS,\" Trump said. \"So we have to get very, very tough on cyber and cyber warfare. It is — it is a huge problem. I have a son. He's 10 years old. He has computers. He is so good with these computers, it's unbelievable. The security aspect of cyber is very, very tough. And maybe it's hardly doable.\"\nCurrent position: It's still unclear what Trump's plan to defeat ISIS is, but it will involve computers and it will be tough.\n'FIRST USE' AND NUCLEAR ARMS 1. I wouldn't strike first.\nAsked during the first presidential debate about whether he'd support 'first use,\" an un-official U.S. prohibition on the use of nuclear weapons against enemies who don't have nuclear capability, Trump said he wouldn't strike first -- a completely different issue.\n\"I would like everybody to end it, just get rid of it,\" he said of nuclear weapons. \"But I would certainly not do first strike.\"\n FROM SEPTEMBER 24: Trump: 'Can't Take Anything Off the Table' with Nuclear Weapons 0:58 2. Or maybe I would.\nShortly after saying he wouldn't do the first strike, Trump then reversed himself.\n\"At the same time, we have to be prepared. I can't take anything off the table. Because you look at some of these countries, you look at North Korea, we're doing nothing there,\" he said.\nCurrent Position: It's unclear where Trump stands on \"first use,\" or if he'd be willing to strike first.\nMINIMUM WAGE\n1. Against raising the minimum wage. Jobs would move to China.\nDuring the thick of the primaries, Trump repeatedly argued that raising the minimum would move jobs to countries like China. Speaking in the cold language of a businessman looking at his bottom line, Trump even seemed to indicate overall American wages, regardless of the law, were too generous already.\n\"Taxes too high, wages too high, we're not going to be able to compete against the world,\" Trump said in a November debate hosted by Fox Business. Trump clarified afterwards that he did not believe American wages were too high, but he did make crystal clear he was fundamentally opposed to a minimum wage increase.\n2. Wages should be raised through economic growth.\nTrump in an interview with CNBC in May said he would prefer to try to raise wages through economic growth. His abrupt move toward a possible increase that he opposed in tough terms is a significant general election shift.\n3. Raise the minimum wage.\n\"I am looking at it, and I haven't decided in terms of numbers. But I think people have to get more,\" Trump said on ABC on May 8, acknowledging that his statement was a shift when pressed.\n\"Sure, it's a change. I'm allowed to change,\" he said. \"But my real minimum wage is going to be — I'm going to bring companies back into this country, and they're going to make a lot more than the $15 even.\"\n4. Get rid of the federal minimum wage, leave it to the states.\nOn NBC on the same day, Trump said more specifically that he wanted states to mandate wages.\n\"Let me just tell you, I've been traveling the country for many months. Since June 16, I'm all over,\" he said. \"I have seen what's going on. And I don't know how people make it on $7.25 an hour. Now, with that being said, I would like to see an increase of some magnitude. But I'd rather leave it to the states. Let the states decide. Because don't forget, the states have to compete with each other.\"\n5. I want to increase it!\nIn a May 11 tweet criticizing Massachusetts Sen. Elizabeth Warren, Trump argued that he was \"asking for increase\" of the federal minimum wage.\n6. States should change it, but it will hurt them.\n\"I actually think that the states should make the decision,\" Trump said in an interview with a Seattle radio station, but argued that \"In some cases, states are going to become noncompetitive, and they're going to start losing maybe jobs and losing business, and they're going to have to readjust. Otherwise, they're just not going to have anything.\"\n7. Let's make it $10 dollars an hour.\nAs the Washington Post notes, Trump's shift here are lengthy and significant: He says he would support raising it to $10 an hour, argues he never wanted to abolish the federal minimum wage, which he did.\n8. It should go up, but states should call the shots here.\nIn a June news conference, Trump said \"the minimum wage has to go up. People are — at least $10, but it has to go up. But I think that states — federal — I think that states should really call the shot.\"\nCurrent position: Raise it to $10 an hour, ignore what I said before.\n FROM MARCH 29: California is poised to raise minimum wage to $15 an hour 0:19 TAXES 1. The wealthy should pay more.\n\"I would take carried interest out, and I would let people making hundreds of millions of dollars a year pay some tax, because right now they are paying very little tax and I think it's outrageous,\" Trump told Bloomberg last August, noting that he'd be OK paying more taxes. \"I want to lower taxes for the middle class.\"\n2. Cut taxes for the wealthy big time.\nIn September, Trump released a plan that silenced anti-tax critics with a proposal that slashed taxes for the wealthy by making the top marginal tax rate 25 percent. He radically simplified the tax plan by proposing just three brackets, 10 percent, 20 percent, and 25 percent. A whopping 67 percent of the overall cost of his individual tax cuts would go to the top 20 percent of earners, while 35 percent of it would go to the top 1 percent, according to the Tax Policy Center's analysis.\nHis plan is estimated to cut $10 trillion in tax revenue, which would be added to the national debt and deficit over a decade (more on Trump's flip-flopping position on paying off the national debt below). It's unclear how Trump would pay for such drastic cuts, but Trump insisted he could do it by offering the vague promise of striking better deals and cutting government waste.\n3. People like me should pay more.\nTrump was asked again in April during a \"TODAY\" town hall if he believed in raising taxes on the wealthy. Despite the big tax cuts for the wealthy outlined in his own tax plan, he said:\n\"I do, I do, including myself. I do.\"\nIn a series of interviews in early May, he claimed that his tax proposal was a starting point for negotiations and the taxes on the rich would go up.\nOn Sunday, May 8, Trump told ABC that taxes on the wealthy would \"go up a little bit\" in negotiations and that, as a wealthy person himself, he is personally OK with higher taxes. \"I am willing to pay more. And you know what? Wealthy are willing to pay more. We've had a very good run,\" he said.\nHe told NBC's Chuck Todd something similar: It's all negotiable.\n\"Under my proposal, it's the biggest tax cut by far, of any candidate by far. But I'm not under the illusion that that's going to pass. They're going to come to me. They're going to want to raise it for the rich. Frankly, they're going to want to raise it for the rich more than anybody else,\" Trump said. \"But the middle class has to be protected. The rich is probably going to end up paying more. And business might have to pay a little bit more. But we're giving a massive business tax cut.\"\nPressed on that last, confusing point - that business might pay more but also get a tax cut - Trump said he meant more than his existing proposal: \"Excuse me. I said they might have to pay a little bit more than my proposal.\"\nHe didn't offer such a qualification for the wealthy until the next day.\n4. I never said that! Cut everyone's taxes!\nOn Monday, May 9, he went on CNN to refute what he'd said the day before.\n\"I said that I may have to increase on the wealthy — I'm not going to allow it to be increased on the middle class — now, if I increase it on the wealthy, that means they're still going to be paying less than they're paying now. I'm not increasing it from this point, I'm talking about increasing from my tax proposal,\" Trump told CNN, insisting that overall there would be a tax decrease for the rich and middle class alike.\n5. Maybe don't slash taxes by $10 trillion — slash taxes by $3 trillion, instead.\nTrump senior economic adviser Larry Kudlow said Wednesday at an RNC event that the tax plan had been revised to only slash taxes by $3 trillion — a third of what was initially proposed — and lower the top individual tax rate to between 30-33 percent, up from the 25 percent initially proposed but below the current top tax rate of 39.6 percent. The campaign did not confirm this.\n6. Scrap the earlier plan entirely. Here are new tax brackets.\nTrump took his earlier tax plan offline before a major economic policy address in early August, where he hiked his initially proposed tax brackets from 10 percent, 20 percent and 25 percent to 12 percent, 25 percent and 33 percent. These brackets more closely mimic his party's past views on taxes.\n Trump Touts Childcare Deductions, Tax on U.S. Businesses Overseas 0:44 7. Maybe ditch, maybe keep a $1 trillion tax cut for small businesses (depending on who is asking).\nTrump publicly backed away from a trillion-dollar tax cut aimed at small businesses in order to optimistically claim that his tax plan won't add to the debt. But his campaign privately told a leading small business group he'd keep it.\nHis campaign then reiterated to the Tax Foundation, a nonpartisan group that analyzes tax plans, that he'd definitely get rid of it, according to a report by the New York Times on what they called a \"trillion-dollar lie.\"\nCurrent position: Despite Trump's frequent talk about helping working people, his tax plan so far seems to mostly benefit the wealthy. It's unclear whether or not his plan will include that small business tax cut.\nVOTING FOR THE IRAQ WAR 1. Clinton voted for the war, so she has bad judgment.\nTrump slammed Clinton in late June for her vote authorizing the invasion of Iraq.\n\"It all started with her bad judgment in supporting the War in Iraq in the first place. Though I was not in government service, I was among the earliest to criticize the rush to war, and yes, even before the war ever started,\" he falsely stated in his June 22 speech . (There is no evidence he opposed the invasion, but there is ample evidence that he supported it.)\n2. It doesn't matter, people make mistakes.\nPressed on his running mate Pence's vote for the Iraq war in an interview on 60 Minutes, Trump said in July he didn't \"care\" because \"it's a long time ago, and he voted that way and they were also misled.\"\n\"He's entitled to make a mistake every once in a while,\" Trump declared, telling CBS' Lesley Stahl of Clinton that \"no, she's not\" allowed to make a mistake herself.\nCurrent position: It's OK that Trump's running mate voted for the Iraq war, but it's not OK that Clinton did.\n FROM JUNE 21: Clinton goes after Trump's economic plans 3:11 GUNS 1. Get rid of gun-free zones\nIn a speech at the National Rifle Association convention on May 20, where Trump was endorsed by the country's most powerful gun group, Trump promised again to do away with gun-free zones, which include schools and military bases. At a campaign stop in Vermont, he had previously vowed to get rid of gun-free zones on his \"first day.\"\n2. No guns in classrooms, except maybe some guns in classrooms.\nIn an interview on May 22, the presumptive nominee advocated against, and then for, and then against, and then for guns in classrooms.\n\"I don't want to have guns in classrooms, although in some cases, teachers should have guns in classrooms, frankly,\" Trump said, offering up two distinct views in an interview days after he was endorsed the NRA. \"Because teachers, you know — things that are going on in our schools are unbelievable.\"\n3. I'm not advocating for guns in classrooms, but wait, yes I am.\nTrump walked back his view that teachers should have guns a second later, then reiterated that some teachers should have guns.\n\"I'm not advocating guns in classrooms,\" he continued. \"But remember, in some cases … trained teachers should be able to have guns in classrooms.\"\n4. Let's put trained gunmen in schools.\nForty-eight hours later, Trump sought to clarify his muddled remarks, saying he wanted \"school resource officers\" to have guns in schools while slamming rival Hillary Clinton's criticism of his stance.\n\"The way she said it meant like every student should be sitting there carrying guns,\" Trump said on CNN on May 24 . \"If trained people had guns, you wouldn't have the carnage that you've had.\"\n5. We should only get rid of some gun-free zones.\nWhile he decried gun-free zones as \"offering up candy to bad people,\" he backed away from axing all of them, telling CNN in the May 24 interview that they would only be eliminated \"in some cases.\"\n6. More guns would save lives.\nTrump has repeatedly said that he wished there were other armed individuals present during terror attacks to fight back.\n\"I think it would've been a lot better if they had guns in that room, somebody could protect,\" Trump said after the San Bernardino shooting in December. \"They could've protected themselves if they had guns.\"\nIn the wake of the deadly shooting in Orlando, Florida at a gay nightclub in June, Trump reiterated this view.\n\"It's too bad that some of the young people that were killed over the weekend didn't have guns, you know, attached to their hips, frankly, and you know where bullets could have flown in the opposite direction,\" he said on the \"Howie Carr Show\" on June 13, one day after the attack. \"It would have been a much different deal. I mean, it sounded like there were no guns. They had a security guard. Other than that there were no guns in the room. Had people been able to fire back, it would have been a much different outcome.\"\n(Despite Trump's assertions, there was an armed guard at the club who tried to stop the gunman, but he was unable to do so.)\nAt a rally in Atlanta on June 15, Trump declared that the outcome would have been different if \"some of those great people that were in that club that night had guns strapped to their waist or strapped to their ankle.\"\n FROM JUNE 13: Donald Trump reacts to Orlando shooting: Criticizes Hillary Clinton, Obama 5:44 7. I didn't actually mean arming clubgoers.\nAfter he spent a week advocating for arming more of the victims (who were predominantly clubgoers, in addition to several club employees), Trump tweeted on June 20 that he didn't mean he wanted to arm clubgoers. Trump changed his stance just hours after the National Rifle Association pushed back against the idea of allowing people to bring weapons into nightclubs.\n\"I was obviously talking about additional guards or employees,\" Trump tweeted .\nCurrent position : More guns are better, though the details are murky and evolving on how many gun-free zones would be abolished.\n2011 INTERVENTION IN LIBYA 1. The intervention in Libya by the U.S.-led coalition was a terrible idea.\nAsked in October 2015 if he felt the Middle East would be more stable with Libyan dictator Muammar Gadhafi and Iraq's authoritarian leader Saddam Hussein still in power, Trump told NBC News' Chuck Todd, \"Of course it would be. You wouldn't have had your Benghazi situation, which is one thing which was just a terrible situation…But of course, it would. Libya is — is not even — nobody even knows what's goin' on over there. It's not even a country anymore.\"\nA few weeks later, he was pressed again on CNN to say whether he felt the two leaders of brutal regimes should have been left in power.\n\"100 percent,\" Trump said. \"I mean, look at Libya. Look at Iraq. Iraq used to be no terrorists. [Hussein] would kill the terrorists immediately, which is like now it's the Harvard of terrorism.\"\nHe continued: \"If you look at Iraq from years ago, I'm not saying he was a nice guy, he was a horrible guy, but it was a lot better than it is right now. Right now, Iraq is a training ground for terrorists. Right now, Libya, nobody even knows Libya — frankly, there is no Iraq and there is no Libya. It's all broken up. They have no control. Nobody knows what's going on.\"\n2. I've never offered a different opinion on Libya.\nWhen then-rival Sen. Ted Cruz brought up Trump's 2011 support for the intervention, which Trump offered at the time via a video blog, during a February debate, Trump denied having ever supported Gadhafi's ouster.\n\"He said I was in favor in Libya,\" he said. \"I never discussed that subject. I was in favor of Libya? We would be so much better off if Gadhafi would be in charge right now.\"\n3. I guess I did support an intervention.\nWhen CBS actually played the video of Trump discussing the subject — and supporting an intervention — in front of Trump in early June 2016, the presumptive nominee changed his mind and acknowledged the past video.\n\"That's a big difference from what we're talking about,\" Trump said. \"I was for something, but I wasn't for what we have right now.\"\n4. I wanted a surgical intervention, not a \"strong\" intervention.\nWhen pressed during the CBS interview, Trump said he was for \"surgical\" intervention, not a \"strong intervention.\"\n\"I didn't mind surgical. And I said surgical. You do a surgical shot, and you take him out. But I wasn't for what happened. Look at the way - I mean, look at with Benghazi and with all of the problems that we've had. It was handled horribly,\" he said.\n\"I think since then you've said you were never for intervention, so it's confusing,\" CBS's John Dickerson countered.\n\"I was never for strong intervention. I could have seen surgical where you take out Gadhafi and his group,\" Trump responded.\n5. We really should have taken the oil in Libya, too, since we were there.\nIn the first debate, Trump inaccurately claimed ISIS now controls huge oil stores in Libya (they don't) and that the U.S. should have taken the oil after the intervention. (That would have violated the Geneva Conventions.)\nCurrent position: As Trump put it, \"I was for something, but I wasn't for what we have right now.\" That \"something\" seems to include violating the Geneva Conventions to seize Libyan oil.\nJAPAN AND NUKES 1. Japan should have nuclear weapons.\nIn March, Trump said the U.S. should reconsider its policy of not allowing Japan to have nuclear weapons. He reiterated that view in April.\n\"It's not like, gee whiz, nobody has them. So, North Korea has nukes. Japan has a problem with that. I mean, they have a big problem with that. Maybe they would in fact be better off if they defend themselves from North Korea,\" Trump said on Fox News in April .\nHost Chris Wallace followed up, asking, \"With nukes?\"\n\"Including with nukes, yes, including with nukes,\" Trump said.\n2. I never said that!\nBut at a Sacramento rally in June, Trump accused Clinton of lying when she repeated his view as an example of his unfitness when it comes to matters of national security.\nClinton \"made a speech, she's making another one tomorrow, and they sent me a copy of the speech. And it was such lies about my foreign policy, that they said I want Japan to get nuclear weapons. Give me a break,\" Trump said. \"See they don't say it: I want Japan and Germany and Saudi Arabia and South Korea and many of the NATO states, nations, they owe us tremendously, we're taking care of all those people and what I want them to do is pay up.\"\nCurrent position: It's unclear whether Trump would reverse U.S. policy to allow Japan to have nuclear weapons, but it's clear Trump doesn't like being reminded of the previous positions he took.\n FROM MAY 27: Former VP Mondale on Nuclear Dangers, Decision 2016 15:04 CLIMATE CHANGE 1. I don't believe in it.\n\"I don't believe in climate change,\" he told CNN in September after a long history of calling it both a hoax and a Chinese invention to undermine U.S. business interests. In May 2016, he vowed to \"renegotiate … at a minimum\" the Paris climate agreement, one of the Obama administration's landmark achievements.\n2. Global warming is threatening one of my golf courses.\nA statement of environmental impact filed by the Trump International Golf Links & Hotel Ireland, owned by the presumptive Republican nominee, cited rising sea levels and extreme weather due to global warming as the reason the company needed to build a seawall to protect its coastal resort, Politico reported Monday. The sea wall is necessary protect the course from \"global warming and its effects.\"\n3. I never said climate change was a hoax.\nDuring the first presidential debate in late September, Trump denied ever saying climate change was a hoax perpetuated by the Chinese (though you can still read his tweet on the matter here.)\n4. Trump believes in climate change, but not that it's man-made.\nTrump's campaign manager offered a more common Republican theory to explain Trump's views: Climate change is real, but it's \"naturally occurring.\"\nCurrent position: Global warming is real, but it's not man-made.\nNATIONAL DEBT 1. Get rid of the national debt in 8 years.\nOn March 31, Trump told the Washington Post that the country needed to eliminate the national debt and that he could do it \"fairly quickly\" without raising taxes.\n\"I would say over a period of eight years,\" he said, arguing he could do it simply by renegotiating the country's trade deals. \"I'm renegotiating all of our deals, Bob. The big trade deals that we're doing so badly on. With China, $505 billion this year in trade. We're losing with everybody.\"\n2. Only pay down a little. Invest in infrastructure first.\nThree weeks later, he told Fortune \"you could pay off a percentage of it\" in a decade but he wouldn't advise being too aggressive because the country's infrastructure needs to be rebuilt and it's a good time to borrow.\n\"It depends on how aggressive you want to be. I'd rather not be so aggressive,\" he said. \"Don't forget: We have to rebuild the infrastructure of our country. We have to rebuild our military, which is being decimated by bad decisions. We have to do a lot of things. We have to reduce our debt, and the best thing we have going now is that interest rates are so low that lots of good things can be done that aren't being done, amazingly.\"\nIt's an argument progressive liberal economists like Paul Krugman could have (and actually have) made . Not only is it far from his original position, it's far from his party's view on the issue.\n3. Pay off the debt by getting America's creditors to accept less.\nDespite the U.S. economy being fundamentally grounded in its ability to borrow at very low interest rates, Trump told CNBC that he would negotiate with creditors to get them to accept less than the full amount owed.\n\"I would borrow, knowing that if the economy crashed, you could make a deal,\" Trump said.\nExperts say this idea is pure fantasy, no matter how good Trump's deal-making skills are. In addition to imperiling the economy, the proposal could also be unconstitutional.\n4. Don't worry about it — the U.S. can't default because we \"print the money.\"\nA week after suggesting that he could get U.S. creditors to accept less than the full amount, Trump defended his stance on CNN by calling himself \"the king of debt\" and railing against publications that reported his earlier proposal.\n\"People said I want to go and buy debt and default on debt, and I mean, these people are crazy. This is the United States government,\" he said on CNN on May 9.\" \"First of all, you never have to default because you print the money, I hate to tell you, OK?\"\nHe then advocated for buying back some of the government's debt at a discount, using interest rates to save the country money. It's a strategy that works may work for businesses but would be more difficult, if not impossible for the U.S. government, economists told the Washington Post.\n\"I understand debt better than probably anybody. I know how to deal with debt very well. I love debt — but you know, debt is tricky and it's dangerous, and you have to be careful and you have to know what you're doing,\" Trump said.\n5. I won't try to renegotiate the national debt.\n\"We have to start chopping that debt down,\" Trump told CBS in June. \"I wouldn't renegotiate the debt. I'd negotiate, if I do a deal in a corporation, as an example, and if the economy goes bad, I'll oftentimes renegotiate that debt. But that's a different thing. That's just a corporate thing. And other people like me, very big people in the world of business, they do that.\"\n6. Take out new loans and pay back debt with new debt.\n\"I think it could be a good time to borrow and pay off debt, borrow debt, make longer-term debt,\" he said in the same June CBS interview.\n7. My plans are deficit neutral.\n\"It will be deficit neutral,\" Trump said of his economic plan released in September. \"It will be accomplished through a complete overhaul of our tax, regulatory, energy and trade policies.\"\n8. Maybe borrow $10 trillion.\nOne of Trump's advisers echoed the skepticism many had of Trump's plans: that they would cost a lot more than Trump's tax plan would bring in.\nTom Barrack, an adviser, said Trump's policies would increase the national debt by $10 trillion — money the nation would have to borrow to accomplish Trump's plans.\nCurrent position: Either \"chop\" the national debt using an approach that is still unclear, or add $10 trillion to the debt to accomplish plans.\n FROM JUNE 21: U.S. 'doesn't do business Trump's way,' Clinton says 6:08 ABORTION 1. Criminalize women who have abortions.\nThough Trump said in 1999 that he was \"very pro-choice,\" Trump has consistently claimed that he's against abortion, except for in cases of rape, incest, or to save the mother's life, since starting his bid last June.\nBut during an exclusive interview with MSNBC's Chris Matthews just after 1 p.m., Trump struggled to define his views on abortion aside from describing himself as \"pro-life.\" When continually pressed for how he'd handle women who violated a theoretical ban on abortion, Trump said the \"answer is that there has to be some form of punishment, yeah.\"\n2. Let the states decide what to do about criminalizing abortion.\nAt 3:36 p.m., Trump put out a statement saying the issue is \"unclear and should be put back into the states for determination.\"\n3. Never mind. Don't punish the women.\nHe fully walked back his position that women should be punished for violating a theoretical abortion ban 80 minutes later, releasing a statement saying \"the doctor or any other person performing this illegal act upon a woman would be held legally responsible, not the woman. The woman is a victim in this case as is the life in her womb.\"\n4. Probably overturn Roe v. Wade, then let states handle it.\nPressed three times in the final presidential debate on whether he hoped his anti-abortion Supreme Court nominees should overturn Roe v. Wade, Trump said \"that will happen automatically in my opinion. Because I am putting pro-life justices on the court.\"\nHe went on to say that after it's overturned states should handle it: \"I will say this. It will go back to the states and the states will then make a determination.\"\nCurrent position : Overturn Roe v. Wade, then let states decide it.\n FROM MARCH 30: Trump backs 'some form of punishment' for abortion 6:36 MONEY IN POLITICS 1. Accepting donations means a candidate is controlled by special interests.\nTrump announced that he'd self-fund his campaign when he announced his presidential bid. This, he said, time and time again would help him better serve the country against the corrupting force of money in politics.\n\"By self-funding my campaign, I am not controlled by my donors, special interests or lobbyists. I am only working for the people of the U.S.!\" he wrote in a September 5 Facebook post.\n2. People can donate to me as long as they don't want anything in return.\nDespite the self-funding promise, the Trump campaign quietly sent out fundraising emails, put a glossy donate option on its website and raked in millions. Still, Trump insists, it's about investment in the campaign — not the cash itself.\n\"I actually like the idea of investing in a campaign, but it has to be no strings attached,\" he said in a CBS interview.\n3. The Trump campaign will not fully self-fund.\nAs the presumptive nominee, Trump has said he won't self-fund like he did in the primary.\n\"I'll be putting up money, but won't be completely self-funding,\" he told the Wall Street Journal in a May 4 interview , noting that he's created a finance committee and will tap his base for money going into the general election. He's hired Steven Mnuchin, a former Goldman Sachs partner who has a history of political donations across both sides of the aisle, to head up the committee.\nThis is a reversal, but only in rhetorical terms, since Trump isn't exactly self-funding his primary campaign, despite his loud protestations to the contrary. PolitiFact dubs his claim \"half true\" because Trump is pulling in big bucks from donors and most of his own contributions are technically loans or in-kind contributions, signaling that he may want to recoup those costs eventually.\nCurrent position: Political donations are fine when those donations benefit the Trump campaign.\n FROM MARCH 29: The many flip-flops of Donald Trump 2:14 VIOLATING U.S. AND INTERNATIONAL LAWS WITH REGARD TO TORTURE, TERRORISM 1. The military will obey potentially illegal orders.\nIn December, Trump started demanding that the US target the families of ISIS members in addition to \"bombing the sh*t\" out of the terrorist organization. He went further in February, advocating for torture as a method of interrogation.\n\"I would bring back waterboarding, and I'd bring back a hell of a lot worse than waterboarding,\" Trump declared in the February debate just ahead of the New Hampshire primary. Calls for bringing torture back became a regular applause line at rallies, despite the likelihood that both of these ideas would require the American military to obey orders that violate international laws and federal anti-torture statutes.\nPressed at a debate on March 3 over whether the American military would obey his order to violate international laws and the Geneva Convention to do such things, Trump insisted they'd listen to him, despite condemnation from military leaders and conservatives.\n\"Frankly, when I say they'll do as I tell them, they'll do as I tell them,\" he said.\n2. The military shouldn't break the law, after all.\nHe then reversed this position the very next day, on March 4, in a statement to the Wall Street Journal, saying he \"will not order military or other officials to violate those laws and will seek their advice on such matters.\"\n3. The laws forbidding torture should be changed so no one has to break them.\nNot long after terrorist attacks in Brussels killed at least 28 people and injured dozens more on March 22, Trump called in to CNN to expand on his call to legalize waterboarding.\n\"Look, I think we have to change our law on the waterboarding thing, where they can chop off heads and drown people in cages, in heavy steel cages and we can't water board,\" Trump told CNN's Wolf Blitzer. \"We have to change our laws and we have to be able to fight at least on almost equal basis.\"\nWhen Blitzer reminded Trump that military leaders don't support torture and that it violates international agreements that the United States has signed, Trump called opposition to torture a \"political decision.\"\n\"I would say that the eggheads that came up with this international law should turn on their television and watch CNN right now, because I'm looking at scenes on CNN right now as I'm speaking to you that are absolutely atrocious,\" Trump said. \"And I would be willing to bet, when I am seeing all of the bodies laying all over the floor, including young, beautiful children laying dead on the floor, I would say if they watched that, maybe, just maybe they'll approve of waterboarding and other things.\"\nCurrent position : Trump says he's against violating international laws or ordering others to do so, but wants to change the laws to legalize, at minimum, waterboarding.\n FROM MARCH 22: 'Waterboarding would be fine' for Paris terror suspect, Trump says 6:31 VISAS FOR HIGH-SKILLED WORKERS 1. H-1B visas are bad for American workers.\nTrump's immigration plan was published on his website in August 2015: it opposed the H-1B program, which allows non-immigrant visas for specialty occupations, arguing then that it was bad for American workers.\n2. H-1B visas are good.\nAt the CNBC debate in October, Trump denied that he'd been critical about the program. \"I am all in favor of keeping these talented people here so they can go to work in Silicon Valley,\" he said.\n3. H-1B visas are still bad, according to Trump's unchanged website.\nAt the Fox News debate on March 3, some five months later, Fox News host Megyn Kelly pressed Trump on which of these conflicting views he supports.\n4. H-1B visas are necessary: 'I'm changing.'\n\"I'm changing. I'm changing. We need highly skilled people in this country. If we can't do it, we will get them in. And we do need in Silicon Valley, we absolutely have to have. So we do need highly skilled,\" he said.\n5. H-1B visas are definitely bad.\nHis campaign later released a statement reversing this shortly after the March 3 debate ended.\n\"Megyn Kelly asked about highly skilled immigration. The H-1B program is neither high-skilled nor immigration: These are temporary foreign workers, imported from abroad, for the explicit purpose of substituting for American workers at lower pay,\" Trump wrote in a statement. \"I will end forever the use of the H-1B as a cheap labor program and institute an absolute requirement to hire American workers first for every visa and immigration program. No exceptions.\"\nHe reaffirmed this position in the GOP debate on March 10 , one week later, vowing to end the program that he noted he uses himself as a businessman.\nCurrent position: Back where he started — against the H-1B visa program.\n FROM JULY 12, 2015: A Look at Donald Trump's Evolving Positions Over the Years 3:58 BORDER CONTROL AND THE REFUGEE CRISIS 1. The U.S. has a 'humanitarian' obligation to take in some Syrian refugees.\nTrump initially said the country should absorb Syrian refugees.\n\"I hate the concept of it, but on a humanitarian basis, you have to,\" Trump told Bill O'Reilly on Fox News on a Tuesday night in September. \"But you know, it's living in hell in Syria. There's no question about it. They're living in hell, and something has to be done.\"\n2. The U.S. cannot and should not accept Syrian refugees.\nThe next day, Trump said the country couldn't welcome refugees fleeing the Syrian civil war.\n\"Look, from a humanitarian standpoint, I'd love to help. But we have our own problems,\" he said on Fox.\nDuring the March debate, Trump defended his changing view.\n\"First time the question had been put to me, it was very early on. The migration had just started. And I had heard that the number was a very, very small number. By the second day, two or three days later, I heard the number was going to be thousands and thousands of people. You know, when they originally heard about it, they were talking about bringing very, very small numbers in, and I said, begrudgingly, well, I guess maybe that's OK,\" Trump said. \"By the time I went back and studied it, and they were talking about bringing thousands and thousands, I changed my tune. And I don't think there's anything wrong with that.\"\n3. Close the border.\n\"I'd close up our borders to people until we figure out what is going on,\" Trump said on Fox News the morning of the Brussels attacks claimed by ISIS that killed at least 28 and injured more than 270.\n4. Don't close the border, just be careful.\n\"I didn't say shut it down — I said you have to be very careful, you have to be careful on who's coming into our country,\" he said the same day as the Fox News interview on CBSN, reiterating that people from Syria without papers shouldn't be allowed in.\nCurrent position : Against closing the borders entirely. Against accepting Syrian refugees in the United States.\nKU KLUX KLAN AND DAVID DUKE 1. 'I disavow, OK?'\nAfter former Ku Klux Klan grand wizard and white nationalist David Duke began encouraging his followers to vote for the Republican front-runner, including making a plea on his radio show on February 25, Trump initially disavowed Duke's support in a press conference on February 26.\n\"I didn't even know he endorsed me. David Duke endorsed me? OK, all right. I disavow, OK?\" Trump said.\n2. 'I don't know anything about David Duke. OK?'\nAfter disavowing David Duke on a Friday, Trump was asked about the Ku Klux Klan and Duke by CNN's Jake Tapper on Sunday. Trump claimed to know nothing of Duke or the KKK.\n\"I don't know anything about David Duke. OK? I don't know anything about what you're even talking about with white supremacy or white supremacists. So I don't know. I don't know, did he endorse me or what's going on, because, you know, I know nothing about David Duke. I know nothing about white supremacists. And so you're asking me a question that I'm supposed to be talking about people that I know nothing about,\" Trump said, refusing three times to unequivocally condemn the support of white supremacists until he knew more about them.\n3. 'I disavow, OK?' — part two.\nAfter that cagey song and dance-like interview sparked outrage, Trump took to Twitter to clarify, tweeting a video of his Friday press conference in which he did disavow Duke.\nAs I stated at the press conference on Friday regarding David Duke- I disavow. pic.twitter.com/OIXFKPUlz2\n— Donald J. Trump (@realDonaldTrump) February 28, 2016 The next day on NBC's \"Today,\" Trump blamed his refusal to condemn Duke and the KKK on a lousy earpiece but continued to hedge against disavowing the support of \"groups\" he doesn't know anything about, despite Savannah Guthrie's reminder that in the interview in question, Trump had been only been asked about the KKK and Duke.\nCurrent position : Trump has disavowed Duke, despite a lengthy back-and-forth about whether he knows about him or not.\nTHE IRAN NUCLEAR DEAL 1. Keep the current deal with Iran, police it.\nTrump was one of the few Republicans who didn't immediately promise to rip up the Iranian nuclear deal. The author of \"The Art of the Deal\" told his supporters that while it was the worst deal ever, they'd probably have to live with it.\n\"It's very hard to say, \"We're ripping it up.' And the problem is by the time I got in there, they will have already received the $150 billion,\" Trump said, referring to a high estimate of how many of Iran's assets will be unfrozen as part of the deal (the White House says after Iran's debts are paid, it's closer to $56 billion).\n\"But I will police that deal,\" he said, touting his handling of business contracts. \"I would police that contract so tough that they don't have a chance. As bad as the contract is, I will be so tough on that contract.\"\n2. Renegotiate the nuclear deal with Iran.\nIn September, he went further.\n\"When I am elected president, I will renegotiate with Iran — right after I enable the immediate release of our American prisoners and ask Congress to impose new sanctions that stop Iran from having the ability to sponsor terrorism around the world,\" he wrote in an op-od for USA Today.\nCurrent position : Renegotiate the deal.\n These are the blue states Donald Trump needs to flip red to win 2:29 HEALTH CARE 1. Repeal Obamacare. Look to Canada for inspiration.\nIn August, Trump was asked repeatedly if he still supported the single-payer health care he'd touted in the past. He said America should have a private system but repeatedly praised Canada and Scotland's socialized system.\n\"As far as single-payer, it works in Canada. It works incredibly well in Scotland. It could have worked in a different age, which is the age you're talking about here,\" Trump said. \"What I'd like to see is a private system without the artificial lines around every state … Get rid of the artificial lines, and you will have yourself great plans. And then we have to take care of the people that can't take care of themselves. And I will do that through a different system.\"\n2. Repeal Obamacare. Cover everybody.\n\"I am going to take care of everybody,\" Trump told CBS in September. \"I don't care if it costs me votes or not. Everybody's going to be taken care of much better than they're taken care of now.\"\n3. Repeal Obamacare, but 'I like the mandate'\nDuring a CNN town hall on February 18, Trump started to answer a question about how he'd replace the Affordable Care Act with health savings accounts, \"which are great,\" but interrupted himself to talk at length about how he's \"a self-funder.\" When pressed by interviewer Anderson Cooper about what would happen when Obamacare is repealed and the mandate disappeared, therefore allowing insurance companies to deny coverage to those with pre-existing conditions, Trump said:\n\"Well, I like the mandate. OK. So here's where I'm a little bit different. I don't want people dying on the streets and I say this all the time.\"\n4. Repeal Obamacare. Replace it with something.\nTrump was mocked in the February 25 debate for being vague about how he would replace Obamacare.\n\"You'll have many different plans. You'll have competition, you'll have so many different plans,\" he said at the debate, earning derision from Sen. Marco Rubio.\n5. Repeal Obamacare. Not everyone will be covered.\nHis health care plan, finally released online in March, has far more in common with the kind of boilerplate health care proposals the rest of the Republican party touts than his earlier praise for Canada suggested it might.\nIt would likely cause 21 million people to lose their health insurance and cost about $270 billion over 10 years, according to the nonpartisan budget advocacy group Committee for a Responsible Federal Budget (CRFB).\nIt offers up unspecified amounts of grants to states to replace Medicaid, but it's not clear how or what those would look like, or how they would cover the millions of people that Trump's plan lets fall through the cracks. CRFB noted that block grants \"could generate a wide range of savings\" to the federal budget, but without details on them, it is \"impossible to score any savings\" from his plan.\nCurrent position : Repeal Obamacare. Replace it with something.", "external_links": ["http://on.msnbc.com/28M0oAz", "https://plus.google.com/share?url=http://www.msnbc.com/msnbc-news/watch/trump-s-controversial-abortion-comments-655208515561", "http://link.theplatform.com/s/2E2eJC/r0Yb05IRHFSf", "http://media4.s-nbcnews.com/j/msnbc/components/video/201608/2016-08-08t16-41-07-966z--1280x720.nbcnews-ux-440-240.jpg", "http://www.nytimes.com/2016/09/17/us/politics/trump-tax-plan.html?_r=0", "http://nbcnews.to/2dV7fW6", "http://media1.s-nbcnews.com/j/msnbc/components/video/201606/tdy_guth_trump_160613.nbcnews-ux-360-200.jpg", "http://link.theplatform.com/s/2E2eJC/UKAbPVCvhGDK?mbr=true", "http://link.theplatform.com/s/2E2eJC/6kKX3aevCt5L?mbr=true", "https://plus.google.com/share?url=http://www.today.com/video/these-are-the-blue-states-donald-trump-needs-to-flip-red-to-win-734607427844", "http://link.theplatform.com/s/2E2eJC/__OLxzDVtbea?mbr=true", "http://media2.s-nbcnews.com/j/msnbc/components/video/__new/a_mtp_trumpimmigration_150815.nbcnews-ux-440-240.jpg", "https://www.facebook.com/sharer.php?u=http://www.nbcnews.com/meet-the-press/video/trump-if-im-elected-obamas-immigration-executive-order-gets-rescinded-505818691739&t=FROM", "http://media1.s-nbcnews.com/i/MSNBC/Components/Video/__NEW/tdy_lauer_trump_160322.jpg", "http://media1.s-nbcnews.com/j/msnbc/components/video/__new/2016-03-30t19-01-31-1z--1280x720.nbcnews-ux-440-240.jpg", "http://player.theplatform.com/p/2E2eJC/nbcNewsOffsite?guid=tdy_mor_wage_160329", "http://media1.s-nbcnews.com/j/msnbc/components/video/201605/n_mtpd_mondalefull_160527.nbcnews-ux-1240-700.jpg", "http://media1.s-nbcnews.com/j/msnbc/components/video/__new/tdy_lauer_trump_160322.nbcnews-ux-360-200.jpg", "https://www.facebook.com/sharer.php?u=http://www.today.com/video/donald-trump-reacts-to-orlando-shooting-criticizes-hillary-clinton-obama-704391748002&t=FROM", "http://media1.s-nbcnews.com/j/msnbc/components/video/201606/tdy_guth_trump_160613.nbcnews-ux-440-240.jpg", "http://link.theplatform.com/s/2E2eJC/aTIpg9jor5kW", "http://media3.s-nbcnews.com/j/msnbc/components/video/201609/f_dc_trump_birther_160916.nbcnews-ux-1080-600.jpg", "https://twitter.com/share?text=Trump", "http://www.today.com/video/these-are-the-blue-states-donald-trump-needs-to-flip-red-to-win-734607427844", "http://link.theplatform.com/s/2E2eJC/IBfBIP01sAt_?mbr=true", "http://www.msnbc.com/msnbc-quick-cuts/watch/the-many-flip-flops-of-donald-trump-654491715547", "http://www.cnn.com/2016/05/23/politics/donald-trump-guns/index.html?wpmm=1&wpisrc=nl_daily202", "http://nbcnews.to/2auQcw2", "https://www.buzzfeed.com/rosiegray/trump-fundraising-spreads-through-conservative-email-lists", "http://media1.s-nbcnews.com/j/msnbc/components/video/__new/2016-03-29t12-04-19-566z--1280x720.nbcnews-ux-800-440.jpg", "http://www.msnbc.com/mtp-daily/watch/former-vp-mondale-on-nuclear-dangers-decision-2016-694297667628&via=nbcnews", "http://media4.s-nbcnews.com/j/msnbc/components/video/201608/2016-08-08t16-41-07-966z--1280x720.nbcnews-ux-800-440.jpg", "http://media1.s-nbcnews.com/j/msnbc/components/video/__new/2015-07-12t13-21-28-633z--1280x720.nbcnews-ux-440-240.jpg", "http://link.theplatform.com/s/2E2eJC/fSKMjS_Nx2MG?mbr=true", "http://media3.s-nbcnews.com/j/msnbc/components/video/201609/f_dc_trump_birther_160916.nbcnews-ux-800-440.jpg", "http://www.politico.eu/article/donald-trump-acknowledges-climate-change-at-his-irish-golf-course/", "http://feed.theplatform.com/f/2E2eJC/nnd_40854565", "http://media1.s-nbcnews.com/j/msnbc/components/video/201606/2016-06-21t23-16-24-133z--1280x720.nbcnews-ux-360-200.jpg", "https://twitter.com/realDonaldTrump/status/744838252369043456", "http://link.theplatform.com/s/7wvmTC/lLwZrttPCbAD?mbr=true", "http://media1.s-nbcnews.com/j/msnbc/components/video/201606/2016-06-21t16-22-09-1z--1280x720.nbcnews-ux-360-200.jpg", "http://link.theplatform.com/s/2E2eJC/qJv_eZcEcTCm?mbr=true", "http://link.theplatform.com/s/2E2eJC/UlSOuqHMl4Zq?mbr=true", "https://plus.google.com/share?url=http://www.nbcnews.com/nightly-news/video/trump-declines-to-rule-out-using-nuclear-weapons-against-isis-655359043618", "https://www.facebook.com/sharer.php?u=http://www.msnbc.com/mtp-daily/watch/former-vp-mondale-on-nuclear-dangers-decision-2016-694297667628&t=FROM", "https://plus.google.com/share?url=http://www.today.com/video/california-is-poised-to-raise-minimum-wage-to-15-an-hour-654159427870", "http://media.snappytv.com/captions/928000/596p596/2016-10-10T01-42-09.4Z--57.133.mp4.srt", "http://media1.s-nbcnews.com/j/msnbc/components/video/__new/n_qc_trumpflip_160329.nbcnews-ux-1240-700.jpg", "http://feed.theplatform.com/f/2E2eJC/nnd_18424734", "http://link.theplatform.com/s/2E2eJC/pLsH_8eMXrM4", "http://player.theplatform.com/p/2E2eJC/nbcNewsOffsite?guid=mtp_trumpvtrump_150712", "http://feed.theplatform.com/f/2E2eJC/nnd_56058811", "http://media4.s-nbcnews.com/j/msnbc/components/video/201608/2016-08-08t16-41-07-966z--1280x720.nbcnews-ux-1240-700.jpg", "http://media1.s-nbcnews.com/j/msnbc/components/video/__new/n_qc_trumpflip_160329.nbcnews-ux-440-240.jpg", "http://link.theplatform.com/s/2E2eJC/opMFeoC6hzq5?mbr=true", "http://player.theplatform.com/p/2E2eJC/nbcNewsOffsite?guid=f_trump_firststrike_160924", "http://tve_static-snappytvpoc.nbcuni.com/snappy/caption/NBC_News/244/255/2016-03-22T11-48-28.967Z--391.001.mp4.vtt", "http://link.theplatform.com/s/2E2eJC/gMvD3NIKngNO?mbr=true", "http://media4.s-nbcnews.com/j/msnbc/components/video/201607/tdy_steve_elecitons_160729.nbcnews-ux-1080-600.jpg", "http://www.today.com/video/california-is-poised-to-raise-minimum-wage-to-15-an-hour-654159427870&via=nbcnews", "http://link.theplatform.com/s/2E2eJC/Uet1g1B1DsAA?mbr=true", "http://link.theplatform.com/s/2E2eJC/5mpkAPQqMmz7?mbr=true", "http://link.theplatform.com/s/2E2eJC/4ehqBaQGYT9x?mbr=true", "http://nbcnews.to/2cuiOHV", "http://media.snappytv.com/captions/928000/885p885/2016-06-21T23-21-32.2Z--368.5.mp4.srt", "http://link.theplatform.com/s/7wvmTC/_pjujl3qpJdc", "http://www.today.com/video/these-are-the-blue-states-donald-trump-needs-to-flip-red-to-win-734607427844&via=nbcnews", "http://media1.s-nbcnews.com/j/msnbc/components/video/201605/n_mtpd_mondalefull_160527.nbcnews-ux-1080-600.jpg", "http://nbcnews.to/1SyHmtR", "https://www.donaldjtrump.com/positions/immigration-reform", "http://tve_static-snappytvpoc.nbcuni.com/snappy/caption/MSNBC/20/875/2016-06-21T16-18-57.367Z--191.666.mp4.vtt", "http://player.theplatform.com/p/2E2eJC/nbcNewsOffsite?guid=tdy_lauer_trump_160322", "http://www.washingtontimes.com/news/2016/mar/10/donald-trump-vows-to-end-h1-b-visa-program-in-wash/", "http://link.theplatform.com/s/2E2eJC/krAe7PZch31Q?mbr=true", "http://on.msnbc.com/1PGhyXS", "http://media.snappytv.com/captions/928000/885p885/2016-06-21T16-18-57.367Z--191.666.mp4.srt", "http://media2.s-nbcnews.com/j/msnbc/components/video/201610/2016-10-10t01-42-43-233z--1280x720.nbcnews-ux-440-240.jpg", "http://link.theplatform.com/s/2E2eJC/kLXhBTfJeq_I?mbr=true", "http://link.theplatform.com/s/2E2eJC/msAFgGTfitu_?mbr=true", "http://media2.s-nbcnews.com/j/msnbc/components/video/201609/2016-09-27t02-27-23-666z--1280x720.nbcnews-ux-440-240.jpg", "http://www.cnn.com/2015/07/29/politics/donald-trump-immigration-plan-healthcare-flip-flop/index.html", "http://on.msnbc.com/28LnwcM", "http://www.politifact.com/truth-o-meter/statements/2016/aug/15/donald-trump/donald-trumps-baseless-claims-about-election-being/", "http://media1.s-nbcnews.com/j/msnbc/components/video/__new/2015-07-12t13-21-28-633z--1280x720.nbcnews-ux-360-200.jpg", "http://tve_static-snappytvpoc.nbcuni.com/snappy/caption/NBC_News/240/47/2016-03-29T12-04-10.667Z--19.666.mp4.vtt", "http://media1.s-nbcnews.com/j/msnbc/components/video/201606/tdy_guth_trump_160613.nbcnews-ux-1080-600.jpg", "http://media1.s-nbcnews.com/i/MSNBC/Components/Video/__NEW/2016-03-30T22-35-14-033Z--1280x720.jpg", "http://feed.theplatform.com/f/2E2eJC/nnd_18424744", "https://plus.google.com/share?url=http://www.msnbc.com/msnbc-quick-cuts/watch/the-many-flip-flops-of-donald-trump-654491715547", "http://media2.s-nbcnews.com/j/msnbc/components/video/201609/2016-09-27t02-27-23-666z--1280x720.nbcnews-ux-1240-700.jpg", "http://media1.s-nbcnews.com/j/msnbc/components/video/__new/2016-03-30t22-35-14-033z--1280x720.nbcnews-ux-360-200.jpg", "http://media1.s-nbcnews.com/j/msnbc/components/video/__new/n_qc_trumpflip_160329.nbcnews-ux-800-440.jpg", "http://www.msnbc.com/hardball/watch/clinton-us-doesn-t-do-business-trump-s-way-710067779884&via=nbcnews", "http://www.msnbc.com/mtp-daily/watch/former-vp-mondale-on-nuclear-dangers-decision-2016-694297667628", "http://media1.s-nbcnews.com/i/MSNBC/Components/Video/__NEW/2016-03-30T19-01-31-1Z--1280x720.jpg", "http://link.theplatform.com/s/2E2eJC/G9xtnyb06qCt", "http://link.theplatform.com/s/7wvmTC/lRpIg6LwogLn?mbr=true", "http://link.theplatform.com/s/7wvmTC/46_MAPvxL5Hr?mbr=true", "https://twitter.com/realDonaldTrump/status/703996959544250373", "https://www.facebook.com/sharer.php?u=http://www.nbcnews.com/nightly-news/video/trump-declines-to-rule-out-using-nuclear-weapons-against-isis-655359043618&t=FROM", "http://tve_static-snappytvpoc.nbcuni.com/snappy/caption/MSNBC/310/415/2016-06-21T23-21-32.2Z--368.5.mp4.vtt", "http://media2.s-nbcnews.com/j/msnbc/components/video/201610/2016-10-10t01-42-43-233z--1280x720.nbcnews-ux-1240-700.jpg", "http://www.politifact.com/truth-o-meter/statements/2016/feb/10/donald-trump/donald-trump-self-funding-his-campaign-sort/", "http://www.cnn.com/2016/07/17/politics/donald-trump-mike-pence-60-minutes-interview/", "http://link.theplatform.com/s/2E2eJC/b0nJPol1mHkm?mbr=true", "https://www.facebook.com/DonaldTrump/posts/10156071933390725", "http://link.theplatform.com/s/2E2eJC/VC1bha0mtWUq?mbr=true", "http://link.theplatform.com/s/2E2eJC/in9SRLfe8lqz?mbr=true", "http://www.msnbc.com/msnbc-news/watch/trump-s-controversial-abortion-comments-655208515561", "https://www.facebook.com/sharer.php?u=http://www.nbcnews.com/video/trump-says-he-can-t-take-anything-off-the-table-with-nuclear-weapons-773727811553&t=FROM", "http://link.theplatform.com/s/2E2eJC/kTufN060p_qr?mbr=true", "http://link.theplatform.com/s/2E2eJC/uDbeQ6GeEBcB?mbr=true", "http://link.theplatform.com/s/2E2eJC/SpyXXDAa5xv7?mbr=true", "https://plus.google.com/share?url=http://www.msnbc.com/msnbc-news/watch/clinton-goes-after-trump-s-economic-plans-709764163865", "https://twitter.com/share?text=These", "http://tve_static-snappytvpoc.nbcuni.com/snappy/caption/NBC_News/360/91/2016-03-30T22-34-31.833Z--119.9.mp4.vtt", "http://www.politico.com/story/2015/11/donald-trump-wages-215812", "http://media4.s-nbcnews.com/j/msnbc/components/video/201607/tdy_steve_elecitons_160729.nbcnews-ux-440-240.jpg", "http://media1.s-nbcnews.com/j/msnbc/components/video/201606/2016-06-21t23-16-24-133z--1280x720.nbcnews-ux-1080-600.jpg", "http://media1.s-nbcnews.com/j/msnbc/components/video/__new/tdy_lauer_trump_160322.nbcnews-ux-800-440.jpg", "https://www.theguardian.com/us-news/2015/dec/07/donald-trump-campaign-defends-muslim-ban-sam-clovis-interview", "http://link.theplatform.com/s/2E2eJC/uTNFy5ss5Q8c?mbr=true", "http://media1.s-nbcnews.com/j/msnbc/components/video/201605/n_mtpd_mondalefull_160527.nbcnews-ux-440-240.jpg", "http://media2.s-nbcnews.com/j/msnbc/components/video/201609/2016-09-27t02-27-23-666z--1280x720.nbcnews-ux-360-200.jpg", "http://media2.s-nbcnews.com/i/MSNBC/Components/Video/201610/2016-10-10T01-42-43-233Z--1280x720.jpg", "https://plus.google.com/share?url=http://www.msnbc.com/hardball/watch/clinton-us-doesn-t-do-business-trump-s-way-710067779884", "http://media2.s-nbcnews.com/j/msnbc/components/video/201610/2016-10-10t01-42-43-233z--1280x720.nbcnews-ux-800-440.jpg", "http://link.theplatform.com/s/7wvmTC/60v_KDi5NfoB?mbr=true", "http://media2.s-nbcnews.com/j/msnbc/components/video/201610/2016-10-10t01-42-43-233z--1280x720.nbcnews-ux-1080-600.jpg", "http://www.politico.com/blogs/2016-gop-primary-live-updates-and-results/2016/03/trump-iraq-syria-220608#ixzz42utL0IsD%20", "https://www.facebook.com/sharer.php?u=http://www.nbcnews.com/video/trump-obama-was-born-in-the-united-states-period-766831171696&t=FROM", "http://media1.s-nbcnews.com/j/msnbc/components/video/__new/2015-07-12t13-21-28-633z--1280x720.nbcnews-ux-1240-700.jpg", "http://link.theplatform.com/s/7wvmTC/dCJbWbKD1ZRR?mbr=true", "http://www.msnbc.com/msnbc-news/watch/clinton-goes-after-trump-s-economic-plans-709764163865", "http://www.today.com/video/donald-trump-waterboarding-would-be-fine-to-interrogate-terror-suspect-649868867713&via=nbcnews", "http://on.today.com/1UpYvrU", "https://plus.google.com/share?url=http://www.nbcnews.com/video/trump-obama-was-born-in-the-united-states-period-766831171696", "http://tve_static-snappytvpoc.nbcuni.com/snappy/caption/NBC_News/17/327/2016-06-13T12-15-21.933Z--344.7.mp4.vtt", "http://link.theplatform.com/s/2E2eJC/EiOclHXcIsMy", "http://link.theplatform.com/s/2E2eJC/fHKVZZ7LT9dY?mbr=true", "http://blogs.wsj.com/washwire/2015/09/24/donald-trump-i-dont-believe-in-climate-change/", "http://www.politico.com/story/2016/06/transcript-trump-speech-on-the-stakes-of-the-election-224654#ixzz4F5F0va5o", "https://www.yahoo.com/news/trump-clinton-guns-classrooms-nra-000000113.html", "https://www.whitehouse.gov/blog/2015/11/20/infographic-screening-process-refugee-entry-united-states", "https://www.facebook.com/sharer.php?u=http://www.msnbc.com/msnbc-news/watch/trump-s-controversial-abortion-comments-655208515561&t=FROM", "http://player.theplatform.com/p/2E2eJC/nbcNewsOffsite?guid=n_msnbc_TrumpAbortion_160330", "http://media1.s-nbcnews.com/j/msnbc/components/video/201606/tdy_guth_trump_160613.nbcnews-ux-1240-700.jpg", "http://link.theplatform.com/s/2E2eJC/kz5eJLLTvW04?mbr=true", "http://media4.s-nbcnews.com/j/msnbc/components/video/201607/tdy_steve_elecitons_160729.nbcnews-ux-800-440.jpg", "http://link.theplatform.com/s/2E2eJC/pKtsUA068ECC", "http://media1.s-nbcnews.com/j/msnbc/components/video/__new/tdy_lauer_trump_160322.nbcnews-ux-440-240.jpg", "http://link.theplatform.com/s/7wvmTC/grI0_YJACxc1", "http://link.theplatform.com/s/2E2eJC/aIVYy4zHdKyX", "http://media4.s-nbcnews.com/j/msnbc/components/video/201608/2016-08-08t16-41-07-966z--1280x720.nbcnews-ux-1080-600.jpg", "http://player.theplatform.com/p/2E2eJC/nbcNewsOffsite?guid=n_mtpd_mondalefull_160527", "http://link.theplatform.com/s/7wvmTC/pz7myxpkWGUx?mbr=true", "http://www.msnbc.com/msnbc-news/watch/clinton-goes-after-trump-s-economic-plans-709764163865&via=nbcnews", "http://link.theplatform.com/s/2E2eJC/jPaJfyRDQ9f3?mbr=true", "http://www.wsj.com/articles/donald-trump-wont-self-fund-general-election-campaign-1462399502", "https://t.co/OIXFKPUlz2", "https://twitter.com/realDonaldTrump/status/265895292191248385?ref_src=twsrc%5Egoogle%7Ctwcamp%5Eserp%7Ctwgr%5Etweet", "https://www.washingtonpost.com/news/fact-checker/wp/2016/08/03/a-guide-to-all-of-donald-trumps-flip-flops-on-the-minimum-wage/", "http://media1.s-nbcnews.com/j/msnbc/components/video/201606/2016-06-21t23-16-24-133z--1280x720.nbcnews-ux-440-240.jpg", "http://media1.s-nbcnews.com/j/msnbc/components/video/__new/2016-03-30t22-35-14-033z--1280x720.nbcnews-ux-1240-700.jpg", "http://media2.s-nbcnews.com/j/msnbc/components/video/201610/2016-10-10t01-42-43-233z--1280x720.nbcnews-ux-360-200.jpg", "http://link.theplatform.com/s/2E2eJC/0CSlIQx1Uq3H?mbr=true", "http://link.theplatform.com/s/2E2eJC/C3uvKrPRayL1?mbr=true", "http://www.msnbc.com/hardball/watch/clinton-us-doesn-t-do-business-trump-s-way-710067779884", "http://media2.s-nbcnews.com/j/msnbc/components/video/201609/2016-09-27t02-27-23-666z--1280x720.nbcnews-ux-1080-600.jpg", "http://media2.s-nbcnews.com/i/MSNBC/Components/Video/201609/2016-09-27T02-27-23-666Z--1280x720.jpg", "https://twitter.com/BenjySarlin/status/723536603700969472", "http://media.snappytv.com/captions/928000/513p513/2016-03-30T19-00-01.4Z--397.233.mp4.srt", "http://media1.s-nbcnews.com/i/MSNBC/Components/Video/__NEW/2016-03-29T12-04-19-566Z--1280x720.jpg", "http://player.theplatform.com/p/2E2eJC/nbcNewsOffsite?guid=f_dc_trump_birther_160916", "http://link.theplatform.com/s/7wvmTC/qpmMiS_Ky2u_?mbr=true", "http://feed.theplatform.com/f/2E2eJC/nnd_18424744-d", "https://www.whitehouse.gov/blog/2011/04/27/president-obamas-long-form-birth-certificate", "http://link.theplatform.com/s/2E2eJC/NIeb0EjO_36l", "http://www.msnbc.com/msnbc-news/watch/trump-s-controversial-abortion-comments-655208515561&via=nbcnews", "http://link.theplatform.com/s/2E2eJC/D0JmMKtZtt6d", "http://tve_static-snappytvpoc.nbcuni.com/snappy/caption/MSNBC/216/546/2016-03-30T19-00-01.4Z--397.233.mp4.vtt", "http://www.today.com/video/donald-trump-waterboarding-would-be-fine-to-interrogate-terror-suspect-649868867713", "http://link.theplatform.com/s/7wvmTC/t7sOSX0vqIG_", "http://media1.s-nbcnews.com/j/msnbc/components/video/__new/2016-03-30t19-01-31-1z--1280x720.nbcnews-ux-1080-600.jpg", "http://tve_static-snappytvpoc.nbcuni.com/snappy/caption/NBC_News/605/350/2016-09-27T02-27-20.233Z--58.667.mp4.vtt", "http://player.theplatform.com/p/2E2eJC/nbcNewsOffsite?guid=a_mtp_trumpimmigration_150815", "http://media1.s-nbcnews.com/j/msnbc/components/video/201606/2016-06-21t16-22-09-1z--1280x720.nbcnews-ux-800-440.jpg", "https://www.facebook.com/sharer.php?u=http://www.nbcnews.com/nightly-news/video/trump-vs.-trump--a-look-at-donald-trumps-evolving-positions-over-the-years-482986563581&t=FROM", "http://link.theplatform.com/s/2E2eJC/YDA0InTK_Dzl?mbr=true", "http://abcnews.go.com/Politics/donald-trumps-history-raising-birther-questions-president-obama/story?id=33861832", "http://player.theplatform.com/p/2E2eJC/nbcNewsOffsite?guid=n_msnbc_clinton1_160621", "http://link.theplatform.com/s/2E2eJC/wX9Ld9gjeeFE", "http://media1.s-nbcnews.com/j/msnbc/components/video/__new/2016-03-30t19-01-31-1z--1280x720.nbcnews-ux-360-200.jpg", "http://media1.s-nbcnews.com/j/msnbc/components/video/__new/n_qc_trumpflip_160329.nbcnews-ux-1080-600.jpg", "https://plus.google.com/share?url=http://www.nbcnews.com/video/trump-touts-childcare-deductions-tax-on-u-s-businesses-overseas-740109891696", "http://media2.s-nbcnews.com/j/msnbc/components/video/201609/2016-09-27t02-27-23-666z--1280x720.nbcnews-ux-800-440.jpg", "http://media.snappytv.com/captions/928000/810p810/2016-06-13T12-15-21.933Z--344.7.mp4.srt", "http://media4.s-nbcnews.com/i/MSNBC/Components/Video/201608/2016-08-08T16-41-07-966Z--1280x720.jpg", "http://link.theplatform.com/s/2E2eJC/gvmbWV1BiB4D?mbr=true", "http://feed.theplatform.com/f/2E2eJC/nnd_brussels", "http://media1.s-nbcnews.com/j/msnbc/components/video/__new/2015-07-12t13-21-28-633z--1280x720.nbcnews-ux-1080-600.jpg", "http://link.theplatform.com/s/2E2eJC/1NIUaYCRfMlk?mbr=true", "http://media3.s-nbcnews.com/i/MSNBC/Components/Video/201609/f_dc_trump_birther_160916.jpg", "http://media2.s-nbcnews.com/j/msnbc/components/video/__new/a_mtp_trumpimmigration_150815.nbcnews-ux-1080-600.jpg", "http://www.bloomberg.com/politics/articles/2015-08-26/donald-trump-says-he-wants-to-raise-taxes-on-himself", "https://plus.google.com/share?url=http://www.msnbc.com/mtp-daily/watch/former-vp-mondale-on-nuclear-dangers-decision-2016-694297667628", "http://link.theplatform.com/s/2E2eJC/r3nlPg6kbNHX?mbr=true", "http://link.theplatform.com/s/2E2eJC/d4U_V8k3IuZ_?mbr=true", "http://link.theplatform.com/s/2E2eJC/cGAisbThM7Q0?mbr=true", "http://on.today.com/25u3soc", "https://plus.google.com/share?url=http://www.today.com/video/donald-trump-reacts-to-orlando-shooting-criticizes-hillary-clinton-obama-704391748002", "http://link.theplatform.com/s/2E2eJC/BUrSZhh7iDLh?mbr=true", "http://link.theplatform.com/s/2E2eJC/36jAE4_Ue8bK?mbr=true", "http://media1.s-nbcnews.com/j/msnbc/components/video/__new/2015-07-12t13-21-28-633z--1280x720.nbcnews-ux-800-440.jpg", "http://www.nytimes.com/2016/05/07/us/politics/donald-trumps-idea-to-cut-national-debt-get-creditors-to-accept-less.html?_r=0", "http://media.snappytv.com/captions/928000/259p259/2015-07-12T13-17-33.533Z--238.234.mp4.srt", "http://player.theplatform.com/p/2E2eJC/nbcNewsOffsite?guid=n_qc_trumpflip_160329", "http://media3.s-nbcnews.com/j/msnbc/components/video/201609/f_dc_trump_birther_160916.nbcnews-ux-440-240.jpg", "http://link.theplatform.com/s/2E2eJC/mctuWfIlylYO?mbr=true", "http://link.theplatform.com/s/7wvmTC/NKdwxX_EiiC_", "http://media1.s-nbcnews.com/j/msnbc/components/video/__new/2016-03-30t19-01-31-1z--1280x720.nbcnews-ux-1240-700.jpg", "https://www.facebook.com/sharer.php?u=http://www.msnbc.com/hardball/watch/clinton-us-doesn-t-do-business-trump-s-way-710067779884&t=FROM", "http://media1.s-nbcnews.com/i/MSNBC/Components/Video/__NEW/2015-07-12T13-21-28-633Z--1280x720.jpg", "http://link.theplatform.com/s/2E2eJC/vFu1qTjp5kng?mbr=true", "https://www.facebook.com/sharer.php?u=http://www.nbcnews.com/video/trump-muslim-ban-has-morphed-into-extreme-vetting-782435907645&t=FROM", "http://media.snappytv.com/captions/928000/929p929/2016-03-30T22-34-31.833Z--119.9.mp4.srt", "http://link.theplatform.com/s/2E2eJC/3XtvjxI2s7gr?mbr=true", "http://tve_static-snappytvpoc.nbcuni.com/snappy/caption/NBC_News/718/31/2016-10-10T01-42-09.4Z--57.133.mp4.vtt", "https://www.washingtonpost.com/news/wonk/wp/2015/08/17/understanding-trumps-plan-to-end-citizenship-for-undocumented-immigrants-kids/", "http://feed.theplatform.com/f/2E2eJC/nnd_20381145", "http://media.snappytv.com/captions/928000/516p516/2016-03-29T12-04-10.667Z--19.666.mp4.srt", "http://media1.s-nbcnews.com/j/msnbc/components/video/201605/n_mtpd_mondalefull_160527.nbcnews-ux-800-440.jpg", "https://www.facebook.com/sharer.php?u=http://www.today.com/video/these-are-the-blue-states-donald-trump-needs-to-flip-red-to-win-734607427844&t=These", "http://link.theplatform.com/s/2E2eJC/CawWGYhDA8Pe?mbr=true", "http://media1.s-nbcnews.com/j/msnbc/components/video/__new/tdy_lauer_trump_160322.nbcnews-ux-1080-600.jpg", "http://feed.theplatform.com/f/2E2eJC/nnd_orlando_nightclub_massacre", "http://media1.s-nbcnews.com/j/msnbc/components/video/201605/n_mtpd_mondalefull_160527.nbcnews-ux-360-200.jpg", "http://link.theplatform.com/s/7wvmTC/f400AC7fYxN_?mbr=true", "http://link.theplatform.com/s/2E2eJC/f3KyT3fmFJoa?mbr=true", "http://player.theplatform.com/p/2E2eJC/nbcNewsOffsite?guid=nn_ami_trump_options_160330", "http://link.theplatform.com/s/2E2eJC/_J5skZYbHk0f?mbr=true", "https://twitter.com/realDonaldTrump/status/787699930718695425", "http://media1.s-nbcnews.com/i/MSNBC/Components/Video/201606/tdy_guth_trump_160613.jpg", "http://media.snappytv.com/captions/928000/561p561/2016-09-27T02-27-20.233Z--58.667.mp4.srt", "http://link.theplatform.com/s/7wvmTC/k5rZyUsoLcNv", "http://on.today.com/2ah35WH", "https://plus.google.com/share?url=http://www.nbcnews.com/video/trump-says-he-can-t-take-anything-off-the-table-with-nuclear-weapons-773727811553", "https://www.facebook.com/sharer.php?u=http://www.today.com/video/california-is-poised-to-raise-minimum-wage-to-15-an-hour-654159427870&t=FROM", "http://link.theplatform.com/s/7wvmTC/rh9XNLrXes_5?mbr=true", "http://www.today.com/video/california-is-poised-to-raise-minimum-wage-to-15-an-hour-654159427870", "http://media.snappytv.com/captions/928000/797p797/2016-03-22T11-48-28.967Z--391.001.mp4.srt", "http://link.theplatform.com/s/2E2eJC/Vwty5SUiDPAi?mbr=true", "http://media4.s-nbcnews.com/j/msnbc/components/video/201607/tdy_steve_elecitons_160729.nbcnews-ux-360-200.jpg", "http://media1.s-nbcnews.com/j/msnbc/components/video/201606/2016-06-21t23-16-24-133z--1280x720.nbcnews-ux-1240-700.jpg", "http://bigstory.ap.org/article/5e65c322ef3e49a7875c11ecd433c7f8/trump-belittles-accusers-more-turn-sordid-stories", "http://link.theplatform.com/s/7wvmTC/gcWFbZqyEx6E", "http://media2.s-nbcnews.com/j/msnbc/components/video/__new/a_mtp_trumpimmigration_150815.nbcnews-ux-1240-700.jpg", "http://on.msnbc.com/24bxeur", "http://media2.s-nbcnews.com/j/msnbc/components/video/__new/a_mtp_trumpimmigration_150815.nbcnews-ux-360-200.jpg", "http://link.theplatform.com/s/2E2eJC/YxSnTiQKu_Cw?mbr=true", "http://media1.s-nbcnews.com/i/MSNBC/Components/Video/201606/2016-06-21T16-22-09-1Z--1280x720.jpg", "http://media1.s-nbcnews.com/j/msnbc/components/video/__new/2016-03-29t12-04-19-566z--1280x720.nbcnews-ux-360-200.jpg", "https://twitter.com/SopanDeb/status/757819348723433472", "http://player.theplatform.com/p/2E2eJC/nbcNewsOffsite?guid=f_stl_extremevetting_161009", "http://link.theplatform.com/s/7wvmTC/q5JV3vl0A72T?mbr=true", "http://www.foxnews.com/transcript/2016/04/03/donald-trump-fights-to-win-over-women-reince-priebus-on-possibility-contested/", "http://nbcnews.to/2cRoW8c", "http://link.theplatform.com/s/7wvmTC/26O5N1AFy6Mn?mbr=true", "http://nbcnews.to/1NafQCd", "http://media1.s-nbcnews.com/j/msnbc/components/video/__new/2016-03-30t19-01-31-1z--1280x720.nbcnews-ux-800-440.jpg", "http://media1.s-nbcnews.com/j/msnbc/components/video/__new/2016-03-30t22-35-14-033z--1280x720.nbcnews-ux-800-440.jpg", "http://media1.s-nbcnews.com/j/msnbc/components/video/__new/2016-03-29t12-04-19-566z--1280x720.nbcnews-ux-1080-600.jpg", "http://link.theplatform.com/s/2E2eJC/IVSI8JUKPLkM?mbr=true", "http://www.wsj.com/articles/trump-reverses-his-stance-on-torture-1457116559", "https://twitter.com/realDonaldTrump/status/730493295550468096?ref_src=twsrc%5Etfw", "http://media1.s-nbcnews.com/i/MSNBC/Components/Video/__NEW/n_qc_trumpflip_160329.jpg", "http://on.msnbc.com/1qfwUhy", "http://media2.s-nbcnews.com/j/msnbc/components/video/__new/a_mtp_trumpimmigration_150815.nbcnews-ux-800-440.jpg", "http://media1.s-nbcnews.com/j/msnbc/components/video/__new/n_qc_trumpflip_160329.nbcnews-ux-360-200.jpg", "http://media3.s-nbcnews.com/j/msnbc/components/video/201609/f_dc_trump_birther_160916.nbcnews-ux-1240-700.jpg", "http://media4.s-nbcnews.com/i/MSNBC/Components/Video/201607/tdy_steve_elecitons_160729.jpg", "http://www.politifact.com/florida/statements/2016/jul/20/donald-trump/donald-trump-wrongly-blames-hillary-clinton-creati/", "http://www.today.com/video/donald-trump-reacts-to-orlando-shooting-criticizes-hillary-clinton-obama-704391748002&via=nbcnews", "https://www.facebook.com/sharer.php?u=http://www.nbcnews.com/video/trump-touts-childcare-deductions-tax-on-u-s-businesses-overseas-740109891696&t=Trump", "http://player.theplatform.com/p/2E2eJC/nbcNewsOffsite?guid=n_hardball_clinton1_160621", "https://www.facebook.com/sharer.php?u=http://www.msnbc.com/msnbc-news/watch/clinton-goes-after-trump-s-economic-plans-709764163865&t=FROM", "https://plus.google.com/share?url=http://www.today.com/video/donald-trump-waterboarding-would-be-fine-to-interrogate-terror-suspect-649868867713", "http://feed.theplatform.com/f/2E2eJC/nnd_21427708", "http://www.cbsnews.com/news/in-10th-gop-debate-marco-rubio-steps-up-to-the-plate-against-donald-trump-analysis/", "http://on.today.com/1WF8Qig", "https://plus.google.com/share?url=http://www.nbcnews.com/nightly-news/video/trump-vs.-trump--a-look-at-donald-trumps-evolving-positions-over-the-years-482986563581", "http://media1.s-nbcnews.com/j/msnbc/components/video/201606/2016-06-21t16-22-09-1z--1280x720.nbcnews-ux-1080-600.jpg", "http://media4.s-nbcnews.com/j/msnbc/components/video/201607/tdy_steve_elecitons_160729.nbcnews-ux-1240-700.jpg", "http://www.msnbc.com/msnbc-quick-cuts/watch/the-many-flip-flops-of-donald-trump-654491715547&via=nbcnews", "http://player.theplatform.com/p/2E2eJC/nbcNewsOffsite?guid=tdy_steve_elections_160729", "http://feed.theplatform.com/f/2E2eJC/nnd_58534155", "http://nbcnews.to/1gvnlWZ", "http://link.theplatform.com/s/7wvmTC/aP6BVt_7BbOv", "https://plus.google.com/share?url=http://www.nbcnews.com/meet-the-press/video/trump-if-im-elected-obamas-immigration-executive-order-gets-rescinded-505818691739", "http://player.theplatform.com/p/2E2eJC/nbcNewsOffsite?guid=tdy_guth_trump_160613", "http://www.buzzfeed.com/bensmith/trump-tape#.yijv28pE0X", "http://media1.s-nbcnews.com/j/msnbc/components/video/__new/tdy_lauer_trump_160322.nbcnews-ux-1240-700.jpg", "http://media1.s-nbcnews.com/j/msnbc/components/video/201606/tdy_guth_trump_160613.nbcnews-ux-800-440.jpg", "http://media3.s-nbcnews.com/j/msnbc/components/video/201609/f_dc_trump_birther_160916.nbcnews-ux-360-200.jpg", "http://www.wsj.com/articles/donald-trump-says-he-would-deport-criminal-illegal-immigrants-if-elected-1472334324", "http://player.theplatform.com/p/2E2eJC/nbcNewsOffsite?guid=f_trump_childcare_160808", "http://link.theplatform.com/s/2E2eJC/HZ0qAG906QG8", "http://media4.s-nbcnews.com/j/msnbc/components/video/201608/2016-08-08t16-41-07-966z--1280x720.nbcnews-ux-360-200.jpg", "https://plus.google.com/share?url=http://www.nbcnews.com/video/trump-muslim-ban-has-morphed-into-extreme-vetting-782435907645", "http://media1.s-nbcnews.com/j/msnbc/components/video/__new/2016-03-30t22-35-14-033z--1280x720.nbcnews-ux-440-240.jpg", "http://media1.s-nbcnews.com/i/MSNBC/Components/Video/201605/n_mtpd_mondalefull_160527.jpg", "https://www.facebook.com/sharer.php?u=http://www.today.com/video/donald-trump-waterboarding-would-be-fine-to-interrogate-terror-suspect-649868867713&t=FROM", "http://media1.s-nbcnews.com/i/MSNBC/Components/Video/201606/2016-06-21T23-16-24-133Z--1280x720.jpg", "http://link.theplatform.com/s/2E2eJC/b_6jU6IBs90k?mbr=true", "http://media1.s-nbcnews.com/j/msnbc/components/video/__new/2016-03-29t12-04-19-566z--1280x720.nbcnews-ux-1240-700.jpg", "https://www.facebook.com/sharer.php?u=http://www.msnbc.com/msnbc-quick-cuts/watch/the-many-flip-flops-of-donald-trump-654491715547&t=FROM", "http://media2.s-nbcnews.com/i/MSNBC/Components/Video/__NEW/a_mtp_trumpimmigration_150815.jpg", "http://link.theplatform.com/s/2E2eJC/3Ph_TEldEnhr?mbr=true", "http://link.theplatform.com/s/2E2eJC/ifZkiFnY6bvq?mbr=true", "http://link.theplatform.com/s/2E2eJC/VkdbkgNFp7O4", "https://twitter.com/share?text=FROM", "http://media1.s-nbcnews.com/j/msnbc/components/video/201606/2016-06-21t16-22-09-1z--1280x720.nbcnews-ux-1240-700.jpg", "http://media1.s-nbcnews.com/j/msnbc/components/video/__new/2016-03-29t12-04-19-566z--1280x720.nbcnews-ux-440-240.jpg", "http://media1.s-nbcnews.com/j/msnbc/components/video/__new/2016-03-30t22-35-14-033z--1280x720.nbcnews-ux-1080-600.jpg", "http://www.washingtonexaminer.com/trump-gop-rigged-but-i-dont-care-because-i-won/article/2590545", "http://link.theplatform.com/s/2E2eJC/A8jiNHm_cf7b?mbr=true", "http://link.theplatform.com/s/2E2eJC/oAZdA9pyadWc?mbr=true", "http://media1.s-nbcnews.com/j/msnbc/components/video/201606/2016-06-21t23-16-24-133z--1280x720.nbcnews-ux-800-440.jpg", "http://link.theplatform.com/s/7wvmTC/kbA6oP8v8zgO?mbr=true", "http://www.today.com/video/donald-trump-reacts-to-orlando-shooting-criticizes-hillary-clinton-obama-704391748002", "http://link.theplatform.com/s/7wvmTC/DtL_iP9Sf9Vm", "http://media1.s-nbcnews.com/j/msnbc/components/video/201606/2016-06-21t16-22-09-1z--1280x720.nbcnews-ux-440-240.jpg"], "published": "2016-10-26T03:03:00.000+03:00", "crawled": "2016-10-30T02:00:56.026+02:00", "highlightTitle": ""}