{"organizations": [], "uuid": "46e6b77cb5cad8c1f2cac12aa2b2d8a9fba98e4a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nbcnews.com", "main_image": "http://media1.s-nbcnews.com/j/newscms/2016_40/1742491/161009-world-pope-cardinals-0646_8322750a9b14bbdd69cc8dfefa1d1e01.nbcnews-fp-1200-800.jpg", "site_section": "http://www.nbcnews.com/News/world", "section_title": "World News: The Latest Global News Stories - NBC News", "url": "http://www.nbcnews.com/news/world/pope-francis-names-17-new-cardinals-including-3-americans-ap-n662656", "country": "US", "domain_rank": 478, "title": "Pope Francis Names 17 New Cardinals, Including 3 U.S. Moderates", "performance_score": 0, "site": "nbcnews.com", "participants_count": 5, "title_full": "Pope Francis Names 17 New Cardinals, Including 3 U.S. Moderates - NBC News", "spam_score": 0.148, "site_type": "news", "published": "2016-10-09T23:52:00.000+03:00", "replies_count": 5, "uuid": "b8e6df21a996ac4253533815d8c05a85ccd063f8"}, "author": "Jay J Jameson", "url": "http://www.nbcnews.com/news/world/pope-francis-names-17-new-cardinals-including-3-americans-ap-n662656#post-3", "ord_in_thread": 3, "title": "", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The third was the outgoing bishop of Dallas. It was a nomination yet and not final. \\n\nThe Pope seemed to send a message to the USA that the USA had better start vetting Syrians and settling them in this country, too. \\n\nThe Vatican settled less than five families in their city-country. I believe their population count is 1,000 total. \\n\nSo in likeness...the USA has 323 million, we should settle between 323,000 and 1,615,000 Syrians. \\n\nAccording to the USA 2000 census, there are 142,897 Syrians in our country. Those immigrating after 1965 have been Muslims. Prior to 1965, mostly Christians...who are not prone to terrorism. \\n\nThere have been 2,290 Syrians in this recent wave of settlement into the USA. Only 3% are Christian. 67% have been women and children under 12. 33% have been males, some who could turn around and go back and fight for their homeland and should be urged and trained to do so. If the Syrian people would fight for their freedom and their homeland, maybe they could all return home one day and start afresh. \\n\nThese refugees are being placed by non-governmental agencies like the World Relief and the Catholic Bishops. So it is THEIR job to make sure these refugees are not hidden terrorists. (I believe terrorism is an incurable mental disease.) OR that if once vetted, it a THEIR job to make sure the refugees never become a convert into terrorism. (continued watching and assessing) AND news has it, the vetting is failing because several recent Syrians were admitted who were ALSO on the no-fly list! This cannot be World Relief and Catholic Bishops. \\n\nThe FBI says that there is no way they can help in vetting every refugee! So the Catholics better step up their game! \\n\nThe USA must hold the USA Catholic Bishops and World Relief to task \\n\nthat they protect our country the USA from terrorism. Mercy toward refugees YES...but ALSO mercy toward the hosting country! People in this country have children and homes and try to spread love and cheer all around the world People in this country do not wish grief upon themselves, heartache, violence, rudeness, and unChristian behavior. If subjected to all of this grief...how much LOVE can a family of the USA spread then when under grief from Satanic influence? NONE! It isn't being selfish to wish for peaceful refugees and wish for peace itself! And to impose sure threat, THIS IS NOT MERCY toward the hosting country! \\n\nThe democrats wish to admit into the USA near the suggested number of 250,000. Okay...but these better ALL be vetted and WATCHED well into the future...and if refugees turn into terrorists....they should be shipped to prison---hopefully without incident! \\n\nThe minute there is a refugee terrorist incident....ALL the invited should be hauled in and threatened with immediate deportation.", "external_links": [], "published": "2016-10-09T23:07:00.000+03:00", "crawled": "2016-10-10T16:05:18.202+03:00", "highlightTitle": ""}