{"organizations": [], "uuid": "602db58561a14df986113aafd8765b0bcb81267b", "thread": {"social": {"gplus": {"shares": 2}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 3}, "facebook": {"likes": 151, "shares": 151, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nbcnews.com", "main_image": "http://media1.s-nbcnews.com/j/newscms/2016_43/1769916/trump-holding-wall-sign_6664446f70dfc49645d20fdbc70c6c1e.nbcnews-fp-1200-800.jpg", "site_section": "", "section_title": "", "url": "http://www.nbcnews.com/news/latino/opinion-right-lessons-trump-s-false-immigration-trade-narrative-n672986", "country": "US", "domain_rank": 478, "title": "Opinion: The Right Lessons from Trump's False Immigration, Trade Narrative - NBC News", "performance_score": 1, "site": "nbcnews.com", "participants_count": 0, "title_full": "Opinion: The Right Lessons from Trump's False Immigration, Trade Narrative - NBC News", "spam_score": 0.663, "site_type": "news", "published": "2016-10-27T08:00:00.000+03:00", "replies_count": 0, "uuid": "602db58561a14df986113aafd8765b0bcb81267b"}, "author": "Ra L Hinojosa-Ojeda", "url": "http://www.nbcnews.com/news/latino/opinion-right-lessons-trump-s-false-immigration-trade-narrative-n672986", "ord_in_thread": 0, "title": "Opinion: The Right Lessons from Trump's False Immigration, Trade Narrative - NBC News", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "negative"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "raúl hinojosa-ojeda", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "raúl hinojosa ojeda", "sentiment": "none"}, {"name": "jonathan drake", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}, {"name": "fayetteville", "sentiment": "none"}, {"name": "los angeles", "sentiment": "none"}, {"name": "north carolina", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "twitter", "sentiment": "none"}], "organizations": [{"name": "nbc news", "sentiment": "negative"}, {"name": "trump", "sentiment": "negative"}, {"name": "wall street journal", "sentiment": "none"}, {"name": "ucla", "sentiment": "none"}, {"name": "north american integration and development center", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "instagram", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "nafta", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "advertisement U.S. Republican presidential candidate Donald Trump holds a sign supporting his plan to build a wall between the United States and Mexico that he borrowed from a member of the audience at his campaign rally in Fayetteville, North Carolina March 9, 2016. JONATHAN DRAKE / Reuters \nLOS ANGELES, California — From the initial launch of his campaign to his third and final debate, Republican presidential candidate Donald Trump has touted a simple yet dangerous media narrative: (1) America ceased being great because of (2) border raiding illegal immigrants (\"murderers and rapists\") and (3) trade agreements like NAFTA and TPP which produce trade deficits that take U.S. jobs. \nIn Trump's view, real American working people are hurt as America's border is being overrun by the \"worst\" people Mexico is sending and because of \"unfair\" trade deals made by \"our bad leaders.\" \nHis magical solution that can \"make America great again\" is to build a Great Wall, deport millions, and impose high tariffs. \nTrump's popularity was too readily conflated by many observers with the actual existence of measurable negative impacts from trade and migration on the lives of Trump supporters, as well as evidence for the need for more restrictive immigration and trade policy responses. \nSome went further, explicitly postulating a positive relationship between Trump's support among voters and \"China Shock\" trade exposure, reporting that \"[i]n this year's Republican presidential primary races, Mr. Trump won 89 of the 100 counties most affected by competition from China, according to an analysis published in The Wall Street Journal. Fewer voters are likely to support Trump in areas with more Mexican immigrants and higher exposure to imports from Mexico and China. \nHowever, a newly released detailed examination at UCLA of the geographical concentration of support for Trump in the presidential primaries among all 3,014 U.S. counties directly contradicts the Trump narrative. \nTrump support, in fact, was highly concentrated in counties that contain very few Mexican immigrants and are less exposed to imports from Mexico or China. \nEqually contradictory to the Trump narrative, our analysis shows that fewer voters are likely to support Trump in areas with higher contact with Mexican migrants and higher exposure to imports from Mexico and China. \nThose counties with higher concentrations of Mexican immigrants and imports from Mexico and China are actually more likely to support another Republican candidate or Hillary Clinton. In fact, less than 2 percent of U.S. counties actually fit the Trump narrative of very high Trump support combined with very high levels of immigration or trade. By contrast, nearly 60 percent of counties are polarized as either high Trump/low Mexican or low Trump/high Mexican counties. \nWhile these results specifically refute and even invert the Trump narrative, they also confirm that Donald Trump enjoys high levels of support in particular regions which are struggling economically, containing high concentrations of White poverty, high unemployment rates and a low median income. \nLow levels of migration and trade appear to actually be symptoms of the chronic stagnation and lack of competitiveness of these areas, rather than the result of too much migration and trade in Trump's narrative. \nIt is critical that we not learn the wrong lesson from the 2016 election and be swayed by the assumed \"political necessities\" of implementing anti-immigrant and anti-trade policies in order to \"address the legitimate concerns of Trump voters.\" \nThe right lessons from the false Trump narrative for future U.S. and Mexico policy makers is that neither the causes nor the solutions for these lagging regional dynamics are related to U.S. migration policies, or to trade relationships with China and Mexico. \nRaúl Hinojosa Ojeda is the Executive Director of the North American Integration and Development Center (NAID) at UCLA. \nFollow NBC News Latino on Facebook , Twitter and Instagram . Raúl Hinojosa-Ojeda ", "external_links": [], "published": "2016-10-27T08:00:00.000+03:00", "crawled": "2016-10-28T04:09:02.428+03:00", "highlightTitle": ""}