{"organizations": [], "uuid": "184473dc53977efa466a2f71e9443f1da53959a7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 18, "shares": 18, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nbcnews.com", "main_image": "http://nodeassets.nbcnews.com/images/og-nbcnews200x200.gif", "site_section": "", "section_title": "", "url": "http://www.nbcnews.com/card/trump-cites-police-military-ice-endorsements-didnt-happen-n672481", "country": "US", "domain_rank": 478, "title": "Trump Cites Police, Military, ICE Endorsements That Didn't Happen - NBC News", "performance_score": 0, "site": "nbcnews.com", "participants_count": 0, "title_full": "Trump Cites Police, Military, ICE Endorsements That Didn't Happen - NBC News", "spam_score": 0.332, "site_type": "news", "published": "2016-10-25T22:33:00.000+03:00", "replies_count": 0, "uuid": "184473dc53977efa466a2f71e9443f1da53959a7"}, "author": "Kailani Koenig", "url": "http://www.nbcnews.com/card/trump-cites-police-military-ice-endorsements-didnt-happen-n672481", "ord_in_thread": 0, "title": "Trump Cites Police, Military, ICE Endorsements That Didn't Happen - NBC News", "locations": [], "entities": {"persons": [{"name": "donald tru", "sentiment": "negative"}, {"name": "rasmussen", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "tim kaine", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "barack obama", "sentiment": "none"}, {"name": "bill clinton", "sentiment": "none"}, {"name": "kaine", "sentiment": "none"}, {"name": "obama", "sentiment": "none"}, {"name": "michelle obama", "sentiment": "none"}, {"name": "podesta", "sentiment": "none"}, {"name": "john podesta", "sentiment": "none"}, {"name": "clinton", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "breitbart", "sentiment": "none"}, {"name": "hillary", "sentiment": "none"}], "locations": [{"name": "united states", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "delaware", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "chicago", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}, {"name": "iowa", "sentiment": "none"}, {"name": "middle east", "sentiment": "none"}], "organizations": [{"name": "trump cites police", "sentiment": "negative"}, {"name": "nbc news", "sentiment": "negative"}, {"name": "nbc news' meet the press", "sentiment": "none"}, {"name": "fox news", "sentiment": "none"}, {"name": "foreign affairs", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "loyola", "sentiment": "none"}, {"name": "trump cites pew study as proof of fraud", "sentiment": "none"}, {"name": "pac", "sentiment": "none"}, {"name": "trump says clinton team promoting voter fraud", "sentiment": "none"}, {"name": "abc", "sentiment": "none"}, {"name": "isis", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "customs enforcement", "sentiment": "none"}, {"name": "nbc news/survey monkey", "sentiment": "none"}, {"name": "pew global", "sentiment": "none"}, {"name": "la times", "sentiment": "none"}, {"name": "wikileaks", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "4 hours ago Trump Cites Police, Military, ICE Endorsements That Didn't Happen \nOn Monday, Donald Trump told News4Jax that the United States military \"conceptually\" endorsed him and that \"virtually every police department\" in the country backed his bid for the presidency. During last week's third debate, Trump said his hardline stance on immigration and pledge to build a border wall had earned him an endorsement from Immigration and Customs Enforcement. a day ago Trump Claims Media Isn't Asking Kaine About Catholics. They Are \nTrump asked on Twitter why Vice Presidential nominee Tim Kaine, a practicing Catholic, was not being asked about the hacked WikiLeaks emails that appear to show Clinton campaign staffers mocking Catholicism. \nKaine has been asked about them in nearly every national TV interview he's done in the last week. \nHe was asked about this twice last Sunday ABC's This Week and Fox News Sunday , CNBC two days later , and was pressed on the same issue on NBC News' Meet the Press yesterday. Why has nobody asked Kaine about the horrible views emanated on WikiLeaks about Catholics? Media in the tank for Clinton but Trump will win! 2 days ago No, ISIS Isn't Rooting for Clinton \nISIS is \"dreaming that Hillary Clinton becomes President. ISIS, their number one dream, Hillary Clinton, let her become President. She's the one that allowed it to form, she's the one that watched it go, now they say it's in 32 countries, worse than ever.\"A dozen interviews with ISIS extremists and a review of their social media networks by Foreign Affairs magazine found that the terrorist group has a strong preference in the 2016 election: they'd like to see Donald Trump elected, not Clinton. \nFact checkers have also reviewed Trump's repeated claim that ISIS' rise is directly Clinton's fault and declared it to be false . 3 days ago Trump Cites Pew Study as Proof of Fraud, But Study Doesn't Find It \n\"According to the highly respected Pew, there are 24 million voter registrations in the United States that are either invalid or significantly inaccurate ... There are 1.8 million dead people that are registered right now to vote. And folks, folks, some of them vote,\" Trump said Saturday night while calling the election \"rigged.\" \nThis 2012 Pew study notes that the voter rolls are wildly out of date and advocates for modernizing the system to save taxpayer money. It finds no proof of voter fraud; the study's only mention of voter fraud is merely that error-riddled voter logs lead to the \"perception\" of being susceptible to fraud. \nIn practice, experts say widespread voter fraud just doesn't exist. Poll observers say that if a voter moves to another state or dies, they don't vote twice and aren't likely to be impersonated. A Loyola researcher who reviewed a billion ballots found 31 credible cases of voter fraud . 4 days ago Yup, the Investor's Business Daily Poll Was the Most Accurate in 2012 \nDonald Trump likes to blur the polls. He's boasted of winning ones that didn't exist, and earlier this week he said he'd won every single post-debate online tally — not true, since our own NBC News/Survey Monkey showed Hillary Clinton winning and even Breitbart's survey said the same for a time — so when Trump started talking up the credentials of a lesser-known poll, our fact checker's ear was piqued. \n\"We're leading in three recent polls the last day: Rasmussen, LA Times, Investor's Business Daily. The last one was the most accurate poll of the last cycle, so that's a good sign!\" he said. \nSure enough, Trump's spot on here: Investor's Business Daily was indeed the most accurate poll of 2012 among the more prolific pollsters. He's leading Clinton by just one point in the national poll of 789 likely voters — within the margin of error to be sure — but leading nonetheless. No, the World Doesn't Hate Obama and America \n\"The world hates our president, and the world hates us.\" Trump 10/21/2016 \nTrump repeatedly said the U.S. is run by \"babies\" and \"losers\" today, deriding the president and his wife who have campaigned for his rival at length. But his claim that the world hates President Barack Obama, and the U.S. in general, is false. \n\"Barack Obama continues to enjoy a broad degree of international popularity,\" a Pew Global report found this summer, noting particularly strong popularity in Europe and Asia. The Middle East, where the U.S. is still involved militarily, has lower favorability ratings for the U.S. What's more, the U.S. isn't poorly viewed: a median of 69% view the U.S. favorably, with 24 percent expressing an unfavorable view in another Pew Global study from last year. 4 days ago Trump Claims Michelle Obama Dissed Hillary Clinton in '08 Primary. She Didn't. \n\"We have a bunch of babies running our country, folks. We have a bunch of losers. They're losers. They're babies. We have a president, all he wants to do is campaign. His wife, all she wants to do is campaign. And I see how much his wife likes Hillary, but wasn't she the one that originally started the statement, 'If you can't take care of your home,' right? 'You can't take care of the White House or the country.' Where's that? I don't hear that. I don't hear that. She's the one that started that. I said, 'We can't say that. It's too vicious.' Can you believe it? I said that. We can't say it. They said, 'Well, Michelle Obama said it.' I said, 'She did?' Now she said that, but we don't hear about that.\" Trump, 10/21/2016 \nIn the 2008 Democratic primary, Michelle Obama spoke about her own family while campaigning for her husband in Chicago: \"One of the things, the important aspects of this race, is role modeling what good families should look like. And my view is that if you can't run your own house, you certainly can't run the White House. Can't do it.\" \nMrs. Obama made similar remarks at a campaign stop in Iowa, talking about the importance of family and how she and Barack Obama managed their careers with raising kids. When those comments were interpreted at a swipe at Clinton, the then-Illinois senator denied that they had anything to do with President Bill Clinton's notorious infidelities. \nTrump made a similar claim in the second debate , suggesting that Mrs. Obama's words had been used as a campaign ad in the 2008 primary. They weren't. The only campaign ad that's used those words are a pro-Trump ad cut by a super PAC this year. 5 days ago Trump Says Clinton Team Promoting Voter Fraud \n\"John Podesta, Hillary Clinton's campaign chairman, was quoted in WikiLeaks saying illegal immigrants could vote as long as they have their driver's license,\" Donald Trump said Thursday, prompting his Delaware crowd to roar angrily. \nOnly Podesta didn't say that. \nIn an email chain about voter ID and voter registration, allegedly from Podesta's personal email account that was hacked and published on WikiLeaks, Podesta appears to suggest that photo ID for same-day registration might be a good way to for them to combat GOP-supported voter ID laws. \nPodesta said voters would need to attest to their citizenship to do so -- something you do any time you register to vote -- he doesn't suggest undocumented immigrants lie in order to register to vote. \nThe conversation is rooted in hypotheticals: one person suggests supporting online voting, another suggests online voter registration. This wasn't campaign scheming as Trump alleges, this was an informal discussion. 6 days ago We Fact Checked the Whole Debate. Here's What We Found. \nIn their third and final debate, the two candidates didn't disappoint our ready and waiting fact check team at NBC News and PolitiFact. In a wild 90-minute debate, Donald Trump and Hillary Clinton brought up dozens of inaccuracies, half truths, and a few surprising truths. ", "external_links": [], "published": "2016-10-25T22:33:00.000+03:00", "crawled": "2016-10-25T22:01:28.982+03:00", "highlightTitle": ""}