{"organizations": [], "uuid": "507c129d7471c1316ae3eb62db849c1d5cdd371f", "thread": {"social": {"gplus": {"shares": 3}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 12}, "facebook": {"likes": 278, "shares": 278, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nbcnews.com", "main_image": "http://media1.s-nbcnews.com/j/newscms/2016_37/1710071/160915_blessingritualscam_48b3d2445228b60699463c7886d091bd.nbcnews-fp-1200-800.jpg", "site_section": "", "section_title": "", "url": "http://www.nbcnews.com/news/asian-america/woman-charged-hate-crime-allegedly-stealing-160-000-blessing-scam-n670596", "country": "US", "domain_rank": 478, "title": "Woman Indicted for Hate Crime After Allegedly Stealing $160,000 in 'Blessing Scam' - NBC News", "performance_score": 2, "site": "nbcnews.com", "participants_count": 0, "title_full": "Woman Indicted for Hate Crime After Allegedly Stealing $160,000 in 'Blessing Scam' - NBC News", "spam_score": 0.384, "site_type": "news", "published": "2016-10-21T08:00:00.000+03:00", "replies_count": 0, "uuid": "507c129d7471c1316ae3eb62db849c1d5cdd371f"}, "author": "Chris Fuchs", "url": "http://www.nbcnews.com/news/asian-america/woman-charged-hate-crime-allegedly-stealing-160-000-blessing-scam-n670596", "ord_in_thread": 0, "title": "Woman Indicted for Hate Crime After Allegedly Stealing $160,000 in 'Blessing Scam' - NBC News", "locations": [], "entities": {"persons": [{"name": "helen peterson", "sentiment": "none"}, {"name": "xuekun su", "sentiment": "none"}, {"name": "shamuil", "sentiment": "none"}, {"name": "eric gonzalez", "sentiment": "none"}, {"name": "peterson", "sentiment": "none"}, {"name": "danny chun", "sentiment": "none"}, {"name": "chris fuchs", "sentiment": "none"}, {"name": "morris shamuil", "sentiment": "none"}, {"name": "su", "sentiment": "none"}], "locations": [{"name": "brooklyn", "sentiment": "none"}, {"name": "new york state", "sentiment": "none"}, {"name": "hawaii", "sentiment": "none"}, {"name": "boston", "sentiment": "none"}, {"name": "chicago", "sentiment": "none"}, {"name": "new york city", "sentiment": "none"}, {"name": "queens", "sentiment": "none"}, {"name": "san francisco", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "manhattan", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "seattle", "sentiment": "none"}, {"name": "china", "sentiment": "none"}], "organizations": [{"name": "nbc news", "sentiment": "negative"}, {"name": "brooklyn supreme court", "sentiment": "none"}, {"name": "new york police department", "sentiment": "none"}, {"name": "nbc new york", "sentiment": "none"}, {"name": "nbc asian america on facebook", "sentiment": "none"}, {"name": "brooklyn da charges", "sentiment": "none"}, {"name": "instagram", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Oct 21 2016, 9:10 am ET Woman Indicted for Hate Crime After Allegedly Stealing $160,000 in 'Blessing Scam' by Chris Fuchs advertisement \nA Chinese woman was indicted in New York on hate crime charges for allegedly scamming two other Chinese woman out of $160,000 in cash and jewelry, the Brooklyn district attorney announced Thursday. \nXuekun Su, 44, is accused in two separate incidents of convincing the women in Brooklyn that their families were cursed and that to rid them of it, they needed to place cash and jewels in a bag to be blessed, the district attorney said. Suspects sought by NYPD charged with conducting \"blessing scams\" NYPD \nIn one instance in April, $140,000 in cash and 24-karat gold jewelry were allegedly stolen before the bag was given back to the 61-year-old Chinese immigrant, with instructions not to open it for days, prosecutors said. \nThe same evening, however, the woman looked inside and discovered that her money and valuables were missing, the district attorney said. Prosecutors said the woman was promised that the cash and jewelry would be given back following the blessing. \nAt her arraignment Thursday in Brooklyn Supreme Court, Su pleaded not-guilty to an eight-count indictment, her attorney told NBC News, which included charges of second-, third-, and fourth-degree grand larceny as a hate crime. \"In this case, the theory is that the victims were targeted because of their ethnicity, because they were Chinese, and because of their religious practices, their religious spiritual beliefs.\" \nHelen Peterson, a spokeswoman for the DA's office, told NBC News that prosecutors can charge a hate crime if a victim is targeted because of ethnicity, race, or religious beliefs. Hate crime charges in New York State increase the punishment if convicted. \n\"In this case, the theory is that the victims were targeted because of their ethnicity, because they were Chinese, and because of their religious practices, their religious spiritual beliefs,\" Peterson said. \nSu faces up to 25 years in prison if found guilty of the indictment's top count, the district attorney's office said. \nJustice Danny Chun set bail at $150,000 cash, or $250,000 bond, according to the district attorney. Su's attorney, Morris Shamuil, said Su has no funds or assets to post bail and remains behind bars. \nHe added that Su had also been charged in a similar case in the borough of Queens. She's due back in Brooklyn Supreme Court on Dec. 21. \nRELATED: Brooklyn DA Charges 3 With Alleged $85,000 Theft in 'Blessing Scam' \nShamuil said he told the judge at the arraignment Thursday that Su was smuggled from China into the U.S. based on promises of being given a job, earning money, and receiving legal immigration status. He added she was forced to do things she didn't agree to in exchange for food and shelter. \n\"She was not aware of what she would have to do,\" he said. \"She didn't know what the price was until she got to America.\" \nShamuil also said he was surprised by and disagreed with the hate crime charges, adding that both his client and the alleged victims are Chinese. \n\"I have not ever seen anything like this done before, in terms of making grand larceny as a hate crime,\" he said. Part of keeping NYC safe is sharing info. Here’s the @NYPD5Pct sharing tips on spiritual blessing scams. pic.twitter.com/qhIfDqpdME — NYPD NEWS (@NYPDnews) May 18, 2016 \nThe charges in the indictment also relate to a second incident, in which Su and other suspects not yet apprehended allegedly targeted a 54-year-old Chinese immigrant. The woman, who was told that a member of her family would die from a curse, gathered around $19,000 in cash and pieces of 24-karat gold jewelry to be blessed. \nShe, too, was promised that her money and jewelry would be returned, according to prosecutors. It was only later that the woman realized what she had handed over was gone from the bag, prosecutors said. \nThe hate crime charges against Su come a little more than a month after the Brooklyn district attorney announced an indictment related to another alleged blessing scam. In that one, two women and a man were charged with stealing $85,000 in cash and jewelry that a Chinese senior citizen allegedly handed over to be blessed to remove a death curse. \nThey and Su were also arrested in August in connection with similar incidents in Manhattan and Queens, according to DNAinfo . Documentation related by the NYPD warning community members about \"blessing scams.\" \nThe so-called \"blessing scam\" has been around in U.S. Chinese communities for years, with victims targeted in Boston, Chicago, San Francisco, Seattle, and Hawaii, according to NBC New York . Following a rash of such cases in New York City, the New York Police Department began a public awareness campaign in 2013, hitting the streets and tacking up posters in Chinese and English to warn residents. \n\"This is the second blessing scam we've indicted in as many months, in which brazen con men and women walk off with the life savings of their victims,\" Acting Brooklyn District Attorney Eric Gonzalez said in a statement. \"I urge those in the Chinese community to warn their vulnerable family members to be aware of these scams to avoid falling prey to them.\" \nFollow NBC Asian America on Facebook , Twitter , Instagram , and Tumblr . Chris Fuchs ", "external_links": [], "published": "2016-10-21T08:00:00.000+03:00", "crawled": "2016-10-21T20:03:02.753+03:00", "highlightTitle": ""}