{"organizations": [], "uuid": "a5a2366369fa40418b975ae47088994cbd4d9bf0", "thread": {"social": {"gplus": {"shares": 2}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 9}, "facebook": {"likes": 31, "shares": 31, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nbcnews.com", "main_image": "http://media1.s-nbcnews.com/j/newscms/2016_43/1715556/160919-citizen-ceremony-2154_8bedd9b68cecc0dd871167aec7fe2f6b.nbcnews-fp-1200-800.jpg", "site_section": "", "section_title": "", "url": "http://www.nbcnews.com/news/asian-america/partial-fee-waivers-introduced-cost-filing-immigration-applications-goes-n674746", "country": "US", "domain_rank": 478, "title": "Partial Fee Waivers Introduced as Cost of Filing On Immigration Applications Goes Up - NBC News", "performance_score": 0, "site": "nbcnews.com", "participants_count": 0, "title_full": "Partial Fee Waivers Introduced as Cost of Filing On Immigration Applications Goes Up - NBC News", "spam_score": 0.0, "site_type": "news", "published": "2016-10-28T08:00:00.000+03:00", "replies_count": 0, "uuid": "a5a2366369fa40418b975ae47088994cbd4d9bf0"}, "author": "Agnes Constante", "url": "http://www.nbcnews.com/news/asian-america/partial-fee-waivers-introduced-cost-filing-immigration-applications-goes-n674746", "ord_in_thread": 0, "title": "Partial Fee Waivers Introduced as Cost of Filing On Immigration Applications Goes Up - NBC News", "locations": [], "entities": {"persons": [{"name": "john moore", "sentiment": "none"}, {"name": "agnes constante", "sentiment": "none"}, {"name": "eva millona", "sentiment": "none"}, {"name": "khansari", "sentiment": "none"}, {"name": "nasim khansari", "sentiment": "none"}], "locations": [{"name": "united states", "sentiment": "none"}, {"name": "new york city", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "great hall of ellis island", "sentiment": "none"}, {"name": "los angeles", "sentiment": "none"}], "organizations": [{"name": "getty images  advocates", "sentiment": "none"}, {"name": "nbc news", "sentiment": "none"}, {"name": "usc dornslife", "sentiment": "none"}, {"name": "u.s. citizenship and immigration services", "sentiment": "none"}, {"name": "asian americans advancing justice", "sentiment": "none"}, {"name": "npna", "sentiment": "none"}, {"name": "nbc asian america on facebook", "sentiment": "none"}, {"name": "instagram", "sentiment": "none"}, {"name": "usc dornslife center for the study of immigrant integration", "sentiment": "none"}, {"name": "massachusetts immigrant and refugee advocacy coalition", "sentiment": "none"}, {"name": "uscis", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Oct 28 2016, 7:55 pm ET Partial Fee Waivers Introduced as Cost of Filing On Immigration Applications Goes Up by Agnes Constante advertisement \nOne million eligible-to-naturalize immigrants could potentially benefit from a new rule issued by U.S. Citizenship and Immigration Services (USCIS) earlier this week that introduces a partial fee waiver for naturalization. \nUnder the new rule, applicants who fall between 150 to 200 percent of federal poverty guidelines — or $36,450 to $48,600 for a household of four — will be eligible for a reduced naturalization fee. The current full fee waiver for applicants with household incomes under 150 percent of poverty guidelines will remain in effect. \n\"This new partial fee waiver, with the full waiver that has been in effect, will allow 3.7 million poor and working poor legal permanent residents to be able to become U.S. citizens and become full participants of our nation,\" Eva Millona, co-chair of the National Partnership for New Americans (NPNA) and executive director of the Massachusetts Immigrant and Refugee Advocacy Coalition, said in a statement. \"Citizenship should not be a privilege limited to the wealthy and highly educated. This is an important step forward for our democracy.\" Immigrants stand for the U.S. national anthem during a naturalization ceremony in the Great Hall of Ellis Island on September 16, in New York City. John Moore / Getty Images \nAdvocates for the partial waiver, including the NPNA and Asian Americans Advancing Justice - Los Angeles, praised the new rule, which reduces the naturalization fee for those eligible to $320. However, they had also urged USCIS expand the waiver to apply to household incomes beyond 200 percent of poverty guidelines. \n\"What we're seeing overall is that the partial waiver is a step in right direction,\" Nasim Khansari, citizenship project director for Asian Americans Advancing Justice - Los Angeles, told NBC News. \"We applaud USCIS for taking that step and making it more affordable.\" \nBut, Khansari added, \"if applicants make more than $48,600, they will be subject to the full fee increase. Even if it's a penny over that amount, they won't qualify.\" \nIn the United States, there are 8.5 million eligible-to-naturalize individuals, according to a USC Dornslife Center for the Study of Immigrant Integration brief that assessed the effects of the partial fee waiver. \nOf the one million who will be eligible for that waiver, the vast majority are Latino immigrants who are disproportionately of Mexican origin and account for 72 percent of those who qualify for the reduced naturalization fee. Mexicans are also disproportionately affected by the cost of citizenship. \nRELATED: Something in the Numbers: Citizen Applications at Highest in Four Years \nAbout 150,000 Asian immigrants, who account for 1.8 million of the nation's eligible-to-naturalize population, are also anticipated to benefit from the USCIS change. Among ethnic groups Advancing Justice-LA serves, it expects to see many working class Filipinos and Koreans — who often aren't eligible for the full waiver — qualify for the partial waiver, Khansari said. \nOthers expected to benefit are African lawful permanent residents, who make up over 275,000 of the eligible-to-naturalize population. Of that number, 85,000 are at or below 150 percent of poverty, and over 28,000 fall between 151 to 200 percent of poverty, according to the USC Dornslife report. \nWhile the partial waiver is good news for eligible-to-naturalize immigrants, it comes alongside increases in immigration application fees across the board. Among these include the standard naturalization fee, which will rise from $680 to $725. Changes will take effect on Dec. 23. \nRELATED: Naturalizations Backlog Could Keep Thousands of Immigrants From Voting \nWith more expensive fees, immigrants will likely choose not to apply for other certificates and petitions, Khansari said. The cost for a certificate of citizenship, for instance, nearly doubles from $600 to $1,170 in December. And the form to petition a relative increases from $420 to $535. \n\"If you have someone who becomes a U.S. citizen and wants to bring a family member, that fee is so high that it's going deter them from bringing them here,\" Khansari said. \nIndividuals who qualify for the reduced fee are encouraged by Advancing Justice-LA to submit their citizenship applications after the new rule goes into effect on Dec. 23, while eligible legal permanent residents who don't qualify for a partial fee waiver are encouraged to submit an application for citizenship before the fee increase goes into effect. \nFollow NBC Asian America on Facebook , Twitter , Instagram , and Tumblr . Agnes Constante ", "external_links": [], "published": "2016-10-28T08:00:00.000+03:00", "crawled": "2016-10-29T07:04:05.487+03:00", "highlightTitle": ""}