{"organizations": [], "uuid": "54c1ba9a6e8cfaf0a1cc0bfc1f78e0df80474089", "thread": {"social": {"gplus": {"shares": 1}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 8}, "facebook": {"likes": 917, "shares": 917, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nbcnews.com", "main_image": "http://media3.s-nbcnews.com/j/newscms/2016_41/1746276/161011-childhood-sylvia-mendez-young_779d95c42ea980e3e180c805ac161416.nbcnews-fp-1200-800.jpg", "site_section": "", "section_title": "", "url": "http://www.nbcnews.com/storyline/hispanic-heritage-month-2016/6-ways-latino-advocacy-has-shaped-our-education-policies-n664491", "country": "US", "domain_rank": 478, "title": "6 Ways Latino Advocacy Has Shaped Our Education Policies - NBC News", "performance_score": 9, "site": "nbcnews.com", "participants_count": 0, "title_full": "6 Ways Latino Advocacy Has Shaped Our Education Policies - NBC News", "spam_score": 0.212, "site_type": "news", "published": "2016-10-12T08:00:00.000+03:00", "replies_count": 0, "uuid": "54c1ba9a6e8cfaf0a1cc0bfc1f78e0df80474089"}, "author": "Raul A. Reyes", "url": "http://www.nbcnews.com/storyline/hispanic-heritage-month-2016/6-ways-latino-advocacy-has-shaped-our-education-policies-n664491", "ord_in_thread": 0, "title": "6 Ways Latino Advocacy Has Shaped Our Education Policies - NBC News", "locations": [], "entities": {"persons": [{"name": "raul a. reyes", "sentiment": "negative"}, {"name": "doe", "sentiment": "none"}, {"name": "judy serna", "sentiment": "none"}, {"name": "alex brandon", "sentiment": "none"}, {"name": "roberto alvarez jr", "sentiment": "none"}, {"name": "richards", "sentiment": "none"}, {"name": "sylvia mendez", "sentiment": "none"}, {"name": "roberto alvarez", "sentiment": "none"}, {"name": "kauffman", "sentiment": "none"}, {"name": "judy serna", "sentiment": "none"}, {"name": "deborah santiago  mendez", "sentiment": "none"}, {"name": "thomas a. saenz", "sentiment": "none"}, {"name": "saenz", "sentiment": "none"}, {"name": "santiago", "sentiment": "none"}, {"name": "latina", "sentiment": "none"}, {"name": "deborah santiago", "sentiment": "none"}, {"name": "mendez", "sentiment": "none"}, {"name": "marshall", "sentiment": "none"}, {"name": "rodney choice", "sentiment": "none"}, {"name": "roberto flores  thomas a. saenz", "sentiment": "none"}, {"name": "sylvia mendez  mendez", "sentiment": "none"}, {"name": "william brennan", "sentiment": "none"}, {"name": "serna", "sentiment": "none"}, {"name": "earl warren", "sentiment": "none"}, {"name": "obama", "sentiment": "none"}, {"name": "albert kauffman", "sentiment": "none"}, {"name": "roberto alvarez jr.", "sentiment": "none"}, {"name": "rodney choice/www", "sentiment": "none"}, {"name": "alvarez", "sentiment": "none"}, {"name": "antonin scalia", "sentiment": "none"}, {"name": "aspira", "sentiment": "none"}, {"name": "thurgood marshall", "sentiment": "none"}], "locations": [{"name": "united states", "sentiment": "none"}, {"name": "san diego", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}, {"name": "new mexico", "sentiment": "none"}, {"name": "el paso", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "new york city", "sentiment": "none"}, {"name": "orange county", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "lemon grove", "sentiment": "none"}, {"name": "laredo", "sentiment": "none"}, {"name": "santiago", "sentiment": "none"}, {"name": "plyler", "sentiment": "none"}, {"name": "southwest", "sentiment": "none"}], "organizations": [{"name": "nbc news", "sentiment": "negative"}, {"name": "league of united latin american citizens", "sentiment": "none"}, {"name": "stanford", "sentiment": "none"}, {"name": "university of texas el paso", "sentiment": "none"}, {"name": "brown v. board of education", "sentiment": "none"}, {"name": "lulac", "sentiment": "none"}, {"name": "u.s. supreme court", "sentiment": "none"}, {"name": "el paso times", "sentiment": "none"}, {"name": "supreme court", "sentiment": "none"}, {"name": "new york city's board of education", "sentiment": "none"}, {"name": "portales school district", "sentiment": "none"}, {"name": "st mary's university school of law", "sentiment": "none"}, {"name": "california superior court", "sentiment": "none"}, {"name": "maldef", "sentiment": "none"}, {"name": "aspira v. board of education", "sentiment": "none"}, {"name": "westminster school district", "sentiment": "none"}, {"name": "school of american research", "sentiment": "none"}, {"name": "portales municipal school district", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "university of california san diego", "sentiment": "none"}, {"name": "los angeles times", "sentiment": "none"}, {"name": "st. mary's university school of law", "sentiment": "none"}, {"name": "instagram", "sentiment": "none"}, {"name": "aspira", "sentiment": "none"}, {"name": "lemon grove school district", "sentiment": "none"}, {"name": "puerto rican legal defense and education fund", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Oct 12 2016, 11:31 am ET 6 Ways Latino Advocacy Has Shaped Our Education Policies by Raul A. Reyes In this June 20, 2016, photo, The Supreme Court is seen in Washington. The eight-justice court has eight cases to resolve in the waning days of a trying and mournful term since the death of Justice Antonin Scalia in February. Alex Brandon / AP Share advertisement \nDid you know that the nation's first successful school desegregation case centered on a blond Mexican-American fifth-grader? Or that a 9-year-old Latina helped pave the way for the end of school segregation in the United States? \nLatinos have long been at the forefront of the battle to improve education outcomes for all Americans. But unlike many of the struggles of the African-American civil rights movement, these efforts are largely unknown to most people today. In fact, as far back as the 1930s, Latinos have been organizing and mounting legal challenges to what they considered unjust education policies. \nIn cases dealing with everything from the \"separate but equal\" doctrine to bilingual education to college access, the Latino community has a rich legacy of parents fighting for better schools, better communities, and better futures for their children. \nHere's a look at six key cases where Latinos helped shape education policy. Roberto Alvarez v. Lemon Grove School District (California, 1931) \nLemon Grove was a small district outside San Diego, where Mexican-American and white students attended school together. One day, the principal blocked the door and turned away the Mexican-American kids. He told them that henceforth they would be studying in a rundown building the kids called la caballeriza (\"the stable\"). \nAlthough the district maintained that this was necessary because the Mexican-American students couldn't speak English and had assimilation issues, it was really more of a reflection of the anti-immigrant sentiments of the Depression era. In fact, many of the Mexican-American children had been born and raised in California. \nSo the Lemon Grove parents banded together and sued the district. Their plaintiff was Roberto Alvarez, age 12, chosen because of his fair appearance, excellent grades, and perfect English. Roberto Alvarez (right) and Roberto Alvarez Jr., at the School of American Research, New Mexico 1996. Roberto Alvarez Jr. \nA California Superior Court judge ruled that segregating the Mexican-American students infringed on the laws of the state, and soon all the kids were back attending school together. \nWhile it attracted little notice at the time, the Lemon Grove parents had won the first successful school desegregation case in American history. \nRoberto Alvarez Jr., now professor emeritus at the University of California San Diego, only learned about the case when he was doing research as a graduate student at Stanford. \"My dad, and his parents, were really humble about it,\" he told NBC News. \"People in the family called it, 'that court thing;' to them it was something that came and went. Later, we called it the 'Lemon Grove Incident .'\" \n\"My dad was very old-school; I don't think he realized the broader significance and impact of what he had done,\" Alvarez said. \nOne thing is certain: The senior Alvarez made the most of his education. When he passed away at age 84 in 2003 , the Los Angeles Times described him as a successful businessman \"who made millions.\" Mendez v. Westminster School District (California, 1946) \nSylvia Mendez was nine years old when her parents took her to register for school in Orange County, California. Instead they were turned away, and told to go to the \"Mexican school,\" even though her family spoke more English than Spanish. Sylvia Mendez, age 10, the plaintiff in Mendez v. Westminster case. Sylvia Mendez \nMendez' father recruited other families for a class action lawsuit and they sued the district over the policy of \"separate but equal\" schools for Mexican-Americans and white students. Mendez' lawyer argued that segregating Mexican-American students led to feelings of inferiority among them, and a federal judge agreed. The ruling was upheld on appeal, and later California's Governor Earl Warren decided to end segregation in all of the state's public schools. \"We have to reframe history so people see how committed Latinos parents are to their youth. We are not powerless.\"- policy expert Deborah Santiago \nMendez returned to school - but she had changed history . One of the lawyers who submitted a brief in support of her case was Thurgood Marshall, who used the legal framework from Mendez to argue Brown v. Board of Education at the Supreme Court in 1954. \nBy then, the Chief Justice was Earl Warren, who sided with Marshall and wrote the majority opinion ending segregation in public schools. So the Mendez case can be seen as a roadmap for Brown; it laid the legal groundwork for one of the significant court decisions in American history. Sylvia Mendez receiving the Presidential Medal of Freedom. She is an advocate for Latino educational issues. Sylvia Mendez. \nSylvia Mendez, now retired from a 33-year career in nursing, recalled how the case impacted her personally. \"When I went back to school, I felt pressure to do well, because my parents had fought for me to be there,\" she told NBC News. \"They taught me that, no matter what, you have to persevere.\" \nMendez received the Presidential Medal of Freedom in 2011. \"I cried when President Obama put it around my neck, thinking of my parents,\" she said. \"I felt like they were finally getting the recognition they deserved. I am just like the messenger, telling the story; they really did all the work.\" Aspira v. Board of Education of the City of New York (New York, 1972) \nAspira, a community organization , sued New York City's Board of Education over the right of students with limited English proficiency to receive bilingual education. Aspira charged that the New York City schools were denying educational opportunities to Puerto Rican students with little or no English-language ability. \nBacked by the Puerto Rican Legal Defense and Education Fund , Aspira won a settlement from the city guaranteeing bilingual education for all New York City public school students. This case was important because it was settled in the largest school district in the country, and it led to bilingual education being introduced in other districts as well. Deborah Santiago, Chief Operating Officer and Vice President for Policy, Excelencia in Education. Rodney Choice / Rodney Choice/www.choicephotogra \n\"The Aspira case has since benefited Asian-Americans, African-Americans, refugees, people of all backgrounds. And the bigger picture is that it was Latinos, in this case Puerto Ricans, who took leadership in moving the issue forward,\" said Deborah Santiago, Chief Operating Officer for Excelencia in Education . \"We have to reframe history so people see how committed Latinos parents are to their youth. We are not powerless.\" \nSantiago believes that the perception that Latinos do not value education must be challenged. \"We can see from history that this is not true,\" she noted. \"In case after case, Latinos are fighting for rights that benefit everyone, so that everyone can get the equity and support that Latino parents felt their children deserved.\" \n\"We are not just fighting for our own rights,\" Santiago said. \"Latinos are advocating in ways that put their own name and experience on the line so that other families can benefit.\" Serna v. Portales Municipal School District (New Mexico, 1974) \nWhen Judy Serna was ready for first grade, her mother took her to enroll in school. The school refused to admit her, however, because they said she couldn't speak English. Serna's mother and other parents joined a lawsuit against the school district. JUDY SERNA as a child, plaintiff in the lawsuit Serna v. Portales School District, 1974. Judy Serna \nIn court, they pointed out that minority children made up over half of the students in New Mexico's public schools, and charged that the district's failure to provide them with a bilingual education was a violation of the Equal Protection clause of the Fourteenth Amendment. Both a federal court and a circuit court found in favor of Serna, and the district was ordered to come up with programs that could meet the needs of all students. \nRELATED: Public Schools Becoming More Racially Segregated: Report \nThe Serna case helped make education equal for Latinos and Spanish-surnamed students across New Mexico, and strengthened the right of English-language learners to an education tailored to their needs. \nLooking back, Judy Serna recalled her memories of the case for NBC News. \"It wasn't even true that I didn't speak English. As a kid, I was comfortable in Spanish because I spent a lot of time with my grandparents, but mostly I was just shy,\" she remembered. \"What is amazing to me is that my mother, a single mom, would take on the school district and actually win.\" \nRELATED: Color Barrier: Segregation Images Resonate 60 Years On \nSerna missed out on a year of school while the case was being resolved , but she says it was worth it. \"I am proud of what my mom achieved,\" she said. \"She made things better for other students, and it also led to the hiring of bilingual teachers. So because of her, more Latino teachers were hired.\" \nAnd ironically, Serna knows more than ever about the value of being fully bilingual. \"All my life,\" she reflected, \"speaking Spanish has helped me get jobs.\" Plyler v. Doe (Texas, 1982) \nIn the 1970s, Texas passed a law that stripped funding from school districts that educated undocumented children, and authorized school districts to charge tuition to the parents of those children. The Mexican American Legal Defense and Educational Fund (MALDEF) filed suit on behalf of a group of these children to have the law invalidated. \nThe case went all the way to the U.S. Supreme Court, which in 1982 struck down the Texas law. \"If the state is to deny a discrete group of innocent children the free public education that it offers to other children residing within its borders, that denial must be justified by a showing that it furthers some substantial state interest,\" wrote Justice William Brennan in the majority opinion. \"No such showing was made here.\" \nThe idea of public education for all children may seem like a non-issue now, yet it was far from settled before Plyler. When the case was initially heard in Texas, the undocumented children involved took all of their belongings with them in suitcases to the courthouse - because they had been told that they would be deported immediately if their side lost. \nSince then, Plyler's doctrine has been used to strike down or weaken other discriminatory measures, like California's Proposition 187 . Thomas A. Saenz, President and General Counsel, MALDEF. Roberto Flores \nThomas A. Saenz, president and general counsel of MALDEF, said he is not surprised that cases like Plyler are not better known. \n\"The narrative of civil rights in this country has been largely framed through a Black/white/Southern U.S. paradigm,\" said Saenz. \"Not as much attention has been paid to the discrimination against Latinos in the Southwest and West.\" \nPart of the challenge for Latino civil rights advocates, he said, is adapting laws that were developed in a Black/White construct to protect Latino communities. Civil rights laws were typically written to end racial discrimination, while Latinos can face discrimination based on language ability, accents, or immigration status. \nCases like Plyler, Saenz said, stem from efforts by politicians to exploit fear among certain Americans of the growth of the Hispanic population. School policy is a natural place to attempt to exploit such a fear, he noted, because that is where the demographic trends are most visible. \n\"But if you read Plyler, it still holds up,\" he said. \"The justices split 5-4, but all nine justices believed it was bad policy to exclude undocumented children from our public schools.\" LULAC v. Richards (Texas, 1987) \nAt the time of this lawsuit, 20 percent of Texas residents lived in the state's border areas, but only 10 percent of state funding for public universities went there. \"People complained that they couldn't go to a good school near where they lived,\" said Albert Kauffman of St. Mary's University School of Law, one of the attorneys for MALDEF in the case. \"People were saying, why are our universities second-rate?\" St Mary's University School of Law Professor Albert Kauffman speaks at MALDEF banquet, 2013. Albert Kauffman \nThe suit alleged that Texas did not provide equal higher education opportunities in predominantly Hispanic border cities like El Paso and Laredo, compared to cities in the state's interior. At the trial, the League of United Latin American Citizens (LULAC) showed that, on average, students in the border areas travelled 225 miles to attend a comprehensive university - one with doctoral programs and professional schools - while those in the rest of Texas traveled 45 miles. \n\"It was the result of both neglect and discrimination, and because folks in the border areas did not have political clout,\" Kauffman said. \"People in the capital said that these students were 'not ready,' or they only needed access to a Bachelors Degree and that was enough.\" \nRELATED: 2016 Latino State of the Union: What Affects Latinos Today \nThe trial court ruled in favor of LULAC , and the South Texas/Border Initiative was created to improve funding in the region. By the time this decision was overturned in 1993, the Initiative had already become a catalyst for more state money, new degree programs, and new campuses in the border areas. The El Paso Times has noted that the lawsuit changed the trajectory of the University of Texas El Paso, whose student body is 80 percent Hispanic . \n\"It took a lawsuit to break up the old system and give people in that region a chance,\" Kauffman said. \"It also took political leaders coming together and putting aside differences, and coming up with a plan. If it hadn't been for that, there would not be the opportunities we have now. Because of that, there is a much better higher education system throughout the border area.\" \nFollow NBC News Latino on Facebook , Twitter and Instagram . Raul A. Reyes ", "external_links": [], "published": "2016-10-12T08:00:00.000+03:00", "crawled": "2016-10-13T01:45:38.559+03:00", "highlightTitle": ""}