{"organizations": [], "uuid": "87ac1796108715adb88626662c4178ac3f63bdb9", "thread": {"social": {"gplus": {"shares": 1}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 709, "shares": 709, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nbcnews.com", "main_image": "http://media3.s-nbcnews.com/j/newscms/2016_43/1764141/dscn6924-1_c7867275d2b471035dc9b6b3cc52af7d.nbcnews-fp-1200-800.jpg", "site_section": "", "section_title": "", "url": "http://www.nbcnews.com/news/asian-america/how-second-chance-led-ex-con-jay-ly-some-stinkin-n670946", "country": "US", "domain_rank": 478, "title": "How a Second Chance Led Ex-Con Jay Ly to Some Stinkin Crawfish - NBC News", "performance_score": 7, "site": "nbcnews.com", "participants_count": 0, "title_full": "How a Second Chance Led Ex-Con Jay Ly to Some Stinkin Crawfish - NBC News", "spam_score": 0.193, "site_type": "news", "published": "2016-10-27T08:00:00.000+03:00", "replies_count": 0, "uuid": "87ac1796108715adb88626662c4178ac3f63bdb9"}, "author": "Agnes Constante", "url": "http://www.nbcnews.com/news/asian-america/how-second-chance-led-ex-con-jay-ly-some-stinkin-n670946", "ord_in_thread": 0, "title": "How a Second Chance Led Ex-Con Jay Ly to Some Stinkin Crawfish - NBC News", "locations": [], "entities": {"persons": [{"name": "jay ly", "sentiment": "negative"}, {"name": "eddy zheng", "sentiment": "none"}, {"name": "ly", "sentiment": "none"}, {"name": "agnes constante", "sentiment": "none"}, {"name": "nha trang", "sentiment": "none"}, {"name": "stinkin crawfish", "sentiment": "none"}, {"name": "deney tuazon", "sentiment": "none"}, {"name": "los angeles  ly", "sentiment": "none"}], "locations": [{"name": "united states", "sentiment": "none"}, {"name": "philippines", "sentiment": "none"}, {"name": "cajun", "sentiment": "none"}, {"name": "saigon", "sentiment": "none"}, {"name": "san quentin state prison", "sentiment": "none"}, {"name": "east los angeles", "sentiment": "none"}, {"name": "bay area", "sentiment": "none"}, {"name": "asian america", "sentiment": "none"}, {"name": "vietnam", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "east los angeles  born", "sentiment": "none"}, {"name": "l.a.", "sentiment": "none"}, {"name": "san francisco", "sentiment": "none"}, {"name": "san quentin", "sentiment": "none"}, {"name": "los angeles", "sentiment": "none"}], "organizations": [{"name": "nbc news", "sentiment": "negative"}, {"name": "state university", "sentiment": "none"}, {"name": "nbc", "sentiment": "none"}, {"name": "community youth center", "sentiment": "none"}, {"name": "bayview youth advocates", "sentiment": "none"}, {"name": "instagram", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "advertisement \nFor Jay Ly, every workday is different. \nSometimes, he gets up at 6 a.m. to meet with contractors at the two currently under construction locations of a Cajun restaurant that he co-founded with friends called Stinkin Crawfish. Other times, he's at the restaurant's three existing branches, fixing the occasional clogged drain or broken power outlet. \nHe's also busy coordinating with a friend and business partner about the two new locations, which are slated to be up and running by early 2017, perhaps even sooner. \nIt's a major change of pace from how Ly used to spend his days several years ago, when he was an inmate at four different correctional facilities, including San Quentin State Prison. \n\"The last 20 years of my life have been a whirlwind of events,\" he told NBC News. \"Most times, I'm grateful, and I just enjoy the fresh air, the ability to walk down the street, buy what I want and eat what I want to eat.\" A photo posted by NBC News (@nbcnews) \nFrom Vietnam to East Los Angeles \nBorn in Vietnam, Ly spent his childhood between Saigon and Nha Trang, a coastal city in the southern region of the country, he said. No adult figures were present during his early years: His mom was absent in his life, and he didn't meet his father until he was 5 years old, he said. He lived with his grandmother and uncle for a few years, but was essentially on his own. \n\"I had a dog. I just woke up every day and me and my dog would just go around and meet my friends,\" Ly said. \"I literally had a pair of shorts and ran around barefoot my whole childhood till they made me go to school.\" \nLy was about 9 years old when he journeyed to the United States. He said it was an abrupt move involving a pitch-black bus ride and swimming to a boat where he and his dad spent four to five days before arriving on an island. \"The last 20 years of my life have been a whirlwind of events. Most times, I'm grateful, and I just enjoy the fresh air, the ability to walk down the street, buy what I want and eat what I want to eat.\" \n\"I didn't know I was leaving,\" Ly said. \"I didn't even know where I was going.\" \nLy and his father wound up spending several months at two refugee camps, including one in the Philippines, before coming to the country in 1989 and settling in East Los Angeles. \nOnce he and his father arrived, it wasn't long before he was exposed to gangs, Ly said. In the fifth grade, his friends told him to bring a knife before going out to play basketball so that they wouldn't get jumped. \n\"So I came with a kitchen knife and sure enough, about a half hour or an hour later [after we started playing], about 10 to 12 Mexicans climbed the fence and started walking toward us,\" he said. \"We grabbed our knives, chased them, and they ran the opposite way.\" \nHis affiliation with gangs continued into his middle and high school years. Ly said being part of one at that time was more about bragging rights than anything else. Oftentimes, gang activities consisted of tagging whatever they could, including desks and folders, he said. Though Jay Ly's early life was tumultuous, his determination has allowed him to speak about his experiences at conferences and has led to the opening of multiple locations of Stinkin Crawfish. Deney Tuazon / Courtesy of Asian Americans Advancing Justice -- Los Angeles \nLy also began using and selling drugs, including crack cocaine and methamphetamine. He said he discovered he didn't like them much. And after witnessing the visible effects of drugs on his body, he decided to stop using them. \nIn his later teenage years, Ly felt the urge to escape the life he was living, but felt stuck and didn't know how to break away from his situation. \n\"I just did whatever my friends wanted. I didn't really have a voice,\" he said. \nIt was that attitude that would land Ly in prison. \nOne night 20 years ago, a person in a car that was involved in a road rage incident with a car Ly was driving was shot dead, according to Ly. In 1997, Ly went to trial facing 25 years to life on counts of first- and second-degree murder, according to court records acquired by NBC News. \nLy and a friend went to trial separately, and Ly was offered a plea bargain to testify against his friend, he said. He opted to decline the offer because he wanted to do the right thing and take responsibility for his actions, he said. \nAlthough he rejected the deal, he was given what he calls a \"second chance.\" Ly was found not guilty of the charges, and was instead convicted of a lesser count of manslaughter, according to court records. As a result, he received a reduced prison sentence of 12 years, of which he served 85 percent. \nA Second Chance \nSince that turning point in his life, Ly went on to attend San Francisco State University where he took on a course load of 15 to 18 units per semester and worked two to three jobs, he said. He graduated in 2009 with a degree in business administration with a concentration in computer information systems. Post by NBC News . \nAfter leaving prison, Ly worked at the Community Youth Center of San Francisco, a non-profit organization, from 2009 to 2013. There, he worked with Eddy Zheng, a formerly incarcerated Chinese American who served 21 years in prison for a crime he committed at the age of 16. \nWhile he was in the Bay Area, Ly also established called Bayview Youth Advocates (BYA), a multicultural group of high school students dedicated to making a positive impact on its community. BYA further conducts outreach to monolingual Chinese youth and families to offer public service assistance in multiple areas including housing applications and public safety awareness. \nToday, Ly is largely focused on the expansion of Stinkin Crawfish. He's also meeting with potential investors about a new restaurant chain he'd like to open. \nLy credits a large part of the reason he is where he is today, despite his prior conviction, to an elderly female juror who, along with two other Asian jurors, helped persuade the others to vote him guilty of manslaughter instead of murder. The lady kept in touch with Ly while he was in prison and even attended his graduation ceremony when he obtained his associate's degree while he was at San Quentin. Jay Ly speaking at a panel on incarceration at the 2016 Advancing Justice Conference in Los Angeles, California. Deney Tuazon / Courtesy of Asian Americans Advancing Justice -- Los Angeles \nOther contributors to his achievements, Ly said, are the volunteers who dedicated their time to work with prisoners in San Quentin and the attorney who fought for him during his trial. \n\"Those things are meaningful and not recognized,\" he said. \nAs an Asian American ex-convict, Ly said that a number of aspects need to be changed to prevent new immigrants to the United States from landing in prison like he did. Among these including immigration reform, providing resources for new immigrants, reforming the school system, and reconsidering felony disenfranchisement, as most states do not allow inmates to vote. \n\"Taking away someone's right to vote is not a punishment. It's a punishment against the other people who are voting,\" he said. \"If you take away my vote, I cannot vote to help you when the time comes.\" \n\"We don't need to make a decision,\" he added. \"We just need a voice. That's all we're asking for.\" \"Taking away someone's right to vote is not a punishment. It's a punishment against the other people who are voting. If you take away my vote, I cannot vote to help you when the time comes.\" \nLy added that understanding each other is crucial if people wish to see more tales of success from formerly incarcerated individuals like himself. \n\"In order for all of this to happen, we all need to understand the pain and suffering that everyone has, and do something to help each other to end the cycle of violence among all people,\" he said. \"When we do that, it makes us human and makes the world a better place.\" \nFor him, it was the understanding of the female juror who made his second chance possible,. \n\"When I got out, I always visited her and [took] her to lunch when I [came] to L.A.,\" he said. \"I haven't talked to her the last two years with the restaurants, but I've been planning to take her here to show it off to her.\" \nFollow NBC Asian America on Facebook , Twitter , Instagram , and Tumblr . Agnes Constante ", "external_links": [], "published": "2016-10-27T08:00:00.000+03:00", "crawled": "2016-10-27T16:12:15.346+03:00", "highlightTitle": ""}