{"organizations": [], "uuid": "c3f9c936c4cb648388781498536517c0e3bae090", "thread": {"social": {"gplus": {"shares": 3}, "pinterest": {"shares": 1}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 943, "shares": 943, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nbcnews.com", "main_image": "http://media4.s-nbcnews.com/j/newscms/2016_43/1770421/161027-donald-trump-2211_aa6a284cd391e1aad8974ecefae2594e.nbcnews-fp-1200-800.jpg", "site_section": "", "section_title": "", "url": "http://www.nbcnews.com/politics/2016-election/18-falsehoods-just-trump-s-thursday-night-n674311", "country": "US", "domain_rank": 478, "title": "18 Falsehoods Just From Trump's Thursday Night - NBC News", "performance_score": 9, "site": "nbcnews.com", "participants_count": 0, "title_full": "18 Falsehoods Just From Trump's Thursday Night - NBC News", "spam_score": 0.037, "site_type": "news", "published": "2016-10-28T10:19:00.000+03:00", "replies_count": 0, "uuid": "c3f9c936c4cb648388781498536517c0e3bae090"}, "author": "Jane C. Timm", "url": "http://www.nbcnews.com/politics/2016-election/18-falsehoods-just-trump-s-thursday-night-n674311", "ord_in_thread": 0, "title": "18 Falsehoods Just From Trump's Thursday Night - NBC News", "locations": [], "entities": {"persons": [{"name": "jane c. timm", "sentiment": "negative"}, {"name": "trump", "sentiment": "negative"}, {"name": "evan vucci", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "bill clinton", "sentiment": "none"}, {"name": "obama", "sentiment": "none"}, {"name": "terry mcauliffe", "sentiment": "none"}, {"name": "obamacare", "sentiment": "none"}, {"name": "john podesta", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "clinton", "sentiment": "none"}, {"name": "george h.w. bush", "sentiment": "none"}, {"name": "mcauliffe", "sentiment": "none"}, {"name": "clintons", "sentiment": "none"}, {"name": "hillary", "sentiment": "none"}, {"name": "newt gingrich", "sentiment": "none"}], "locations": [{"name": "america", "sentiment": "none"}, {"name": "virginia", "sentiment": "none"}, {"name": "geneva", "sentiment": "none"}, {"name": "arizona", "sentiment": "none"}, {"name": "lima", "sentiment": "none"}, {"name": "toledo", "sentiment": "none"}, {"name": "ohio", "sentiment": "none"}], "organizations": [{"name": "nbc news", "sentiment": "negative"}, {"name": "trump", "sentiment": "negative"}, {"name": "fbi", "sentiment": "none"}, {"name": "fox news", "sentiment": "none"}, {"name": "isis", "sentiment": "none"}, {"name": "state", "sentiment": "none"}, {"name": "pew research", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "house", "sentiment": "none"}, {"name": "congressional", "sentiment": "none"}, {"name": "nafta", "sentiment": "none"}, {"name": "loyola university", "sentiment": "none"}, {"name": "wikileaks", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Oct 27 2016, 10:12 pm ET 18 Falsehoods Just From Trump's Thursday Night by Jane C. Timm Republican presidential candidate Donald Trump arrives to speak to a campaign rally, Thursday, Oct. 27, 2016, in Geneva, Ohio. Evan Vucci / AP Share advertisement \nFrom extreme Obamacare tax hikes to allegations of widespread corruption by Hillary Clinton and her allies, Donald Trump's Thursday night speeches and a Fox News interview offered up more than a dozen inaccuracies — an impressive feat even for a campaign that has spawned an cottage industry of fact checkers. \nHere's what he got wrong. \n1. \"The Clinton crew gave more than $675,000 to the deputy FBI director overseeing the investigation into Hillary's illegal server,\" Trump said in Toledo, Ohio. \nVirginia Gov. Terry McAuliffe's political arms gave that sum to a Virginia political candidate whose husband is an FBI official, but he wasn't promoted to oversee the Clinton email case until after that Virginia legislative race was already over. McAuliffe is a Clinton ally, to be sure, but not a member or part of any Clinton organization or \"crew.\" \n2. Trump said in two cities that 75 percent of people thing the country is on the wrong track. \nThat figure is actually 65 percent. \n3. Trump said Arizonans will see an \"116 percent hike.\" \nArizona will be hard hit by Obamacare rate hikes, and this figure is true for some plans, but Obamacare administrators say lower income Americans will be shielded from that hike by government subsidies designed to make healthcare more affordable. Middle income Americans may not be shielded from the hike as much, though. \n4. \"Remember every time you see a closed factory, a wiped-out community here in Ohio, the Clintons were really involved because NAFTA was such a disaster. And he signed it.\" \nPresident George H.W. Bush negotiated and signed NAFTA and former President Bill Clinton advocated for its Congressional approval. Clinton was hardly the only one and the deal's flaws can hardly be pinned on him and his wife: More Republicans than Democrats voted for the trade deal. One of Trump's top allies, former House Speaker Newt Gingrich, was a key player in securing Congressional approval. \n5. \"Hillary Clinton put the office of Secretary of State up for sale.\" \nThere's no evidence that Clinton illegally used her influence as Secretary of State for her financial gain. \n6. \"Hillary Clinton wants to raise taxes on small businesses up to 45 percent. What a difference this is. I was just thinking to myself: We should just cancel the election and give it to Trump.\" \nThat would be a coup, and Clinton doesn't want to tax small businesses 45 percent. She wants to raise taxes on wealthy people, so the increase Trump appears to be referring to would only apply to people reporting an income over 5 million. If a private business owner were reporting their business' income on their personal taxes and it was over $5 million - which is about 0.02 percent of tax returns - such a tax hike could occur. \n7. \"Hillary also says she wants to put coal miners out of work.\" \nThose remarks are out of context. She was talking about helping people who are losing their job in the coal industry. \n8. Clinton wants to \"stop producing shale energy in most places and put a permanent moratorium on energy development on federal lands where vast coal and shale energies are located.\" \nPolitiFact found that Clinton has supported regulations on shale energy , not ending it. She has advocated for a three-year moratorium on energy development, not a permanent ban, as well as increasing renewable energy production on those federal lands. \n9. Trump said Obama golfs every other day. \nHe doesn't. Obama completed his 300th round of golf in August, which if averaged out would be a round of golf every nine days. He's likely to play more in the summer and less in the winter months. \n10. ISIS is dreaming of her becoming president.\" \n12. \"The Border Patrol Agents and ICE, both endorsed me.\" \nThey did not; federal agencies cannot get involved in elections. Unions representing some of their employees did. \n13. Trump pronounced the Ohio city Lima as \"Lee-ma\" while speaking in Toledo. \nHis crowd corrected him: It's pronounced Ly-ma, as in lima beans. \n14. \"She pledges open border in secret to her donors, even as it costs millions of dollars and thousands of American lives,\" Trump said in Geneva. \nShe spoke positively about the concept of open borders as it related to energy in a speech excerpt in a batch of emails that appear to have been hacked from Clinton campaign manager John Podesta and released by WikiLeaks. While we only see an excerpt of the speech in the emails, she was not pledging to an actual immigration or national security policy. \n15. Trump said on Fox News that Pew Research found millions of registered voters who are dead or registered in multiple states, arguing that \"that means you vote in two states.\" \nPew Research found outdated and inaccurate information on voter rolls, but it did not find evidence of voter fraud. A Loyola University study of one billion ballots found 31 credible instances of voter fraud. \n16. Trump said that the Clintons became wealthy after leaving the White House by selling \"favors\" and \"access.\" The Clintons became wealthy writing books and giving paid speeches , a common way for political figures to grow their wealth after leaving office. \n17. Trump said America is the highest taxed nation. ", "external_links": [], "published": "2016-10-28T10:19:00.000+03:00", "crawled": "2016-10-28T05:20:10.449+03:00", "highlightTitle": ""}