{"organizations": [], "uuid": "c579cfb9855d8ff968c4c684b1d095ecfb280b48", "thread": {"social": {"gplus": {"shares": 9}, "pinterest": {"shares": 1}, "vk": {"shares": 0}, "linkedin": {"shares": 6}, "facebook": {"likes": 904, "shares": 904, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nbcnews.com", "main_image": "http://media4.s-nbcnews.com/j/newscms/2016_43/1773251/161029-jaylen-bledsoe-black-conference-mbe-1239p_9e1ad11f3d8d14ec6c0db8b8b1912aff.nbcnews-fp-1200-800.jpg", "site_section": "", "section_title": "", "url": "http://www.nbcnews.com/feature/college-game-plan/millionaire-17-robotics-scholar-teaches-students-power-technology-n675031", "country": "US", "domain_rank": 478, "title": "17-Year-Old Millionaire, Robotics Scholar Teach Students the Power of Technology - NBC News", "performance_score": 9, "site": "nbcnews.com", "participants_count": 0, "title_full": "17-Year-Old Millionaire, Robotics Scholar Teach Students the Power of Technology - NBC News", "spam_score": 0.004, "site_type": "news", "published": "2016-10-29T08:00:00.000+03:00", "replies_count": 0, "uuid": "c579cfb9855d8ff968c4c684b1d095ecfb280b48"}, "author": "Susan Donaldson James", "url": "http://www.nbcnews.com/feature/college-game-plan/millionaire-17-robotics-scholar-teaches-students-power-technology-n675031", "ord_in_thread": 0, "title": "17-Year-Old Millionaire, Robotics Scholar Teach Students the Power of Technology - NBC News", "locations": [], "entities": {"persons": [{"name": "jaylen bledsoe", "sentiment": "negative"}, {"name": "erin dennis", "sentiment": "none"}, {"name": "bledsoe", "sentiment": "none"}, {"name": "lebron james", "sentiment": "none"}, {"name": "justina nixon saintil", "sentiment": "none"}, {"name": "cynthia erenas", "sentiment": "none"}, {"name": "erenas", "sentiment": "none"}, {"name": "susan donaldson james", "sentiment": "none"}, {"name": "jaylen", "sentiment": "none"}, {"name": "hult", "sentiment": "none"}], "locations": [{"name": "new york city", "sentiment": "none"}, {"name": "san francisco", "sentiment": "none"}, {"name": "washington d.c.", "sentiment": "none"}, {"name": "nashville", "sentiment": "none"}, {"name": "tennessee", "sentiment": "none"}, {"name": "st. louis", "sentiment": "none"}, {"name": "los angeles", "sentiment": "none"}], "organizations": [{"name": "nbc news", "sentiment": "negative"}, {"name": "verizon foundation", "sentiment": "none"}, {"name": "verizon", "sentiment": "none"}, {"name": "verizon learning initiative", "sentiment": "none"}, {"name": "young entrepreneur university", "sentiment": "none"}, {"name": "university of san diego", "sentiment": "none"}, {"name": "university of vermont says yes  pew research", "sentiment": "none"}, {"name": "hult business school", "sentiment": "none"}, {"name": "patrick henry middle school", "sentiment": "none"}, {"name": "national science and math initiative", "sentiment": "none"}, {"name": "charles hart middle school", "sentiment": "none"}, {"name": "national society of black engineers", "sentiment": "none"}, {"name": "jaylen d. bledsoe global group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "advertisement \nJaylen Bledsoe is a millionaire at age 17 and credits a technology program for gifted third graders at his St. Louis school for his remarkable success. \nBledsoe taught himself web design in sixth grade after taking a yearbook design class. At age 12, he started an IT consulting company, and just last year, he became CEO of The Jaylen D. Bledsoe Global Group, valued at about $3.5 million. \nAt a time when the number of college students who study science, technology, engineering and math — so-called STEM fields — has fallen flat, Bledsoe wants to motivate younger students to acquire the skills to be innovators and entrepreneurs. \nSpecial section: Get tips and advice about college at College Game Plan \n\"Give kids access to technology, and with a curious mind, they will succeed in any environment,\" he said. \nUnchallenged by his teachers, Bledsoe left high school early to attend Hult Business School in San Francisco, but got bored there, too, and dropped out. Jaylen Bledsoe speaks with a conference attendee at the National Society of Black Engineers annual convention in Nashville, Tennessee. Verizon Innovative Learning \nBledsoe isn't against a college education, he told NBC News. \n\"It just isn't the path for me at the current moment.\" \nToday, he works with students at Hult's Founder's Lab, an \"incubator\" for innovation. Bledsoe, who is African-American, also runs the Young Entrepreneur University, a traveling camp for at-risk high school students. \nRelated: Students of All Races Welcome First Black Presidents to Largely White Colleges \nDespite a national effort to boost American competitiveness, fewer than half of all high school graduates are ready for college-level math and only a third are prepared for college-level science classes, according to the National Science and Math Initiative . That number is even lower for black (12 percent) and Hispanic (17 percent) students. \nCynthia Erenas, a Mexican immigrant, was a struggling student with no plans for college before she took a robotics class at her Los Angeles school. Her passion for STEM led to national awards and even at TED talk at age 14. \nNow Erenas is a freshman at University of San Diego, planning to major in computer science. \n\"Technology is moving quickly and if we do not start giving them opportunities now, many kids will be left behind,\" Erenas, 18, said. Cynthia Erenas at Charles Hart Middle School in Washington D.C. as part of the Verizon Innovative Learning program in October. Erin Dennis / Verizon Innovative Learning \n\"The skills you gain through STEM can change the world,\" she told NBC News. \"It can range from developing your own video game to eventually working on a project that can cure different diseases.\" \nThis weekend, both Bledsoe and Erenas will share their stories with hundreds of students at P.S. 171 Patrick Henry Middle School in New York City, hoping to inspire them. \nThe school is one of 46 low-income schools nationwide to participate in the Verizon Learning Initiative in partnership with another nonprofit, Digital Promise. Students and teachers get free computer tablets and 24/7 Internet access, as well as training and support. \nThe hope is these students will be future innovators, creators and entrepreneurs so they can increase their economic mobility. \nRelated: Can a Course on Birding Change the World? University of Vermont Says Yes \nPew Research reveals that more than a third of households whose annual incomes fall below $50,000 with children under 17 do not have a high-speed Internet connection at home, putting them at a learning disadvantage. \n\"When these kids get home, they don't have anywhere to extend their learning, to do homework, collaborate with other students or email a teacher,\" said Justina Nixon Saintil, director of education and technology for the Verizon Foundation. \nAs for Jaylen, he says he was was motivated by poverty to learn by himself. By sixth grade, he says he had taught himself seven computer languages. \n\"I was in a single-parent family and my mom struggled to pay the rent,\" he said. \"That encouraged me to work hard.\" \n\"People say I am gifted and a genius and a one in a million, but anyone can do it,\" he said. \"I want to give a student a story to follow. Look at how many kids want to be athletes because of LeBron James.\" \nErenas echoed that. \n\"If my story helps even one of them dream bigger for their futures, then I'm making a difference,\" she said. \"I feel like no child should go off to college without ever being in a robotics team, a coding team, or a team that gives them the opportunity to learn something they have not yet seen.\" Susan Donaldson James ", "external_links": [], "published": "2016-10-29T08:00:00.000+03:00", "crawled": "2016-10-29T22:40:32.614+03:00", "highlightTitle": ""}