{"organizations": [], "uuid": "36d89e962f83a201e88e073808962dbd2e7b5f23", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nbcnews.com", "main_image": "http://media2.s-nbcnews.com/j/newscms/2016_43/1771276/senate_2016_illinois_debate-jpeg-3c260_00471c08eb4b8d47a5c824f3ed196750.nbcnews-fp-1200-800.jpg", "site_section": "", "section_title": "", "url": "http://www.nbcnews.com/politics/2016-election/mark-kirk-apologizes-after-racially-charged-retort-senate-debate-n674561", "country": "US", "domain_rank": 478, "title": "Mark Kirk Apologizes After Racially-Charged Retort in Senate Debate - NBC News", "performance_score": 0, "site": "nbcnews.com", "participants_count": 0, "title_full": "Mark Kirk Apologizes After Racially-Charged Retort in Senate Debate - NBC News", "spam_score": 0.562, "site_type": "news", "published": "2016-10-28T08:00:00.000+03:00", "replies_count": 0, "uuid": "36d89e962f83a201e88e073808962dbd2e7b5f23"}, "author": "Jane C. Timm", "url": "http://www.nbcnews.com/politics/2016-election/mark-kirk-apologizes-after-racially-charged-retort-senate-debate-n674561", "ord_in_thread": 0, "title": "Mark Kirk Apologizes After Racially-Charged Retort in Senate Debate - NBC News", "locations": [], "entities": {"persons": [{"name": "mark kirk", "sentiment": "negative"}, {"name": "clinton", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "barack obama", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "duckworth", "sentiment": "none"}, {"name": "kirk", "sentiment": "none"}, {"name": "jane c. timm", "sentiment": "none"}, {"name": "lindsey graham", "sentiment": "none"}, {"name": "tammy duckworth", "sentiment": "none"}], "locations": [{"name": "illinois", "sentiment": "none"}, {"name": "iran", "sentiment": "none"}], "organizations": [{"name": "nbc news", "sentiment": "negative"}, {"name": "american heritage", "sentiment": "negative"}, {"name": "senate", "sentiment": "negative"}, {"name": "telemundo", "sentiment": "none"}, {"name": "democratic", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Senator Questions Opponent's American Heritage at Illinois Debate 1:24 autoplay autoplay Copy this code to your website or blog <iframe src=\"http://www.nbcnews.com/widget/video-embed/795732547920\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen></iframe> \nFor the Republican senator polling an average of 7 points below Duckworth, the remark has the potential to be the nail in the coffin, undoing months of Kirk's efforts to distance himself from Trump and tying his bid even closer to the controversial nominee with just days to go before the nation votes. \nCondemnation arrived swiftly, with Democratic nominee Hillary Clinton tweeting \"it's not really that hard to grasp\" and Duckworth responding with a telling family photo spelling out her family's heritage. My mom is an immigrant and my dad and his family have served this nation in uniform since the Revolution #ILSEN pic.twitter.com/ehEBHswFMs — Tammy Duckworth (@TammyforIL) October 28, 2016 \nKirk apologized by lunchtime on Friday, but long after his comments gained national attention on social media and cable news. Sincere apologies to an American hero, Tammy Duckworth, and gratitude for her family's service. #ilsen — Mark Kirk (@MarkKirk) October 28, 2016 \nAs a Republican seeking reelection, Kirk's political fortunes have been complicated by his party's presidential nominee, whose rise was rooted in racially-charged assumptions about Mexican immigrants and the birthplace of the president. \nWhile this isn't Kirk's first controversy in recent years -- he called the unmarried Republican Sen. Lindsey Graham a \"bro with no ho\" and critically referred to President Barack Obama as the \"drug dealer in chief\" for his handling of Iran -- the senator has worked hard to distance his campaign from Trump. \nAfter endorsing him early on, Kirk became the first Republican senator to un-endorse Trump back in June amid the nominee's early headline-dominating controversies. Kirk later called him \"too bigoted and racist\" to be president and ran ads against his party's nominee, saying in Spanish \"I do not support Trump\" in short television spots airing on Telemundo and Hispanic this fall. \nRunning in a blue state, Kirk had little choice: the state hasn't gone red in a presidential election since 1988 and in the few polls conducted in the state Clinton is polling in double digits ahead of Trump. \nThe embattled senator championed his own tough recovery from a stroke that nearly killed him as a learning experience and sought to differentiate himself as more moderate than his controversial national nominee, arguing instead that Trump's candidacy helped him remind his blue state of his independent streak, and votes gun restrictions and support of gay rights. \nAs his electoral hopes and Trump's numbers dropped throughout the summer and fall, Kirk was one of the most outspoken Republicans insisting that Trump should be pulled from the ballot, despite the fact that voting had already begun and there was no way to remove him. \nIn the end, Kirk will end his bid just as he began it: tied to Trump. Jane C. Timm ", "external_links": [], "published": "2016-10-28T08:00:00.000+03:00", "crawled": "2016-10-28T21:56:15.266+03:00", "highlightTitle": ""}