{"organizations": [], "uuid": "6247e16bc77e936f4aa1caab90eaee9885adcfde", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nbcnews.com", "main_image": "http://media4.s-nbcnews.com/i/newscms/2016_39/1729736/og-decision2016-200x200_e5e64fd467d815608f9a82df824d6560.gif", "site_section": "", "section_title": "", "url": "http://www.nbcnews.com/card/clinton-ends-day-campaigning-watching-cubs-earn-world-series-ticket-n671321", "country": "US", "domain_rank": 478, "title": "Clinton Ends Day of Campaigning by Watching Cubs Earn World Series Ticket - NBC News", "performance_score": 0, "site": "nbcnews.com", "participants_count": 0, "title_full": "Clinton Ends Day of Campaigning by Watching Cubs Earn World Series Ticket - NBC News", "spam_score": 0.037, "site_type": "news", "published": "2016-10-23T14:28:00.000+03:00", "replies_count": 0, "uuid": "6247e16bc77e936f4aa1caab90eaee9885adcfde"}, "author": "Ali Vitali", "url": "http://www.nbcnews.com/card/clinton-ends-day-campaigning-watching-cubs-earn-world-series-ticket-n671321", "ord_in_thread": 0, "title": "Clinton Ends Day of Campaigning by Watching Cubs Earn World Series Ticket - NBC News", "locations": [], "entities": {"persons": [{"name": "clinton", "sentiment": "negative"}, {"name": "dj anjali", "sentiment": "none"}, {"name": "bernie sanders", "sentiment": "none"}, {"name": "barack obama", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "mitt romney", "sentiment": "none"}, {"name": "bill clinton", "sentiment": "none"}, {"name": "glen caplin", "sentiment": "none"}, {"name": "evan mcmullin", "sentiment": "none"}, {"name": "kaine", "sentiment": "none"}, {"name": "dori monson", "sentiment": "none"}, {"name": "chris wallace", "sentiment": "none"}, {"name": "sanders", "sentiment": "none"}, {"name": "john podesta", "sentiment": "none"}, {"name": "miley", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "miley cyrus", "sentiment": "none"}, {"name": "mike pence", "sentiment": "none"}, {"name": "hillary", "sentiment": "none"}, {"name": "donald trump jr.", "sentiment": "none"}, {"name": "tim", "sentiment": "none"}, {"name": "cyrus", "sentiment": "none"}, {"name": "trump jr.", "sentiment": "none"}], "locations": [{"name": "trump rally  virginia", "sentiment": "none"}, {"name": "virginia", "sentiment": "none"}, {"name": "rhode island", "sentiment": "none"}, {"name": "brooklyn", "sentiment": "none"}, {"name": "tampa", "sentiment": "none"}, {"name": "chicago", "sentiment": "none"}, {"name": "park ridge", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}, {"name": "vermont", "sentiment": "none"}, {"name": "new hampshire", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "usa", "sentiment": "none"}, {"name": "fairfax", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "pensacola", "sentiment": "none"}, {"name": "new jersey", "sentiment": "none"}, {"name": "fl", "sentiment": "none"}, {"name": "pennsylvania", "sentiment": "none"}], "organizations": [{"name": "nbc news", "sentiment": "negative"}, {"name": "white sox", "sentiment": "none"}, {"name": "nypd's office of the deputy commissioner", "sentiment": "none"}, {"name": "miley cyrus surprises college students", "sentiment": "none"}, {"name": "kiro radio", "sentiment": "none"}, {"name": "party", "sentiment": "none"}, {"name": "nbcuniversal", "sentiment": "none"}, {"name": "george mason university", "sentiment": "none"}, {"name": "cubs", "sentiment": "none"}, {"name": "public information", "sentiment": "none"}, {"name": "msnbc", "sentiment": "none"}, {"name": "va", "sentiment": "none"}, {"name": "gop", "sentiment": "none"}, {"name": "los angeles dodgers", "sentiment": "none"}, {"name": "chicago cubs", "sentiment": "none"}, {"name": "google", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "latest posts from DECISION 2016 3 hours ago Clinton Ends Day of Campaigning by Watching Cubs Earn World Series Ticket \nDemocratic presidential candidate Hillary Clinton was seen watching the Chicago Cubs earn their ticket to the team's first World Series since 1945. \nClinton was born in Chicago and raised in the suburb of Park Ridge. Her press secretary tweeted a photo of the former secretary of state reacting to the win on a mobile phone while on a plane after a day of campaigning in Pennsylvania. The Cubs beat the Los Angeles Dodgers 5-0 Saturday in Game Six of the NLCS. \nWhile President Barack Obama also has ties to Chicago, he is a White Sox fan. That look when you cap off a day on the trail by watching the @Cubs cement their trip to the #WorldSeries . #FlyTheW pic.twitter.com/94KMWpKHwe 10 hours ago Hillary Clinton Mask on Pole, Bullseye Poster Seen At Trump Rally \nVIRGINIA BEACH, VA — Chants of \"lock her up\" and the nickname \"Crooked Hillary\" have become commonplace at Trump rallies. But Saturday afternoon's event here saw a plastic Hillary Clinton mask mounted on a stick, raised above the crowd and bobbing with the crowd's cheers. \nAnother sign elsewhere in the few thousand person crowd featured a bullseye over a photo of Clinton. The image, which looked like a target, was pasted on to a Trump/Pence sign. \nThe images appear to show an escalation in anti-Clinton sentiment at these rallies. While Trump has never endorsed violence against Clinton, his words have incited some angry reactions from supporters already inclined to despise the former secretary of state. 11 hours ago Donald Trump Inspires Bathroom Signs at Bill Clinton Rally \nDonald Trump's greatest hits from the last debate have inspired new bathroom designations at a community center in Pensacola, Florida, where President Bill Clinton held a rally Saturday. \nThe typical \"MEN\" and \"WOMEN\" signs were replaced with placards that read \"BAD HOMBRES\" and \"NASTY WOMEN.\" \nTrump called rival Hillary Clinton a \"nasty woman\" during the third and final presidential debate this week while she discussed entitlements. Earlier in the night, as he answered moderator Chris Wallace's question about immigration, he said, \"We have some bad hombres here, and we're going to get them out.\" \nThe internet and social media have since adopted the phrases, creating a number of memes and merchandise that display the two slogans. If you need to use the restroom at @billclinton 's Pensacola, FL event today... pic.twitter.com/iv22u8iM2Y 11 hours ago Miley Cyrus Surprises College Students in Support of Clinton \nFor singer Miley Cyrus, it will only be a \"Party in the USA\" if her favorite candidate wins the election — and she's doing everything possible to make that happen. \n\"The Voice\" coach went to George Mason University in Fairfax, Virginia, Saturday afternoon to knock on dorm room doors and urge students to vote for Hillary Clinton. \nDressed in a flashy red, white and blue ensemble, Cyrus asked students who they planned to vote for, chatted with them about the consequences of not voting and even played video games with some. \n\"I'm going from door-to-door right now in support of Hillary and Tim. Are you going to vote? Have you registered to vote? Are you voting here or from out of town? Voting for Clinton and Kaine?\" Cyrus asked one student after surprising her at her door. \nShe bounded from room to room, and also gave Clinton pins as souvenirs to students who said they were supporting her in November. VIDEO- Miley surprising students at George Mason University today pic.twitter.com/ox7wr3FX8M 14 hours ago Clinton: It's My Responsibility to Heal Divided Nation as President \nHillary Clinton has vowed to be the \"president for everybody,\" whether they vote for her or not. \n\"I don't want to leave anybody behind. I'm going to be the president for the people who vote against me and for me. I take that responsibility hard because I feel there's a place for everyone in America,\" Clinton told DJ Anjali \"Queen B \" on Tampa radio station 97.7 FM on Friday. \nShe said it would require a \"greater effort\" to accomplish that as the first female president, but feels she is up for the challenge. \nClinton added that she felt responsibility to bring people together amid the adversarial race with Donald Trump, and said she regretted how much the election had divided America. \n\"I really regret how divisive this campaign has been. Many of the things that have been said by my opponent are hurtful and have set people against each other. I've got the responsibility of not only being commander-in-chief, but I've got to figure out how we'd heal this divide,\" Clinton said. \nThe former secretary of state lamented the fact that Americans don't seem to see the \"potential in front of us,\" and instead engage in hateful rhetoric and bullying. 15 hours ago Google Searches for 'Write-In' Surge to Highest Point Since 2004 \nEven though Bernie Sanders is no longer in the presidential race, many supporters haven't given up on him — or on other options besides Hillary Clinton and Donald Trump, data from Google Trends shows . \nThe data shows that searches for the term \"write in,\" as in write-in candidate, have been growing since August, hitting a peak on October 13 — which happens to be the day after four women accused Republican candidate Donald Trump of touching them inappropriately. \nDuring that week, searches for \"write in\" rose by 2,800 percent, the highest its been since 2004. Searches for \"is Bernie Sanders a write in candidate\" rose 2,750 percent and searches for \"write in Mike Pence\" grew 2,400 percent the same week. Other candidates searched include Mitt Romney and Evan McMullin. \nThe highest interest is in New Jersey, Vermont, Rhode Island and New Hampshire. All of these states allow write-in candidates. \nWrite-in votes accounted for 0.11 percent of the vote in 2012. While they have the potential to make some impact on the race, they are rarely counted by states. \nSanders has strongly urged his supporters to back Hillary Clinton, but many have been reluctant to do so. 16 hours ago Trump Jr. Defends Father's Lewd Comments: 'It's a Fact of Life' \nDonald Trump Jr. is defending his father's recently unearthed lewd comments about women, calling it a \"fact of life\" that men talk like that. \nThe Republican nominee's son spoke Friday to KIRO radio's Dori Monson about the comments, which were caught on a hot microphone on a 2005 \"Access Hollywood\" videotape . ( \"Access Hollywood\" is owned and distributed by NBCUniversal, the parent company of NBC News and MSNBC.) \nThe tape, in which Trump is heard boasting about attempting to seduce a married woman, sparked backlash within the GOP and beyond. \n\"I think we all know guys who have had conversations with other guys that go a little bit in that direction. That's a fact of life,\" Trump Jr. said. \nHe asked voters to realize that his father hadn't \"spent his whole life\" being a politician. \n\"He hasn't spent his whole life polishing every statement he's ever made and every conversation he's ever had. He doesn't run a focus group so he can tell you what he's thinking. He speaks from the heart,\" Trump Jr. said, jabbing Clinton for differences in her public and private statements that he said came to light in the leaked emails from her chief of staff, John Podesta. \nOf the string of sexual misconduct allegations that have been waged against him, Trump Jr. said, \"Obviously, he's not happy\" about them. \nTrump Jr. said felt his father could still relate to \"ordinary Americans\" better on \"many cases\" than Hillary Clinton. a day ago Suspicious Substance Sent to Clinton Campaign HQ Deemed 'Non-Hazardous' \nOffices of Hillary Clinton's campaign headquarters in New York were evacuated on Friday evening after receiving a letter with a \"white powdered substance,\" according to officials. \nThe entire 11th floor was cleared around 5:30 p.m. ET after the unknown substance arrived in a business size envelope to Clinton's Brooklyn headquarters, the NYPD's Office of the Deputy Commissioner, Public Information (DCPI) told NBC News. \n\"Preliminary testing by federal and local officials has found the substance to be non-hazardous. The four individuals involved have reported no health issues and, following a full examination by medical personnel, were each released to go home,\" said Clinton spokesperson Glen Caplin. \"Our office remained open throughout this period and will remain open without interruption tomorrow morning .\" ", "external_links": [], "published": "2016-10-23T14:28:00.000+03:00", "crawled": "2016-10-23T12:05:04.175+03:00", "highlightTitle": ""}