{"organizations": [], "uuid": "e9984c91bae0dca269fa75a6ecb52ffa44f1c9c6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 119, "shares": 119, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nbcnews.com", "main_image": "http://media4.s-nbcnews.com/j/newscms/2016_42/1758191/161019-final-debate-trump-946p_cbc11bccfc9be3620a6a8bb2c0d68c26.nbcnews-fp-1200-800.jpg", "site_section": "", "section_title": "", "url": "http://www.nbcnews.com/news/latino/opinion-too-bad-trump-chose-bad-hombres-over-big-tent-n670306", "country": "US", "domain_rank": 478, "title": "Opinion: Too Bad Trump Chose 'Bad Hombres' Over 'Big Tent' - NBC News", "performance_score": 1, "site": "nbcnews.com", "participants_count": 0, "title_full": "Opinion: Too Bad Trump Chose 'Bad Hombres' Over 'Big Tent' - NBC News", "spam_score": 0.041, "site_type": "news", "published": "2016-10-21T08:00:00.000+03:00", "replies_count": 0, "uuid": "e9984c91bae0dca269fa75a6ecb52ffa44f1c9c6"}, "author": "Victoria Defrancesco Soto", "url": "http://www.nbcnews.com/news/latino/opinion-too-bad-trump-chose-bad-hombres-over-big-tent-n670306", "ord_in_thread": 0, "title": "Opinion: Too Bad Trump Chose 'Bad Hombres' Over 'Big Tent' - NBC News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "ignore", "persons": [], "text": "Defending Border Stance, Trump Adds, 'We Have Some Bad Hombres Here' 0:19 autoplay autoplay Copy this code to your website or blog <iframe src=\"http://www.nbcnews.com/widget/video-embed/789600323671\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen></iframe> \nDonald Trump has come full circle with his immigration rhetoric, but he did it by ditching the Republican Party strategy, which had undergone a 180-degree turnabout on the issue when it came to presidential elections. \nThe GOP and its 2016 nominee have parted ways on a number of issues, but perhaps none so sharply as immigration and outreach to Latinos. The basis for these differing strategies boils down to what it takes to win the presidency. \nEveryone can agree that elections are a numbers game. More votes equals a win, pretty plain and simple. But where it gets tricky is the path to that win. \nRELATED: Debate Was Short On Immigration, But #BadHombres Was Trending \nFor the last 15 or 20 years the Republican Party has recognized that they need to open up the partisan tent and bring in more voters. Until recently, one of the groups the GOP had been targeting was Latinos. \nIn the past, the diverse Hispanic electorate had proven friendly to Republican candidates. For example in 2004, George W. Bush won upwards of 40 percent of the Latino vote. \nIn 2013 on the heels of Mitt Romney's loss to President Obama, the GOP produced an autopsy report. In recounting what went wrong and setting out how to fix it, the main takeaway was essentially this: Don't insult and alienate Latinos — we need them! Republican presidential nominee Donald Trump gestures as he speaks during the third and final U.S. presidential debate at the Thomas &amp; Mack Center on Oct. 19, 2016 in Las Vegas, Nevada. Win McNamee / Getty Images \nBut enter Donald Trump, who took a completely different path to primary victory. Instead of broadening the Republican coalition, he subscribed to an alternate theory — bring back disenchanted white voters into the fold. Forget the big tent, just build a beautiful wall. \nThis idea was first laid out in 2013 by Real Clear Politics' Sean Trende . In \"The Case of the Missing White Voters, Revisited\" Trende summarizes his research that lays out how the GOP could win the presidency by boosting the numbers of white voters that have been in decline. \nRELATED: 'Game Over, Donald': Our Latino Panel Rates the Debate \nTrende points out how the most salient demographic change was in the number of white voters from 2008 to 2012. He walks through the data and then discusses who in particular these voters are, mainly rural, rust-belt whites. Coincidentally these seem to be the very same voters that Donald Trump has been appealing to since day 1. Democratic presidential nominee former Secretary of State Hillary Clinton (R) speaks as Republican presidential nominee Donald Trump looks on during the third U.S. presidential debate. Mark Ralston / Pool via Getty Images \nTrump took Trende's theory to heart. Rather than reach out to minorities he decided to double down on white voters. \nMore specifically, he implemented a divide-and-conquer strategy to win the presidency. Trump has drawn on the economic frustrations and worries of working-class whites and spun them toward the blaming of the \"other\" — especially immigrant Latinos. \nTrump's recipe for victory rested on low Latino turnout and anger-boosted white turnout. Or in Trump talk - he was hoping the bad hombres wouldn't turn out and the disenchanted white turnout would be huge, or \"yuuge.\" . \nThe election is not over yet. Until then we can't definitively say whether the \"big tent\" or the \"divide and conquer\" strategy was the best for the GOP. \nOne thing's more certain. Even in the off chance that the divide and conquer strategy wins this time around, the reality is that it's demographically unsustainable. \nNumbers don't lie and the demographic reality is that \"the\" Latinos are here to stay and only growing in size. You might as well get used to it and keep the open tent. \nFollow NBC News Latino on Facebook , Twitter and Instagram . Victoria DeFrancesco Soto ", "external_links": [], "published": "2016-10-21T08:00:00.000+03:00", "crawled": "2016-10-21T20:02:44.232+03:00", "highlightTitle": ""}