{"organizations": [], "uuid": "38aff2c061c4f30946c1a2e91cc952005464610b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 22, "shares": 22, "comments": 28}, "stumbledupon": {"shares": 0}}, "site_full": "www.buzzfeed.com", "main_image": "https://img.buzzfeed.com/buzzfeed-static/static/2016-09/19/19/campaign_images/buzzfeed-prod-fastlane01/trump-cites-bombings-in-renewing-calls-for-toughe-2-11465-1474329059-5_dblbig.jpg", "site_section": "http://www.buzzfeed.com/politics.xml", "section_title": "BuzzFeed - Politics", "url": "https://www.buzzfeed.com/adolfoflores/trump-cites-latest-attacks-in-renewing-calls-for-tougher-imm", "country": "US", "domain_rank": 137, "title": "Trump Cites Bombings In Renewing Calls For Tougher Immigration Controls", "performance_score": 0, "site": "buzzfeed.com", "participants_count": 1, "title_full": "Trump Cites Bombings In Renewing Calls For Tougher Immigration Controls", "spam_score": 0.0, "site_type": "news", "published": "2016-09-20T05:43:00.000+03:00", "replies_count": 0, "uuid": "38aff2c061c4f30946c1a2e91cc952005464610b"}, "author": "Adolfo Flores", "url": "https://www.buzzfeed.com/adolfoflores/trump-cites-latest-attacks-in-renewing-calls-for-tougher-imm", "ord_in_thread": 0, "title": "Trump Cites Bombings In Renewing Calls For Tougher Immigration Controls", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "negative"}, {"name": "joe raedle", "sentiment": "neutral"}, {"name": "imperato", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "adolfo flores", "sentiment": "none"}, {"name": "obama", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "clinton", "sentiment": "none"}, {"name": "ahmad khan rahami", "sentiment": "none"}, {"name": "bob mercier", "sentiment": "none"}, {"name": "kumbaya", "sentiment": "none"}, {"name": "poole", "sentiment": "none"}, {"name": "patricia poole", "sentiment": "none"}, {"name": "leticia miranda", "sentiment": "none"}, {"name": "andrea imperato", "sentiment": "none"}, {"name": "rahami", "sentiment": "none"}], "locations": [{"name": "fl", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "sarasota", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "fort myers", "sentiment": "none"}, {"name": "punta gorda", "sentiment": "none"}, {"name": "afghanistan", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "germain arena", "sentiment": "none"}, {"name": "new jersey", "sentiment": "none"}, {"name": "los angeles", "sentiment": "none"}, {"name": "middle east", "sentiment": "none"}], "organizations": [{"name": "trump", "sentiment": "negative"}, {"name": "republican", "sentiment": "none"}, {"name": "buzzfeed news", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Donald Trump speaks in Florida on Monday. Joe Raedle / Getty Images ID: 9645076 \nFort Myers, FL — Donald Trump on Monday renewed his calls for curbing immigration from countries where “safe and adequate screening cannot occur,” citing recent bombings in New York and New Jersey as proof that the government wasn’t doing enough to keep Americans safe. \nIn his speech at Fort Myers, Florida, Trump said Hillary Clinton would allow more refugees in, putting the United States at greater risk of even more homegrown terror attacks. \n“We should temporarily suspend immigration entering from regions where safe and adequate screening cannot occur,” Trump said. “We want people to come into our country but they have to come legally, through a process, and we need extreme screening.” Joe Raedle / Getty Images ID: 9645082 \nIf potential immigrants aren’t able to be screened, then they shouldn’t be allowed into the US, Trump added. \n“This isn’t just a matter of terrorism, this is really a question of quality of life,” Trump said. “We want to make sure we’re only admitting people into our country who love our country, we want them to love our country, and we want them to love our people.” \nThe Republican nominee also mentioned the suspect in Saturday’s bombings in New York and New Jersey, calling Ahmad Khan Rahami — a US citizen who was born in Afghanistan — an “evil thug.” \nAnd while he congratulated law enforcement for catching him, Trump lamented that the “bad part now” is Rahami, who was injured in a shootout, will get top notch medical care and likely be represented by an “outstanding lawyer.” \n“He’ll probably even have room service, knowing the way our country is,” Trump said. \nTrump also criticized Clinton and President Obama for refusing to say “radical Islamic terrorism.” \n“We will not defeat it with closed eyes or silent voices,” Trump said. “Anyone who cannot name our enemy is not fit to lead this country.” \nAn applicant’s ideology must be considered when deciding whether or not they should be allowed to immigrate to the US, Trump said, adding that Clinton would refuse to consider someone’s world view. \n“In the 20th century the US defeated fascism, nazism, and communism,” Trump said. “Now we must defeat radical terrorism.” Joe Raedle / Getty Images ID: 9645141 \nTrump also read the lyrics of “The Snake,” a song about a woman who takes in a weak snake and is later killed by its poisonous bite. He used the song to show the dangers of allowing Syrian and other immigrants into the US, saying it will lead to homegrown terror attacks and be worse than the Trojan Horse. \n“People are coming across our borders, people are coming into our country and we are going to make the Trojan Horse something that is unimportant,” Trump said. “This has to do with people coming into our country.” Leticia Miranda/BuzzFeed News ID: 9645483 \nTrump’s plan to crack down on immigration from certain regions of the world was met with roaring support by members of the crowd at the Germain Arena. \nBob Mercier, a 75-year-old from Punta Gorda, Florida, told BuzzFeed News that Trump has “got the right ideas.” \n“I do think the idea of vetting people coming in from areas where there is potential danger or an ideology that is against our beliefs in America is right,” he said. “It should help. Open borders is not the right answer, especially when we have enemies coming across the border.” Patricia Poole and Andrea Imperato. Leticia Miranda/BuzzFeed News ID: 9645523 \nAndrea Imperato, 57, from Sarasota told BuzzFeed News she is frustrated with immigration approach of Clinton and Obama “to sing Kumbaya and let more in,” while refusing to “not call it a bomb” and “not call it islamic extremist terrorism.” \n“I mean it makes no sense,” she said. “How do you defeat it, how do you address it if you can’t call it what it is? It doesn’t mean all Muslims are bad. It doesn’t mean followers of Islam are bad. It means the extremists who want to kill us are bad. Why can’t we call it what it is and deal with those people accordingly and keep the majority safe?” \nPatricia Poole, 57, also of Sarasota, said the country is “just tolerating.” \n“I don’t mean to sound that way,” she said. “We’re very tolerable people. But every generation is like, ‘This is happening on our soil and what do we do now?’ And everyone is numb.” \nBoth Imperato and Poole said that they are concerned about some immigrants and refugees from the Middle East who do not adopt American customs and continue with certain “cultural” practices. \n“We’re all immigrants,” said Imperato. “They came here because they wanted a better life. They believe in America. You still keep your roots, you still have your customs, but you’re not here to blow up people who don’t believe in what you believe in, or to kill your own because your wife disgraced you or your daughter disgraced you so you slit her throat. We’re a civilized country and we just don’t do that.” \n“It’s a culture,” Poole added. “I don’t mean everyone is that way, but it’s accepted in their country. You know, but this is our country. Come and live our ways. Enjoy our life. Don’t bring us harm.” Adolfo Flores is a reporter for BuzzFeed News and is based in Los Angeles. Contact Adolfo Flores at . Leticia Miranda is a consumer affairs reporter for BuzzFeed News and is based in New York. Contact Leticia Miranda at .", "external_links": [], "published": "2016-09-20T05:43:00.000+03:00", "crawled": "2016-09-20T13:47:10.499+03:00", "highlightTitle": ""}