{"organizations": [], "uuid": "5db8053926c6ac2839345244090361847ff192d8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 2, "shares": 2, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "latino.foxnews.com", "main_image": "http://global.fncstatic.com/static/v/all/img/fn_latino_128x128.png", "site_section": "http://feeds.latino.foxnews.com/home/feed", "section_title": "FOX News", "url": "http://latino.foxnews.com/latino/news/2016/09/19/dulce-matuz-from-undocumented-dreamer-to-us-citizen/", "country": "US", "domain_rank": 185, "title": "Dulce Matuz: From undocumented Dreamer to U.S. citizen", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "Dulce Matuz: From undocumented Dreamer to U.S. citizen | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2016-09-19T03:00:00.000+03:00", "replies_count": 0, "uuid": "5db8053926c6ac2839345244090361847ff192d8"}, "author": "EFE", "url": "http://latino.foxnews.com/latino/news/2016/09/19/dulce-matuz-from-undocumented-dreamer-to-us-citizen/", "ord_in_thread": 0, "title": "Dulce Matuz: From undocumented Dreamer to U.S. citizen", "locations": [], "entities": {"persons": [{"name": "dulce matuz", "sentiment": "negative"}, {"name": "barack obama", "sentiment": "none"}, {"name": "matuz", "sentiment": "none"}, {"name": "jan brewer", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "phoenix", "sentiment": "none"}, {"name": "sonora", "sentiment": "none"}, {"name": "arizona", "sentiment": "none"}], "organizations": [{"name": "arizona dream act coalition", "sentiment": "none"}, {"name": "time", "sentiment": "none"}, {"name": "trevor browne high school", "sentiment": "none"}, {"name": "time magazine", "sentiment": "none"}, {"name": "arizona state university", "sentiment": "none"}, {"name": "efe", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "  Phoenix –   Activist and \"Dreamer\" Dulce Matuz, who in 2012 was recognized as one of the world's most influential people by Time magazine, on Monday achieved one of her greatest desires by becoming a U.S. citizen.\nThis is a very significant day, she said, noting that she had been in this country without documents for 12 years and, at first, she didn't understand what that meant. But, over time, she realized that her efforts were worth nothing if she didn't have a Social Security Number, since without that, she couldn't achieve many of her goals, Matuz told EFE.\nBorn in the Mexican state of Sonora, Matuz came to this country when she was just 15 with the aim of reuniting with her mother.\nFacing many obstacles due to her immigration status, Matuz managed to finish high school and continue her college studies, eventually graduating with a degree in electronic engineering from Arizona State University.\nIt was during her university years that she experienced firsthand the true significance of \"not having papers\" and how doors closed and opportunities were denied to undocumented people despite their desire to get ahead and the efforts they made in their studies and careers.\nIn 2007, Arizona approved the controversial State Law 300, which denied undocumented students the possibility of paying for public university or college studies as state residents.\nIn 2009, Matuz began to get involved in the struggle, after noticing the unfair aspects of the system, she said.\nShe co-founded the Arizona Dream Act Coalition and for years was a \"regular face\" at marches, protests and events promoting the Dream Act, Dreamers and the immigrant community in Arizona, fighting hard to prevent the legislation from being approved at the national level.\nHer work in Arizona was recognized in April 2012 when Time listed her as one of the world's most influential people, sharing the honor with leaders and other well-known people such as President Barack Obama.\nMatuz also was one of the group of Dreamers who filed a lawsuit against the state of Arizona when in 2012 then-Gov. Jan Brewer signed an executive order denying driver's licenses to young people protected under the DACA program.\nAfter a long legal struggle, a federal judge finally ruled in favor of the Dreamers in December 2014 and allowed them to obtain driver's licenses.\nOn Monday, the activist was in a group of approximately 140 people from more than 130 countries who took the citizenship oath at a ceremony held in the Trevor Browne High School auditorium in Phoenix.\nMinutes after becoming a citizen, Matuz registered to vote, a process that she completed along with her mother.\nMatuz - who is now married to a U.S. citizen and is the owner of her own real estate company - said she was just practicing what she's been preaching: that everyone who can should register to vote.", "external_links": [], "published": "2016-09-19T03:00:00.000+03:00", "crawled": "2016-09-20T01:33:03.356+03:00", "highlightTitle": ""}