{"organizations": [], "uuid": "53039f29fff01c3ad9eca99f5770ef925b8d6741", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "latino.foxnews.com", "main_image": "http://global.fncstatic.com/static/v/all/img/fn_latino_128x128.png", "site_section": "http://feeds.latino.foxnews.com/home/feed", "section_title": "FOX News", "url": "http://latino.foxnews.com/latino/politics/2016/09/19/survey-shows-latinos-still-ignored-in-us-elections/", "country": "US", "domain_rank": 185, "title": "Survey shows Latinos still ignored in U.S. elections | Fox News Latino", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "Survey shows Latinos still ignored in U.S. elections | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2016-09-19T03:00:00.000+03:00", "replies_count": 0, "uuid": "53039f29fff01c3ad9eca99f5770ef925b8d6741"}, "author": "EFE", "url": "http://latino.foxnews.com/latino/politics/2016/09/19/survey-shows-latinos-still-ignored-in-us-elections/", "ord_in_thread": 0, "title": "Survey shows Latinos still ignored in U.S. elections | Fox News Latino", "locations": [], "entities": {"persons": [{"name": "clinton", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "vargas", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "arturo vargas", "sentiment": "none"}, {"name": "obama", "sentiment": "none"}], "locations": [{"name": "washington", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}, {"name": "pennsylvania", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}, {"name": "nevada", "sentiment": "none"}], "organizations": [{"name": "efe", "sentiment": "negative"}, {"name": "senate", "sentiment": "none"}, {"name": "national association of latino elected", "sentiment": "none"}, {"name": "naleo", "sentiment": "none"}, {"name": "house of representatives", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Published September 19, 2016 EFE Washington –   Despite being a key factor in the 2012 elections, the majority of Latino voters continue to be ignored during this year's presidential election in the United States, and the candidates' messages fail to reflect the major concerns of this continuously expanding community, according to a survey published Monday.\nThe National Association of Latino Elected and Appointed Officials, or NALEO, released an opinion poll of Latino voters that it promises to update every week until the general elections on Nov. 8 in the United States, and which highlights the failures of the political parties' communication strategies in getting out the Hispanic vote.\nOn Nov. 8 Americans will choose between Democrat Hillary Clinton and Republican Donald Trump as their president, while electing all members of the House of Representatives and a third of the Senate.\nAccording to this first study, more than 60 percent of Latinos have never been contacted by any campaign, mainly due to the fact that most Hispanic voters do not live in swing states that could go either way, Democratic or Republican, in a presidential election.\nThe survey taken by NALEO between Sept. 12-17 indicates that political campaigns continue to focus on immigration, while Hispanics consider jobs, wages, health and terrorism to be subjects of equal importance.\n\"Politicians only talk about Hispanic concerns every four years. There's no long-term view about winning the Latino community,\" the executive director of NALEO, Arturo Vargas, told EFE in an interview.\nThe poll shows that Latinos have a better opinion of Clinton than of Trump, whose comments about immigrants are considered \"racist\" by 72 percent of Latino voters, while only 30 percent have a favorable view of the New York magnate moving into the White House.\nIn comparison, 72 percent say that Clinton has the necessary experience to be president, though they do not completely trust her.\nConclusions of the NALEO survey coincide with the concerns of other experts about the candidates' lack of empathy with Latinos in this electoral year, particularly among Democrats, who could lose the ground they won during the Obama presidency, supported by 71 percent of Hispanic voters.\n\"The electoral system in this country makes candidates focus mostly on three or four states, like Florida, Nevada and Pennsylvania, but they forget to address Hispanics in the states where they have the biggest populations - Texas, California and New York,\" Vargas said.\nFor that reason he believes Hispanics might not feel sufficiently motivated to go to the polls on Nov. 8.\nBut despite everything, a record number of 13 million Hispanics are expected to take part in the electoral process this year, due to a demographic growth so great that its level of participation could possibly remain at the same percentage as in 2012.\nAccording to a study published this month by the pro-immigrant organization Latino Decisions, Trump is on his way to garnering the least support among Hispanics in the history of Republican candidacies, though the Democrats do not seem likely to capitalize on that discontent in the legislative elections.", "external_links": [], "published": "2016-09-19T03:00:00.000+03:00", "crawled": "2016-09-20T00:55:24.874+03:00", "highlightTitle": ""}