{"organizations": [], "uuid": "6f0afd51a7c6dc2564e0e25593fcf88aa19f051f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 21, "shares": 21, "comments": 8}, "stumbledupon": {"shares": 0}}, "site_full": "www.buzzfeed.com", "main_image": "https://img.buzzfeed.com/buzzfeed-static/static/2016-09/15/22/campaign_images/buzzfeed-prod-web10/clinton-turns-back-the-focus-to-charges-of-trump--2-21813-1473991304-2_dblbig.jpg", "site_section": "http://www.buzzfeed.com/politics.xml", "section_title": "BuzzFeed - Politics", "url": "https://www.buzzfeed.com/adriancarrasquillo/clinton-turns-back-the-focus-to-charges-of-trump-racism-in-s", "country": "US", "domain_rank": 137, "title": "Clinton Turns Back The Focus To Charges Of Trump Racism In Speech To Latinos", "performance_score": 0, "site": "buzzfeed.com", "participants_count": 1, "title_full": "Clinton Turns Back The Focus To Charges Of Trump Racism In Speech To Latinos", "spam_score": 0.0, "site_type": "news", "published": "2016-09-16T09:48:00.000+03:00", "replies_count": 0, "uuid": "6f0afd51a7c6dc2564e0e25593fcf88aa19f051f"}, "author": "Adrian Carrasquillo", "url": "https://www.buzzfeed.com/adriancarrasquillo/clinton-turns-back-the-focus-to-charges-of-trump-racism-in-s", "ord_in_thread": 0, "title": "Clinton Turns Back The Focus To Charges Of Trump Racism In Speech To Latinos", "locations": [], "entities": {"persons": [{"name": "hillary clinton", "sentiment": "negative"}, {"name": "justin sullivan", "sentiment": "negative"}, {"name": "clinton", "sentiment": "negative"}, {"name": "roberto clemente", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "dolores huerta", "sentiment": "none"}, {"name": "cesar chavez", "sentiment": "none"}, {"name": "laurie hernandez", "sentiment": "none"}, {"name": "obama", "sentiment": "none"}, {"name": "lin-manuel miranda", "sentiment": "none"}, {"name": "timmons", "sentiment": "none"}, {"name": "jose andres", "sentiment": "none"}, {"name": "soñia sotomayor", "sentiment": "none"}, {"name": "adrian carrasquillo", "sentiment": "none"}, {"name": "faith green timmons", "sentiment": "none"}], "locations": [{"name": "washington", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "focus to charges of trump", "sentiment": "negative"}, {"name": "chci", "sentiment": "none"}, {"name": "msnbc", "sentiment": "none"}, {"name": "bethel united methodist church", "sentiment": "none"}, {"name": "buzzfeed news", "sentiment": "none"}, {"name": "congressional hispanic caucus institute", "sentiment": "none"}, {"name": "trump university", "sentiment": "none"}, {"name": "hispanic heritage month", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Justin Sullivan / Getty Images ID: 9628336 \nWASHINGTON — Hillary Clinton framed the election as a high-stakes choice for Latino voters, highlighting the contributions of Hispanics in the U.S. and contrasting her vision for the community with Donald Trump’s, in a speech to the Congressional Hispanic Caucus Institute on Thursday. \nClinton argued that she would be better for the economy and embrace the country’s diversity, making reference not just to Trump but also a supporter who went on MSNBC to warn of the influence of Latinos. \nShe criticized the “outlandish and offensive comments we have heard from my opponent and his supporters,” adding “I personally think a taco truck on every corner sounds absolutely delicious.” \nAfter a week where questions about her health dominated the campaign due to a high-profile bout with pneumonia, Clinton sought to put the focus back on charges of racism that have hurt Trump with moderate and suburban white voters. \nShe blasted Trump for “the racist lie that launched his campaign” about rapists crossing the border from Mexico “to the racist attack on a federal judge” when Trump attacked the Mexican-American judge overseeing the case against Trump University. \nBut she also aimed to remind voters that Trump hadn’t changed, bringing up his awkward interaction with Rev. Faith Green Timmons of the Bethel United Methodist Church, when Timmons told Trump not to be political and attack Clinton from the pulpit. Trump responded by saying “something was up” with the “nervous” and “shaking” reverend. \nClinton’s speech recalled Obama’s 2014 CHCI address, also before a crucial election when immigration was front and center. \nAt the time, an embattled Obama was under siege by immigration activists angry over the delay of executive actions to shield undocumented people from deportation. \nHe challenged Latinos in the audience then not just to vote in November, but to also support post-election efforts to explain the importance of immigration. \nThis year, Clinton said she hopes to inspire a high-level of turnout from Latinos that are under 35. “We need you,” she said, during a week when Democrats have fretted that young Latinos may not be excited by her candidacy. \nDuring his speech this year a relaxed Obama made jokes, reusing his line on the trail of “Thanks Obama” because of the accomplishments during his administration. He invoked Trump without using his name, saying the country must reject the politics of “bluster” and “higher walls” and said sensible immigration changes can be made that honor that the U.S. is a country of immigrants but also of laws. \nImmigrants, he said, arrive “not as criminals, not as rapists, but as families who came here for the same reasons all families came here for,” in another reference to Trump. \nClinton, who was protested by activists over accepting private prison donations, while presenting an award to chef Jose Andres at CHCI in 2015, saw no such opposition this year from the supportive crowd. She reiterated her support for immigration legislation in her first 100 days if elected and said other people with sympathetic cases should be able to make their case for deferred action as well. \nBeneficiaries should include those who have experienced and report extreme labor abuses, Clinton said, and stressed her plan to “end family detention, close private detention facilities, and stop the raids and round ups.” \nBut in a nod to the first day of Hispanic Heritage Month, Clinton also mentioned Latinos that have contributed to the country to cheers — those in history books like Cesar Chavez, Dolores Huerta and Roberto Clemente, as well as more recent notable Latinos like Soñia Sotomayor, Lin-Manuel Miranda and Laurie Hernandez. Adrian Carrasquillo is a political reporter for BuzzFeed News and is based in New York. Contact Adrian Carrasquillo at .", "external_links": [], "published": "2016-09-16T09:48:00.000+03:00", "crawled": "2016-09-16T09:05:42.069+03:00", "highlightTitle": ""}