{"organizations": [], "uuid": "58838c073d57eaf9f28b3c49ea3fa87a2a7f539c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 13, "shares": 13, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/news/0/0/Latino%20polls%20under%20Asian.jpg", "site_section": "http://feeds.latino.foxnews.com/home/feed", "section_title": "FOX News", "url": "http://latino.foxnews.com/latino/news/2016/09/10/latino-population-now-behind-asian-americans-study-says/", "country": "US", "domain_rank": 185, "title": "Latino population now behind Asian study says", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "Latino population now behind Asian Americans study says | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2016-09-10T03:00:00.000+03:00", "replies_count": 0, "uuid": "58838c073d57eaf9f28b3c49ea3fa87a2a7f539c"}, "author": "Fox News Latino", "url": "http://latino.foxnews.com/latino/news/2016/09/10/latino-population-now-behind-asian-americans-study-says/", "ord_in_thread": 0, "title": "Latino population now behind Asian study says", "locations": [], "entities": {"persons": [{"name": "el segundo", "sentiment": "negative"}, {"name": "frey", "sentiment": "none"}, {"name": "johnson", "sentiment": "none"}, {"name": "william h. frey", "sentiment": "none"}, {"name": "kenneth m. johnson", "sentiment": "none"}, {"name": "franco", "sentiment": "none"}, {"name": "mauricio castro", "sentiment": "none"}, {"name": "rogelio franco", "sentiment": "none"}], "locations": [{"name": "united states", "sentiment": "none"}, {"name": "luzerne county", "sentiment": "none"}, {"name": "duchesne county", "sentiment": "none"}, {"name": "south carolina", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}, {"name": "new mexico", "sentiment": "none"}, {"name": "south", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "el paso", "sentiment": "none"}, {"name": "north dakota", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "beadle county", "sentiment": "none"}, {"name": "burleigh county", "sentiment": "none"}, {"name": "north carolina", "sentiment": "none"}, {"name": "tennessee", "sentiment": "none"}, {"name": "utah", "sentiment": "none"}, {"name": "colorado", "sentiment": "none"}, {"name": "pennsylvania", "sentiment": "none"}, {"name": "salt lake city", "sentiment": "none"}, {"name": "south dakota", "sentiment": "none"}], "organizations": [{"name": "pew research center", "sentiment": "none"}, {"name": "u.s. census bureau", "sentiment": "none"}, {"name": "brookings institution", "sentiment": "none"}, {"name": "ap photo/russell contreras", "sentiment": "none"}, {"name": "north carolina congress of latino organizations", "sentiment": "none"}, {"name": "university of new hampshire", "sentiment": "none"}, {"name": "carsey school of public policy", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "  Jan. 5, 2016 file photo, students walk home from school in the largest Mexican-American El Segundo Barrio in El Paso, Texas. The population growth of U.S. Latinos is slowing thanks to lower immigration and declining birthrates, although states like North Dakota and Tennessee are seeing Latino population spikes, according to a Pew Research Center study released Thursday, Sept. 8, 2016. (AP Photo/Russell Contreras,   This material may not be published, broadcast, rewritten or redistribu \nThe growth of the U.S. Latino population — once the nation's fastest growing — slowed considerably over the past seven years and slipped behind that of Asian Americans amid declining Hispanic immigration and birth rates, a study released Thursday found.\nThe Pew Research Center study, which analyzed U.S. Census Bureau data, found that the U.S. Hispanic population grew annually on average by 2.8 percent between 2007 and 2014.\nThat's down from the 4.4 percent annual growth from 2000 to 2007, before the Great Recession.\nBy comparison, the Asian American population grew around 3.4 percent on average annually during the same period.\nWilliam H. Frey, a demographer with the Brookings Institution's Metropolitan Policy Program, the slower growth is largely a factor of the economy. A slower economy is influencing families to hold off on having more children, and it's discouraging migration amid stronger border enforcement, he said.\nKenneth M. Johnson, a senior demographer at the University of New Hampshire's Carsey School of Public Policy, said U.S. Hispanic women between the ages of 20 to 24 have seen a 36 percent decline in birth rates.\n\"That's by far the largest decline of any other group,\" Johnson said.\nDespite slowing population growth, Latinos still accounted for 54 percent of the nation's population growth between 2000 and 2014, according to the nonpartisan Pew Research Center.\nRegional growth patterns also have changed some following the economic downturn of 2007 reflecting the changing economies of states, the study found.\nCounties in the South continued to account for the largest share of the nation's Hispanic population growth — 43 percent between 2007 and 2014. Among the other fastest-growing counties for Latinos were Luzerne County in Pennsylvania, Beadle County in South Dakota, Duchesne County in Utah and Burleigh County in North Dakota.\n\"Latinos are coming to Utah because the government here is doing a lot to create jobs,\" said Rogelio Franco of Entre Latinos, a Salt Lake City, Utah advocacy group that works to integrate Hispanics into the state. Entre Latinos was not affiliated with the study.\nFranco said he thinks the declining birth rate is a result of Latino millennials holding off on having children while pursuing their education.\n\"They are planning more,\" Franco said. \"They are focusing on other things.\"\nThe growth in North Dakota's statewide Latino population nearly doubled to 18,000, making it the state with the highest Hispanic growth rate over seven years. Though small in numbers compared to states like California and Texas, the rise in Latino residents has put pressures on local governments and nonprofits to accommodate the new residents.\nFor example, in 2014 Catholic nuns from Mexico were sent to North Dakota to help serve new Hispanic parishioners in that state.\nNorth Dakota had experienced an oil boom until recently, attracting workers from around the country. It remains one of the least diverse states in the country.\n\"Latino population growth has become less concentrated in counties with historically large Latino populations and whose Latino population grew by at least 10,000,\" the study's authors wrote.\nThough the growth has slowed in the last seven years, the Latino population in the South has exploded when examined over 14 years.\nFrom 2000 to 2014, Latino populations in Tennessee and South Carolina, for example, nearly tripled.\nNorth Carolina also saw its population spike 136 percent since 2000, the report said.\nMauricio Castro, an organizer with the North Carolina Congress of Latino Organizations, said Latino immigrants coming to the region tend to work in the construction or service industry.\nStill, between 2007 and 2014, nearly 40 counties experienced declines in the percentage of Latinos. Most of those counties were in Colorado, New Mexico and Texas — states with traditionally large Hispanic populations.\nFrey said once the U.S. economy starts picking up, he expects to see a return of higher rates of immigration and increase births.\n\"This is not the end of Latino growth in the United States by any means,\" Frey said.\nLike  ", "external_links": [], "published": "2016-09-10T03:00:00.000+03:00", "crawled": "2016-09-10T20:22:09.190+03:00", "highlightTitle": ""}