{"organizations": [], "uuid": "c4d6b7ac7f2a727b07c3802b673fa4b51e170d9c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "nvs24.com", "main_image": "", "site_section": "http://nvs24.com/rss.xml", "section_title": "NVS24 News Network", "url": "http://nvs24.com/news/topstories/Obama-Vows-to-Take-In-More-Refugees-Amid-Intense-Debate-8418407.html", "country": "US", "title": "Obama Vows to Take In More Refugees Amid Intense Debate", "performance_score": 0, "site": "nvs24.com", "participants_count": 0, "title_full": "Obama Vows to Take In More Refugees Amid Intense Debate", "spam_score": 0.0, "site_type": "news", "published": "2016-09-14T15:37:00.000+03:00", "replies_count": 0, "uuid": "c4d6b7ac7f2a727b07c3802b673fa4b51e170d9c"}, "author": "", "url": "http://nvs24.com/news/topstories/Obama-Vows-to-Take-In-More-Refugees-Amid-Intense-Debate-8418407.html", "ord_in_thread": 0, "title": "Obama Vows to Take In More Refugees Amid Intense Debate", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  Obama Vows to Take In More Refugees Amid Intense Debate  37 The Obama administration is pressing ahead with plans to boost the number of refugees it will allow into the U.S. as a national debate rages over immigration and security. The increase to 110,000 represents a more than 57 percent jump since 2015 \"and is consistent with our belief that all countries should do more to help the world's most vulnerable people,\" a State Department official told NBC News. Of the 110,000 the U.S. intends to begin admitting, at least 40,000 are from the Near East and South Asia, a White House senior administration official said. And most of those are likely to be people escaping the brutal Syrian civil war, even as many GOP lawmakers and Republican presidential nominee Donald Trump sound the alarm about terrorists in the midst of the refugees. Secretary of State John Kerry, along with Homeland Security and Health and Human Services officials, briefed members of the House and Senate Judiciary Committees during a closed briefing on Tuesday, officials. \"As the Secretary has said, this is who we are; this is America at its best,\" the State Department official said. Trump and many in his party have fomented fears that there could be Islamic terrorists in their midst — and who have called for a total ban on Syrian refugees. Last year, lawmakers in the Republican-controlled Senate tried to pass legislation, sponsored by two GOP presidential candidates, to block or curtail benefits for Syrian refugees seeking to enter the U.S. The measures failed. Last year, the Republican-controlled House easily passed tough... Source: http://nbcnews.com Read more... \nSource: http://nbcnews.com", "external_links": [], "published": "2016-09-14T15:37:00.000+03:00", "crawled": "2016-09-14T20:12:36.284+03:00", "highlightTitle": ""}