{"organizations": [], "uuid": "857fe873597eb6ac9457bd8a7217e4f20bbdd120", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "latino.foxnews.com", "main_image": "http://global.fncstatic.com/static/v/all/img/fn_latino_128x128.png", "site_section": "http://feeds.latino.foxnews.com/home/feed", "section_title": "FOX News", "url": "http://latino.foxnews.com/latino/news/2016/09/19/trump-says-bombings-in-us-this-is-only-going-to-get-worse/", "country": "US", "domain_rank": 185, "title": "Trump says of bombings in U.S.: \"This is only going to get worse\"", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "Trump says of bombings in U.S.: \"This is only going to get worse\" | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2016-09-19T03:00:00.000+03:00", "replies_count": 0, "uuid": "857fe873597eb6ac9457bd8a7217e4f20bbdd120"}, "author": "EFE", "url": "http://latino.foxnews.com/latino/news/2016/09/19/trump-says-bombings-in-us-this-is-only-going-to-get-worse/", "ord_in_thread": 0, "title": "Trump says of bombings in U.S.: \"This is only going to get worse\"", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "negative"}, {"name": "trump", "sentiment": "negative"}, {"name": "clinton", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "ahmad khan rahami", "sentiment": "none"}, {"name": "dahis adan", "sentiment": "none"}, {"name": "andrew cuomo", "sentiment": "none"}, {"name": "adan", "sentiment": "none"}], "locations": [{"name": "washington", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "chelsea", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "minnesota", "sentiment": "none"}, {"name": "seaside park", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "white plains", "sentiment": "none"}, {"name": "afghanistan", "sentiment": "none"}, {"name": "new jersey", "sentiment": "none"}, {"name": "elizabeth", "sentiment": "none"}], "organizations": [{"name": "efe", "sentiment": "negative"}, {"name": "white house", "sentiment": "none"}, {"name": "fox", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "  EFE Washington –   Republican presidential candidate Donald Trump said Monday about the presumed jihadist attacks this weekend in the United States that \"this is only going to get worse.\"\n\"I think this is something that will maybe get - will happen perhaps more and more all over the country,\" the conservative candidate for the White House said on the Fox television channel.\nThe real estate mogul was commenting on the planting of several bombs in New York and in the neighboring state of New Jersey over the past few days, as well as the explosion of another device and a knife attack by a suspected jihadist in a Minnesota shopping mall that left nine people wounded over the weekend.\n\"It's a mess, and it's a shame, and we're going to have to be very tough...this is only going to get worse,\" the candidate said.\nDemocratic presidential candidate Hillary Clinton also said in an improvised press conference at the airport in White Plains, New York, that the terrorist threat \"is real,\" but added that \"so is our resolve\" as Americans to deal with it.\n\"Americans will not cower, we will prevail,\" said Clinton, adding that \"if you see something, or you hear something, report it immediately to local law enforcement authorities,\" and promised that \"we will not turn on each other or undermine our values. We'll stand together because we are stronger together in the face of this threat and every other challenge.\"\nTrump meanwhile referred to the possible \"foreign connection\" to these attacks, of which New York Gov. Andrew Cuomo had spoken shortly before, and said he believes that could well be true due to the number of people infiltrating the U.S. that could carry out these bombings.\n\"We're allowing these people to come into our country and destroy our country, and make it unsafe for people,\" said Trump, who used the incidents to insist on the need to be tougher on immigration.\nClinton, for her part, reminded everyone that \"there are millions and millions of naturalized citizens in America from all over the world...so let's not get diverted and distracted by the kind of campaign rhetoric we hear coming from the other side.\"\nU.S. authorities have taken into custody a person identified as Ahmad Khan Rahami, born in Afghanistan and nationalized a U.S. citizen, suspected of planting the bombs last weekend in New York, while the knife-wielding criminal in a Minnesota shopping mall has been identified by his family as Dahis Adan, a Somali immigrant.\nIn the Minnesota attack, nine people were stabbed by Adan Saturday night with a kitchen knife, while another 29 people were wounded that same night when a bomb went off in New York's Chelsea neighborhood, after which another homemade bomb, a pressure cooker full of explosives, was found nearby.\nThen this Monday before dawn another bomb went off in the town of Elizabeth, New Jersey, while being inspected by a police robot, and early Saturday another device exploded at Seaside Park, New Jersey, but left neither victims nor material damage.", "external_links": [], "published": "2016-09-19T03:00:00.000+03:00", "crawled": "2016-09-19T21:40:44.901+03:00", "highlightTitle": ""}