{"organizations": [], "uuid": "57ad828312143445185e0f6689e1bc018fc3423e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/694940094001_5114941332001_7d31d0a2-485c-44db-8e4f-101bd503343f.jpg", "site_section": "http://www.foxnews.com/hannity/", "section_title": "Hannity | Sean Hannity | Fox News", "url": "http://www.foxnews.com/transcript/2016/09/06/newt-gingrich-on-why-polls-are-tightening-in-2016-race-julian-assange-hillary/", "country": "IT", "domain_rank": 185, "title": "Newt Gingrich on why polls are tightening in the 2016 race; Julian Assange: Hillary Clinton is lying about not knowing what a 'C' is", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "Newt Gingrich on why polls are tightening in the 2016 race; Julian Assange: Hillary Clinton is lying about not knowing what a 'C' is | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2016-09-06T03:00:00.000+03:00", "replies_count": 0, "uuid": "57ad828312143445185e0f6689e1bc018fc3423e"}, "author": "FoxNews.com", "url": "http://www.foxnews.com/transcript/2016/09/06/newt-gingrich-on-why-polls-are-tightening-in-2016-race-julian-assange-hillary/", "ord_in_thread": 0, "title": "Newt Gingrich on why polls are tightening in the 2016 race; Julian Assange: Hillary Clinton is lying about not knowing what a 'C' is", "locations": [], "entities": {"persons": [{"name": "hillary clinton", "sentiment": "neutral"}, {"name": "julian assange", "sentiment": "neutral"}, {"name": "sean hannity", "sentiment": "neutral"}, {"name": "newt gingrich", "sentiment": "neutral"}, {"name": "herman", "sentiment": "none"}, {"name": "jeb bush", "sentiment": "none"}, {"name": "colin kaepernick", "sentiment": "none"}, {"name": "tim kaine", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "bill clinton", "sentiment": "none"}, {"name": "ron johnson", "sentiment": "none"}, {"name": "darrell scott", "sentiment": "none"}, {"name": "john kerry", "sentiment": "none"}, {"name": "larry", "sentiment": "none"}, {"name": "jackson", "sentiment": "none"}, {"name": "ingraham", "sentiment": "none"}, {"name": "david clarke", "sentiment": "none"}, {"name": "ben carson", "sentiment": "none"}, {"name": "doug schoen", "sentiment": "none"}, {"name": "chuck grassley", "sentiment": "none"}, {"name": "p. diddy", "sentiment": "none"}, {"name": "laura", "sentiment": "none"}, {"name": "scott", "sentiment": "none"}, {"name": "halperin", "sentiment": "none"}, {"name": "rob", "sentiment": "none"}, {"name": "comey", "sentiment": "none"}, {"name": "al gore", "sentiment": "none"}, {"name": "rob portman", "sentiment": "none"}, {"name": "cain", "sentiment": "none"}, {"name": "mark halperin", "sentiment": "none"}, {"name": "obama", "sentiment": "none"}, {"name": "clinton", "sentiment": "none"}, {"name": "schoen", "sentiment": "none"}, {"name": "giuliani", "sentiment": "none"}, {"name": "assange", "sentiment": "none"}, {"name": "doug schoen", "sentiment": "none"}, {"name": "hillary", "sentiment": "none"}, {"name": "ed henry", "sentiment": "none"}, {"name": "trey gowdy", "sentiment": "none"}, {"name": "martha stewart", "sentiment": "none"}, {"name": "herman cain", "sentiment": "none"}, {"name": "dick cheney", "sentiment": "none"}, {"name": "mark halperin", "sentiment": "none"}, {"name": "david bossie", "sentiment": "none"}, {"name": "darrell scott", "sentiment": "none"}, {"name": "hannity", "sentiment": "none"}, {"name": "jesse jackson", "sentiment": "none"}, {"name": "angela merkel", "sentiment": "none"}, {"name": "clarke", "sentiment": "none"}, {"name": "laura ingraham", "sentiment": "none"}, {"name": "jesse jackson", "sentiment": "none"}, {"name": "hannity", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "scott", "sentiment": "none"}, {"name": "doug", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "gingrich", "sentiment": "none"}, {"name": "martha raddatz", "sentiment": "none"}, {"name": "larry elder", "sentiment": "none"}, {"name": "jim comey", "sentiment": "none"}, {"name": "julian", "sentiment": "none"}, {"name": "sean", "sentiment": "none"}, {"name": "rudy giuliani", "sentiment": "none"}, {"name": "joe scarborough", "sentiment": "none"}, {"name": "james comey", "sentiment": "none"}, {"name": "donald", "sentiment": "none"}, {"name": "herman cain", "sentiment": "none"}, {"name": "clinton", "sentiment": "none"}, {"name": "rudy giuliani", "sentiment": "none"}, {"name": "mike pence", "sentiment": "none"}, {"name": "bill clinton", "sentiment": "none"}, {"name": "laura ingraham", "sentiment": "none"}, {"name": "david clarke", "sentiment": "none"}], "locations": [{"name": "united states", "sentiment": "none"}, {"name": "newsbreak", "sentiment": "none"}, {"name": "san diego", "sentiment": "none"}, {"name": "milwaukee", "sentiment": "none"}, {"name": "cleveland", "sentiment": "none"}, {"name": "iowa", "sentiment": "none"}, {"name": "baton rouge", "sentiment": "none"}, {"name": "new hampshire", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "detroit", "sentiment": "none"}, {"name": "mahoning county", "sentiment": "none"}, {"name": "cincinnati", "sentiment": "none"}, {"name": "hannity", "sentiment": "none"}, {"name": "buckeye state", "sentiment": "none"}, {"name": "louisiana", "sentiment": "none"}, {"name": "wisconsin", "sentiment": "none"}, {"name": "long island", "sentiment": "none"}, {"name": "ohio river valley", "sentiment": "none"}, {"name": "ohio", "sentiment": "none"}, {"name": "milwaukee county", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "trump tower", "sentiment": "none"}, {"name": "youngstown", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "north carolina", "sentiment": "none"}, {"name": "michigan", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}, {"name": "maine", "sentiment": "none"}, {"name": "new york city", "sentiment": "none"}], "organizations": [{"name": "wikileaks", "sentiment": "none"}, {"name": "fox news", "sentiment": "none"}, {"name": "fox news", "sentiment": "none"}, {"name": "republican party", "sentiment": "none"}, {"name": "justice department", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "cnn", "sentiment": "none"}, {"name": "new york times", "sentiment": "none"}, {"name": "abc", "sentiment": "none"}, {"name": "salem radio", "sentiment": "none"}, {"name": "msnbc", "sentiment": "none"}, {"name": "fbi", "sentiment": "none"}, {"name": "senate", "sentiment": "none"}, {"name": "kkk", "sentiment": "none"}, {"name": "time", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "house", "sentiment": "none"}, {"name": "u.s. senate", "sentiment": "none"}, {"name": "fmr", "sentiment": "none"}, {"name": "national diversity coalition", "sentiment": "none"}, {"name": "state department", "sentiment": "none"}, {"name": "democratic party", "sentiment": "none"}, {"name": "wikileaks", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Published September 06, September 6,\n(BEGIN VIDEOTAPE)\nSEAN HANNITY, FOX NEWS HOST (voice-over): Tonight, Donald Trump is surging in new national polls. Former speaker of the House Newt Gingrich is here tonight with reaction.\n(BEGIN VIDEO CLIP)\nHILLARY CLINTON, D, PRESIDENTIAL NOMINEE: Donald Trump does not have the temperament to be our commander-in-chief.\n(END VIDEO CLIP)\nHANNITY: Then Hillary Clinton has multiple coughing fits all on the campaign trail. Laura Ingraham and Herman Cain weigh in.\nAnd Hillary Clinton is also in hot water after the FBI releases documents on its investigation into her private e-mail server. David Bossie, Doug Schoen, Larry Elder react tonight.\n(END VIDEO CLIP)\nDONALD TRUMP, R, PRESIDENTIAL NOMINEE: I believe we need a civil rights agenda for our times.\n(END VIDEO CLIP)\nHANNITY: Plus, Donald Trump delivers a powerful speech to African- Americans in Detroit. We'll check in with the Reverend Darrell Scott and Sheriff David Clarke. They join us, plus all of that and we speak with WikiLeaks founder Julian Assange.\n\"Hannity\" starts right here, right now.\n(END VIDEOTAPE)\nHANNITY: And welcome to \"Hannity.\" Tonight, with just nine weeks to go before the general election, Donald Trump is now surging in new national polls. In a CNN/ORC poll out today, Trump is now leading Hillary Clinton 45-43 in a four-way race among likely voters. And according to the same poll -- look at this -- Trump has a commanding lead among independent voters, topping Clinton 49 percent to 29 percent in a four-way race.\nAnd the latest Fox News poll shows a very close race, Clinton and Trump in a dead heat in a four-candidate contest, with Clinton's small lead now falling within the margin of error.\nNow, here's what's interesting. When it comes to key swing states, a Reuters poll now shows Trump leading or in a tie, for example, in Iowa. Trump is beating Clinton 44-41. Maine -- when has a Republican competed in Maine last? Trump and Clinton are tied 42 percent.\nThere's a very close race going on in Michigan. Donald Trump is leading 42 to 41. In New Hampshire, Trump is up 45-44. And over to Ohio, the -- no Republican has won the White House without the Buckeye State. Trump is up 46 to 43.\nLook at this. The state of Wisconsin is all tied up. Trump and Clinton both have 38 percent. And with the polls now showing this race tightening, Donald Trump is campaigning very hard. By the way, if anyone is low energy, it's not Jeb Bush. It's Hillary Clinton.\nLook at Trump.\n(BEGIN VIDEO CLIP)\nTRUMP: My opponent wants a 550 percent increase in Syrian refugees over the large number...\n(BOOS)\nTRUMP: ... over the large number that are already coming into the country through -- thousands and thousands through President Obama. She is running to be America's Angela Merkel, and you see what happened to Angela Merkel of Germany! They had a massive defeat recently in the elections because Germany has had problems like it's rarely seen before.\nAnd look at France, and look at other countries. It's catastrophic, folks. It's catastrophic. I have friends that go to France every year. They love it. I say, How did you like it this year? They say, We don't go to France anymore. France isn't France. Pretty tough. We'll go to North Carolina instead, OK?\n(CHEERS AND APPLAUSE)\nTRUMP: I think so.\nI'm also going to notify all countries that refuse to take back dangerous illegal immigrants who have committed crimes in this country that they will lose access to our visa programs and many, many more little goodies if they continue to refuse to take back the criminals that have been placed in our country!\n(CHEERS AND APPLAUSE)\n(END VIDEO CLIP)\nHANNITY: Here now with reaction, former speaker of the House, Fox News contributor Newt Gingrich. All right, these polls are very reassuring. We got -- you're smiling. That's never a good sign. We got a lot of game left to play, but certainly in the last three-and-a-half weeks, things have changed.\nI would argue he's on message. He's only comparing his record, the failing record of Obama and Clinton versus his vision for the country, and I think his outreach in Baton Rouge, to the Mexican president, to this church in Detroit has served him very well. Thoughts.\nNEWT GINGRICH, R, FMR. HOUSE SPEAKER, FOX CONTRIBUTOR: Well, I think, first of all, if you're Trump, you have to feel pretty good at the tremendous comeback from the week after the Democratic convention, when the polls were terrible, people were writing him off, et cetera.\nYou look at a place like Wisconsin, where they're now tied. That means that Ron Johnson's reelection campaign for the U.S. Senate has a big boost.\nYou look at Ohio, where he's now ahead. That means that Rob Portman's reelection to the Senate has a big boost. You look at Iowa, where Chuck Grassley is going to get reelected.\nBut this is all coming together in a positive way. Remember, you have 63 days. My prediction -- and I've been on this theme for a while. My prediction is that it will get better for Trump. It will get worse for Clinton.\nAnd to the degree that Trump stays focused on two things, sticking with the teleprompter, which he does as well as anybody I've ever seen, and he's making his points, and he's coming across very, very effectively. And second, continuing to do things that are bold.\nIt was bold to go to Louisiana while Hillary Clinton stayed hidden in Long Island raising money. It was bold to take the Mexican president's invitation and then to look equally presidential in that press conference. I mean, anybody looking at that could say Donald Trump clearly can be president, while Hillary Clinton stayed hidden in Long Island raising money. It was bold to go to Detroit.\nAnd by the way, it was very bold to go to Youngstown, Ohio. The largest county fair in Ohio is in Youngstown. Youngstown is historically -- Mahoning County's a very Democratic base originally. He had huge crowds. He and Mike Pence were there together. They had huge crowds in Youngstown. If Trump carries eastern Ohio by the margins that are building, he's going to carry the state.\nAnd there's a wonderful cross-Trump, to use a phrase from Bridge, between Rob, who's really doing a great job, Rob Portman, from Cincinnati, carrying the suburban areas, and Trump carrying the Ohio River Valley. If they mutually reinforce each other, Ohio could get to be a very good state.\nHANNITY: You know, it's amazing how immigration and the issue of refugees-- it's always peace and prosperity that drive elections. It's big here. I showed on the air last week that Hillary Clinton has flip-flopped on driver's licenses for illegal immigrants. On building the wall she's flip- flopped. On sanctuary cities, she's flip-flopped. On welfare and health care benefits -- she's flipped and flailed all over this.\nWatch this. You were there. You're in this video in 1995. Listen to Bill Clinton talking about immigration.\n(BEGIN VIDEO CLIP)\nBILL CLINTON, FORMER PRESIDENT OF THE UNITED STATES: All Americans, not only in the states most heavily affected, but in every place in this country, are rightly disturbed by the large numbers of illegal aliens entering our country. The jobs they hold might otherwise be held by citizens or legal immigrants. The public service they use imposes burdens on our taxpayers.\nThat's why our administration has moved aggressively to secure our borders more by hiring a record number of new border guards, by deporting twice as many criminal aliens as ever before. We are a nation of immigrants, but we are also a nation of laws. It is wrong and ultimately self-defeating for a nation of immigrants to permit the kind of abuse of our immigration laws we have seen in recent years, and we must do more to stop it.\n(APPLAUSE)\n(END VIDEO CLIP)\nHANNITY: Kind of sounded a lot like Donald Trump, don't you think?\n(LAUGHTER)\nGINGRICH: Yes, I have to give -- really, this was a remarkable moment. I had actually forgotten that line. That was the very first State of the Union that I was part of. And I saw Dr. Ben Carson on TV Sunday, and he referred to that. And we pulled that section. And I thought to myself, this is the Clinton/Trump plan, and we should ask Hillary Clinton how she feels about Bill Clinton's plan because it is remarkably like Trump.\nAnd by the way, today I saw a six-minute local news report from San Diego on illegal immigration into San Diego this last week. It is so startling, it's unbelievable.\nHANNITY: We'll play this again tomorrow, but I've got Hillary flipping and flopping and flailing like, you know, John Kerry -- I voted for $87 billion before I voted against it -- on everything involving immigration.\nLet me go to this other issue. You and I have discussed at length for years the need for the Republican Party to reach out, in particular to the black community, where under Obama, there's been a 58 percent increase of black Americans on food stamps, millions more black Americans now are out of the labor force, and in poverty, a 20 percent increase, black Americans not participating in the labor force.\nJesse Jackson -- they ran this ad about Trump and the KKK and the Confederate flag, but this is what Jesse Jackson said about Trump. Does this help Trump?\n(BEGIN VIDEO CLIP)\nREV. JESSE JACKSON, RAINBOW/PUSH COALITION: I do want to express thanks to you, Donald Trump, for being with us tonight. We need your building skills, your gusto, your rent package for people on Wall Street to represent diversity, and we thank you for coming tonight. Let's give Donald Trump a big hand.\nIn terms of reaching out and being inclusive, he's done that, too, and created for many people a comfort zone. When I ran for the presidency in '84 and '88, he came to our business meeting here in New York because he has this sense of the curious and a will to risk to make things better.\n(END VIDEO CLIP)\nHANNITY: 1999. I've been to Trump Tower. I see the people, the diversity of people that work there. I think that kind of takes the sting out of that phony race-baiting ad that Hillary's campaign is using.\nGINGRICH: I think the Trump campaign would be well served to take that clip, put it on every black radio station in the country, and say, Who are you going to believe, you know, Jesse Jackson or Hillary Clinton?\nAnd you're exactly right. By the way, Jackson refers back to meetings with Trump in the '80s, when Jackson was running for president. He said, Trump came to my business meetings because he was openly curious about what was going on.\nSo this idea that the speech in Detroit is a sudden, you know, last-minute event -- Donald Trump has been concerned about solving America's problems for his entire business career, talked about it in the '80s, got the cover of Time magazine in '89 because he was more than just a businessman. He's tried to figure out how to help the country and...\nHANNITY: Well, let me ask this.\nGINGRICH: Go ahead.\nHANNITY: All right, Clinton aides -- 327 times, they didn't remember information about the private e-mail server -- 327 times! Hillary couldn't remember 40. One of the excuses she made is, Well, I didn't know if I was briefed because -- and we'll get into this later -- because I had a concussion in 2012.\nNow, I want to say that in light of -- here's the media on her plane, and these are the questions the media -- the real tough questions they've been asking her.\n(BEGIN VIDEO CLIP)\nHILLARY CLINTON, D, PRESIDENTIAL NOMINEE: Welcome to our big plane!\nIt's so exciting.\nUNIDENTIFIED MALE: What do you think?\nCLINTON: I think it's pretty cool, don't you? You're supposed to say yes.\n(CROSSTALK)\nCLINTON: I am so happy to have all of you with me.\nQUESTION: Have you missed us?\nCLINTON: I was just waiting for this moment.\nQUESTION: How was your Labor Day weekend?\nCLINTON: It was good. It was really good. Yes, we had a good time. The last moment of -- happy Labor Day, I know. It's exactly right.\nQUESTION: Do you have a Labor Day message?\nCLINTON: Oh, I do. You'll hear it.\n(LAUGHTER)\nCLINTON: I definitely -- I definitely do.\n(END VIDEO CLIP)\nHANNITY: So she can't remember. She says her concussion caused her to forget all of these horrible things about her. And I'm thinking, You can't come up with a better question than that, or the pay-to-play scandal and the Clinton Foundation?\nGINGRICH: Well, but you're asking the elite media to be other than who they are. They are essentially the offensive wing of the Democratic Party. They're totally connected to the Democrats. They're desperately hoping that she'll win, and they're willing to cover up for her every way they can.\nThe problem they've got is that her problems are so big that they keep leaking through, despite the best efforts of the elite media, and the country week by week learns more about how dishonest and corrupt Hillary is.\nAgain, think about this. I mean, if you're Donald Trump and you're preparing for a debate and you're going to face a person who cannot remember 46 times and White House lies routinely, how do you prepare to debate that?\n(LAUGHTER)\nGINGRICH: I mean, you know, the moderator is going to ask her something, and she's going to say, Well, you know, I don't quite remember. And then she wants us to believe she's ready for the 2:00 in the morning phone call.\n(LAUGHTER)\nHANNITY: All right. I got it. You're on your \"A\" game. Welcome back. I know you were on vacation. Thanks for being with us.\nGINGRICH: Good to be with you.\nHANNITY: And up next tonight right here on \"Hannity\"...\n(BEGIN VIDEO CLIP)\nCLINTON: Every time I think about Trump, I get allergic!\n(LAUGHTER)\n(END VIDEO CLIP)\nHANNITY: Hillary -- yet another coughing fit, four minutes, 22 seconds, and she finally took a couple of questions from the press, but they were all softballs. Herman Cain, Laura Ingraham weigh in next.\nAnd then later, WikiLeaks founder Julian Assange. He said he's going to be releasing significant information about Hillary Clinton that will derail her campaign. Well, he'll be here to tell us what may happen next. That and more.\n(COMMERCIAL BREAK)\n(NEWSBREAK)\n(BEGIN VIDEO CLIP)\nHILLARY CLINTON (D-NY), PRESIDENTIAL NOMINEE: Every time I think about Trump, I get allergic!\n(LAUGHTER AND CHEERS)\nCLINTON: Boy, we have 63 days to go.\n(END VIDEO CLIP)\nHANNITY: All right, Hillary Clinton having one of her frequent coughing fits. I think this went on 4 minutes and 22 seconds at a rally in Cleveland, Ohio, yesterday. But that was not an isolated incident. She had another coughing fit, an attack while speaking with reporters on her campaign plane. Take a look.\n(BEGIN VIDEO CLIP)\nCLINTON: So -- you got some water?\nUNIDENTIFIED FEMALE: Yes.\nUNIDENTIFIED FEMALE: Thank you.\nUNIDENTIFIED FEMALE: I'll be all right (INAUDIBLE)\n(END VIDEO CLIP)\nHANNITY: Earlier today, the Drudge Report ran a headline highlighting Clinton's recent history of coughing fits. By the way, we're just going to keep in the corner of the screen just -- we kind of put them all together. Just take a look.\nDoes it raise questions about her health, especially in light of the revelation she told the FBI that, well, she couldn't remember a lot of things because she had a concussion in 2012. Well, I thought it was a conspiracy, according to CNN, if you bring up the idea about Hillary's health.\nHere with our discussion, editor-in-chief, Lifezette.com, nationally syndicated radio host Laura Ingraham. Also FOX News contributor, a nationally syndicated host himself, Herman -- we're all talk show hosts here.\n(LAUGHTER)\nHANNITY: But you can watch Hillary. She has these coughing fits one after another after another. Then we find out she uses as an excuse, Laura, the fact that she had a concussion, why she couldn't remember if she was briefed or not as it relates to how to secure e-mails. So do we now have a right to inquire a little bit more deeply about what the situation is with her health?\nLAURA INGRAHAM, FOX CONTRIBUTOR: Yes. As a former white collar litigator, I would say that Hillary Clinton opened the door to questions about her health.\nSean, when she claims that she doesn't remember basic elements of her duty as secretary of state, she doesn't remember certain briefings, she doesn't remember the designation on the top of a document for classified information -- she didn't remember that she had more than one device? I mean, none of this passes the straight face test.\nHANNITY: She had 14 of them.\nINGRAHAM: We know that.\n(CROSSTALK)\nHANNITY: All right, so here's what we know, Herman. She couldn't recall all the security briefings. She couldn't recall 40 times. She couldn't recall the receipt of the security briefings because she had a concussion. How do you forget the whole briefing, and does it raise questions?\nHer aide destroyed her Blackberries with a hammer. Her e-mail was targeted multiple times by hackers because once she clicked on a porn link, and she also claimed that the \"C\" marking, which everybody knows is \"classified,\" was referencing paragraphs in alphabetical order.\nNow, her aides also said 327 times they didn't remember. She said it 40 times. Do you believe any of this, or is she just lying? And by the way, she's coughing in the corner there. Go ahead.\nHERMAN CAIN, FOX CONTRIBUTOR: Well, Sean, she's just lying. I mean it's one thing -- this shows that her staff is pushing her out there despite her physical condition. She needs to get medical help. It's one thing to have one coughing spell, but to continue to have multiple coughing spells, and they get longer and longer and longer -- her staff is not being sensitive to the fact that maybe she needs to step back.\nThey don't want to do that because it might continue to add to a lot of the rhetoric and a lot of the perception that maybe she's not healthy enough to do this.\nThe other thing is all of these other things that she has denied she's able to remember -- her biggest problem is not coughing. Her biggest problem is lack of integrity, and it's starting to show through with a lot of people, period.\nHANNITY: All right, 277 days, Laura, no press conference. Her events -- they're often, like, 100 people, and it's for the TV cameras, and they never pan back to show that there's no crowd there.\nNow, you're a lawyer. Is it not evidence of acting intentionally and with a criminal intent? She didn't -- she was asked by Ed Henry, You mean with a cloth, when she was asked if she wiped her server clean. No, she used expensive BleachBit software to make sure God couldn't read them, as Trey Gowdy said. So is that criminal intent? Do they need to reopen this investigation?\nINGRAHAM: I think they absolutely should reopen the investigation. They seem to have new information that wasn't brought to congressional attention earlier this year. The information alone about the Blackberry destruction -- how did Jim Comey not even sit in on the interview with Hillary Clinton?\nHe didn't even take part of it.\nHANNITY: Oh, by the way, you mean the same guy that made a document dump last Friday, when everybody's on vacation, the way campaigns do? That guy?\nINGRAHAM: Oh, of course. Let me -- let me just -- can I say just one thing about the FBI? This is supposed to be an agency, Sean, even in our hyperpolitical world, that calls balls and strikes fairly. They're an umpire. They're not on one side or the other. We should be able to trust the FBI to do the proper investigation and come to the proper conclusion without regard to political allegiance or political party.\nWe know that one of the independent investigators at the Justice Department actually gave money to the Obama campaign both in 2008 and 2012. This, I think, hurts the integrity of the FBI...\nHANNITY: I agree with you.\nCLINTON: ... and again, eats away at the public's trust in government.\nNone of us could get away with smashing potential state's evidence with a hammer.\nHANNITY: Oh, good luck to you, Laura Ingraham. I'd like to see you bash up your phones with -- and your computers. All right, last word, Herman.\nCAIN: Well, Laura is exactly right. Unfortunately, the integrity of the FBI has been compromised by this administration and the Justice Department.\nThat's unfortunate because people have often, for a long time, had a lot of trust in the FBI.\nThey have now compromised their integrity because it is apparent and it's clear that they are trying to hold back and cover for Hillary Clinton, which, in fact, she has shown that she cannot be trusted. She does not recognize the integrity of classified information, and she is definitely not trustworthy.\nHANNITY: All right, guys, we got to continue this. We'll have you back later in the week. Thank you both for being with us.\nWhen we come back, WikiLeaks founder Julian Assange says that he has, Quote: , \"significant documents\" that could impact Hillary's campaign.\nAssange is getting ready to release them, and he'll be here to talk about that next.\nAlso later, on Friday, the FBI released their report on Clinton's private server. The document dump came on a holiday weekend. Larry Elder, Doug Schoen they'll weigh in on that and more on this busy news night tonight on \"Hannity.\"\n(COMMERCIAL BREAK)\nHANNITY: And welcome back to \"Hannity.\" So in a recent interview with The New York Times, Wikileaks founder Julian Assange had some harsh words for Hillary Clinton and the mainstream media. Let's take a look.\n(BEGIN VIDEO CLIP)\nJULIAN ASSANGE, WIKILEAKS: The American liberal press, are falling over themselves to defend Hillary Clinton, are erecting a demon that is going to put nooses around everyone's necks, assuming she wins the election, which she is almost certainly going to do.\n(END VIDEO CLIP)\nHANNITY: Now, he was not mincing words there, but that's not all. In other interviews, Assange has said that he has, Quote: , \"significant documents\" that would be damaging to Hillary Clinton's campaign.\nHere to join us and explain more, the man himself, WikiLeaks founder Julian Assange. Julian, how are you, sir? Welcome to the program.\nASSANGE: Good day, Sean. I'm well as can be expected for being detained for six-and-a-half years without charges.\nHANNITY: You know what? I understand -- you know, part of me in the beginning was conflicted about you, and I'll tell you why. I believe in privacy. I believe that people, especially when it comes to private e- mails, personal e-mails, et cetera and -- I think people have a right to that privacy.\nOn the other hand, you have done a lot of good in what you have exposed about how corrupt, dishonest and phony our government is, and I applaud that. I think that's good that we know that.\nDo you understand people when they talk to you about the privacy issue?\nASSANGE: I -- I do. And we have exposed a lot of governments, and WikiLeaks has -- you know, we specialize in bringing the First Amendment to the world. We're always very surprised that one of our biggest battles would be trying to bring it to the United States under an Obama administration.\nHANNITY: Yes, that's interesting you say that. Why do you say that that's a surprise to you?\nASSANGE: Well, because if you see the rhetoric coming out of the Democrats, it's that they're pro-civil liberties, and an important part of civil liberties is respect for the First Amendment and the rule of law. And that has broken down under the Obama administration, and Hillary Clinton was part of that process.\nShe has and the Obama administration has attempted to prosecute more journalists and journalistic sources under the Espionage Act, that same Espionage Act that she was being investigated under, than all previous presidencies combined.\nHANNITY: Yes.\nASSANGE: Not just more than any one of them, more than all of them combined. So there's -- under Obama, an epidemic has developed of abusing national security laws to crack down on what is legitimate use of the First Amendment.\nHANNITY: You said to PBS that you have a significant amount of information. The information itself is significant pertaining to Hillary Clinton's campaign. You will be releasing it in several batches as you are finishing it from a journalistic standpoint. How many batches, as you describe them, do you think you'll be releasing, and how soon?\nASSANGE: A tricky question, Sean.\nHANNITY: No, that's actually a pretty simple one. That's not tricky.\nASSANGE: The first batch is reasonably soon. We're quite confident about it now. We might put out some teasers as -- I don't want to promise anything because you have to see how the formatting goes. But we might put out some teasers as early as the next week or the week after.\nHANNITY: Last question. It's not really hard to hack into these even secure systems, is it? I've talked to some real smart computer friends of mine. They say it's far more simple than anybody would ever know. Is that true?\nASSANGE: It is. I just want to say one thing. In the FBI report released Friday, I agree with your analysis. It is very strange that that was released Friday afternoon on a labor weekend. I do think it draws questions to what sort of game the FBI is trying to play.\nBut Hillary Clinton says that she can't remember what a ‘C’ in brackets stands for. Everyone in positions of government and in WikiLeaks knows it stands for classified, confidential. And in fact we have already released thousands of cables by Hillary Clinton -- here she is, Clinton -- see, that's her signature, Clinton with a ‘C’ in brackets right there.\nHANNITY: Wow.\nASSANGE: Thousands where she, herself, has used a \"c\" in brackets and signed it off, and more than 22,000 times that she has received cables from others with this \"c\" in brackets. So it's absolutely incredible for Clinton to lie. She is lying about not knowing what that is. But it's a bit disturbing that James Comey goes along with that game.\nHANNITY: Wow. Julian Assange, fascinating. I do hope you get free one day. I wish you the best. Thank you for being with us.\nASSANGE: Thank you, Sean.\nHANNITY: All right, We'll have part two of that interview coming up tomorrow.\nNow, the FBI did a huge document dump on Friday, releasing its report on the investigation of Clinton's e-mail server. Larry Elder, Doug Schoen weigh in next.\nPlus tonight.\n(BEGIN VIDEO CLIP)\nDONALD TRUMP, R, PRESIDENTIAL CANDIDATE: I fully understand that the African-American community has suffered from discrimination and that there are many wrongs that must still be made right.\n(END VIDEO CLIP)\nHANNITY: Now, Donald Trump spoke to members of an African-American church this weekend. His outreach to the black community continues. We'll play highlights, get reaction from the Reverend Darrell Scott and Sheriff David Clarke as we continue tonight right here on HANNITY.\n(COMMERCIAL BREAK)\nHANNITY: Welcome back to HANNITY. So on Friday the FBI decided to dump documents on its investigation into Hillary Clinton's use of a private e- mail server, and what was made public is absolutely stunning. Again, they did this before a holiday weekend.\nNow, according to the FBI report, Clinton used 13 mobile devices for e- mail, and none of them could be recovered by the FBI. Why? Because some of them were destroyed by an aide of hers that used a hammer on them. Now, members of her staff deleted e-mails after receiving a congressional subpoena. Now, Clinton didn't know that the letter \"c\" marking on documents meant that it was classified. She blamed her 2012 concussion for not being able to recall security briefings. And Clinton also told the FBI that she couldn't recall or didn't remember specific details nearly 40 times. And the list of what she couldn't recall includes, Quote: , \"when she first received her security clearance at the State Department, receiving classified training, using her power to classify documents, who had access to her e-mails, and receiving e-mails that should not have been on an unclassified system.\"\nNow, the timing of the release by the FBI and its director, James Comey, is so stunning that even members of the mainstream media are questioning if it was done to protect the Clinton campaign. Let's take a look.\n(BEGIN VIDEO CLIP)\nMARK HALPERIN, MANAGING EDITOR OF BLOOMBERG POLITICS: There's so much to say about the FBI's conduct here. Those who are skeptical about how he's done this, look at the Friday release. The guy has not had a press conference. He talks about transparency. I've become increasingly critical of him. I know he's got a sterling reputation.\nJOE SCARBOROUGH, MSNBC HOST: Not anymore with me.\nHALPERIN: To release this on a Friday as if he's an arm of the Clinton campaign, I'm just stunned, because there's a lot of information in here that's of great public interest. And if you really cared about transparency, you would say to yourself, is the best time to release this to get a full public hearing on Friday before Labor Day? No.\n(END VIDEO CLIP)\nHANNITY: A very good point. And according to former federal prosecutor Rudy Giuliani, he says the report proves that Clinton is lying and broke the law.\n(BEGIN VIDEO CLIP)\nRUDY GIULIANI, R, FORMER NEW YORK CITY MAYOR: I think she is doing something called lying, which violates 18 United States code, section --\n(CROSSTALK)\nGIULIANI: That is what Martha Stewart went to jail for, for one lie, for a couple of years, one lie about a financial matter that had nothing to do with our national security.\n(END VIDEO CLIP)\nHANNITY: Here with reaction, Salem Radio nationally syndicated host Larry Elder, FOX News contributor, former Clinton pollster Doug Schoen. So doesn't that show that she acted intentionally, the campaign, her people acted intentionally and with criminal intent when you use BleachBit? Ed Henry asked her did you wipe the server clean, and she goes, \"you mean like with a cloth?\" No, they used BleachBit. BleachBit is designed to make sure, as Trey Gowdy said, God can't find those e-mails. So isn't that obstruction? Doesn't that get to the heart of intent?\nDOUG SCHOEN, As a trained lawyer, I've learned not to make judgments about cases I've not been in. But, Sean, it looks pretty darn close to me, and I say this as a Clinton supporter. All I can say is Mr. Comey, I think, has a lot more questions to answer for his behavior. I agree with Mark Halperin.\nHANNITY: Clinton aides, 327 times, Larry Elder, they couldn't recall the details. And, by the way, the Hannity conspiracy about her health, it appears I was way ahead of the curve considering she is citing her concussion for not being able to recall. I'd like to know what else she doesn't recall. Does she know what happened on 9/11? Does she recall the Sunday after 9/11? She was profiling Muslim Americans, you know, just a few little details she might have forgotten.\nLARRY ELDER, SALEM RADIO NATIONAL SYNDICATED HOST: Her top surrogate, of course, is Governor Tim Kaine, her running mate, and he did not hold up very well under persistent but fair questioning by Martha Raddatz over at ABC.\nThe arguments are three. James Comey did not make a criminal referral. And, by the way, she apologized. She made a mistake. Oh, and Donald Trump has not turned over his tax returns. The problem with James Comey not making a criminal referral is that most Americans believe that he should have made one. Even Colin Kaepernick said that if it had been anybody other than Hillary, she would have been in prison.\nAnd the other argument about her being sorry when Dick Cheney was alleged to have outed a covert agent, critics didn't say he made a mistake. Critics said he jeopardized national security. She has jeopardized national security.\nAnd regarding Donald Trump not being transparent, it's called a non sequitur. It's called a dodge. She's not been transparent. She said she turned over all of her relevant e-mail. We find out now that she did not turn over all of her relevant e-mail. She did send and receive classified information. She did send and receive --\nHANNITY: Here's my question, though.\nELDER: -- that was marked as such. This is awful. And it undermines if not completely offsets her number one argument against Donald Trump, the strongest argument against Donald Trump, which is he's too dangerous to be --\nHANNITY: If she remembered losing the memory of the briefings she apparently was supposed to take or did take, what else does she remember not remembering? I'd like to know the answer to that question.\nSCHOEN: I think that answer is there is no answer to that question. Larry's silence --\nHANNITY: Whatever is convenient?\nSCHOEN: Look, Secretary Clinton got through this. This is politics. She is going to hit Donald Trump very, very hard because, as we've said, Sean, there is not much of an argument that she's made or at this point can be made for her candidacy. She's going to hit hard. She's going to focus on --\nHANNITY: So the only way she could be win is to be negative against Trump. She can't run on her record. She can't run on honesty. She can't run on vision. She's got nothing but negativity. That's what you're saying?\nSCHOEN: That is what she's going to do.\nHANNITY: That's all she can do.\nSCHOEN: I think at this point she could articulate a vision. She won't. But she's going to stay negative, unrelenting, a billion, billion and a half dollars-worth of communication. That's just a fact.\nHANNITY: Larry, I don't disagree with Doug because that's all she's got. It's pretty pathetic that so many people support her.\nELDER: Doug has always been sane and rational, has never hit below the belt. And what else does she have? She can't talk about economic growth because there hasn't been economic growth. And she can't talk about anything than Donald Trump is reckless. He's racist. He's a homophobe. He's a xenophobe, because that's all she's got.\nAnd what's happened? Donald Trump's poll numbers are going to rise in the black community, as I predicted to you a long time ago, between 10 percent and 15 percent, and she cannot win. Donald Trump is going to be the next president of the United States because the strongest argument against Donald Trump is that he's reckless. He's irresponsible. He can't be trusted. And Hillary has now offset that strongest argument. She's in very, very serious trouble.\nHANNITY: I agree with you, but I agree with Doug inasmuch as this is not done yet. A lot of game to play.\nSCHOEN: Very close race. Very close race.\nELDER: Three debates.\nHANNITY: Up next tonight right here on HANNITY.\n(BEGIN VIDEO CLIP)\nTRUMP: It's from the pews and pulpits and Christian teachings of black churches all across this land that the civil rights movement lifted up its soul and lifted up the soul of our nation.\n(END VIDEO CLIP)\nHANNITY: Donald Trump's outreach to the black community continues as he traveled to Detroit this holiday weekend. He spoke to members of an African-American church. We're going to play you highlights. We'll get reaction. He got a standing O. The Reverend Darrell Scott is here.\nSheriff David Clarke will join us as well, straight ahead.\n(COMMERCIAL BREAK)\nHANNITY: Welcome back to HANNITY. So on Saturday Donald Trump traveled to Detroit where he continued to reach out to black American voters. This time he gave a heartfelt speech to members of an African-American church.\nLet's take a look.\n(BEGIN VIDEO CLIP)\nTRUMP: It's from the pews and pulpits and Christian teachings of black churches all across this land that the civil rights movement lifted up its soul and lifted up the soul of our nation.\nToday I just want to let you know that I am here to listen to you, and I've been doing that. I believe we need a civil rights agenda for our time, one that ensures the rights to a great education, so important, and the right to live in safety and in peace.\nI fully understand that the African-American community has suffered from discrimination and that there are many wrongs that must still be made right.\nIt is my prayer that America of tomorrow, and I mean that, that the America of tomorrow with be one of unity, togetherness, and peace. And perhaps we can add the word, \"prosperity,\" OK, prosperity.\n(APPLAUSE)\n(END VIDEO CLIP)\nHANNITY: And joining us now with reaction, Milwaukee County Sheriff David Clarke, and the CEO for the National Diversity Coalition for Trump, he was in the audience, the Reverend Darrell Scott.\nReverend Scott, two things that stood out in my mind. When Al Gore would go before predominantly black audiences, he would go into like -- he would change his pitch, his tone, his cadence, his delivery, and try and be a black preacher. Hillary did the same thing. I played it many times. I think that is so condescending.\nAnd I saw Donald Trump speak to people as he does everybody, with a little bit of reverence for being in a church. I give him credit for that. But he keeps reaching out to the black community and pointing out what I have been pointing out. Black Americans, P. Diddy even said it, they got shortchanged by Obama's promises. They're not better off. A 58 percent increase in the Obama years, black Americans now getting food stamps, a 20 percent increase black Americans out of the labor force. They've been disproportionately impacted, and Donald Trump keeps making this outreach.\nWill it pay dividends for him?\nREV. DARRELL SCOTT, NATIONAL DIVERSITY COALITION FOR TRUMP: I think it will. Donald Trump is saying things that need to be said but politicians don't like him saying, especially if you're with the incumbent administration because any disparities or disenfranchisement on behalf or on the part of black Americans reflects negatively on the current administration. It's been eight years and this current administration, and this is where it has gotten us. That's why I don't take offense to him saying what do you have to lose, because we've lost just about everything. We don't have anything else left to lose.\nHANNITY: Sheriff, what is your take? I actually think this is one of the best speeches he gave. I liked the way he delivered it. I liked the fact that he was there. I like Republicans fighting back this false, defamatory narrative that if you're conservative you don't care about minorities.\nI've always resented that false accusation.\nSHERIFF DAVID CLARKE, MILWAUKEE COUNTY: This has been nothing short of splendid. It even surprised me. And what I mean by that is I thought there would be little lag time before we saw some results, but it seems to be happening. And I'm not talking about a huge shift, but black people just want to be talked to. What I got out of that whole speech, and I listened to it, I like the tone in which he talked to us, too. He talked to us like we're adults. He didn't talk to us like we're a bunch of infants, and he didn't show up in this very clumsy way like Mrs. Bill Clinton does with a bottle of hot sauce in her purse and eating a plate of watermelon and thinking that is cool.\n(LAUGHTER)\nHANNITY: Am I allowed to laugh at this? Do you guys notice, Al Gore goes into a black church and he goes into that preacher mode? \"And the glory of the Lord.\" And Hillary Clinton, \"I ain't feeling in no way tired.\" What is that? What are they doing? What the hell is that?\nCLARKE: The other thing I liked, Sean, is that he's right. We need a new civil rights agenda. The civil rights agenda of the 21st century for the Democrats has been to mainstream criminal behavior and more rights for criminals. But Donald was very clear -- Mr. Trump, I'm sorry, with all due respect. Better schools for their kids, meaningful work, adequate housing, things like that are what the black community needs. The problem with the Democrats right now Sean is that they can't look and extoll the virtues of living in the ghetto because that could end this. But they can't say to black people, look around. Isn't this great? That's the problem for them right now. They're going to have to spend a lot more resources on this than they anticipated going into the final 60 days.\nHANNITY: All right, guys, thank you both.\nSCOTT: Thanks, man, god bless you.\nHANNITY: You, too. God bless you.\nComing up next, a very important \"Question of the Day.\" We need your help.\nThat's straight ahead.\n(COMMERCIAL BREAK)\nHANNITY: Welcome back to HANNITY. And it's time for our \"Question of the Day.\" So what do you think about some of the press's softball questions to Hillary that we showed you tonight? Just go to Facebook.com/SeanHannity, @SeanHannity on Twitter, let us know what you think. That is all the time we have this evening. As always, thank you for being with us. It's 62 days until Election Day as of tomorrow night. Have a great night.\n ", "external_links": [], "published": "2016-09-06T03:00:00.000+03:00", "crawled": "2016-09-08T01:10:11.373+03:00", "highlightTitle": ""}