{"organizations": [], "uuid": "83a04df775fd0acb947cf6e9ca6ee84e25b2b98d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 1}, "vk": {"shares": 0}, "linkedin": {"shares": 7}, "facebook": {"likes": 348, "shares": 348, "comments": 6}, "stumbledupon": {"shares": 0}}, "site_full": "www.buzzfeed.com", "main_image": "https://img.buzzfeed.com/buzzfeed-static/static/2016-08/31/16/campaign_images/buzzfeed-prod-fastlane03/6-movies-you-wont-want-to-miss-this-month-2-27705-1472675440-8_dblbig.jpg", "site_section": "", "section_title": "", "url": "https://www.buzzfeed.com/alisonwillmore/under-the-radar-movies-september-2016", "country": "US", "domain_rank": 137, "title": "6 Movies You Won’t Want To Miss This Month", "performance_score": 3, "site": "buzzfeed.com", "participants_count": 0, "title_full": "6 Movies You Won’t Want To Miss This Month", "spam_score": 0.223, "site_type": "news", "published": "2016-08-31T08:00:00.000+03:00", "replies_count": 0, "uuid": "83a04df775fd0acb947cf6e9ca6ee84e25b2b98d"}, "author": "Alison Willmore Buzzfeed News Film Critic", "url": "https://www.buzzfeed.com/alisonwillmore/under-the-radar-movies-september-2016", "ord_in_thread": 0, "title": "6 Movies You Won’t Want To Miss This Month", "locations": [], "entities": {"persons": [{"name": "der bunker", "sentiment": "none"}, {"name": "klaus", "sentiment": "none"}, {"name": "eric mcnatt", "sentiment": "none"}, {"name": "deyn", "sentiment": "none"}, {"name": "vincent cassel", "sentiment": "none"}, {"name": "terence davies", "sentiment": "none"}, {"name": "emmanuelle bercot", "sentiment": "none"}, {"name": "georgio", "sentiment": "none"}, {"name": "lynchian", "sentiment": "none"}, {"name": "jake", "sentiment": "none"}, {"name": "brian", "sentiment": "none"}, {"name": "maïwenn", "sentiment": "none"}, {"name": "toby", "sentiment": "none"}, {"name": "alfred molina", "sentiment": "none"}, {"name": "greg kinnear", "sentiment": "none"}, {"name": "chris pine", "sentiment": "none"}, {"name": "tony", "sentiment": "none"}, {"name": "ewan", "sentiment": "none"}, {"name": "fripan", "sentiment": "none"}, {"name": "john lithgow", "sentiment": "none"}, {"name": "heinrich", "sentiment": "none"}, {"name": "pit bukowski", "sentiment": "none"}, {"name": "jeff bridges", "sentiment": "none"}, {"name": "jennifer ehle", "sentiment": "none"}, {"name": "lina keller", "sentiment": "none"}, {"name": "martin bonner", "sentiment": "none"}, {"name": "gil birmingham", "sentiment": "none"}, {"name": "morris", "sentiment": "none"}, {"name": "theo taplitz", "sentiment": "none"}, {"name": "daniel fripan", "sentiment": "none"}, {"name": "toby howard", "sentiment": "none"}, {"name": "oona von maydell", "sentiment": "none"}, {"name": "lorey sebastian", "sentiment": "none"}, {"name": "sheridan", "sentiment": "none"}, {"name": "michael mcdonough", "sentiment": "none"}, {"name": "chad hartigan", "sentiment": "none"}, {"name": "sicario", "sentiment": "none"}, {"name": "jack o’connell", "sentiment": "none"}, {"name": "craig robinson", "sentiment": "none"}, {"name": "kathy", "sentiment": "none"}, {"name": "leonor", "sentiment": "none"}, {"name": "mackenzie", "sentiment": "none"}, {"name": "taylor sheridan", "sentiment": "none"}, {"name": "paulina garcía", "sentiment": "none"}, {"name": "kevin guthrie", "sentiment": "none"}, {"name": "katrin", "sentiment": "none"}, {"name": "chris", "sentiment": "none"}, {"name": "curtis", "sentiment": "none"}, {"name": "peter mullan", "sentiment": "none"}, {"name": "david scheller", "sentiment": "none"}, {"name": "david mackenzie", "sentiment": "none"}, {"name": "ben foster", "sentiment": "none"}, {"name": "carla juri", "sentiment": "none"}, {"name": "agyness deyn", "sentiment": "none"}, {"name": "tanner", "sentiment": "none"}, {"name": "michael barbieri", "sentiment": "none"}], "locations": [{"name": "united states", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "heidelberg", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "manhattan", "sentiment": "none"}, {"name": "brooklyn", "sentiment": "none"}, {"name": "west texas", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "sachs", "sentiment": "none"}, {"name": "cbs films", "sentiment": "none"}, {"name": "nikias chryssos", "sentiment": "none"}, {"name": "little men", "sentiment": "none"}, {"name": "magnolia pictures filmmaker ira sachs", "sentiment": "none"}, {"name": "morris from america", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "View this image › Artsploitation We’ve all been there: You rent a room based on an ad promising a lake view, only to discover upon arrival that it’s actually a windowless hovel in a remote bunker inhabited by a disturbing Lynchian family of three. Der Bunker , the directorial debut of Nikias Chryssos, is a heady dose of weirdness set almost entirely in the underground dwelling of the title, a place done up in the kind of mishmash vintage decor of people who haven’t been keeping abreast of the times. The renter in question, who’s never called anything other than “the student,” is played by Pit Bukowski, and the fact that he stays after seeing his proposed lodging is a sign that he’s just as off-kilter as his new roomies. \nThey’re quite a bunch — the mother (Oona von Maydell) is convinced her leg is possessed by an alien visitor named Heinrich who sometimes weighs in with advice; the father (David Scheller) insists their child is going to be president of the United States, and won’t hear otherwise; and then there’s Klaus (Daniel Fripan), who claims to be 8 years old (Fripan’s in his thirties) and is still being breastfed. Der Bunker would be an adequate piece of WTF-ery regardless of whether it added up to more. But it also works as a nightmare version of overprotective parenting. Klaus faces impossible expectations and extreme coddling at the same time, literally sheltered from the world in a surreal perma-childhood. \nHow to see it: Der Bunker is available on DVD and Blu-ray, and for digital rental/purchase via Vimeo . ID: 9438796 View this image › Lorey Sebastian / CBS Films The best role Chris Pine has ever played is as Toby Howard, the divorced dad making a go of bank robbing in David Mackenzie’s West Texas thriller Hell or High Water . Turns out, high school A-lister gone to seed is a good look for Pine, an actor who’s game if not always that memorable in more traditional leading man roles. He makes all kind of sense as a guy whose life has failed to turn out as well as he once might have expected. Toby was the good kid, while his brother Tanner (Ben Foster) was the troublemaker, fresh out of jail when the film begins. Yet they’ve ended up in the same place, broke and desperate, taking big risks to try to salvage something so that Toby’s two sons don’t end up in the same grinding poverty in which he finds himself stuck. \nMackenzie, whose last film was the terrific Jack O’Connell prison drama Starred Up , is Scottish, and his screenwriter, Taylor Sheridan, is Texan; together, they create a portrait of an economically demolished area that feels lived in and allegorical all at once. Sheridan, an actor who made the shift to screenwriter with Sicario , fills out the space between tense bank robberies with chewy dialogue between the brothers and between Jeff Bridges and Gil Birmingham as the lawmen tracking the Howards down. Hell or High Water is the only wider release of the summer to touch on the white working-class despair that’s become such a strong force in the current election, but it’s also just tremendously entertaining, a cops and robbers story with no good guys or bad guys, a bunch of characters trying to get by. \nHow to see it: Hell of High Water expands to 900 theaters nationwide this week — search the list here . ID: 9515410 View this image › Eric McNatt / Magnolia Pictures Filmmaker Ira Sachs’ last movie Love Is Strange was a bright, sunny Manhattan horror story about how little time it takes for a longtime couple (John Lithgow and Alfred Molina) to go from stable homeowners to couch-surfers, testing the patience of friends, family, and each other after the loss of a job. Sachs’ new feature, Little Men , is about a younger relationship being tested by the relentless forces of New York real estate — Jake (Theo Taplitz) and Tony (Michael Barbieri), teens whose friendship buds in the face of growing tension between their parents over the Brooklyn building they share. \nLittle Men is a discreetly barbed film about gentrification. Nestled within the initially polite — and later not-so-polite — negotiations between grown-ups Brian (Greg Kinnear), Kathy (Jennifer Ehle), and Leonor (Paulina García) are all sorts of issues of race, class, and family ties. But it’s also a story about the moment in which awareness of those and other dividing lines start encroaching on childhood. Jake and Tony enjoy the simple, easy rapport of two kids who just really like hanging out, but they’re not going to stay children for much longer. The looming shadow of high school hangs over the connection between the introverted, possibly gay Jake and the pint-size swaggerer Tony, and they seem destined to be divided by social pressure no matter what their parents do. The fragility of their connection makes it all the more touching. \nHow to see it: Little Men is now playing in limited release — check out a list of locations here . ID: 9438799 View this image › A24 Thirteen-year-old Morris (Markees Christmas) is chunky, and boyish, and black, and American, facts that make him multiple times an outcast among his fellow teens in Heidelberg, Germany, where he now lives with his widowed father Curtis (Craig Robinson). The two are, as his dad ruefully observes, “the only brothers” in the quaint but far from diverse town, something Morris is reminded of by the unabashed, oblivious questions he gets about whether he’s well-endowed, or good at basketball, or the owner of some pot that was found in the youth center. In between German lessons with his tutor Inka (Carla Juri), Morris writes hip-hop lyrics bragging about sexual feats he most definitely has not achieved. \nWhen he’s befriended by the pretty, bored Katrin (Lina Keller) — at least at first for novelty value — heartbreak looms on the horizon for Morris. But Morris From America , directed by This Is Martin Bonner ’s Chad Hartigan, isn’t interested in the expected beats, instead following Morris through a stage of growing up that’s painful, poignant, and sweet. It’s a movie that’s especially strong when it comes to its father-son relationship, which is tested, at times, by the fact that Morris and Curtis have been left with each other as their default best friend. \nHow to see it: Morris From America is now in select theaters and is also available for digital rental/purchase. ID: 9526441 View this image › Film Movement Georgio (Vincent Cassel) is the kind of man who’d take a date to a wedding without telling her where they’re headed — the sort of guy who, it turns out, is also the best man at said wedding, which may or may not hinge on his presence. He’s a dude who, rather than give a woman his number, tosses her his actual phone and then peaces out, certain that’ll guarantee they meet again. He’s larger than life and terrifically, terrifyingly free, his behavior right on the border between fun and red flag. Tony (Emmanuelle Bercot) bets big on the former while ignoring the latter — in fact, she ends up marrying him. \nMy King , directed by French actor Maïwenn, is a nuanced portrait of a relationship that’s equal parts emotional abuse and love — Georgio is erratic and energetic, devoted while also being a lying philanderer. He adores Tony and begs her to have a baby with him, only to move out while she’s pregnant, claiming it’s for the benefit of their romance. He’s a gaslighter of masterful levels, but what makes My King so compelling — despite a tiresome, unnecessary framing device in which Tony rehabilitates an injured knee and, with it, a wounded spirit — is that it refuses to leave out the highs to only focus on the lows. The result is a film that shows why Georgio leaves, but also why Tony stays for as long as she does, returning again and again despite knowing better. \nHow to see it: My King is now in select theaters — check out a list of locations here . ID: 9515412 View this image › Terence Davies’ Sunset Song is a jaw-droppingly gorgeous movie about how hideously difficult life could be in rural Scotland at the beginning of the 20th century. The contrast between aesthetics and content at first feels jarring, then hypnotic, and finally, like the whole point of the film. As the main character Chris, played by onetime model Agyness Deyn, comes to realize, “nothing endured but the land,” and the people wresting a living out of it are mere flickers in comparison. The land’s surpassing loveliness, captured in golden tones by cinematographer Michael McDonough, exists in indifference to the story being told. \nThat story’s often a rough one, encompassing abuse, marital rape, and natural hardships, but it’s broken up by periods of ebullient happiness. Chris grows up in the shadow of a domineering father (Peter Mullan, in the kind of role he can play in his sleep). When he falls ill and requires her care, Chris’s dreams of becoming a teacher are over. After his death, she comes into her own, finally in control of the farm and her life, choosing for herself a sweet-faced local man named Ewan (Kevin Guthrie) to marry. When, in a cruel twist, World War I arrives, sweeping him up and returning him as violent and short-tempered as the parent from which she escaped, it’s another in a line of heartbreaks for Chris. Deyn’s subdued but luminous performance grows in resonance along with the character’s strength, which, like the land Chris loves, is grounded in persistence. \nHow to see it: Sunset Song is available on Blu-ray and DVD, and for digital rental/purchase. ID: 9515388 ", "external_links": [], "published": "2016-08-31T08:00:00.000+03:00", "crawled": "2016-09-01T05:40:15.202+03:00", "highlightTitle": ""}