{"organizations": [], "uuid": "78925feea95c13ae19b20ab1761898738645ac02", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.foxnews.com", "main_image": "http://www.foxnews.com/content/dam/fox-news/logo/og-fn-foxnews.jpg", "site_section": "http://feeds.foxnews.com/foxnews/national", "section_title": "FOX News", "url": "http://www.foxnews.com/us/2016/09/24/war-crimes-tribunal-sought-to-try-islamic-state-detainees.html", "country": "CH", "domain_rank": 185, "title": "War crimes tribunal sought to try Islamic State detainees", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "War crimes tribunal sought to try Islamic State detainees", "spam_score": 0.0, "site_type": "news", "published": "2016-09-24T17:08:00.000+03:00", "replies_count": 0, "uuid": "78925feea95c13ae19b20ab1761898738645ac02"}, "author": "", "url": "http://www.foxnews.com/us/2016/09/24/war-crimes-tribunal-sought-to-try-islamic-state-detainees.html", "ord_in_thread": 0, "title": "War crimes tribunal sought to try Islamic State detainees", "locations": [], "entities": {"persons": [{"name": "stephen rapp", "sentiment": "none"}, {"name": "hinnant", "sentiment": "none"}, {"name": "mark toner", "sentiment": "none"}, {"name": "barack obama", "sentiment": "none"}, {"name": "josh lederman", "sentiment": "none"}, {"name": "rapp", "sentiment": "none"}, {"name": "john kerry", "sentiment": "none"}, {"name": "obama", "sentiment": "none"}, {"name": "balint szlanko", "sentiment": "none"}, {"name": "chris engels", "sentiment": "none"}, {"name": "bill wiley", "sentiment": "none"}, {"name": "chris smith", "sentiment": "none"}, {"name": "brett mcgurk", "sentiment": "none"}, {"name": "butler", "sentiment": "none"}], "locations": [{"name": "washington", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}, {"name": "united states of america", "sentiment": "none"}, {"name": "new jersey", "sentiment": "none"}, {"name": "erbil", "sentiment": "none"}, {"name": "raqqa", "sentiment": "none"}, {"name": "shariah", "sentiment": "none"}, {"name": "middle east", "sentiment": "none"}, {"name": "iraq", "sentiment": "none"}], "organizations": [{"name": "islamic state", "sentiment": "neutral"}, {"name": "hinnant", "sentiment": "none"}, {"name": "yazidi", "sentiment": "none"}, {"name": "associated press", "sentiment": "none"}, {"name": "commission for international justice", "sentiment": "none"}, {"name": "house", "sentiment": "none"}, {"name": "ap", "sentiment": "none"}, {"name": "state department", "sentiment": "none"}, {"name": "defense department", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "War crimes tribunal sought to try Islamic State detainees   \nWASHINGTON – War crimes investigators collecting evidence of the Islamic State group's elaborate operation to kidnap thousands of women as sex slaves say they have a case to try IS leaders with crimes against humanity but cannot get the global backing to bring current detainees before an international tribunal. \nTwo years after the IS group's onslaught in northern Iraq, the investigators, as well as U.S. diplomats, say the Obama administration has done little to pursue prosecution of the crimes that Secretary of State John Kerry has called genocide. Current and former State Department officials say that an attempt in late 2014 to have a legal finding of genocide was blocked by the Defense Department, setting back efforts to prosecute IS members suspected of committing war crimes. \n\"The West looks to the United States for leadership in the Middle East, and the focus of this administration has been elsewhere — in every respect,\" Bill Wiley, the head of the independent investigative group, the Commission for International Justice and Accountability, told The Associated Press. \nOfficials in Washington say that the Defense Department and ultimately the administration were concerned that court trials would distract from the military campaign. But the diplomats say that justice is essential in a region whose religious minorities have been terrorized. The officials spoke on condition of anonymity because they were not authorized to discuss the issue. \nThe U.S. has no legal obligation to take on the genocide of the Yazidis, but President Barack Obama has said that \"preventing mass atrocities and genocide is a core national security interest and a core moral responsibility of the United States of America.\" \nStephen Rapp, who stepped down as the administration's ambassador at large for war crimes last year, says the administration should have moved early to help secure evidence of IS atrocities and push for the creation of special Iraqi courts to try war crimes. \n\"The priority for the U.S. government is to win the war against the Islamic State and destroy them,\" Rapp said. \"It's been profoundly disappointing, because the idea of accountability has been such a low priority.\" \nRapp is now the chairman of the advisory board of the commission, whose investigators in Iraq work with the Kurdish regional government to formally document the IS crimes, including those against the Yazidi minority group. They have built a case implicating the entire IS command structure in a plot to kidnap Yazidi women and girls and establish a sex slave market. \nThe plan was executed by an organized bureaucracy, from the temporary sorting facilities — including a prison, schools and a curtained ballroom where the Yazidis were divided by age and willingness to convert to Islam — to the waiting buses that would haul them by the dozens across the border to Raqqa. The Islamic State group's Shariah courts soon stepped in, to settle contract disputes and ensure that its finance hierarchy got its cut of the sex-slave proceeds. \n\"You have members of IS who were engaged in ensuring that this system continued and that it functioned well,\" said Chris Engels, the American lawyer who is leading the commission's legal investigation. Without a legal documentation of their identities from the top down, many could \"slide into refugee streams\" and disappear, he said. \nThough there are at least dozens of Islamic State extremists in custody in Iraq, there have been no prosecutions for the crimes against humanity that the U.S. — among many others — insist have taken place. On Tuesday, the Obama administration's envoy for the coalition to counter Islamic State militants, Brett McGurk, tweeted that he \"pledged full accountability\" for Islamic State crimes against the Yazidis, whom IS considers infidels because of their religion. \nIn 2012, Obama announced what he called a comprehensive strategy to prevent and respond to war crimes with the establishment of an atrocities prevention board. \nBut in a recent investigation, the AP found that even in territories liberated from IS militants by Kurdish forces, dozens of mass graves have been left unsecured. \n\"It's a tragedy that we are not getting in there and securing these sites where we can and doing things like collecting DNA evidence,\" said Rapp. \nA measure by the House that calls on the U.S. to fund precisely the kind of court envisioned by the investigators is unlikely to advance anytime soon in an election year. The war crimes commission says it would need about $6.6 million and about six months to get the trials going. \n\"If the administration was committed to criminal investigations of perpetrators, then it would be robustly funding criminal investigations of perpetrators,\" said Rep. Chris Smith, a New Jersey Republican who sponsored the bill. \nThe State Department said the U.S. was promoting accountability, and spokesman Mark Toner said the administration is \"supporting ongoing efforts to collect, document, preserve, and analyze evidence of atrocities for transitional justice processes.\" He provided no specifics. \n___ \nHinnant reported from Paris. Balint Szlanko in Erbil, Iraq, and Josh Lederman in Washington contributed. \n___ \nFollow Butler at http://twitter.com/desmondbutler and Hinnant at http://twitter.com/lhinnant \n___ \nEDITOR'S NOTE — This is the latest report in an Associated Press series, \"Islamic State: A Savage Legacy,\" that chronicles the casualties of the IS war that has killed thousands and displaced millions more. Previous reports can be found online at http://www.ap.org/explore/a-savage-legacy/ Advertisement", "external_links": [], "published": "2016-09-24T17:08:00.000+03:00", "crawled": "2016-09-24T18:29:11.512+03:00", "highlightTitle": ""}