{"organizations": [], "uuid": "13c8f5d8fe34a58ab8c8a3cf9ecd048dadf6b432", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 3, "shares": 3, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "latino.foxnews.com", "main_image": "http://global.fncstatic.com/static/v/all/img/fn_latino_128x128.png", "site_section": "http://feeds.latino.foxnews.com/home/feed", "section_title": "FOX News", "url": "http://latino.foxnews.com/latino/lifestyle/2016/09/13/road-trip-through-americas-inspiring-2-argentine-entrepreneurs/", "country": "US", "domain_rank": 185, "title": "Road trip through the Americas inspiring 2 Argentine entrepreneurs", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "Road trip through the Americas inspiring 2 Argentine entrepreneurs | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2016-09-13T03:00:00.000+03:00", "replies_count": 0, "uuid": "13c8f5d8fe34a58ab8c8a3cf9ecd048dadf6b432"}, "author": "EFE", "url": "http://latino.foxnews.com/latino/lifestyle/2016/09/13/road-trip-through-americas-inspiring-2-argentine-entrepreneurs/", "ord_in_thread": 0, "title": "Road trip through the Americas inspiring 2 Argentine entrepreneurs", "locations": [], "entities": {"persons": [{"name": "mariano sioli", "sentiment": "none"}, {"name": "ernesto \"che\" guevara", "sentiment": "none"}, {"name": "mariano", "sentiment": "none"}, {"name": "valentin", "sentiment": "none"}, {"name": "alberto granado", "sentiment": "none"}, {"name": "valentin abella", "sentiment": "none"}], "locations": [{"name": "americas", "sentiment": "none"}, {"name": "bogota", "sentiment": "none"}, {"name": "panama", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "medellin", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}, {"name": "ecuador", "sentiment": "none"}, {"name": "argentina", "sentiment": "none"}, {"name": "guatemala", "sentiment": "none"}, {"name": "latin america", "sentiment": "none"}, {"name": "peru", "sentiment": "none"}, {"name": "chile", "sentiment": "none"}, {"name": "colombia", "sentiment": "none"}, {"name": "buenos aires", "sentiment": "none"}], "organizations": [{"name": "efe", "sentiment": "positive"}]}, "highlightText": "", "language": "english", "persons": [], "text": "  EFE Bogota –   Five months ago, two young Argentines decided to tour the Americas in an SUV, much like their countrymen Ernesto \"Che\" Guevara and Alberto Granado did 64 years ago on a motorcycle. Their mission: to seek inspiration from the social companies they encountered on the road so that they can create one in Buenos Aires.\nValentin Abella and Mariano Sioli are partway through the journey they are calling \"Huellas por America\" (Footprints through the Americas), a trip they discuss on the social networks and on their Web site, where they explain how they are learning about \"organizations that work to influence social problems in an innovative way.\"\n\"Focusing on the social firms, we want to understand how, through creativity, talent and innovative action one can improve things for many people,\" says Valentin, a 23-year-old company administrator from Buenos Aires.\nHe said that when he finished college in 2015 he and Mariano decided to use their savings and the help of Assist Card to drive from California to the Argentine capital, through \"all the countries of Latin America and get to know different ... social companies ... (that) are trying to make a profit and also have a positive impact on their environment (by) solving some social problem.\"\nMariano is 22 and also a company administrator who had worked for a non-governmental organization as a volunteer in Buenos Aires and at a bank but quit to undertake the project.\nHe said that the idea of social companies \"is not new ... but it's becoming a trend and a bigger force where traditional companies are moving closer to this more hybrid model, more aware of everything that surrounds them and not only seeking profits.\"\n\"An example that really got our attention is an organization in Mexico devoted to making solar panels that they install in rural low-income homes where there's no access to the electric grid ... They do it via several business models where some sell or rent (the panels) or give them away free,\" the pair said.\n\"It's not aid, it's not generosity, it's not a donation. It's a service and it's a product given to society,\" Mariano concluded.\nAnother social company that impressed the pair was one called X2AI founded by a Dutch citizen that is developing an artificial intelligence application to deal with cases of post-traumatic stress, \"like a virtual psychologist, very applicable in cases of natural disasters or problems of refugee displacement but it can also be applied to daily life.\"\nTraveling in a 13-year-old Prado Toyota Land Cruiser with 223,000 kilometers (138,000 miles) on the odometer, in Mexico and Guatemala they ran across firms that build low-cost homes in conjunction with local communities and via a system of subsidies.\nThey arrived in Medellin, Colombia, from Panama and learned about the experience of Agrupa, which focuses on helping vulnerable communities via community work.\nNext on the agenda after Colombia are Ecuador and Peru, then Chile and Argentina.\n\"When we get to Buenos Aires, besides the memories and posts about the trip, we'll take all the ideas to get a social company started in Argentina and contribute to our own society perhaps in the area of renewable energy or low-cost homes, the impact of which on depressed populations really got our attention,\" they said.", "external_links": [], "published": "2016-09-13T03:00:00.000+03:00", "crawled": "2016-09-13T21:27:49.152+03:00", "highlightTitle": ""}