{"organizations": [], "uuid": "fc0dd18a0ce37fad9d791e103409de71b0430b60", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 59, "shares": 59, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/media2.foxnews.com/BrightCove/694940094001/2016/09/01/0/0/694940094001_5107594886001_090116-ff-trump-1280.jpg?ve=1", "site_section": "http://feeds.foxnews.com/foxnews/opinion", "section_title": "FOX News", "url": "http://www.foxnews.com/opinion/2016/09/01/on-immigration-trump-feeds-beast-that-is-his-base-and-squanders-opportunity.html", "country": "CH", "domain_rank": 185, "title": "Immigration speech: Trump feeds the beast (his base) and squanders an opportunity", "performance_score": 0, "site": "foxnews.com", "participants_count": 22, "title_full": "Immigration speech: Trump feeds the beast (his base) and squanders an opportunity | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2016-09-01T03:00:00.000+03:00", "replies_count": 24, "uuid": "fc0dd18a0ce37fad9d791e103409de71b0430b60"}, "author": "FoxNews.com", "url": "http://www.foxnews.com/opinion/2016/09/01/on-immigration-trump-feeds-beast-that-is-his-base-and-squanders-opportunity.html", "ord_in_thread": 0, "title": "Immigration speech: Trump feeds the beast (his base) and squanders an opportunity", "locations": [], "entities": {"persons": [{"name": "julie roginsky", "sentiment": "negative"}, {"name": "trump", "sentiment": "negative"}, {"name": "enrique pena nieto", "sentiment": "none"}, {"name": "peno nieto", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "mitt romney", "sentiment": "none"}, {"name": "romney", "sentiment": "none"}, {"name": "pena nieto", "sentiment": "none"}], "locations": [{"name": "united states", "sentiment": "none"}, {"name": "rio grande", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}, {"name": "arizona", "sentiment": "none"}, {"name": "mexico city", "sentiment": "none"}, {"name": "phoenix", "sentiment": "none"}], "organizations": [{"name": "trump", "sentiment": "none"}, {"name": "comprehensive communications group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Julie Roginsky \nPublished September 01, 2016 FoxNews.com     \nIn the span of a few hours on Wednesday, Donald Trump taught Mexico a lesson that domestic observers of his temperament have learned long ago: a foolish consistency is not only the hobgoblin of little minds but also the hobgoblin of would-be world leaders who refuse to deliver one message in private, only to double down on a self-defeating policy in public to feed the ravenous beast that is his base.\nIn Donald Trump’s world, bands of illegal immigrants are roaming our streets, killing our children, raping our women, changing the very culture of what made America great at some undisclosed moment in history.  Only a police state and a big, beautiful wall paid for by a foreign government can stop them.\nWhen Trump had an opportunity Wednesday to discuss payment for the wall with the man leading the nation that would presumably pay for it, he choked. I\nn order to burnish his statesman bona fides, he did not stare down Mexican President Enrique Pena Nieto at their meeting on what is arguably his most famous campaign plank: Mexican payment for a multi-billion dollar wall to stem the hoards of criminal foreigners coming here to lessen America’s greatness.\nIf Trump’s speech in Phoenix was designed to bring more Latinos into his coalition, his dark rhetoric about undocumented workers and continued insistence on splitting up families will not move the needle.\nAlso apparently not on the discussion docket between Trump and Pena Nieto: the location of the wall and whether it would be built in the middle of the Rio Grande, which delineates much of the border boundary between the United States and Mexico, or whether the United States intends to invade Mexico to build the wall on the Mexican side of the Rio Grande. (Presumably, part of making America great again does not involve building a wall on our side of the Rio Grande and cutting off American access to an important water source.)\nA few hours later, a much more loquacious Trump touched down on the northern side of the Rio Grande to deliver a speech that at once doubled down on his dystopian vision of immigration and provided a response to Pena Nieto, who claimed shortly after Trump’s departure that he had told him explicitly that Mexico would not pay for the wall.\n2016 Election Headquarters The latest headlines on the 2016 elections from the biggest name in politics. See Latest Coverage → \nThe speech tried to thread the needle between placating Trump’s primary base, which was promised a deportation force that would remove millions of undocumented workers from the country on day one of a Trump presidency, and the reality-based community, which has a sizeable say in the outcome of this year’s election.  \nTrump doubled down on his pledge to deport those who committed crimes, although he did not specify whether those crimes included those who received something as minor as a traffic ticket. \nHe doubled down on Mitt Romney’s 2012 suggestion that illegal immigrants self-deport back to their home countries if they wanted to return legally, without specifying exactly how he would encourage them to do that in light of their previous refusal to take Romney up on his offer.\nHe even doubled down on his insistence that Mexico pay for the wall, immediately overshadowing whatever presidential vibes he had been trying to emit as he stood at a podium next to a head of state in Mexico City hours earlier.\nIf Trump’s visit to Mexico was designed to reassure voters that he could be a statesman, his failure to get on the same page as Peno Nieto about whether payment for the wall had been discussed at their meeting showed that he was not ready for prime time.\nIf Trump’s speech in Phoenix was designed to bring more Latinos into his coalition, his dark rhetoric about undocumented workers and continued insistence on splitting up families will not move the needle.\nIf Trump’s entire exercise of the last twenty-four hours was to reassure his primary base that he was not wavering on an issue that is so crucial to them, he accomplished his mission. But it need not have taken a trip south of the border and a speech in ever-more-purple Arizona to convince them that he shares their views, even if those views are so out of step with what the vast majority of American voters support.\n\nJulie Roginsky has extensive experience in government, politics and public relations on both the federal and state levels. She is the president of Comprehensive Communications Group, a public relations and crisis communications firm that counts Fortune 500 corporations, elected officials and non-profit organizations among its clients. Follow her on Twitter @JulieRoginsky .", "external_links": [], "published": "2016-09-01T03:00:00.000+03:00", "crawled": "2016-09-02T01:20:06.064+03:00", "highlightTitle": ""}