{"organizations": [], "uuid": "4866c5d0af711cb9c1f367accebe6547632cdfe2", "thread": {"social": {"gplus": {"shares": 19}, "pinterest": {"shares": 5}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 348, "shares": 348, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/FNL/Politics/0/0/row%20of%20cars.jpg", "site_section": "http://feeds.latino.foxnews.com/home/feed", "section_title": "FOX News", "url": "http://latino.foxnews.com/latino/news/2016/09/13/undocumented-immigrants-paid-up-to-5k-for-driver-license-court-papers-show/", "country": "US", "domain_rank": 185, "title": "Undocumented immigrants paid up to $5K for a driver's license, court papers show", "performance_score": 3, "site": "foxnews.com", "participants_count": 1, "title_full": "Undocumented immigrants paid up to $5K for a driver's license, court papers show | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2016-09-13T03:00:00.000+03:00", "replies_count": 0, "uuid": "4866c5d0af711cb9c1f367accebe6547632cdfe2"}, "author": "Fox News Latino", "url": "http://latino.foxnews.com/latino/news/2016/09/13/undocumented-immigrants-paid-up-to-5k-for-driver-license-court-papers-show/", "ord_in_thread": 0, "title": "Undocumented immigrants paid up to $5K for a driver's license, court papers show", "locations": [], "entities": {"persons": [{"name": "jose a. ytuarte", "sentiment": "none"}, {"name": "ytuarte", "sentiment": "none"}, {"name": "albert flores", "sentiment": "none"}, {"name": "linda ann perez", "sentiment": "none"}], "locations": [{"name": "texas", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "west side", "sentiment": "none"}, {"name": "san antonio", "sentiment": "none"}], "organizations": [{"name": "dps", "sentiment": "none"}, {"name": "fbi", "sentiment": "none"}, {"name": "mistry", "sentiment": "none"}, {"name": "san antonio express-news", "sentiment": "none"}, {"name": "department of public safety", "sentiment": "none"}, {"name": "department of homeland security", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "  Getty Images \nA Texas man accused of facilitating driver’s licenses to undocumented immigrants during a two-year-period pleaded guilty to bribery charges on Monday.\nAccording to court records cited by the San Antonio Express-News, Azeez Mistry charged between $1,000 to $5,000 for each license, which he in turn got after paying $700 to a Department of Public Safety (DPS) clerk.\nMistry, 45, received at least $40,000 between May 2013 and July 2015, the paper said, citing court records and statements made during the hearing. He got the licenses from a DPS customer representative identified as Jose A. Ytuarte, the plea deal said.\n“They would wait until lunch to conduct the transactions so that other DPS clerks would be away,” it said.\nLike many states, in Texas only people residing lawfully in the state are allowed to get driver’s licenses. Foreign nationals are allowed to obtain driver’s licenses during the period of their visas, for which they must show their immigration status. To verify their lawful status, the DPS cross-checks their information with that of the Department of Homeland Security, which oversees immigration.\nYtuarte, who is 54, got around the rules by saying, falsely, that undocumented people who were applying were born in the United States, according to the newspaper.\nMistry faces sentencing on Dec. 7, while Ytuarte was already sentenced last week to 18 months in federal prison.\nThe scheme began to unravel after someone tipped off the FBI.\nAnd, according to statements from a prosecutor in court Monday, it appears the agencies still don’t know the full names of all the immigrants who got the licenses.\nThe newspaper said that Mistry’s lawyer, Albert Flores, would not comment except to say that there were no links to terrorists.\nFederal agencies became involved initially out of concern that perhaps terrorists had obtained licenses, which then enabled them to board airplanes and gain access to other things that require proof of lawful presence in the United States.\nSimilar corruption cases have cropped up elsewhere in Texas and the nation, as states have gotten tougher about making sure that people who are not authorized to be in the United States do not obtain driver’s licenses.\nIn July, for instance, Linda Ann Perez, a clerk at the DPS office in San Antonio’s West Side was sentenced to nearly four years in jail for taking $215,000 in bribes in exchange for entering fraudulent information into DPS computers so undocumented immigrants could get driver’s licenses, the newspaper said.\n ", "external_links": [], "published": "2016-09-13T03:00:00.000+03:00", "crawled": "2016-09-13T19:50:48.397+03:00", "highlightTitle": ""}