{"organizations": [], "uuid": "89a9357d595c070685d99b13e417454b4c987f1f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 2, "shares": 2, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/news/0/0/Latino-Population%20Growth%20Latino.jpg", "site_section": "http://feeds.latino.foxnews.com/home/feed", "section_title": "FOX News", "url": "http://latino.foxnews.com/latino/news/2016/09/08/growth-us-latino-population-slows-study-finds-due-to-falling-immigration-birth/", "country": "US", "domain_rank": 185, "title": "Growth of U.S. Latino population slows, study finds, due to falling immigration, birth rates", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "Growth of U.S. Latino population slows, study finds, due to falling immigration, birth rates | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2016-09-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "89a9357d595c070685d99b13e417454b4c987f1f"}, "author": "Fox News Latino", "url": "http://latino.foxnews.com/latino/news/2016/09/08/growth-us-latino-population-slows-study-finds-due-to-falling-immigration-birth/", "ord_in_thread": 0, "title": "Growth of U.S. Latino population slows, study finds, due to falling immigration, birth rates", "locations": [], "entities": {"persons": [{"name": "frey", "sentiment": "none"}, {"name": "johnson", "sentiment": "none"}, {"name": "william h. frey", "sentiment": "none"}, {"name": "kenneth m. johnson", "sentiment": "none"}, {"name": "franco", "sentiment": "none"}, {"name": "mauricio castro", "sentiment": "none"}, {"name": "rogelio franco", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "s.d.", "sentiment": "none"}, {"name": "luzerne county", "sentiment": "none"}, {"name": "duchesne county", "sentiment": "none"}, {"name": "virginia", "sentiment": "none"}, {"name": "south carolina", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}, {"name": "new mexico", "sentiment": "none"}, {"name": "south", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "north dakota", "sentiment": "none"}, {"name": "beadle county", "sentiment": "none"}, {"name": "kyle", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}, {"name": "burleigh county", "sentiment": "none"}, {"name": "north carolina", "sentiment": "none"}, {"name": "tennessee", "sentiment": "none"}, {"name": "utah", "sentiment": "none"}, {"name": "pennsylvania", "sentiment": "none"}, {"name": "colorado", "sentiment": "none"}, {"name": "salt lake city", "sentiment": "none"}, {"name": "nevada", "sentiment": "none"}, {"name": "south dakota", "sentiment": "none"}], "organizations": [{"name": "la india bonita mexic", "sentiment": "negative"}, {"name": "pew research center", "sentiment": "none"}, {"name": "u.s. census bureau", "sentiment": "none"}, {"name": "brookings institution", "sentiment": "none"}, {"name": "associated press", "sentiment": "none"}, {"name": "north carolina congress of latino organizations", "sentiment": "none"}, {"name": "university of new hampshire", "sentiment": "none"}, {"name": "entre latinos", "sentiment": "none"}, {"name": "ap", "sentiment": "none"}, {"name": "facebook  follow us on twitter & instagram", "sentiment": "none"}, {"name": "carsey school of public policy", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "  Fox News Latino FILE - In this May 1, 2015 file photo, customers eat outside La India Bonita Mexican Restaurant in Kyle, S.D., on the Pine Ridge Indian Reservation. The population growth of U.S. Latinos is slowing thanks to lower immigration and declining birthrates, although states like North Dakota, South Dakota, and Tennessee are seeing Latino population spikes, according to a Pew Research Center study released Thursday, Sept. 8, 2016. (AP Photo/Russell Contreras, File) Copyright 2016 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistribu \nA slowdown in immigration – including a reverse migration of Mexicans from the United States back to Mexico – as well as a decline in births among U.S. Latinos has led to an overall slower growth and dispersion of the community, according to a new study.\nLatino population growth – once the fastest in the nation – now is topped by that of Asian-Americans. The Asian population growth rate was 3.4 percent from 2007 to 2014, compared to that of Latinos, which was 2.8 percent in that period. The Hispanic growth rate was lower in the most recent years studied, from 2010 to 2014 – 2.4 percent, according to the Pew Research Center study, which analyzed U.S. Census Bureau data.\nConsider that in the 1990s, Latino population growth was 5.6 percent annually, declining to 4.4 percent between 2000 and 2007.\nThe growth of Latinos, and their spreading geographically beyond the one-time hubs of Florida, California and Texas, has resulted in the spread of their cultural and even political influence in small towns, suburbs and rural areas across the country.\nIn 2012, 17 states had kindergarten student populations that were at least 20 percent Latino, up from just eight states in 2000, according to the study.\nHispanics' political clout, as a result, has grown in battleground states such as Colorado, Nevada, Virginia and North Carolina, the study noted.\nCounties in the South continued to account for the largest share of the nation's Hispanic population growth — 43 percent between 2007 and 2014. Among the other fastest-growing counties for Latinos were Luzerne County in Pennsylvania, Beadle County in South Dakota, Duchesne County in Utah and Burleigh County in North Dakota.\n\"Latinos are coming to Utah because the government here is doing a lot to create jobs,\" said Rogelio Franco of Entre Latinos – a Salt Lake City, Utah, advocacy group that works to integrate Hispanics into the state. EntreLatinos was not affiliated with the study.\nWilliam H. Frey, a demographer with the Brookings Institution's Metropolitan Policy Program, said the reduced growth rate is largely a factor of the economy. A slower economy is influencing families to hold off on having more children, and it's also discouraging migration amid stronger border enforcement, he said.\nKenneth M. Johnson, a senior demographer at the University of New Hampshire's Carsey School of Public Policy, said U.S. Hispanic women between the ages of 20 and 24 have seen a 36 percent decline in birthrates.\n\"That's by far the largest decline of any other group,\" Johnson said.\nDespite slowing population growth, Latinos still accounted for 54 percent of the nation's population growth between 2000 and 2014, according to the nonpartisan Pew Research Center.\nRegional growth patterns also have changed some following the economic downturn of 2007 reflecting the changing economies of states, the study found.\nFranco, of Entre Latinos, said he thinks the declining birthrate is a result of Latino millennials holding off on having children while pursuing their education.\n\"They are planning more,\" Franco said. \"They are focusing on other things.\"\nThe growth in North Dakota's statewide Latino population nearly doubled to 18,000, making it the state with the highest Hispanic growth rate over the seven years studied. Though small in numbers compared to states like California and Texas, the rise in Latino residents has put pressures on local governments and non-profit groups to accommodate the new residents.\nFor example, in 2014 Catholic nuns from Mexico were sent to North Dakota to help serve new Hispanic parishioners.\nNorth Dakota had experienced an oil boom until recently, attracting workers from around the country. It remains one of the least diverse states in the nation.\n\"Latino population growth has become less concentrated in counties with historically large Latino populations and whose Latino population grew by at least 10,000,\" the study's authors wrote.\nThough growth has slowed in the last seven years, the Latino population in the South has exploded when examined over 14 years.\nFrom 2000 to 2014, Hispanic populations in Tennessee and South Carolina, for example, nearly tripled.\nNorth Carolina also saw its population spike 136 percent since 2000, the report said.\nMauricio Castro, an organizer with the North Carolina Congress of Latino Organizations, said immigrants coming to the region tend to work in the construction or service industry.\nStill, between 2007 and 2014, nearly 40 counties experienced declines in the percentage of Latinos. Most of those counties were in Colorado, New Mexico and Texas — states with traditionally large Hispanic populations.\nFrey said once the U.S. economy starts picking up, he expects to see a return of higher rates of immigration and increase births.\n\"This is not the end of Latino growth in the United States by any means,\" Frey said.\nBased on reporting by the Associated Press. \nLike us on Facebook \nFollow us on Twitter & Instagram", "external_links": [], "published": "2016-09-08T03:00:00.000+03:00", "crawled": "2016-09-09T00:23:11.861+03:00", "highlightTitle": ""}