{"organizations": [], "uuid": "cd5c55a4c3c7da987ca260710a7592acdeb9e50b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbsnews.com", "main_image": "http://cbsnews1.cbsistatic.com/hub/i/2016/09/02/82a46682-72f3-4512-bdda-a4f8838f65b7/star-trek-tos-the-city-on-the-edge-of-forever.jpg", "site_section": "http://www.cbsnews.com/latest/rss/sunday-morning", "section_title": "Sunday Morning - CBSNews.com", "url": "http://www.cbsnews.com/pictures/the-best-and-worst-original-star-trek-episodes/", "country": "US", "domain_rank": 584, "title": "The best (and worst) original \"Star Trek\" episodes", "performance_score": 0, "site": "cbsnews.com", "participants_count": 0, "title_full": "The best (and worst) original \"Star Trek\" episodes", "spam_score": 0.0, "site_type": "news", "published": "2016-09-03T04:34:00.000+03:00", "replies_count": 0, "uuid": "cd5c55a4c3c7da987ca260710a7592acdeb9e50b"}, "author": "", "url": "http://www.cbsnews.com/pictures/the-best-and-worst-original-star-trek-episodes/", "ord_in_thread": 0, "title": "The best (and worst) original \"Star Trek\" episodes", "locations": [], "entities": {"persons": [{"name": "will kirk", "sentiment": "none"}, {"name": "william windom", "sentiment": "none"}, {"name": "khan", "sentiment": "none"}, {"name": "garr", "sentiment": "none"}, {"name": "mark lenard", "sentiment": "none"}, {"name": "genghis khan", "sentiment": "none"}, {"name": "john gill", "sentiment": "none"}, {"name": "robert lansing", "sentiment": "none"}, {"name": "ahab", "sentiment": "none"}, {"name": "lazarus", "sentiment": "none"}, {"name": "scotty", "sentiment": "none"}, {"name": "alice", "sentiment": "none"}, {"name": "surak", "sentiment": "none"}, {"name": "james cagney", "sentiment": "none"}, {"name": "fredric brown", "sentiment": "none"}, {"name": "david morgan", "sentiment": "none"}, {"name": "gene roddenberry", "sentiment": "none"}, {"name": "spock", "sentiment": "none"}, {"name": "hitler", "sentiment": "none"}, {"name": "horta", "sentiment": "none"}, {"name": "sandra smith", "sentiment": "none"}, {"name": "landru", "sentiment": "none"}, {"name": "alexander", "sentiment": "none"}, {"name": "gorn", "sentiment": "none"}, {"name": "janice lester", "sentiment": "none"}, {"name": "james t. kirk", "sentiment": "none"}, {"name": "kirk", "sentiment": "none"}, {"name": "lester", "sentiment": "none"}, {"name": "leonard nimoy", "sentiment": "none"}, {"name": "napoleon", "sentiment": "none"}, {"name": "sarek", "sentiment": "none"}, {"name": "gary seven", "sentiment": "none"}, {"name": "teri garr", "sentiment": "none"}, {"name": "khan noonien singh", "sentiment": "none"}, {"name": "sigma iotia ii", "sentiment": "none"}, {"name": "ricardo montalban", "sentiment": "none"}, {"name": "john christopher", "sentiment": "none"}, {"name": "caesar", "sentiment": "none"}, {"name": "william shatner", "sentiment": "none"}, {"name": "commodore matt decker", "sentiment": "none"}, {"name": "tommy", "sentiment": "none"}, {"name": "gill", "sentiment": "none"}, {"name": "theodore sturgeon", "sentiment": "none"}, {"name": "mccoy", "sentiment": "none"}, {"name": "mudd", "sentiment": "none"}, {"name": "abraham lincoln", "sentiment": "none"}, {"name": "roger perry", "sentiment": "none"}, {"name": "roger c. carmel", "sentiment": "none"}, {"name": "harcourt fenton mudd", "sentiment": "none"}, {"name": "decker", "sentiment": "none"}], "locations": [{"name": "united states", "sentiment": "none"}, {"name": "spock", "sentiment": "none"}, {"name": "gorn", "sentiment": "none"}, {"name": "carmel", "sentiment": "none"}, {"name": "earth", "sentiment": "none"}, {"name": "neutral zone", "sentiment": "none"}, {"name": "rome", "sentiment": "none"}, {"name": "uhuru", "sentiment": "none"}, {"name": "botany bay", "sentiment": "none"}, {"name": "kirok", "sentiment": "none"}, {"name": "sulu", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "yankees", "sentiment": "none"}, {"name": "spock", "sentiment": "none"}, {"name": "nazis", "sentiment": "none"}, {"name": "magna roma", "sentiment": "none"}, {"name": "nbc", "sentiment": "none"}, {"name": "federation", "sentiment": "none"}, {"name": "paramount television", "sentiment": "none"}, {"name": "starship enterprise", "sentiment": "none"}, {"name": "romulans", "sentiment": "none"}, {"name": "air force", "sentiment": "none"}, {"name": "starfleet", "sentiment": "none"}, {"name": "ekos", "sentiment": "none"}, {"name": "cbs", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Next These are the voyages ... \nPremiering on September 8, 1966, “Star Trek” was on the air for just three years on NBC, but the series about the crew of the Starship Enterprise, starring William Shatner and Leonard Nimoy, lived long and prospered in syndication, before making the jump to the big screen. \nOnly 79 episodes were created for the original series, with many gems of sci-fi entertainment (and some, not-so-much). \nClick though our gallery to check out - in chronological order - the 20 best “Star Trek” episodes (and the 10 worst). \nBy CBSNews.com senior producer David Morgan Credit: Paramount Television \n“The Naked Time” \nFirst aired: September 29, 1966 \nThe camaraderie of the Enterprise crew was one of the show’s greatest selling points, and was evident fairly early in its run. But this episode showed when the starship crew was falling apart - blighted by a virus that provokes irrational and highly emotional behavior among those infected, putting the entire ship in jeopardy. Most memorable was Sulu’s turn as a swashbuckling fencer, foiled by a Vulcan nerve pinch. Credit: Paramount Television \n“Mudd’s Women” \nFirst aired: October 13, 1966 \nA con man, Harcourt Fenton Mudd (Roger C. Carmel), is brought on board the Enterprise along with his human cargo: three voluptuous women who, it turns out, are made staggeringly beautiful thanks to an illegal “Venus drug.” So why are they opting for lives as mail-order brides to settlers on a distant planet? While the plot is not all that great, Mudd, as played by Carmel, is a delight - so much so that he returned in a later episode, on a planet filled with beautiful female robots. Credit: Paramount Television \n“The Corbomite Maneuver” \nFirst aired: November 10, 1966 \nIn the uncharted regions of space, a good and resourceful ship’s caption must also be good at poker - calling the bluff of your adversary. That is especially important when confronted by a gigantic (and I mean GIGANTIC) spaceship whose captain threatens you with annihilation. Credit: Paramount Television \n“Balance of Terror” \nFirst aired: December 15, 1966 \nIt was in this episode (inspired by a World War II submarine thriller, “The Enemy Below”) that we learn a bit of Vulcan history, with the Enterprise encountering a Romulan warship. The Romulans have attacked several Federation outposts near the Neutral Zone, but have never been seen, before a transmission is intercepted, revealing that Romulans look just like Vulcans! As crewmembers question the loyalty of First Officer Spock (whose ancestors have blood ties to Romulans), Kirk must play cat-and-mouse with the alien ship (which is hidden by a cloaking device) before it can retreat back into Romulan territory. Credit: Paramount Television \n“Shore Leave” \nFirst aired: December 29, 1966 \nSci-fi author Theodore Sturgeon penned this memorable tale of a planet where people’s thoughts and memories suddenly appear in the flesh. Alice and the White Rabbit? A samurai? A knight on horseback? A World War II fighter plane? When crewmembers on shore leave start dying, Kirk has to get to the bottom of it. The answer? As Spock would say, “fascinating.” Credit: Paramount Television \n“Tomorrow Is Yesterday” \nFirst aired: December 29, 1966 \nIn “The Naked Time” an experiment involving anti-matter threw the Enterprise back in time, by a matter of days. In this episode, an encounter with a black hole plunges the Enterprise back to 20th century Earth, where it is seen by an Air Force pilot scrambled to track the UFO. Beamed aboard the Enterprise, Captain John Christopher (Roger Perry) is distraught that he can’t be returned (he’s already seen too much). But then the effects of potentially changing future history by his absence have to be weighed - and Kirk finds there is no easy solution. Credit: Paramount Television \n“The Return of the Archons” \nFirst aired: February 9, 1967 \nA community on planet Beta III exhibits the characteristics of a hive mind, when the townspeople en masse attack Kirk and crew. They are in thrall to their omniscient leader, Landru, and seek to absorb anyone who is “not of the body.” The climactic reveal became something of a tired fixture in “Star Trek” (in which an all-powerful being is shown to actually be a robot, a computer, or a testy little kid). But a shot of the townspeople collectively stooping to pick up rocks - the better to “greet” their visitors - is chilling. Credit: Paramount Television \n“Space Seed” \nFirst aired: February 16, 1967 \nThe Enterprise comes across a derelict ship, the SS Botany Bay, which carries the hibernating bodies of dozens of humans from late 20th century Earth. Turns out they are genetically-modified beings responsible for Earth’s Eugenics War. Their leader, Khan Noonien Singh (Ricardo Montalban), is awakened from hibernation, which is a bad idea - he frees his followers and tries to take over the Enterprise. \nWhat was a nifty one-off episode would inspire the best of the “Star Trek” movies, 1982’s “Star Trek II: The Wrath of Khan,” when Khan and his people, living in exile on a desert planet, commandeer a passing ship and hunt down the man responsible for their plight: James T. Kirk! Credit: Paramount Television \n“The Devil in the Dark” \nFirst aired: March 9, 1967 \n“Star Trek” did not go in much for horror, and used the ugly-alien-monster-that-must-be-killed trope less than other sci-fi series. But this tale of a mining colony where workers are attacked and killed by a mysterious creature was both an engrossing encounter with an unknown threat, and a story of learning to co-exist with other creatures, even those whose appearance may be repellent (and that’s how the alien Horta views humans). Credit: Paramount Television \n“The City on the Edge of Forever” \nFirst aired: April 6, 1967 \nThe hands-down best episode of “Star Trek” is a riveting tale of time travel and altered history. When McCoy steps through a time portal back to Depression-era Earth, he saves the life of a peace activist in a traffic accident. That good deed unfortunately allows the Nazis to triumph during World War II, altering the course of history, and threatening the very existence of the Enterprise crew. Following McCoy, Kirk realizes that to set things right, the very woman he has fallen for back in the 1930s must die. Credit: Paramount Television \n“Amok Time” \nFirst aired: September 15, 1967 \nVulcan biology - as in the need to mate every seven years, or die - makes it imperative for Kirk to risk his professional career to get Spock back to his home planet, and to the young bride to whom his first officer had been betrothed. But Vulcan traditions about marriage and procreation are much more complicated, especially when the bride is allowed to choose a champion to fight her intended to the death - a contest that pits Spock against Kirk! Credit: Paramount Television \n“Mirror, Mirror” \nFirst aired: October 6, 1967 \n“Evil twins” became a mainstay of TV pop culture, allowing actors to play “bad” versions of their characters. Here, a transporter malfunction sends Kirk, McCoy, Uhuru and Scotty into a parallel universe, but one in which the Federation is an evil empire, with starship crews employing assassination as a form of career advancement. Will Kirk, etc. survive, or will “evil Spock” have the last laugh? Credit: Paramount Television \n“The Doomsday Machine” \nFirst aired: October 20, 1967 \nGuest star William Windom gives a terrific performance as Commodore Matt Decker, commander of the USS Constellation, who witnessed his entire crew destroyed by a giant, planet-eating machine. Like Ahab hunting the white whale, Decker commandeers the Enterprise and engages in a suicidal mission to destroy the machine once and for all. Credit: Paramount Television \n“Journey to Babel” \nFirst aired: November 17, 1967 \nThe difficult family dynamics of Spock - whose father was Vulcan and mother human - are explored in this story featuring Mark Lenard as Sarek, a Vulcan ambassador en route to a diplomatic conference. When an assassin murders one of the traveling dignitaries, the investigation opens the wounds of a father-son relationship, leading to a kind of reconciliation. Credit: Paramount Television \n“The Trouble With Tribbles” \nFirst aired: December 29, 1967 \nA fan favorite, this was the first “Trek” episode played for laughs. An interstellar salesman’s pet tribbles - purring balls of fur that love to multiply - become a real pain for Kirk, who also has to deal Klingon saboteurs, obnoxious space diplomats, and crew members who brawl in bars. Credit: Paramount Television \n“A Piece of the Action” \nFirst aired: January 12, 1968 \nAnother humorous episode - and it is heartening to know that old gangster movies would be familiar to 23rd century space travelers like Kirk, who spouts the patois of James Cagney. Unlike other developing alien worlds which must be protected from knowledge about the Federation via the Prime Directive (so as not to taint them), the “gangsters” on Sigma Iotia II are fully aware of outside civilizations - they’ve designed their entire culture on a book, “Chicago Mobs of the Twenties,” brought there by an Earth ship 100 years earlier. When Kirk, Spock and McCoy beam down to the planet, they find a mob boss who wants to trade up from Tommy guns to phasers, leaving Kirk to sell the Federation’s protection racket. After all, Sigma Iotia II is a nice planet - you wouldn’t want something to happen to it. Credit: Paramount Television \n“The Immunity Syndrome” \nFirst aired: January 12, 1968 \nAn entire ship manned by Vulcans is destroyed, creating a psychic blow that hits Spock hard. But he recovers enough to then investigate the cause of that destruction: a giant, single-cell organism that is eating away at space, destroying worlds and threatening the entire galaxy. It was one threat that didn’t have to be reasoned with, tricked, negotiated with, seduced or tackled in a fistfight - just destroyed (if possible). Credit: Paramount Television \n“Bread and Circuses” \nFirst aired: March 15, 1968 \nWhat is that member of the crew of the SS Beagle doing in a mysterious TV broadcast, engaged in a deadly gladiatorial fight in a Rome that never fell? Kirk, Spock and McCoy investigate, and find the society on the planet Magna Roma mirroring the glories of ancient Rome, but with the technological advances of 20th century Earth, such as color television. Some clever satire on the fickleness of TV programming, as the Enterprise officers are forced to fight before the cameras, but also a “Twilight Zone”-like twist, when the rebellious Children of the Sun are revealed to worship something other than that star in the sky. Credit: Paramount Television \n“The Enterprise Incident” \nFirst aired: September 27, 1968 \nIn a deft bit of intergalactic espionage and military brinkmanship, the Enterprise enters the Neutral Zone, only to be surrounded by three Romulan ships. Kirk and Spock are brought before the Romulan commander, whereupon Spock outs Kirk as having intentionally intruded on Romulan space. Or did he? Credit: Paramount Television \n“The Tholian Web” \nFirst aired: November 15, 1968 \nEngaged in a rescue mission when Captain Kirk is stranded in a space-time rift, Spock must also contend with the Tholians, whose entrance has further distorted the inter-dimensional rift, jeopardizing Kirk and putting the entire crew at risk. The alien not only looks cool; their ships’ energy field - a criss-cross web entrapping the Enterprise - is one of the most memorable visuals in the series. Credit: Paramount Television \n“Arena” \nFirst aired: January 19, 1967 \nFond memories of Kirk’s one-on-one battle with a Gorn, adapted from Fredric Brown’s classic short story, collide with the realization that this episode doesn’t make much sense. Never mind the monotony of their faceoff as the Enterprise crew watches, helpless, to see whether Kirk will be victorious, sparing their lives from the alien referee forcing the two ships’ captains to duke it out, ‘cause he can. Kirk ultimately downs the slow-moving Gorn by mixing mineral deposits he comes across to make gunpowder, conveniently recalling the chemical composition of something which had been out of use for at least 200 years. And when Kirk refuses to kill the Gorn, everyone’s lives are spared, proving humans are more compassionate than the higher life forms that toy with us for their own amusement. Credit: Paramount Television \n“The Alternative Factor” \nFirst aired: March 30, 1967 \nThe Enterprise picks up a man, named Lazarus, who claims to have pursued his enemy across centuries and into a parallel universe. The “anti-Lazarus,” possibly a form of anti-matter, spells disaster for both universes should the two ever come into contact. A plethora of plot holes and ridiculous dialogue (“He’ll kill us all if you don’t kill him first! Kill! Kill! Kill! Kill! Kill!”) bring this one under. Credit: Paramount Television \n“Return to Tomorrow” \nFirst aired: February 9, 1968 \nA disembodied consciousness that lives in a sphere within a long-dead planet enters the body of Captain Kirk, and then conscripts the Enterprise’s crew to construct humanoid robots that his fellow intangible beings can inhabit, ‘cause who doesn’t prefer a flesh-and-blood body to a glowing orb? Credit: Paramount Television \n“Patterns of Force” \nFirst aired: February 16, 1968 \nOne of the lesser “Trek” episodes in which Kirk and Spock explore an alien world that resembles Earth’s past. On the planet Ekos, a Starfleet academic named John Gill has replicated a society mimicking Nazi Germany, on the rich assumption that the nastier elements of Hitler’s Third Reich - genocide, oppression, war-mongering - can be avoided. Tell that to the people of neighboring planet Zeon, whose population is threatened with a “final solution” brought by Gill’s adherents. Oh, and that Prime Directive? Once it’s been broken, apparently Federation crew members are free to up and join a local resistance, interfering just enough to bring down the regime and save Zeon. Credit: Paramount Television \n“The Omega Glory” \nFirst aired: March 1, 1968 \nYes, this aired during the Cold War. And a similar conflict was also taking place light-years away, on the planet Omega IV, where a long-ago parallel Cold War led to the near-annihilation of “Yangs” and “Kohms.” (Yankees and Communists, get it?) Kirk and crew discover remnants of the Yang society carrying Old Glory and honoring faded documents that read exactly like the United States’ Constitution. Because in a universe with potentially millions of habitable planets, why wouldn’t one of them also develop a system of representative democracy that mirrors ours, word for word, right down to the Preamble? Credit: Paramount Television \n“Assignment: Earth” \nFirst aired: March 29, 1968 \nGene Roddenberry’s pilot for a proposed series about an alien secret agent on 1960s Earth wasn’t helped by shoehorning it into the “Star Trek” universe, forcing Kirk and Spock to travel back in time to the ‘60s. There they basically watched helplessly as Gary Seven (Robert Lansing), his ditsy secretary (Teri Garr), and a cat engage in some subterfuge that would - Seven claims - prevent World War III. One rocket explosion later, all is fine, and Seven’s cat is revealed to be a voluptuous woman, making Garr appropriately jealous. Credit: Paramount Television \n“Spock’s Brain” \nFirst aired: September 20, 1968 \n“Star Trek” was cancelled after two seasons, but a letter-writing campaign by passionate fans helped persuade NBC to bring it back. The gratification of the cast at having their jobs again must have been met with downcast expressions once they read the script for this third season episode, in which a pretty female alien beams aboard the Enterprise and steals the brain out of Spock’s head. Why? To run her planet’s infrastructure, naturally. After retrieving the errant organ, and with the body of Spock offering guidance, Dr. McCoy performs a “reverse brain transplant,” and all is well. The worst “Trek” episode of all time. Credit: Paramount Television \n“The Paradise Syndrome” \nFirst aired: October 4, 1968 \nYet another “alien planet mimics Earth’s past” episode, this time featuring a civilization which resembles Native American tribes, except for that strange metallic obelisk. Kirk is “kidnapped” by the obelisk, suffering amnesia and waking up as “Kirok,” whose strange space-man ways lead him to be accepted as the tribe’s medicine man. And while he may have forgotten who he is, Kirok is still Kirk, getting a comely native girl pregnant. Meanwhile, an asteroid is about to destroy the entire planet. Will Kirk get his memory back in time to save everyone? Credit: Paramount Television \n“The Savage Curtain” \nFirst aired: March 7, 1969 \n“Star Trek” would often tie figures from Earth’s past to characters of the future (one list of history’s failed despots included Alexander, Caesar, Napoleon, Hitler and “Krotus”). “The Savage Curtain” takes this one step further, by bringing to life our greatest president, Abraham Lincoln, and Surak, “the father of Vulcan civilization,” to join Kirk and Spock in a cage match to the death against exemplars of evil: Genghis Khan, 21st century Earth warlord Colonel Green, the Klingon Kahless, and Zora, a woman not to be trusted. The talking rock that officiates the experiment in good vs. evil figures the better philosophy will vanquish their rivals, but ultimately the bad guys just quit and run away. Boooo! Credit: Paramount Television \n“Turnabout Intruder” \nFirst aired: June 3, 1969 \nThe last new episode of the Original Series, alas, saw the show off on a down note, and a surprisingly anti-feminist one at that. An old flame of Kirk’s, Dr. Janice Lester (Sandra Smith), believing that being a woman has kept her from breaking the glass ceiling of starship command, goes bonkers and decides to steal Kirk’s body and take over the Enterprise. As her mind is transferred to Kirk’s body, his mind enters hers. Fortunately a Vulcan mind meld contradicts the old saw that men can never understand what’s on a woman’s mind, when Spock discovers his captain inside Lester’s head. Credit: Paramount Television The Crew of the Enterprise \n“May the wind be at our backs.” \nThe “Star Trek” franchise marks its 50th anniversary with a new feature film (“Star Trek Beyond”) and, in January 2017, a new TV series on CBS All Access, “Star Trek: Discovery.” \nBy CBSNews.com senior producer David Morgan", "external_links": [], "published": "2016-09-03T04:34:00.000+03:00", "crawled": "2016-09-03T19:05:27.225+03:00", "highlightTitle": ""}