{"organizations": [], "uuid": "6555dab0d6127552534db08b83391574bc8b901a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sltrib.com", "main_image": "http://www.sltrib.com/csp/mediapool/sites/shared/assets/img/tribune1200x630.jpg", "site_section": "http://www.sltrib.com/rss/feed/?sec=/Contents/&level=0", "section_title": "Contents - The Salt Lake Tribune", "url": "http://www.sltrib.com/blogs/outofcontext/4375032-155/news-roundup-republicans-now-favored-to", "country": "US", "domain_rank": 8518, "title": "News roundup: Republicans now favored to keep control of the Senate", "performance_score": 0, "site": "sltrib.com", "participants_count": 1, "title_full": "News roundup: Republicans now favored to keep control of the Senate | The Salt Lake Tribune", "spam_score": 0.0, "site_type": "news", "published": "2016-09-20T14:21:00.000+03:00", "replies_count": 0, "uuid": "6555dab0d6127552534db08b83391574bc8b901a"}, "author": "Tribune Political Reporters", "url": "http://www.sltrib.com/blogs/outofcontext/4375032-155/news-roundup-republicans-now-favored-to", "ord_in_thread": 0, "title": "News roundup: Republicans now favored to keep control of the Senate", "locations": [], "entities": {"persons": [{"name": "dabakis", "sentiment": "neutral"}, {"name": "jay faison", "sentiment": "none"}, {"name": "troy rawlings", "sentiment": "none"}, {"name": "john dougall", "sentiment": "none"}, {"name": "jeremy johnson", "sentiment": "none"}, {"name": "jackie biskupski", "sentiment": "none"}, {"name": "mary ellen", "sentiment": "none"}, {"name": "barack obama", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "scott beck", "sentiment": "none"}, {"name": "peter thomson", "sentiment": "none"}, {"name": "gary herbert", "sentiment": "none"}, {"name": "jim dabakis", "sentiment": "none"}, {"name": "angie welling", "sentiment": "none"}, {"name": "sean reyes", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "thomas burr", "sentiment": "none"}, {"name": "jason chaffetz", "sentiment": "none"}, {"name": "pat bagley", "sentiment": "none"}, {"name": "spencer cox", "sentiment": "none"}, {"name": "zoe woolf mcginn", "sentiment": "none"}, {"name": "muhammadu buhari", "sentiment": "none"}, {"name": "david damschen", "sentiment": "none"}, {"name": "mia love", "sentiment": "none"}, {"name": "donald trump jr.", "sentiment": "none"}, {"name": "scott", "sentiment": "none"}], "locations": [{"name": "iran", "sentiment": "none"}, {"name": "visit salt lake", "sentiment": "none"}, {"name": "nigeria", "sentiment": "none"}, {"name": "tehran", "sentiment": "none"}, {"name": "> salt lake city", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "twitter.com", "sentiment": "none"}, {"name": "capitol", "sentiment": "none"}, {"name": "davis county", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}, {"name": "chelsea/new jersey", "sentiment": "none"}, {"name": "new york city", "sentiment": "none"}, {"name": "salt lake county", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "st. george", "sentiment": "none"}, {"name": "fiji", "sentiment": "none"}, {"name": "north carolina", "sentiment": "none"}, {"name": "utah", "sentiment": "none"}], "organizations": [{"name": "senate", "sentiment": "negative"}, {"name": "associated press and center for public integrity", "sentiment": "none"}, {"name": "utah transit authority", "sentiment": "none"}, {"name": "jordan education foundation economic summit", "sentiment": "none"}, {"name": "un", "sentiment": "none"}, {"name": "achieving prosperity and securing america", "sentiment": "none"}, {"name": "general assembly", "sentiment": "none"}, {"name": "kutv", "sentiment": "none"}, {"name": "westminster college", "sentiment": "none"}, {"name": "flds", "sentiment": "none"}, {"name": "fbi", "sentiment": "none"}, {"name": "oversight committee", "sentiment": "none"}, {"name": "isis", "sentiment": "none"}, {"name": "gop", "sentiment": "none"}, {"name": "united nations general assembly", "sentiment": "none"}, {"name": "uta", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Republicans now favored to keep control of the Senate. Iran officials concerned about Sen. Dabakis’ visit to Tehran. UTA disbands committees, but committee members still meet.\n\nHappy Tuesday. Senate Republicans’ 2016 looked tough from the very beginning. And it didn’t get any easier when Donald Trump won the GOP nomination. And yet today, Republicans are favored to retain control of the Senate in November -- albeit slightly. And that’s because a tightening presidential race and strong performances by several GOP incumbents have moved some targeted seats into safer territory. [ WaPost ]\n\nTopping the news: Architects designing a new Utah state prison said Monday they’re trying to cherry pick the best ideas from hundreds of other modern correctional facilities around the country to create a campus that focuses on the rehabilitation of inmates so they don’t commit more crimes and return. [ APviaTrib ] [ DNews ] [ Fox13 ] [ KUER ]\n\n-> Some Iranian officials expressed concern about a visit to Tehran by state Sen. Jim Dabakis, who says, for his part, he was invited and was surprised by the controversy. [ Trib ] [ APviaDNews ] [ KUTV ]\n\n-> The Utah Transit Authority has disbanded all committees but the executive committee while it navigates restructuring of the agency but has been holding informal meetings that are closed to the public with all the same members of the dissolved committees. [ Trib ]\n\n-> North Carolina conservative entrepreneur Jay Faison and his group ClearPath have praised Rep. Mia Love as a Republican battling climate change, pledging to spend $100,000 in ads for Love. [ Trib ]\n\nTweets of the day: From @ heydudekyle : \"Here @Skittles I got you. ‘For every pack of Skittles you buy between now and Nov. 8, we’ll donate $1 to support refugees.’\"\n\nFrom @ Skittles : \"Every stranger is just a friend you haven’t met who might share their Skittles with you.\"\n\nFrom @ presidentjlh : \"Really excited about my candidate’s expertise in the area of vague concepts.\"\n\nFrom @ aedwardslevy : \"What’s really great is you can rearrange the phrases without losing meaning: Achieving Direction, Securing Prosperity, America’s America\"\n\nHappy Birthday: Belated birthday wishes to Scott Beck, president and CEO of Visit Salt Lake, who turned a year younger on Monday -- and congratulations to Scott and his new bride, Angie Welling, who married on Saturday at a pop-up wedding.\n\nIn other news: The Associated Press and Center for Public Integrity investigate drug producers working and donating money against state-level opioid reform legislation in a two-part story. [ Trib ] [ Trib ]\n\n-> The parents of St. George businessman Jeremy Johnson, who is serving an 11-year prison term for fraud, sent a letter to Attorney General Sean Reyes urging him to fund Davis County Attorney Troy Rawlings’ inquiry into a federal grand jury on the scandal that sent their son to prison. [ Trib ]\n\n-> Salt Lake City Mayor Jackie Biskupski’s office released a study Monday that proposed a lowering of impact fees for commercial projects and steep increases on fees for housing construction to help pay for municipal services for the growing city. [ Trib ]\n\n-> Snowbird ski resort wants to expand into Mary Ellen gulch, triggering worries about disturbing abandoned mines and sending toxic sediments down the canyon. [ Trib ]\n\n-> Students at Westminster College, one of three Utah schools under investigation by the federal government for handling of sexual assault cases, signed a pledge Monday to \"start by believing\" reporters of sexual assault. [ Trib ] [ KUER ] \n\n-> A public hearing on Salt Lake County’s planned $90 million bond to help fund zoos, arts and parks will take place on Tuesday. [ Trib ]\n\n-> A hearing for the FLDS food stamp fraud case is set for Oct. 4, where prosecutors and defendants will debate the issue of compelling government interests interfering with religious freedom. [ Trib ]\n\n-> Pat Bagley comments on how Donald Trump’s temperament would play out in a national security setting compared to on \"The Apprentice.\" [ Trib ]\n\nNationally: Donald Trump, at a rally in Florida on Monday, used the identification of the Chelsea/New Jersey bombings suspect to illustrate why an immigration ban on certain countries and a vetting process that ensures that immigrants love America is needed. [ NBCNews ] [ WaPost ]\n\n-> Meanwhile, Hillary Clinton gave a news conference at an airport Monday morning calling for Americans not to give ISIS the satisfaction of associating terror attacks with the entire Muslim community. [ CNN ] [ NYTimes ] [ WaPost ]\n\n-> Donald Trump Jr. tweeted a graphic comparing Syrian refugees to skittles that illustrated his father’s stance on accepting refugees from terror-ridden countries. [ Politico ] [ CNN ]\n\n-> Topics for next Monday’s first presidential debate are announced: America’s Direction, Achieving Prosperity and Securing America. [ Politico ]\n\nWhere are they? \n\nRep. Jason Chaffetz votes and chairs a classified Oversight Committee hearing on the FBI’s Hillary Clinton investigation. \nRep. Mia Love flies to Washington, meets with the GOP caucus and votes. \nGov. Gary Herbert attends business meetings in New York City. \nLt. Gov. Spencer Cox stops by the Jordan Education Foundation Economic Summit and sits down with legislators at the Capitol. \nState Auditor John Dougall chats with State Treasurer David Damschen before a meeting with the Attorney General’s office. \nPresident Barack Obama speaks at the Opening Session of the 71st Session of the General Assembly, holds a bilateral meeting with President Muhammadu Buhari of Nigeria and holds courtesy calls with President of the General Assembly Peter Thomson of Fiji and UN Secretary-General Ban Ki-Moon. After a luncheon hosted by the Secretary-General, the President swings by a CEO roundtable and a Refugee Summit family photo and meeting. He ends the night by delivering remarks at the reception for foreign heads of delegations to the United Nations General Assembly. \n\nGot a tip? A birthday, wedding or anniversary to announce? Email us at cornflakes@sltrib.com . If you haven’t already, sign up for our weekday email and get this sent directly to your inbox. [ Trib ]\n\n-- Thomas Burr and Zoe Woolf McGinn\nTwitter.com/thomaswburr and Twitter.com/zoewmcginn \nVIDEOS TOP JOBS", "external_links": [], "published": "2016-09-20T14:21:00.000+03:00", "crawled": "2016-09-20T15:26:51.751+03:00", "highlightTitle": ""}