{"organizations": [], "uuid": "6f887f50e6c9080e1b87fe0eb8164691dc49660f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 520, "shares": 520, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/FNL/Politics/0/0/emilio%20and%20dolores.jpg", "site_section": "http://feeds.latino.foxnews.com/home/feed", "section_title": "FOX News", "url": "http://latino.foxnews.com/latino/politics/2016/09/16/gop-incumbent-in-democratic-congressional-district-faces-labor-icon-son-emilio/", "country": "US", "domain_rank": 185, "title": "GOP congressman from CA faces re-election challenge from Dolores Huerta's son", "performance_score": 5, "site": "foxnews.com", "participants_count": 1, "title_full": "GOP congressman from CA faces re-election challenge from Dolores Huerta's son | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2016-09-16T03:00:00.000+03:00", "replies_count": 0, "uuid": "6f887f50e6c9080e1b87fe0eb8164691dc49660f"}, "author": "Elizabeth Llorente", "url": "http://latino.foxnews.com/latino/politics/2016/09/16/gop-incumbent-in-democratic-congressional-district-faces-labor-icon-son-emilio/", "ord_in_thread": 0, "title": "GOP congressman from CA faces re-election challenge from Dolores Huerta's son", "locations": [], "entities": {"persons": [{"name": "dolores huerta", "sentiment": "negative"}, {"name": "elizabeth llorente    fox news latino emilio huerta", "sentiment": "neutral"}, {"name": "kent price", "sentiment": "none"}, {"name": "amanda renteria", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "cesar chavez", "sentiment": "none"}, {"name": "david valadao", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "emilio huerta", "sentiment": "none"}, {"name": "elizabeth llorente", "sentiment": "none"}, {"name": "huerta", "sentiment": "none"}, {"name": "renteria", "sentiment": "none"}, {"name": "emilio", "sentiment": "none"}, {"name": "amanda", "sentiment": "none"}, {"name": "valadao", "sentiment": "none"}, {"name": "cesar", "sentiment": "none"}], "locations": [{"name": "central valley", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "valadao", "sentiment": "none"}, {"name": "bakersfield", "sentiment": "none"}], "organizations": [{"name": "gop", "sentiment": "negative"}, {"name": "fox news latino", "sentiment": "none"}, {"name": "congress", "sentiment": "none"}, {"name": "dccc", "sentiment": "none"}, {"name": "democratic congressional campaign committee", "sentiment": "none"}, {"name": "california state university", "sentiment": "none"}, {"name": "facebook  follow us on twitter & instagram", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Elizabeth Llorente \n  Fox News Latino Emilio Huerta and his mother, Dolores Huerta. HuertaforCongress.com \nEmilio Huerta HuertaforCongress.com \nNext Slide Previous Slide District 21 in California is 71 percent Latino and overwhelmingly Democratic. Since 2012, it’s elected David Valadao as its representative in Congress.\nAnd that is quite remarkable – Valadao is a Republican of European descent, the son of Portuguese immigrants. And in his last two congressional races, he beat Latino Democrats.\nNow, as Valadao seeks his third term in Congress, he is facing what could be his most formidable opponent: lawyer and businessman Emilio Huerta, the son of civil rights and labor icon Dolores Huerta.\n“That whole district is a mystery to everyone who has ever looked at it,” said California State University, Bakersfield political science professor Kent Price. “It has a Democratic advantage, a Latino advantage. Demographically and politically, you look at it and ask ‘How is it Republican?’”\nOne key factor in Valadao’s favor is that he is a moderate Republican who speaks highly of immigration, often invoking his own family. And as a dairy farmer, he has been able to speak on an intimate level to both farmers and farmworkers, who form a large part of the very agricultural district.\nAnother reason is because of low voter turnout among Latinos in a mostly agricultural district that is one of the poorest in the country. While Latinos make up 55 percent of the district’s registered voters, the voter turnout among the group is at about 20 percent.\nBut Price, as well as other political experts, believe that Huerta can bring Latinos and others who have sat out past elections out to vote on Nov. 8 – if he plays his cards right.\nFamous last name \nHuerta, who never before has run for elected office, has a longtime family connection to farmworkers, and has worked in farmworker rights as a lawyer. He has a keen understanding of the district’s agricultural nature and, of course, he has a famous last name.\n“Emilio has done his work in the Central Valley,” Price said. “He has a little more advantage than other Democrats who have run against David Valadao.”\nCalifornia is clearly a blue state – political jargon for Democrat-leaning – with nearly 45 percent of the registered voters identifying as Democrats. About 27 percent are registered Republicans, and 23 percent have no party affiliation.\nCritics accused Valadao of flip-flopping because he initially said he would back the party's presidential nominee, whether that was Donald Trump or not. But over the summer, Valadao said he would not support someone whose rhetoric “denigrates people based on their ethnicity, religion, or disabilities.”\n“I am disappointed with the divisive rhetoric coming from this presidential election and cannot support either candidate,” the congressman said in the statement released to the press.\nValadao did not respond to interview requests by Fox News Latino.\nFor his part, Huerta is borrowing the grassroots approach that his mother and her fellow labor leader Cesar Chavez used when building their movement for farmworker rights.\n“My mom and Cesar had house meetings,” Huerta told Fox News Latino. “We’ve adopted that method. We’re holding house meetings, we talk to the people around the kitchen table, in their backyards, in local parks, in community centers – wherever we can do it.”\n\"There's no wine and cheese,\" he added.\nThe immigrant and Latino community in the district, Huerta said, feels little connection to politicians, and so they feel little motivation to vote.\n“The political process has ignored them,” he said. “These are people who get up at 4 or 5 a.m. to work, and they work until sundown. The average income for a farmworker family is $20,000 a year. They don’t have the time to figure out what the political process is and how it can benefit them.”\n“There’s poor quality water , poor quality air,” Huerta said. “A lot of young children suffer bronchial issues. My daughter was born in the district, she’s asthmatic.”\nThen there is the poor educational record.\n“Fifty percent or less of high school graduates attend college,” Huerta said. “The schools have a lack of resources, I have friends who are teachers and they say they don’t even have AP (advanced placement) courses, like the more affluent districts do.”\nSo he is taking the political world to them, Huerta said.\nHe said he had tried to help them through his work as a lawyer, but then decided he could make a bigger difference by running for office.\n“It was surprising for me to learn that some communities in the district are still facing the poor conditions they were facing in the 60s,” Huerta said, “when Cesar Chavez was organizing in those areas.”\n“Power of the incumbency” \nPrice said that Valadao has been able to stay strong in the race by playing it safe and having hefty campaign coffers.\n“He has played it middle-of-the-road, he’s a fundraising machine,” Price said. “He has not been aggressive on immigration. He does nothing to offend anyone. Now he has the power of the incumbency.”\nMany thought that Valadao’s 2014 Democratic rival, Amanda Renteria , would give him stiff competition.\nRenteria, who left California for a while, returned in 2013 and announced she was running against Valadao. The Democratic Congressional Campaign Committee (DCCC) poured $1 million for ads for Renteria. But Renteria lost the race to Valadao by 16 percent. She is now the national political director for Hillary Clinton’s presidential campaign.\n“Even though Amanda had roots here, she was seen as someone who hadn’t spent much time here, and there’s a very high level of suspicion when an ‘outsider’ comes in to run,” Price said.\nHuerta, on the other hand, is running an old-fashioned door-to-door campaign, eschewing the kind of large-apparatus assistance that other Democrats received from the DCCC.\nHuerta's mother has made appearances with him on support of her son's campaign, but she has not been a fixture on the trail in the district, spending far more time campaigning for Hillary Clinton around the country.\n\"She was very supportive when I told her I wanted to run,\" Huerta said. \"She's given me a lot of time. But she's got quite a bit on her plate.\" \n\"She understands the needs of the working folks here in the valley,\" he said. \"She supports us spiritually.\"\n\nElizabeth Llorente is the Politics Editor/Senior Reporter for Fox News Latino, and can be reached at Elizabeth.Llorente@Foxnewslatino.com. Follow her on https://twitter.com/Liz_Llorente \nLike us on Facebook \nFollow us on Twitter & Instagram", "external_links": [], "published": "2016-09-16T03:00:00.000+03:00", "crawled": "2016-09-17T00:23:13.845+03:00", "highlightTitle": ""}