{"organizations": [], "uuid": "ccb74ad5ef766f58d1f137bb26f41af905cad9af", "thread": {"social": {"gplus": {"shares": 7}, "pinterest": {"shares": 13}, "vk": {"shares": 0}, "linkedin": {"shares": 7}, "facebook": {"likes": 792, "shares": 792, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/media2.foxnews.com/2015/08/21/0/0/082115_dotcom_imimgration_640.jpg?ve=1", "site_section": "http://feeds.foxnews.com/foxnews/latest", "section_title": "FOXNews.com", "url": "http://www.foxnews.com/us/2016/09/07/citizenship-for-sale-nj-hospital-courts-russians-for-birth-tourism.html", "country": "CH", "domain_rank": 185, "title": "Citizenship for sale? NJ hospital courts Russians for 'birth tourism'", "performance_score": 7, "site": "foxnews.com", "participants_count": 1, "title_full": "Citizenship for sale? NJ hospital courts Russians for 'birth tourism'", "spam_score": 0.0, "site_type": "news", "published": "2016-09-08T04:35:00.000+03:00", "replies_count": 0, "uuid": "ccb74ad5ef766f58d1f137bb26f41af905cad9af"}, "author": "foxnewsonline@foxnews.com (Fox News Online)", "url": "http://www.foxnews.com/us/2016/09/07/citizenship-for-sale-nj-hospital-courts-russians-for-birth-tourism.html", "ord_in_thread": 0, "title": "Citizenship for sale? NJ hospital courts Russians for 'birth tourism'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Citizenship for sale? NJ hospital courts Russians for 'birth tourism' Published September 07, 2016 Facebook 0 Twitter 0 livefyre Email Print \nFor a pregnant woman in Russia, the sales pitch from one New Jersey hospital is alluring: Spend upwards of $10,000 to deliver a baby in a U.S. facility where mother and child will receive superior medical care. \nWithin the fine print is the greatest benefit of all -- American citizenship for the newborn and all the privileges that come with it. \n\"Childbirth in New York is the best investment in the future of your family!” reads the Russian-language AmeriMama website. Related Image Expand / Contract The hospital has aggressively advertised its maternity services in Russia. (Screengrab) \nThe \"AmeriMama\" program at Meadowlands Hospital Medical Center, first reported by NJ Spotlight , is part of a lucrative and controversial business called \"birth tourism,\" the practice of soliciting pregnant women from other countries to deliver their children in the U.S. -- automatically making them American citizens -- before they return home. \nBut the Secaucus, N.J., hospital has taken it to a brazen new level, say immigration experts. \nFor fees ranging from $8,500 to $27,500, the Russian-language website for AmeriMama promised to secure citizenship papers, passports, and travel visas for the baby, according to NJ Spotlight, which reported on the program in August. Related Image Expand / Contract Experts say the hospital may not be breaking the law, but its strategy is brazen. (Meadowlands Hospital Medical Center) \nWhile U.S. \"birthing houses\" and \"maternity hotels\" have been targeted by the feds, an American for-profit hospital openly marketing U.S. citizenship appears to be the first of its kind, according to one government source and watchdog groups. \n\"They claim they’re selling their hospital services, but the unspoken benefit of this is that the child gets a U.S. passport and U.S. citizenship,\" said Jessica Vaughan, of the Center for Immigration Studies. \n\"This is essentially U.S. citizenship up for sale,\" Vaughan told FoxNews.com. \"And this is the first time I’ve seen a hospital itself market to this customer base.\" \nThe AmeriMama website and its Facebook page were removed shortly after NJ Spotlight ran a series of reports last month investigating the hospital's birth-tourism program and questionable business practices. \nHospital officials did not return repeated requests for comment. \nThe laws surrounding birth tourism are murky. It is not illegal for foreign couples to give birth in the U.S., but it is illegal for them to lie to immigration officials about the reasons for their visit. An estimated 40,000 babies are born to couples visiting the U.S. each year. \n\"There is no clear law that prevents hospitals from establishing this business and promoting it abroad and there’s no law against a foreigner coming here for the specific purpose of having a baby,\" said Vaughan. \"It only crosses the line into a violation of law if they are misrepresenting the purpose of their visit or if they were to overstay or if they were to fraudulently claim public benefits.\" \nMany birth tourism cases, Vaughan explained, \"start with a lie to the immigration officer at the point of entry.\" \n\"That’s an immigration violation and means they should be deported,\" she said. \nAlvin Phillips, a spokesman for the U.S. Department of Homeland Security, said, \"There is nothing in the law that makes it illegal for pregnant women to enter the United States.\" \n\"However, if a pregnant woman or anyone else uses fraud or deception to obtain a visa or gain admission to the United States, that would constitute a criminal act and be a matter of interest to Homeland Security Investigations (HSI),\" he said. \nA booming business, birth tourism appeals to middle and upper- middle class couples in countries such as Russia and China, most of whom return home after the baby is born, though Vaughan noted this is difficult to track. The dual citizenship granted to their baby is considered an insurance policy, should the child choose to return to the U.S. to attend school -- and receive in-state tuition -- or the parents opt to apply for permanent U.S. residency. \nAdding to the controversy, is the potential cost to the U.S. taxpayer. \nShould a complication arise at birth, the bill would far exceed the $28,000 figure reportedly advertised by AmeriMama. \n\"Who pays for that?\" asked Vaughan. Advertisement", "external_links": [], "published": "2016-09-08T04:35:00.000+03:00", "crawled": "2016-09-07T23:54:13.833+03:00", "highlightTitle": ""}