{"organizations": [], "uuid": "82fc3b583470b6ca77c841f6283abd22d298c26c", "thread": {"social": {"gplus": {"shares": 26}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 14}, "facebook": {"likes": 478, "shares": 478, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/media.foxbusiness.com/BrightCove/854081161001/201608/1470/0/0/854081161001_5081404760001_081216-intel-morgan.jpg?ve=1", "site_section": "http://feeds.foxnews.com/foxnews/world", "section_title": "FOX News", "url": "http://www.foxnews.com/world/2016/09/13/3-syrians-believed-sleeper-cell-sent-by-isis-arrested-in-germany.html", "country": "IT", "domain_rank": 185, "title": "3 Syrians--believed a sleeper cell sent by ISIS-- arrested in Germany", "performance_score": 4, "site": "foxnews.com", "participants_count": 1, "title_full": "3 Syrians--believed a sleeper cell sent by ISIS-- arrested in Germany | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2016-09-13T03:00:00.000+03:00", "replies_count": 0, "uuid": "82fc3b583470b6ca77c841f6283abd22d298c26c"}, "author": "Associated Press", "url": "http://www.foxnews.com/world/2016/09/13/3-syrians-believed-sleeper-cell-sent-by-isis-arrested-in-germany.html", "ord_in_thread": 0, "title": "3 Syrians--believed a sleeper cell sent by ISIS-- arrested in Germany", "locations": [], "entities": {"persons": [{"name": "ibrahim m.", "sentiment": "none"}, {"name": "mohamed a.", "sentiment": "none"}, {"name": "mahir al-h.", "sentiment": "none"}, {"name": "de maiziere", "sentiment": "none"}, {"name": "thomas de maiziere", "sentiment": "none"}, {"name": "mahir al-h", "sentiment": "none"}], "locations": [{"name": "germany", "sentiment": "none"}, {"name": "greece", "sentiment": "none"}, {"name": "berlin", "sentiment": "none"}, {"name": "syria", "sentiment": "none"}, {"name": "turkey", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "schleswig-holstein", "sentiment": "none"}, {"name": "wuerzburg", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}, {"name": "ansbach", "sentiment": "none"}, {"name": "raqqa", "sentiment": "none"}], "organizations": [{"name": "isis", "sentiment": "negative"}, {"name": "federal criminal police office", "sentiment": "none"}, {"name": "state", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "  livefyre Email Print   \nThree Syrian men believed to have been sent to Germany last year by the Islamic State group as a possible \"sleeper cell\" were arrested in raids on Tuesday, part of efforts to root out extremists sent to Europe amid the migrant influx, authorities said.\nThe three are accused of coming to Germany in mid-November at the behest of IS \"in order either to carry out an assignment they had already received or to keep themselves ready for further instructions,\" federal prosecutors said. The three are suspected of membership in a foreign terrorist organization.\nTheir arrests followed raids at refugee homes in Schleswig-Holstein, Germany's northernmost state. Interior Minister Thomas de Maiziere said the men had been under observation for months, and that \"there are no indications of concrete attack plans\" at present.\n\"This may have been a sleeper cell,\" he told reporters.\nDe Maiziere said the suspects appear to have made it to Europe through the same channels as two men who blew themselves up outside France's national stadium in November in the Paris attacks claimed by IS.\n\"Everything points to the same smuggling organization as with the Paris attackers having brought these three who were arrested to Germany,\" he said. \"And everything points to the travel documents having come from the same workshop.\"\nProsecutors identified the suspects only as Mahir Al-H., 17, Mohamed A., 26, and Ibrahim M., 18, in keeping with German privacy rules.\nThe three traveled to Germany via Turkey and Greece, the route used by most migrants to Europe last year. Mahir Al-H. joined IS in Raqqa, Syria, earlier last year and received weapons and explosives training, prosecutors said, before he and the other two suspects in October told an IS official responsible for \"operations and attacks outside the IS area\" that they would travel to Europe.\nThe three were provided with passports by IS and were given a \"high four-figure sum\" of cash in U.S. dollars as well as cellphones with a pre-installed communication program, prosecutors said in a statement.\nThe Federal Criminal Police Office said that six locations in two German states were searched Tuesday. It said that, as well as the arrests, \"extensive material\" was seized as evidence.\nThe office noted that the attacks in Paris and Brussels over the past year showed that IS has used the migrant flow to send people to Europe. It said that it knows of more than 400 tips about people among the migrants who might have a terrorist background, but most turned out to be wrong. However, more than 60 investigations were opened.\nIn July, two attacks were carried out in Germany by asylum seekers who arrived over the past two years and claimed by IS. Five people were wounded in an ax rampage on a train near Wuerzburg and 15 in a bombing outside a bar in Ansbach. Both of the attackers were killed.\nThose attacks and two others unrelated to Islamic extremism in the same weeklong period put the country on edge and stoked tensions over the arrival last year of hundreds of thousands of migrants.\nThose tensions have helped the nationalist, anti-immigration Alternative for Germany party, which won over 20 percent of the vote in a state election in the northeastern region of Mecklenburg-Western Pomerania Sept. 4.\nTuesday's arrests come days ahead of another state election in Berlin. De Maiziere said they \"show that security authorities are vigilant and are acting with determination.\"", "external_links": [], "published": "2016-09-13T03:00:00.000+03:00", "crawled": "2016-09-13T17:07:21.414+03:00", "highlightTitle": ""}