{"organizations": [], "uuid": "5057b04197d780aa44c6a7c873bd8fac0331c800", "thread": {"social": {"gplus": {"shares": 4}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 2}, "facebook": {"likes": 342, "shares": 342, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/politics/0/0/dreamers%20obama.jpg", "site_section": "http://feeds.foxnews.com/foxnews/latest?format=xml", "section_title": "FOXNews.com", "url": "http://latino.foxnews.com/latino/politics/2016/09/06/dreamers-plan-next-move-if-trump-becomes-president-and-lose-deportation/", "country": "CH", "domain_rank": 185, "title": "Dreamers who may face deportation under a Trump presidency plan next move Latino", "performance_score": 3, "site": "foxnews.com", "participants_count": 1, "title_full": "Dreamers who may face deportation under a Trump presidency plan next move | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2016-09-06T03:00:00.000+03:00", "replies_count": 0, "uuid": "5057b04197d780aa44c6a7c873bd8fac0331c800"}, "author": "Elizabeth Llorente", "url": "http://latino.foxnews.com/latino/politics/2016/09/06/dreamers-plan-next-move-if-trump-becomes-president-and-lose-deportation/", "ord_in_thread": 0, "title": "Dreamers who may face deportation under a Trump presidency plan next move Latino", "locations": [], "entities": {"persons": [{"name": "elizabeth llorente    fox", "sentiment": "neutral"}, {"name": "alex ortega", "sentiment": "none"}, {"name": "bernie sanders", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "barack obama", "sentiment": "none"}, {"name": "obama", "sentiment": "none"}, {"name": "sanders", "sentiment": "none"}, {"name": "clinton", "sentiment": "none"}, {"name": "césar vargas", "sentiment": "none"}, {"name": "greisa martinez", "sentiment": "none"}, {"name": "elizabeth llorente", "sentiment": "none"}, {"name": "vargas", "sentiment": "none"}, {"name": "kris kobach", "sentiment": "none"}, {"name": "jeff sessions", "sentiment": "none"}, {"name": "kris koback", "sentiment": "none"}], "locations": [{"name": "united states", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "kansas", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "brooklyn", "sentiment": "none"}, {"name": "arizona", "sentiment": "none"}, {"name": "u.s", "sentiment": "none"}, {"name": "longmont", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}, {"name": "colorado", "sentiment": "none"}, {"name": "central america", "sentiment": "none"}], "organizations": [{"name": "trump", "sentiment": "negative"}, {"name": "fox news latino", "sentiment": "none"}, {"name": "dream action coalition", "sentiment": "none"}, {"name": "united we dream action", "sentiment": "none"}, {"name": "gop", "sentiment": "none"}, {"name": "customs enforcement", "sentiment": "none"}, {"name": "deferred action for childhood arrivals program", "sentiment": "none"}, {"name": "department of homeland security", "sentiment": "none"}, {"name": "daca", "sentiment": "none"}, {"name": "facebook  follow us on twitter & instagram", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Elizabeth Llorente \n  Fox News Latino ap \nOne group of undocumented immigrants has been able to gradually move out of the shadows in the last four years, securing a renewable two-year reprieve from deportation, getting a work permit and driver’s licenses and no longer fearing the specter of a sudden arrest and removal from the United States.\nBut the Dreamers, as they are known – young undocumented immigrants who were brought to the United States as minors – now are more fearful than they have been in years that the pieces to a permanent life in the U.S. they have been cobbling together, optimistically, in recent years can crumble under a Donald Trump presidency.\nThe concern has rippled across the Dreamer community especially since last week, when Trump delivered a stern warning to all undocumented immigrants – that they were all subject to deportation, as far as he was concerned.\nThe GOP nominee further singled out the 2012 initiative by President Barack Obama called the Deferred Action for Childhood Arrivals Program (DACA), as one he would eliminate.\nHis warning has intensified worries that many Dreamers, as well as other undocumented immigrants, have about what lies next for them. They have been consulting lawyers, holding meetings, and brainstorming about how they would protect themselves and push their cause in the event of a Trump presidency.\n“As someone who is beneficiary of DACA, I heard him clearly say that he wants to take away the small protection that I have, the ability to work with dignity,” said Greisa Martinez, a 28-year-old Texas resident who has DACA and is the state advocacy director for United We Dream Action, a group that fights to get Dreamers a path to legal status.\nDACA recipient and immigration activist César Vargas, who worked on the Bernie Sanders presidential campaign, says he is more worried about the people Trump would select for key administration posts that would affect immigrants.\nVargas, who came from Mexico at the age of 5, and made headline four years ago after he passed the New York state bar exam but was prevented from practicing law because of his immigration status. In February, he was sworn in as a lawyer in Brooklyn.\n“A Trump presidency would pose a danger to DACA and all undocumented immigrants,” said Vargas, 32, who is director and a founder of Dream Action Coalition, which advocates for Dreamers.\nNot because of Trump, but because of the people he would appoint to his administration.\n“… The people who are around him – [Senator] Jeff Sessions and Kris Kobach – are hardliners in immigration,” Vargas said. “I’m concerned about the people a Trump as president would appoint to the [Department of Homeland Security] or the [U.S . Immigration and Customs Enforcement.]”\n(Kris Koback, the Kansas secretary of state, has been an author of many of the strictest immigration measures at the state level, including Arizona's SB 1070. He also helped draft the Texas-led lawsuit that challenges DACA and Obama's other executive actions on immigration.)\nBut critics of Dreamers say they should not hold special privileges – and should be held to the same standards as every other immigrant in the country illegally.\nVargas is also one of many Dreamers whose DACA is up for renewal in February – after the country has a new president – making it subject to a possible elimination if Trump should win the election and act on his vow to do away with it.\n\"The concern over Trump is not theoretical for me and many Dreamers,\" Vargas said.\nIn the undocumented population, which tends to stay under the radar, Dreamers have been bold and some would say provocative in their fight for immigration reform. In the last decade or so, they have become well-organized, thanks in part to their command of social media, which has enhanced their efforts to get their message out and rally support. They have been holding press conferences, speaking at rallies, appearing on news shows – without hiding their faces or their names.\nMany threw their support behind Sanders, with some of them citing Clinton's checkered record on immigration. Though generally Clinton had supported a more liberal immigration policy, she at times took stances – such as not supporting driver's licenses for undocumented immigrants, and saying that unaccompanied minors who arrived illegally from Central America should be sent back – that angered many Dreamers and other immigration activists. \nThe Dreamers' potent movement achieved results. Even more conservative lawmakers began to distinguish between older undocumented immigrants, and Dreamers, who were described often as being here illegally “through no fault of their own.”\nMeasures have been introduced, and some passed at state level, giving reprieve just to Dreamers. Obama issued executive orders, in 2012 and in 2014, through a broader initiative, giving them a reprieve from deportation. \nThe latter initiatives, such the Deferred Action for Parents of Americans and Lawful Permanent Residents (DAPA), which gives reprieve to undocumented parents of legal immigrants or U.S. citizens, have been held up in court. But altogether, the initiatives stand to protect some 5 million people.\nDreamers are actively working to encourage Latinos who are eligible to vote to register and get out to the polls in November.\n“For me, the fight against deportations is a fight for survival and I am here to stay, ready to fight and together with registered voters in our communities,” Alex Ortega, an undocumented young leader from Longmont, Colorado, said in a statement, “ready to win.”\n\nElizabeth Llorente is the Politics Editor/Senior Reporter for Fox News Latino, and can be reached at Elizabeth.Llorente@Foxnewslatino.com. Follow her on https://twitter.com/Liz_Llorente \nLike us on Facebook \nFollow us on Twitter & Instagram", "external_links": [], "published": "2016-09-06T03:00:00.000+03:00", "crawled": "2016-09-07T00:31:32.790+03:00", "highlightTitle": ""}