{"organizations": [], "uuid": "a972f7a128240f369d88ee2d42b7de614d25daf5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/images.foxnews.com/content/fox-news/world/2016/09/30/timeline-comet-probe-12-year-space-odyssey/_jcr_content/par/featured-media/media-0.img.jpg/0/0/1475228790316.jpg?ve=1", "site_section": "http://feeds.foxnews.com/foxnews/world?format=xml", "section_title": "FOX News", "url": "http://www.foxnews.com/world/2016/09/30/timeline-comet-probe-12-year-space-odyssey.html", "country": "US", "domain_rank": 185, "title": "A timeline of comet probe's 12-year space odyssey", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "A timeline of comet probe's 12-year space odyssey | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2016-09-30T03:00:00.000+03:00", "replies_count": 0, "uuid": "a972f7a128240f369d88ee2d42b7de614d25daf5"}, "author": "Associated Press", "url": "http://www.foxnews.com/world/2016/09/30/timeline-comet-probe-12-year-space-odyssey.html", "ord_in_thread": 0, "title": "A timeline of comet probe's 12-year space odyssey", "locations": [], "entities": {"persons": [{"name": "rosetta", "sentiment": "negative"}, {"name": "guiana", "sentiment": "none"}], "locations": [{"name": "lutetia", "sentiment": "none"}, {"name": "earth", "sentiment": "none"}, {"name": "rosetta", "sentiment": "none"}, {"name": "berlin", "sentiment": "none"}, {"name": "kourou", "sentiment": "none"}, {"name": "jupiter", "sentiment": "none"}, {"name": "red planet", "sentiment": "none"}, {"name": "mars", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}, {"name": "darmstadt", "sentiment": "none"}], "organizations": [{"name": "european space agency", "sentiment": "none"}, {"name": "ap photo/michael probst", "sentiment": "none"}, {"name": "rosetta", "sentiment": "none"}, {"name": "associated press", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "  A model of orbiter Rosetta hangs from the ceiling in a conference room at the European Space Agency ESA in Darmstadt, Germany, Friday, Sept. 30, 2016. Rosetta will be impacted on comet 67P/Churyumov-Gerasimenko on Friday, marking the end of the twelve years lasting Rosetta mission. (AP Photo/Michael Probst)  (The Associated Press) \nBERLIN –   The European Space Agency's comet-chasing probe Rosetta is performing a final maneuver Friday that will end its 12-year mission with a crash-landing on the surface of comet 67P/Churyumov-Gerasimenko.\nHere's a look at key moments during the mission:\n___\nMarch 2, 2004: Europe's unmanned probe Rosetta takes off from Kourou, French Guiana, after a series of delays, including an abandoned January 2003 launch window because of a rocket problem.\nFeb. 25, 2007: Rosetta carries out a close flyby of Mars. European Space Agency's mission control breaks out in applause after the end of 15 tense minutes of radio silence as the craft passes behind the Red Planet.\nSept. 5, 2008: Probe successfully passes close to an asteroid 250 million miles from Earth. The spacecraft loses its radio signal for 90 minutes as planned during the flyby of the Steins asteroid, also known as Asteroid 2867.\nJuly 10, 2010: Between Mars and Jupiter, Rosetta transmits its first pictures from the largest asteroid ever visited by a satellite after it flies by Lutetia as close as 1,900 miles (3,200 kilometers). It is the closest look to date at the Lutetia asteroid.\nJan. 20, 2014: Waking after almost three years of hibernation, Rosetta sends its first signal back to Earth. Systems had been powered down in 2011 to conserve energy, leaving scientists in the dark for 31 months.\nAug. 6, 2014: Rosetta swings alongside comet 67P/Churyumov-Gerasimenko somewhere between the orbits of Mars and Jupiter.\nNov. 12, 2014: The probe releases the Philae lander and it drops to the comet's surface. Seven hours later, Philae touches down on the comet.\nNov. 15, 2014: Philae goes into hibernation after performing experiments and sending data back to Earth for 60 hours.\nFeb. 14, 2015: Rosetta swoops to a distance of just 6 kilometers (less than 4 miles) above the surface of the comet to take close-up pictures of the surface.\nJune 11, 2015: Scientists say they may have caught a glimpse of Philae, whose exact location remains unknown. After analyzing images and other data collected over the past months they identified several possible sites including one bright spot described as \"a good candidate for the lander.\"\nJune 13, 2015: Philae communicates with Earth for the first time in seven months in a sign that it has come out of hibernation.\nJuly 9, 2015: Last contact with Philae.\nAug. 13, 2015: Comet 67P reaches the closest point to the sun on its 6 &frac12;-year orbit, with Rosetta by its side.\nOct. 28, 2015: Scientists announce that they have detected significant amounts of molecular oxygen coming out of a comet, an unexpected discovery that calls into questions earlier assumptions underlying the search for alien life.\nJune 30, 2016: The European Space Agency announces that it will crash-land Rosetta on the comet Sept. 30, ending the active part of the mission.\nSept. 5, 2016: Scientists say they have finally located the position of the Philae lander in a \"dark crack\" on the side of the comet.\nSept. 29, 2016: Mission controllers send their last command to Rosetta, putting it on a collision course with 67P, its final resting place, hours later.", "external_links": [], "published": "2016-09-30T03:00:00.000+03:00", "crawled": "2016-09-30T12:59:15.504+03:00", "highlightTitle": ""}