{"organizations": [], "uuid": "22e19005f07375f96b704c2540d1f7bb40196e6d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 37, "shares": 37, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/lifestyle/0/0/Naked%20Trump%20%20sculpture.jpg", "site_section": "", "section_title": "", "url": "http://latino.foxnews.com/latino/politics/2016/08/31/going-once-going-twicenaked-trump-statue-to-be-auctioned-off-in-october/", "country": "US", "domain_rank": 185, "title": "Going once, going twice ... Naked Trump statue to be auctioned off in October | Fox News Latino", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Going once, going twice ... Naked Trump statue to be auctioned off in October | Fox News Latino", "spam_score": 0.959, "site_type": "news", "published": "2016-09-02T10:15:00.000+03:00", "replies_count": 0, "uuid": "22e19005f07375f96b704c2540d1f7bb40196e6d"}, "author": "", "url": "http://latino.foxnews.com/latino/politics/2016/08/31/going-once-going-twicenaked-trump-statue-to-be-auctioned-off-in-october/", "ord_in_thread": 0, "title": "Going once, going twice ... Naked Trump statue to be auctioned off in October | Fox News Latino", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Going once, going twice ... Naked Trump statue to be auctioned off in October Published August 31, 2016 Fox News Latino A statue of a naked Donald Trump, Thursday, Aug. 18, 2016 in New York's Union Square. AP \nA life-size foam sculpture of Donald Trump in his birthday suit is being auctioned off in October, with some of the proceeds going to an immigration advocacy group. \nThe Trump sculpture, a version of which was on display in New York City, San Francisco, Cleveland, Seattle and Los Angeles earlier this month, is the brainchild of the anarchist art collective INDECLINE, which has protested the presidential nominee in other ways in the past. \nJulien’s Auctions is scheduled to handle the sale of the statue, titled “The Emperor Has No Balls,” according to Marketplace.org. It is estimated to fetch anywhere between $10,000 and $20,000. \nSome of the profits are to go to the National Immigration Forum. \nAn image of Hillary Clinton is expected to get $15,000, at a maximum, at the Oct. 22 auction. It is named “Hillary Clinton Cojones,” the website said. \nThe statues of Trump that were displayed in public places in various U.S. cities were damaged or destroyed, except for the one in Los Angeles — which is the one being auctioned. \n\"The explicit statue quickly became a symbol of political protest art and garnered international coverage when the gallery refused to hide or censor the statue,\" CNBC quoted Julien's Actions as saying in a release , \"choosing instead to display it prominently and in public view.\" \nTrump began his presidential campaign last year by vowing to take a hard line on illegal immigration. It remained a cornerstone of his campaign during the GOP primaries and after he became Republican nominee in July at the party’s national convention in Cleveland. \nThe collective INDECLINE also has spray-painted a U.S.-Mexico border fence in Tijuana, Mexico, with an image of a gagged Trump. \nThe group's other projects have included putting the names of African-Americans killed by police over the inlaid stars on the Hollywood Walk of Fame and painting the words \"This Land Was Our Land\" across an unused airstrip in the Mojave Desert. \nThe Associated Press contributed to this report. \nLike us on Facebook ", "external_links": [], "published": "2016-09-02T10:15:00.000+03:00", "crawled": "2016-09-02T05:38:41.652+03:00", "highlightTitle": ""}