{"organizations": [], "uuid": "f8da478e4acbb3ef2de76005073bd5a2ad629aaa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 11, "shares": 11, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.foxnews.com", "main_image": "http://www.foxnews.com/content/dam/fox-news/logo/og-fn-foxnews.jpg", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/world/2016/09/19/latest-jordan-prods-wealthy-countries-over-refugees.html", "country": "EU", "domain_rank": 185, "title": "The Latest: Jordan prods wealthy countries over refugees | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "The Latest: Jordan prods wealthy countries over refugees | Fox News", "spam_score": 0.257, "site_type": "news", "published": "2016-09-19T21:27:00.000+03:00", "replies_count": 0, "uuid": "f8da478e4acbb3ef2de76005073bd5a2ad629aaa"}, "author": "", "url": "http://www.foxnews.com/world/2016/09/19/latest-jordan-prods-wealthy-countries-over-refugees.html", "ord_in_thread": 0, "title": "The Latest: Jordan prods wealthy countries over refugees | Fox News", "locations": [], "entities": {"persons": [{"name": "barack obama", "sentiment": "none"}, {"name": "zeid", "sentiment": "none"}, {"name": "zeid ra'ad al-hussein", "sentiment": "none"}, {"name": "nasser judeh", "sentiment": "none"}, {"name": "judeh", "sentiment": "none"}], "locations": [{"name": "jordan", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "syria", "sentiment": "none"}], "organizations": [{"name": "u.n. general assembly", "sentiment": "negative"}, {"name": "fox news  united nations", "sentiment": "neutral"}, {"name": "u.n.", "sentiment": "none"}, {"name": "general assembly", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "\nUNITED NATIONS – The Latest on the high-level U.N. General Assembly meetings (all times local): \n1:00 p.m. \nJordan's Foreign Minister Nasser Judeh is lashing out at wealthy countries that have not taken in even a handful of refugees. \nSpeaking at the U.N.'s summit meeting on Refugees and Migrants on Monday, Judeh said that his country was hosting 1.3 million refugees from the Syrian conflict — equivalent to 20 percent of Jordan's population — while larger and wealthier countries had not even received \"a handful.\" \nHe says the plight of migrants from the seven-year Syrian conflict brought \"shame\" on the international community. He called for more funding to help Jordan bear the cost of hosting refugees, expedited resettlement of refugees in third countries and a political settlement to the Syrian conflict. \n___ \n10:55 a.m. \nThe U.N. human right chief says the summit on refugee and migrants was necessary because the international community has failed to protect those caught in the world's conflict zones. \nHigh Commissioner for Human Rights Zeid Ra'ad al-Hussein on Monday praised the political consensus reached in approving the New York Declaration on Migrants and Refugees, but warned against complacency and self-congratulation. \n\"The bitter truth is, this summit was called because we have been largely failing. Failing the long-suffering people of Syria, in not ending the war in its infancy. Failing others in now chronic conflict zones, for the same reason. Failing millions of migrants who deserve far more than lives marked by cradle-to-grave indignity and desperation,\" Zeid told world leaders gathered for the high-level General Assembly meeting in New York. \n___ \n9:30 a.m. \nWorld leaders and foreign ministers from 193 countries have approved wide-ranging document aimed at providing a more humane and coordinated response to the refugee crisis. \nThe 22-page \"New York Declaration for Refugees and Migrants,\" is not legally binding and lacks concrete commitments but calls on countries to protect refugees' human rights, boost humanitarian aid and increase resettlement of refugees. \nSecretary-General Ban Ki-moon opened the day-long session Monday, calling on world leaders to commit to \"upholding the rights and dignity of everyone force by circumstance to flee their homes in search of a better life.\" \nA second summit to be hosted by President Barack Obama on Tuesday will seek concrete pledges from leaders to help bear the cost of assisting and resettling the world's 65.3 million migrants and refugees. Advertisement ", "external_links": [], "published": "2016-09-19T21:27:00.000+03:00", "crawled": "2016-09-19T20:44:07.642+03:00", "highlightTitle": ""}