{"organizations": [], "uuid": "8eccbeb9148935467cb48b2b971b2f62fecee4a1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/media2.foxnews.com/BrightCove/694940094001/2016/08/29/0/0/694940094001_5103268829001_082916-fff-bylth-1280.jpg?ve=1", "site_section": "http://feeds.foxnews.com/foxnews/politics", "section_title": "FOX News", "url": "http://www.foxnews.com/politics/2016/09/02/gross-injustice-10000-syrian-refugees-to-us-56-are-christian.html", "country": "CH", "domain_rank": 185, "title": "'Gross injustice': Of 10,000 Syrian refugees to the US, 56 are Christian", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "'Gross injustice': Of 10,000 Syrian refugees to the US, 56 are Christian | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2016-09-02T03:00:00.000+03:00", "replies_count": 0, "uuid": "8eccbeb9148935467cb48b2b971b2f62fecee4a1"}, "author": "FoxNews.com", "url": "http://www.foxnews.com/politics/2016/09/02/gross-injustice-10000-syrian-refugees-to-us-56-are-christian.html", "ord_in_thread": 0, "title": "'Gross injustice': Of 10,000 Syrian refugees to the US, 56 are Christian", "locations": [], "entities": {"persons": [{"name": "adam shaw", "sentiment": "negative"}, {"name": "obama", "sentiment": "negative"}, {"name": "matthew clark", "sentiment": "none"}, {"name": "shea", "sentiment": "none"}, {"name": "cotton", "sentiment": "none"}, {"name": "wright", "sentiment": "none"}, {"name": "kerry", "sentiment": "none"}, {"name": "nina shea", "sentiment": "none"}, {"name": "tom cotton", "sentiment": "none"}, {"name": "john kerry", "sentiment": "none"}, {"name": "daesh", "sentiment": "none"}, {"name": "kristin wright", "sentiment": "none"}, {"name": "clark", "sentiment": "none"}], "locations": [{"name": "us", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "jordan", "sentiment": "none"}, {"name": "syria", "sentiment": "none"}, {"name": "r-ark.", "sentiment": "none"}, {"name": "beirut", "sentiment": "none"}, {"name": "middle east", "sentiment": "none"}], "organizations": [{"name": "american center for law and justice", "sentiment": "none"}, {"name": "foxnews.com", "sentiment": "none"}, {"name": "u.n.", "sentiment": "none"}, {"name": "islamic state", "sentiment": "none"}, {"name": "isis", "sentiment": "none"}, {"name": "aclj", "sentiment": "none"}, {"name": "open doors usa", "sentiment": "none"}, {"name": "hudson institute’s center for religious freedom", "sentiment": "none"}, {"name": "united nations", "sentiment": "none"}, {"name": "state department", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Adam Shaw \n    \nThe Obama administration hit its goal this week of admitting 10,000 Syrian refugees -- yet only a fraction of a percent are Christians, stoking criticism that officials are not doing enough to address their plight in the Middle East. \nOf the 10,801 refugees accepted in fiscal 2016 from the war-torn country, 56 are Christians, or .5 percent.\nReligious Breakdown of Recent Syrian Refugees | Graphiq A total of 10,722 were Muslims, and 17 were Yazidis. \nThe numbers are disproportionate to the Christian population in Syria, estimated last year by the U.S. government to make up roughly 10 percent of the population. Since the outbreak of civil war in 2011, it is estimated that between 500,000 and 1 million Christians have fled the country, while many have been targeted and slaughtered by the Islamic State.\nIn March, Secretary of State John Kerry said the U.S. had determined that ISIS has committed genocide against minority religious groups, including Christians and Yazidis.\n“In my judgment, Daesh is responsible for genocide against groups in territory under its control, including Yazidis, Christians and Shia Muslims,” Kerry said at the State Department, using an alternative Arabic name for the group.\nHe also accused ISIS of “crimes against humanity” and \"ethnic cleansing.\"\nYet, despite the strong words, relatively few from those minority groups have been brought into the United States. A State Department spokesperson told FoxNews.com that religion was only one of many factors used in determining a refugee’s eligibility to enter the United States.\nCritics blasted the administration for not making religion a more important factor, as the U.S. government has prioritized religious minorities in the past in other cases.\n“It’s disappointingly disproportional,” Matthew Clark, senior counsel at the American Center for Law and Justice (ACLJ), told FoxNews.com. “[The Obama administration has] not prioritized Christians and it appears they have actually deprioritized them, put them back of the line and made them an afterthought.”\n“This is de facto discrimination and a gross injustice,” said Nina Shea, director of the Hudson Institute’s Center for Religious Freedom.\nExperts say another reason for the lack of Christians in the make-up of the refugees is the make-up of the camps. Christians in the main United Nations refugee camp in Jordan are subject to persecution, they say, and so flee the camps, meaning they are not included in the refugees referred to the U.S. by the U.N.\n“The Christians don’t reside in those camps because it is too dangerous,” Shea said. “They are preyed upon by other residents from the Sunni community and there is infiltration by ISIS and criminal gangs.”\n“They are raped, abducted into slavery and they are abducted for ransom. It is extremely dangerous, there is not a single Christian in the Jordanian camps for Syrian refugees,” Shea said.\nHowever, Kristin Wright, director of advocacy for Open Doors USA – a group that advocates for Christians living in dangerous areas across the world – told FoxNews.com that another reason is many Christians are choosing to stick it out in Syria, or going instead to urban areas for now.\n“Many have fled to urban areas instead of the camps, so they may be living in Beirut instead of living in a broader camp, meaning many are not registering as refugees,” Wright said. “They may still come to the U.S. but may come through another immigration pathway.”\nHowever, others called on the Obama administration, in light of its genocide declaration, to do more to assist Christians, including setting up safe zones in Syria or actively seeking out Christians via the use of contractors to bring them to safety.\nIn March, Sen. Tom Cotton, R-Ark., introduced legislation that would give special priority to refugees who were members of persecuted religious minorities in Syria.\n“We must not only recognize what's happening as genocide, but also take action to relieve it,\" Cotton said.\n“The administration did the right thing by recognizing genocide, but by not taking action, it deflates it and makes it so Christians and others are not receiving any help,” Clark said. “So it’s all words and no actions, it’s just lip service on the issue of the genocide.”\nThis week, the ACLJ filed a lawsuit against the State Department for not responding to Freedom of Information Act requests about what the administration is doing to combat the genocide. \nFor Shea, the question is not just about helping refugees, but the very survival of Christianity in the 2,000-year community that has existed since the apostolic era of Christianity.\n\"This Christian community is dying,\" she said. \"I fear that there will be no Christians left when the dust settles.\"\n\nAdam Shaw is a Politics Reporter and occasional Opinion writer for FoxNews.com. He can be reached here or on Twitter: @AdamShawNY .", "external_links": [], "published": "2016-09-02T03:00:00.000+03:00", "crawled": "2016-09-03T00:22:03.041+03:00", "highlightTitle": ""}