{"organizations": [], "uuid": "1e1f80605ff934f48ad4c07316a577da3a1a662d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 19, "shares": 19, "comments": 1}, "stumbledupon": {"shares": 0}}, "site_full": "www.buzzfeed.com", "main_image": "https://img.buzzfeed.com/buzzfeed-static/static/2016-09/16/17/campaign_images/buzzfeed-prod-fastlane01/koch-network-to-merge-grassroots-groups-for-post--2-1282-1474059864-1_dblbig.jpg", "site_section": "http://www.buzzfeed.com//index.xml", "section_title": "BuzzFeed Index - Latest", "url": "https://www.buzzfeed.com/tariniparti/koch-network-to-merge-grassroots-groups-for-post-election-po", "country": "US", "domain_rank": 137, "title": "Koch Network To Merge Grassroots Groups For Post-Election Policy Battles", "performance_score": 0, "site": "buzzfeed.com", "participants_count": 1, "title_full": "Koch Network To Merge Grassroots Groups For Post-Election Policy Battles", "spam_score": 0.0, "site_type": "news", "published": "2016-09-17T20:16:00.000+03:00", "replies_count": 0, "uuid": "1e1f80605ff934f48ad4c07316a577da3a1a662d"}, "author": "Tarini Parti", "url": "https://www.buzzfeed.com/tariniparti/koch-network-to-merge-grassroots-groups-for-post-election-po", "ord_in_thread": 0, "title": "Koch Network To Merge Grassroots Groups For Post-Election Policy Battles", "locations": [], "entities": {"persons": [{"name": "lucas jackson", "sentiment": "negative"}, {"name": "david koch", "sentiment": "negative"}, {"name": "charles", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "george w. bush", "sentiment": "none"}, {"name": "genopp", "sentiment": "none"}, {"name": "daniel garza", "sentiment": "none"}, {"name": "obamacare", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "clinton", "sentiment": "none"}, {"name": "davis", "sentiment": "none"}, {"name": "levi russell", "sentiment": "none"}, {"name": "garza", "sentiment": "none"}, {"name": "adrian carrasquillo", "sentiment": "none"}, {"name": "james davis", "sentiment": "none"}, {"name": "mexican-american garza", "sentiment": "none"}], "locations": [{"name": "washington", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "capitol hill", "sentiment": "none"}, {"name": "d.c.", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "cva", "sentiment": "none"}, {"name": "afp", "sentiment": "none"}, {"name": "libre", "sentiment": "none"}, {"name": "gop", "sentiment": "none"}, {"name": "libre initiative", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "buzzfeed news", "sentiment": "none"}, {"name": "supreme court", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Lucas Jackson / Reuters ID: 9633417 \nWASHINGTON — Groups within billionaires Charles and David Koch’s political network that focus on Latino, millennial and veteran outreach are gearing up to merge with grassroots behemoth Americans For Prosperity as part of a post-election expansion, officials told BuzzFeed News. \nThe network — which is made up of hundreds of top GOP donors — is not backing Donald Trump or Hillary Clinton and expects major policy battles no matter who makes it to the White House. As part of its efforts to double-down on its grassroots investments, LIBRE Initiative, Generation Opportunity and Concerned Veterans for America will now be able to operate in all 35 states where AFP, which has 2.5 million members, has a presence. \nCurrently, LIBRE is in 10 states, GenOpp is in 4 and CVA is in 16. \n“As we looked at how we could continue to double-down on our grassroots advantage, we decided merging our resources would help us leverage the infrastructure and operational efficiency of AFP to allow CVA, GenOpp and LIBRE to scale more rapidly across the country and into more communities to create this grassroots movement,” said James Davis, spokesman for the network. \nThe changes — described as a “strategic scaling”— will be implemented between November and January and will allow the smaller groups to use AFP offices and staff without making separate investments. Asked about any layoffs in case of redundancies, officials said personnel decisions have yet to be worked out but that they view the merger as an expansion. \n“We’re looking ahead to 2017 and these changes will put us in a position to lead on policy when, no matter what the outcome of the election, the country will be looking for leadership,” Davis said. \nThe three groups merging with AFP would still maintain their own brand and focus on targeting their specific demographic. \n“This is a natural direction of where all these groups, including AFP, wanted to go,” said Levi Russell, spokesman for AFP. “We were already partners, but this makes it that much closer.” \nThe LIBRE Initiative’s Daniel Garza said the new integration with AFP across the country will allow the organization to be best positioned to amplify its message on policy issues like immigration legislation, with a newly elected president that the group does not support in either Trump or Clinton. \n“Contrary to popular belief we do have limited resources,” Garza said, with a nod towards the Koch network’s vast financial support. \nRegardless of who wins, Garza says AFP will be able to mobilize an army of people across the country to either oppose Clinton’s policies or pressure Trump to keep his word. \n“There is a presumption he will be better on taxes, on regulation, on the Supreme Court, Obamacare, and Dodd-Frank but we don’t know that,” Garza said. \nThe Mexican-American Garza, who was a former member of the George W. Bush administration, said he wants the country to understand immigrants are a strength for America and acknowledged the education is often aimed at opposition from conservatives. \nHe said the new reorganization gives LIBRE a better opportunity to also share their expertise with other network groups, comparing it to the importance of reflecting diversity within the Latino community. \n“We work two-fold in that area — to educate the Latino community, but we also educate non-Latinos about Latinos and Latino priorities which are American priorities,” he said. Tarini Parti is a Capitol Hill reporter for BuzzFeed News and is based in Washington, D.C. Contact Tarini Parti at . Adrian Carrasquillo is a political reporter for BuzzFeed News and is based in New York. Contact Adrian Carrasquillo at .", "external_links": [], "published": "2016-09-17T20:16:00.000+03:00", "crawled": "2016-09-17T16:02:01.074+03:00", "highlightTitle": ""}