{"organizations": [], "uuid": "ff1e0f696023ab59fb90d04fe243db4313944fd1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/694940094001_5111169548001_090316-cashinin-immigrants-1280.jpg", "site_section": "http://www.foxnews.com/costoffreedom/", "section_title": "The Cost of Freedom | Fox News", "url": "http://www.foxnews.com/transcript/2016/09/03/should-us-only-allow-access-to-immigrants-who-will-thrive/", "country": "IT", "domain_rank": 185, "title": "Should US only allow access to immigrants who will 'thrive'?", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "Should US only allow access to immigrants who will 'thrive'? | Fox News", "spam_score": 0.003, "site_type": "news", "published": "2016-09-03T03:00:00.000+03:00", "replies_count": 0, "uuid": "ff1e0f696023ab59fb90d04fe243db4313944fd1"}, "author": "FoxNews.com", "url": "http://www.foxnews.com/transcript/2016/09/03/should-us-only-allow-access-to-immigrants-who-will-thrive/", "ord_in_thread": 0, "title": "Should US only allow access to immigrants who will 'thrive'?", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "negative"}, {"name": "clinton", "sentiment": "none"}, {"name": "kaepernick", "sentiment": "none"}, {"name": "juan williams", "sentiment": "none"}, {"name": "mercedes schlapp", "sentiment": "none"}, {"name": "obama", "sentiment": "none"}], "locations": [{"name": "us", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "america", "sentiment": "none"}], "organizations": [{"name": "nfl", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "\nDONALD TRUMP: SOVEREIGN NATION HAS A RIGHT TO CHOOSE IMMIGRANTS LIKELY TO 'THRIVE' AND 'FLOURISH'\nKristin Tate: We should be able to choose who comes into this country, of course. We want immigrants that will continue to contribute to our society, instead of immigrants that will drain from our society. This is a moot point because the Obama administration and certainly the Clinton administration has zero intention of following immigration law. As long as the welfare state is in place, we should absolutely be prioritizing self-sufficient immigrants.\nJuan Williams: I don't think this is hard. Guess what? I love America, and I know that the Statue of Liberty talks about taking in those who have been thrown out in other countries. I know that we as Americans remember when Italians were viewed as less and Jews, in the midst of the Holocaust; we had to push them back. Again people said, we don’t want those people, they’re not the best. We find in America that we take people that have been rejected by others and they come here and they thrive and they make us stronger and make our economy stronger.\nMercedes Schlapp: The core issue here is, are we going to have a set of laws that are followed? We've seen the complacency; we have the fact that the Clinton and Obama administration have allowed this immigration thing to become the norm in our society. If you come in as an illegal, visa overstay, you don't leave, chances are you're not going to be deported, chances are you’re not going to pay the penalty. We should honor and respect those legal immigrants who have gone through the process, followed the law and have come to the United States. Because it is true, immigrants they make this country great and its part of that immigrant story that helps to build this nation.\nNFL QUARTERBACK KAEPERNICK STILL REFUSING TO STAND DURING NATIONAL ANTHEM\nMercedes Schlapp: I have to say, this is heartbreaking to watch. I think it’s an insulting action, especially towards the military, who sacrifice their life for our freedom so that he can live a luxurious life, becoming a successful football player and living an American dream. I have to tell you that sports figures are heroes for children. I find that so disappointing because of the fact that he won’t stand up for America.", "external_links": [], "published": "2016-09-03T03:00:00.000+03:00", "crawled": "2016-09-06T23:47:26.487+03:00", "highlightTitle": ""}