{"organizations": [], "uuid": "2b272fd74712b7c17fb87057cad89895216b6282", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.buzzfeed.com", "main_image": "https://img.buzzfeed.com/buzzfeed-static/static/2016-09/10/3/social_promotion/buzzfeed-prod-web03/facebook-social-promotion-15634-1473494141-1.png", "site_section": "", "section_title": "", "url": "https://www.buzzfeed.com/patrickstrudwick/this-is-what-its-like-to-be-dying-of-aids-and-then-survive", "country": "US", "domain_rank": 137, "title": "This Is What It's Like To Be Dying Of AIDS – And Then Survive", "performance_score": 0, "site": "buzzfeed.com", "participants_count": 0, "title_full": "This Is What It's Like To Be Dying Of AIDS – And Then Survive", "spam_score": 0.831, "site_type": "news", "published": "2016-09-10T08:00:00.000+03:00", "replies_count": 0, "uuid": "2b272fd74712b7c17fb87057cad89895216b6282"}, "author": "Patrick Strudwick Buzzfeed Lgbt Editor", "url": "https://www.buzzfeed.com/patrickstrudwick/this-is-what-its-like-to-be-dying-of-aids-and-then-survive", "ord_in_thread": 0, "title": "This Is What It's Like To Be Dying Of AIDS – And Then Survive", "locations": [], "entities": {"persons": [{"name": "ssanyu-sseruma", "sentiment": "none"}, {"name": "james", "sentiment": "none"}, {"name": "winnie ssanyu-sseruma", "sentiment": "none"}, {"name": "julio montaner", "sentiment": "none"}, {"name": "peter", "sentiment": "none"}, {"name": "laura gallant", "sentiment": "none"}, {"name": "rob", "sentiment": "none"}, {"name": "bernard", "sentiment": "none"}, {"name": "anna", "sentiment": "none"}, {"name": "john major", "sentiment": "none"}, {"name": "robert james", "sentiment": "none"}, {"name": "eddie izzard", "sentiment": "none"}, {"name": "lazarus", "sentiment": "none"}, {"name": "nick", "sentiment": "none"}], "locations": [{"name": "vancouver", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "somerset", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "sheffield", "sentiment": "none"}, {"name": "brighton", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "uganda", "sentiment": "none"}, {"name": "walthamstow", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "stanley park", "sentiment": "none"}, {"name": "kansas", "sentiment": "none"}, {"name": "swansea", "sentiment": "none"}, {"name": "hertfordshire", "sentiment": "none"}, {"name": "maryland", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}, {"name": "newham general hospital", "sentiment": "none"}], "organizations": [{"name": "st john ambulance", "sentiment": "none"}, {"name": "national insurance", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "XI International AIDS Conference, Vancouver, 1996 ID: 9564521 \n“There was this sense that something absolutely major had happened,” he says. But as Bernard listened a horrible realisation grew. The combinations used individual drugs that he had either already taken and become resistant to, or were so similar in their chemical structure that they would most likely not work on him. “I thought, Well, it’s great that lots of people are going to benefit, but I’m not .” \nHe was right. By 1999, Bernard was dying; the medication not only failing but also flooding his organs with so much toxicity as to trigger chemically induced hepatitis. Peter cared for him, tended to him, a 24-hour nurse. \n“My health became a full-time job,” he says, looking away, describing just the surface effects – cheeks sunken, buttocks and legs deflated; the most infamous side effects of early HIV medication, lipoatrophy and lipodystrophy, where body fat either disappears or resurfaces elsewhere. \n“I had so little energy,” says Bernard. “I could choose between doing one thing per day: I could go out to the local shops, or I could cook. My world shrank and shrank. I would just sit in a chair and look out the window, out at the world, and feel like I wasn’t part of it.” \nHe describes this time with a kind of baffled detachment, as if recounting a childhood nightmare. “I would just sit in a chair and look out the window, out at the world, and feel like I wasn’t part of it.” ID: 9567437 \n“I knew the chances of me making the millennium were slim,” he says quietly. “I wasn’t going to see 40. We both expected me to die.” \nThe dynamic between the couple shifted starkly: from partners to patient/carer – and worse. “I lost my sense of myself,” he says. “I gave up my identity to become the person that Peter could take care of. He became my daddy and I was the boy: infantilised, no power, no autonomy. The relationship had to work like that, but I don’t know who that person was. I was a shell.” \nBernard was at least able to warn his family back in Britain that he was dying – a fortune many parents of gay men, especially the illiberal, did not share. \n“I had found a man that was taking care of me, so I told them that so they didn’t worry I was going to die alone,” he says. His face is blank. \nAfter Bernard made it through the millennium, he read up on the latest treatments. From this research, he and his doctor, Julio Montaner – now an internationally acclaimed HIV expert – together devised a completely new combination, using eight different drugs, including a crucial new antiretroviral medication called Kaletra. Laura Gallant / BuzzFeed ID: 9553623 \n“The combination was incredibly experimental,” he says. “It was either going to kill me or cure me.” \nWithin just a couple of weeks he started to feel better. The amount of virus in his blood – called the viral load – started falling. He had terrible gastric side effects, but over a period of six months, Bernard’s health improved dramatically. One day he went for a walk in Vancouver’s Stanley Park. \n“It was the first time I was able to get up out of my chair,” he says. “I went out and it was like I was seeing in colour for the first time and I remember walking…” he inhales sharply, trying to keep control. His eyes fill. He swallows and starts again. “I remember walking through the park and just seeing the beauty of nature and the sky and the trees and the mountains and the sea and this feeling like, ‘This is amazing. I’m alive. I’m not going to die.’” \nBernard shifts in his chair, his face waking up, eyes darting around as if seeing a looming oasis. “It was that Lazarus moment. I came back from the dead.” \nRegaining his health, his life, also meant regaining himself. “I remember walking through the park and just seeing the beauty of nature and the sky and the trees and this feeling like, ‘This is amazing. I’m alive. I’m not going to die.’” ID: 9567423 \nIt destroyed his relationship. \nPeter, he says, realising that Bernard would now live, finally felt able to grieve for his father who had died a few years before, a grief suppressed by the more urgent need to save his boyfriend. The grief, says Bernard, surfaced and overwhelmed Peter, but Bernard could not look after him, could not return the favour. \n“Where I had been a very good patient, he wasn’t. And where he was a great caregiver, I was not. We tried to salvage our relationship but we ended up hating each other.” Bernard took a trip back to Britain to see friends, one of whom was living in Brighton on England’s south coast. \n“I instantly fell in love with the place and thought, I could live here. Vancouver is beautiful but I can’t stay there; it just reminds me too much of my past, of all the ghosts, of Peter and AIDS. Now there’s going to be a new chapter to my life .” \nHe left Vancouver and moved to Brighton. Dispensing with the entertainment reporting of his earlier life, Bernard dedicated himself to writing about HIV/AIDS treatment, work that later morphed into campaigning to combat the criminalisation of HIV transmission. \nSex resumed too. In most cases, adhering to medication suppresses the virus to such low levels (referred to as “undetectable”) as to make HIV-positive people uninfectious – a fact that quelled Bernard’s fear of passing it on. “I remember I met someone who came here and he fucked me – the first time I’d been fucked in a decade. This sense of, ‘Oh my god! I can enjoy sex again!’” \nIn the early ’00s he met his partner, Nick, who lives in Germany, but the distance – even after 13 years – works for them, he says: There is no danger of co-dependence. \nRealising he was not going to die was step one; realising he could might even reach old age was a second, slow awakening. \n“It was like being born again,” he says. “I basically lost my thirties, so I lived life again with a new vigour for everything. I could make plans – even a year or two years ahead.” \nHe began to see someone new in the mirror, too: someone alive, gaining weight, a complexion imbued with colour, but cheeks still sunken, the permanent telltale mark of lipoatrophy. \n“I would see the scars of the battles I’d been fighting,” he says. He started having a cosmetic filler treatment injected into his cheeks to plump out the ravines. It looks natural. He no longer has to confront a reflection of the past. \nBernard begins to talk about the box above his head, and what’s in it, but before he goes any further he mentions a straight man he knows called Rob, whose story he thinks should be told. ID: 9553579 Laura Gallant / BuzzFeed ID: 9553640 \nRobert James, it emerges over the course of a morning, has the blackest sense of humour, which he deploys with a delicious cackle. \n“I’m an actual heterosexual – a breeder with AIDS!” he chirps, sitting at a dining table strewn with papers and pills in his basement flat just a few streets away from Bernard. He walks with a stick. His dancing eyebrows, seasoned impishness, and reedy voice call to mind the comedian Eddie Izzard. \nJames was diagnosed when he was 19 in 1985, while living with his family in rural Somerset, England, and shortly before going to university – a place he had hoped would enable him to meet women. \n“It was a great time to get diagnosed with the worst disease in the world with which you would sexually kill all your girlfriends,” he says with such brutal sarcasm it sucks the air out of the room. “Really good timing.” “It was a great time to get diagnosed with the worst disease in the world with which you would sexually kill all your girlfriends.” ID: 9567462 \nHe also has haemophilia, the genetic disease that prevents blood clotting – in his case mostly internally, causing painful invisible bleeds that damage his joints. \nUntil 1985, when the medical profession started screening blood donations, the HIV virus was unknowingly contained in blood products – plasma, including a blood-clotting agent, extracted from numerous people’s blood – with which James injected himself every few days for years. \n“You took the diseases of 20,000 people, concentrated them all together and then injected them into lots of people!” he says, his voice rising in satire. \nThrough this, James also contracted hepatitis C, a virus that has many different forms, or “genotypes”. He has several. Only some are curable. \nHe returns to the moment he was diagnosed with HIV. “I went in with my dad and the doctor said she’d got something to say, that she was really sorry but they’d done a blood test and I’ve got this thing, HTLV-111.” It was a year before the international medical community had agreed to call the virus HIV. \nThe doctor did not tell James how long he had left to live. She did not know. No one did exactly, although at the time estimates tended to be about three years. \nHe cannot remember what he said in response, only how determined it made him. “To make sure I had a good time when I went to university,” he says, “because I’d probably not live long enough to finish the degree.” Laura Gallant / BuzzFeed ID: 9553648 \nWhile studying in Swansea, James was open about being HIV-positive, which spawned a thousand assumptions. Mostly, that he was gay. “I got used to coming out as straight,” he says, laughing. \nMixing in left-wing circles at college in the 1980s meant that having HIV as a white, straight man granted him immediate “cachet”, he says. \n“We were in the middle of a period when identity politics was really powerful and through this [HIV] I was instantly given one. Having a friend with the ‘gay plague’ [as it was then sometimes called] was an important thing for them, so there was a sense of some people wanting to be my friend because it could add to their own credibility.” \nThe parents of his girlfriends did not exactly feel the same. \n“They had nothing against me,” he says. “They just wished I’d fuck off and go out with someone else. They would see me as the person who was going to kill their daughter.” He pauses. \n“They never admitted that.” \nWhen relationships ended, James faced thoughts few students have to contend with. \n“It would be, I’m never to going to meet anyone else again, I’m just going to get horribly ill and die ,” he says, before segueing on to a broader discussion about his social life at university. \n“I got drunk a lot,” he says. “To manage the ups and downs.” \nLife expectancy around HIV would increase a little during the 1980s as more data was collected, but still, James realised that in all likelihood, rather than three years in total, he would probably have three years from when he first became ill. \n“There’s a certain freedom in it: ‘Well, it doesn’t matter if I mess things up, because I’m not going to get to the end, so I’m here for a good time,’” he says, before admitting, “It’s bloody depressing quite a lot of the time.” And annoyingly, he adds, he didn’t get ill at university. “So I had to do the bloody exams.” Laura Gallant / BuzzFeed ID: 9553667 \nWith extraordinary good fortune, James remained in relative good health for several years after university and moved to Hertfordshire with his girlfriend. “I thought, I’m gonna get ill at some point and when I do I’ve got three years. I need to build up savings so I can live OK for three years. That’s my plan .” He told his then girlfriend what they would do when that happened: “We’ll move back to Swansea and I’ll die on the Gower [a famously beautiful peninsula in the Welsh city]. Because I thought that would be a nice place to die.” \nJames stops, suddenly realising how dramatic this sounds – he hates the dramatic – and explains, “It becomes normal to have that conversation.” \nIt also became normal for him not to think about any long-term career, he says, or how much he was being paid, but to simply embark on jobs because they were interesting. He worked in various fields related to HIV or health: the drugs sector, homelessness, the St John Ambulance service. “I drifted around,” he says. Whenever anyone mentioned the word “pension” he would laugh. His friends began to die of AIDS. \nThe British government, meanwhile, started giving haemophiliacs who had contracted HIV “recompense”– compensation. \n“Newspapers would call us the ‘innocent victims’,” says James, with sneering disgust for the judgment this implied about others with HIV. \nOne day, after John Major’s government had decided to give HIV-positive haemophiliacs £20,000 “to stop us taking the government to court”, James took the cheque into the building society. \n“The woman behind the till said, ‘Ooh wow, you’re lucky.’” \nIn some regards, she was not wrong. James dodged all the major illnesses that prey on those with late-stage HIV: the pneumonias, the cancers. But as the years ticked by, with no effective treatment, James’ trust in doctors dwindled. So when combination therapy arrived in 1996 he was not exactly filled with optimism. He had moved to Brighton, partly on account of the fact that it has good coffee shops. He went to his new local HIV clinic. \n“I thought, I really should introduce myself and say, ‘When I get ill and die I’m going to need you. Up until then I really don’t think there’s any point me coming in.’ But the doctor wouldn’t hear a word of it. She said, ‘You should start on treatment.’” His CD4 count at the time was 150, dangerously low. \n“I said, ‘Treatment is a waste of time.’ And she got very angry and said, ‘No it’s not, it’s saving people’s lives and you’ve really got to do this.’” It was just after the Vancouver conference. “I said, ‘Treatment is a waste of time.’ And she got very angry and said, ‘No it’s not, it’s saving people’s lives and you’ve really got to do this.’” ID: 9567467 \nJames thought she was talking “crap” but read about it nonetheless. “I saw some of the stuff from the conference and was like, ‘Oh my god, it works. Wow.’ So I went back to the clinic and said, ‘Alright.’ At the time they were saying, ‘We think this will guarantee you at least another six months of life.’” But within six months of taking it, he says, that expectation had swelled to five years. \nThe medication worked. James didn’t have a Lazarus effect like Bernard’s – he hadn’t been ill enough to experience a dramatic physical improvement – but instead came an existential one. He now had to grasp that he would live. This took years. \n“It comes very slowly because there was always the fear of [drug] resistance, and then the next fear was getting a lymphoma or cancer that will kill you but it might not be for 10 years.” His friend Anna took him aside. \n“She said I’ve got to stop living like I was going to die. I would still make comments like, ‘I don’t need to bother with a pension or having a healthy diet because I’ll be dead long before it gets me,’ and she got fed up with me making the same comments. That made me think, Actually, yes, I am going to live .” Laura Gallant / BuzzFeed ID: 9553736 \nThis process was beset with other realisations. “There were moments of, Oh my god, I’m going to have to work another 30 years. I hadn’t thought of that . And, Yeah, I am going to retire, so I have to do something [about that]. Have I paid my National Insurance contributions? It hits you in waves. What am I going to do in work for 30 years? What do I want to do? ” He started saving for a pension and thinking about work differently, seeking more security. He’s now a lecturer in law. \nJames found himself facing the previously unthinkable prospect of reaching old age. \n“All that deterioration that I thought would be nicely condensed into a three-year period before death now might get stretched out,” he says, laughing wryly. \nSomething else happened: HIV went from being his most urgent, threatening illness, to the least. It suddenly dawned on James that he would have to do something about the hepatitis C, a slow-burning deterioration of the liver that can take 30 years to destroy it – decades he never thought he would see. \nHis haemophilia has been thrust into the foreground, too, not least because of what state he might be in physically with the condition in retirement. Over time, internal bleeding corrodes joints, which deform as they regrow. \nHis elbows are nobbled, distorted by the disease. Both his ankles have been operated on to fuse the bones together properly. Until those recent operations, the pain he was living with was worse, he says, than any pain he experienced through HIV. \nAfter several relationships, James is single. “I actually like it,” he says. Partly, he adds, because he gets bored easily, but also, “I’m very bad at letting people look after me.” \nIn a few weeks he turns 50. \n“I remember thinking it’d be amazing to get to the year 2000,” he says. “So 50 is really nice – I can say that I’m alive.” “I remember thinking it’d be amazing to get to the year 2000, so 50 is really nice – I can say that I’m alive.” ID: 9567473 \nHe begins to reflect on 1996 and the effect combination therapy had on his generation. “If treatment hadn’t come along, if it had been another 10 years, I may well have died. We survived just because we were lucky.” There is a tinge of something in his voice: guilt. \n“I don’t think you can live through a whole group of your peers and friends dying and not feel at some point it’s unfair that I survived and they didn’t,” he says. “I got lucky.” \nThere is someone else who shares this sense of luck. Someone who also knows James. She says she is privileged –“too privileged”, a description few could fit with the story that begins to unfold. ID: 9553583 \nIt is September 1996 and a 35-year old woman walks into Newham General Hospital, in east London. She is emaciated, broken, and close to death. \nHer name is Winnie Ssanyu-Sseruma. \nThe doctors ask her who she is and why she is there, and run tests on her. They are aghast at what they find. A healthy person’s immune system will show a CD4 count of between 500 and 1600. Ssanyu-Sseruma’s is 1. Any passing infection could kill her. The doctors ask more questions: Where have you been? How did you get like this? What is your immigration status? \nShe begins to tell them. They plead with her to return, so they can tend to her, monitor her, and administer the new drugs. But Ssanyu-Sseruma is not interested. She is ready to die. Laura Gallant / BuzzFeed ID: 9553750 \nTwenty years later, Ssanyu-Sseruma sits in her living room in Walthamstow, London, revisiting that time. Her eyes are wide and fill often; her voice is soft and low – smoky. A monochrome picture hangs in the hallway behind us. It is Ssanyu-Sseruma in the 1990s, a detailed drawing drafted from a photograph of her face. You cannot see how thin she had become. \nSsanyu-Sseruma was born in Sheffield, England, in 1961, but aged 2 moved with her parents back to their country: Uganda. It was a family of seven. Now it is four. \nAfter winning a scholarship at 19 to study in Kansas, Ssanyu-Sseruma moved east to Maryland in 1988 for an internship, and for which she was told a full medical check was required, including an HIV test. \n“When I was told that the test came back positive I was thinking, Surely HIV-positive has to be good? Positive is good, negative is bad ,” she says. “But the guy said, ‘HIV-positive means you have the HIV virus and there’s no cure. There’s no medicine. So we can’t determine how long you’re going to live.’ He said it in a very blasé way – as he was sitting down, getting his chair sorted. I was numb.” \nFrom that moment, she says, her life changed dramatically. She vowed to tell no one. \n“At that time, everything in the news was very grim [regarding HIV],” she says. “In Uganda HIV was well-known. The impact on people there, on whole villages – everybody just died. I didn’t know any women living with HIV [in the US] and the stigma…the combination of those things told me, ‘Just shut up.’” It also, she says, took time to understand the condition and how long she might have left. \n“I thought I would just drop dead, walking on the street. So I lived life like I could die any minute. If I was sitting somewhere with friends I would think, This might be the last time I sit with these people. I would walk in a daze, bumping into people, thinking that death could come and what could that mean?” “I thought I would just drop dead, walking on the street. If I was sitting somewhere with friends I would think, This might be the last time I sit with these people .” ID: 9567488 \nThe clinic in Maryland treated her sensitively, however. “I told them that I need to come to the clinic when there was no one from my [Ugandan] community there.” At the time in Uganda, she says, “there was a lot of talk about being bewitched” surrounding those with HIV. And there was another, more graphic name used instead of HIV: Slim. \n“If you got it you started to lose weight. Everybody knew, and you were taken somewhere – hidden away at your request, or it’d be the family’s decision – and died a really undignified death.” By 1990 around 1 in 6 adults in Uganda had HIV. \nShe feared that if she was seen at the Maryland clinic by fellow Ugandans, news of her HIV status would reach her family – news that would destroy them. \nIn 1990, Ssanyu-Sseruma discovered that one of her brothers was also living with the virus; the same year her mother died of cancer. Her brother died of HIV-related tuberculosis in 1992. The following year, her father died of cancer. Winnie Ssanyu-Sseruma ", "external_links": [], "published": "2016-09-10T08:00:00.000+03:00", "crawled": "2016-09-11T07:27:32.234+03:00", "highlightTitle": ""}