{"organizations": [], "uuid": "fc835bc88da695487afbb13cee280dd0fc12555e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 2, "shares": 2, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/images.foxnews.com/content/fox-news/world/2016/09/29/tumult-to-tranquility-migrant-family-finds-peace-in-germany/_jcr_content/par/featured-media/media-0.img.jpg/0/0/1475143648207.jpg?ve=1", "site_section": "http://feeds.foxnews.com/foxnews/world", "section_title": "FOX News", "url": "http://www.foxnews.com/world/2016/09/29/tumult-to-tranquility-migrant-family-finds-peace-in-germany.html", "country": "IT", "domain_rank": 185, "title": "Tumult to tranquility: Migrant family finds peace in Germany", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "Tumult to tranquility: Migrant family finds peace in Germany | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2016-09-29T03:00:00.000+03:00", "replies_count": 0, "uuid": "fc835bc88da695487afbb13cee280dd0fc12555e"}, "author": "Associated Press", "url": "http://www.foxnews.com/world/2016/09/29/tumult-to-tranquility-migrant-family-finds-peace-in-germany.html", "ord_in_thread": 0, "title": "Tumult to tranquility: Migrant family finds peace in Germany", "locations": [], "entities": {"persons": [{"name": "delphine qasu", "sentiment": "negative"}, {"name": "samir", "sentiment": "none"}, {"name": "delphine", "sentiment": "none"}, {"name": "bessi qasim", "sentiment": "none"}, {"name": "bessi qasu", "sentiment": "none"}, {"name": "dilshad", "sentiment": "none"}, {"name": "qasu", "sentiment": "none"}, {"name": "dunia", "sentiment": "none"}, {"name": "elzach", "sentiment": "none"}, {"name": "bessi", "sentiment": "none"}, {"name": "samir qasu", "sentiment": "none"}, {"name": "dildar", "sentiment": "none"}, {"name": "david rising", "sentiment": "none"}, {"name": "dildar qasu", "sentiment": "none"}, {"name": "muhammed muheisen", "sentiment": "none"}], "locations": [{"name": "pakistan", "sentiment": "none"}, {"name": "black forest", "sentiment": "none"}, {"name": "greece", "sentiment": "none"}, {"name": "berlin", "sentiment": "none"}, {"name": "dunia", "sentiment": "none"}, {"name": "aegean", "sentiment": "none"}, {"name": "austria", "sentiment": "none"}, {"name": "afghanistan", "sentiment": "none"}, {"name": "iraq", "sentiment": "none"}, {"name": "sinjar", "sentiment": "none"}, {"name": "heidelberg", "sentiment": "none"}, {"name": "denzlingen", "sentiment": "none"}, {"name": "elzach", "sentiment": "none"}, {"name": "balkans", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}, {"name": "middle east", "sentiment": "none"}], "organizations": [{"name": "germany   associated press", "sentiment": "neutral"}, {"name": "islamic state", "sentiment": "none"}, {"name": "associated press", "sentiment": "none"}, {"name": "ap", "sentiment": "none"}, {"name": "patrick henry village", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "  Associated Press   Email Print In this Thursday, Dec. 10, 2015 photo, Delphine Qasu, 18, right, a Yazidi refugee from Sinjar, Iraq, is comforted by her brother Dilshad, 17, while crying after talking about their journey to reach Germany, at their new temporary home at Patrick Henry Village, in Heidelberg, Germany. (AP Photo/Muhammed Muheisen)  (The Associated Press) \nIn this Wednesday, Sept. 14, 2016 photo, Samir Qasu, 46, right, and his wife Bessi Qasim, 43, Yazidi migrants from Sinjar, Iraq, attend their integration course at the town hall in Denzlingen, Germany. (AP Photo/Muhammed Muheisen)  (The Associated Press) \nIn this Tuesday, Sept. 13, 2016 photo, Bessi Qasim, 43, right, a Yazidi migrant from Sinjar, Iraq, cooks in her kitchen, while her son Dildar Qasu, 11, left, talks with their neighbor at their apartment in Elzach, Germany. (AP Photo/Muhammed Muheisen)  (The Associated Press) \nPrevious Next ELZACH, Germany –   They fled Iraq just ahead of an Islamic State group onslaught in which thousands of their fellow Yazidis were enslaved or slaughtered. Months as refugees on the fringes of Turkish society, a nearly fatal trip across the Aegean and a long trek through the Balkans and Austria north to Germany came next.\nNow, there finally is calm for the six members of the Qasu family, tranquility they only could dream of during their year-long odyssey.\nBessi Qasu, husband Samir, daughters Delphine and Dunia and sons Dilshad and Dildar share a small apartment in the serene town of Elzach, nestled in the rolling hills of the Black Forest in southwestern Germany.\n\"Not so long ago we were between life and death, but now we are a family in a home in a safe and great country,\" says Samir, 46, who ran a convenience store before his family fled in August 2014 as IS fighters closed in on the city of Sinjar in northern Iraq.\nGermany opened its borders to hundreds of thousands of asylum seekers like the Qasus last year. As they have settled around the country, it has led to friction at times with local residents, particularly in the eastern regions of the country.\nBut members of the Qasu family say they have felt none of that.\n\"Nobody discriminates against us. We don't feel different. Even my German friends tell me that now 'You're a German,'\" 18-year-old Dilshad says.\nHis father adds that they have done their best to fit in. \"We are their guests, and we have to respect their culture and traditions,\" Samir says.\nTo that end, Samir and Bessi are taking daily \"integration\" classes to learn the German language and culture, after which they hope to find jobs. Dunia, 14, attends a local secondary school and Dildar, 11, is in elementary school and plays on the local youth soccer team. Dilshad and Delphine, 19, are waiting to start classes at the end of September.\nWhen the family arrived in Germany on Dec. 9, they lived in a temporary facility in Heidelberg. They resettled in Elzach after about three months.\nNow granted asylum, they have been given a two-room apartment that is paid for by Germany along with the cost of utilities. In addition, they receive about 1,900 euros ($2,125) a month for food and other necessities, which they say is more than enough.\nAt least twice a day, they spread a big blanket on the floor of their apartment and eat meals while joking, discussing their progress learning German and talking about the future that once seemed so grim.\n\"I am happy to see my children safe and in schools, and a bright future waiting them,\" Bessi says.\nSamir says he talks about the old days with an Iraqi neighbor, but the children rarely mention their previous life or the journey that led them to Elzach.\n\"Please, let's not bring up these tough memories,\" Delphine says.\nDelphine hopes to eventually become a doctor, while Dildar nurses dreams of playing professional soccer. Like many young teenagers, Dunia isn't quite sure. She'd like to be a famous artist and is hedging her bets, learning both how to dance and to play the keyboard.\nDilshad just wants to bring in wages to provide for his family, helping his parents like they have helped him.\n\"Now I know I will have a good future,\" the young man says. \"The only future for us in Iraq was death.\"\n__\nMuhammed Muheisen, the Associated Press' chief photographer for the Middle East, Pakistan and Afghanistan, followed the Qasu family from Greece to Germany on Dec. 3-10, and returned on Sept. 13, 2016 to document how they settled down in Germany. David Rising in Berlin contributed to this report.", "external_links": [], "published": "2016-09-29T03:00:00.000+03:00", "crawled": "2016-09-29T13:14:47.237+03:00", "highlightTitle": ""}