{"organizations": [], "uuid": "9cfaa0a7e8579c3b69c9ca540f8de9d2f1a2a1cb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 3, "shares": 3, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/politics/0/0/Cortez%20Masto%20Heck%20Latino.jpg", "site_section": "http://feeds.latino.foxnews.com/home/feed", "section_title": "FOX News", "url": "http://latino.foxnews.com/latino/politics/2016/09/26/catherine-cortez-masto-faces-off-against-rep-joe-heck-for-harry-reid-senate/", "country": "US", "domain_rank": 185, "title": "Ex Nevada AG hopes to become 1st Latina in Senate, but getting tepid Hispanic support", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "Ex Nevada AG hopes to become 1st Latina in Senate, but getting tepid Hispanic support | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2016-09-26T03:00:00.000+03:00", "replies_count": 0, "uuid": "9cfaa0a7e8579c3b69c9ca540f8de9d2f1a2a1cb"}, "author": "Elizabeth Llorente", "url": "http://latino.foxnews.com/latino/politics/2016/09/26/catherine-cortez-masto-faces-off-against-rep-joe-heck-for-harry-reid-senate/", "ord_in_thread": 0, "title": "Ex Nevada AG hopes to become 1st Latina in Senate, but getting tepid Hispanic support", "locations": [], "entities": {"persons": [{"name": "joe heck", "sentiment": "negative"}, {"name": "catherine cortez masto", "sentiment": "negative"}, {"name": "elizabeth llorente    fox", "sentiment": "neutral"}, {"name": "brian baluta", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "heck", "sentiment": "none"}, {"name": "barack obama", "sentiment": "none"}, {"name": "romero", "sentiment": "none"}, {"name": "cortez masto", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "elizabeth llorente", "sentiment": "none"}, {"name": "fernando romero", "sentiment": "none"}, {"name": "catherine", "sentiment": "none"}, {"name": "reid", "sentiment": "none"}, {"name": "yvanna cancela", "sentiment": "none"}, {"name": "harry reid", "sentiment": "none"}, {"name": "sharron angle", "sentiment": "none"}], "locations": [{"name": "las vegas", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "latina u.s.", "sentiment": "none"}, {"name": "nevada", "sentiment": "none"}], "organizations": [{"name": "nevada ag", "sentiment": "negative"}, {"name": "1st latina", "sentiment": "negative"}, {"name": "senate", "sentiment": "negative"}, {"name": "fox news latino", "sentiment": "none"}, {"name": "roll call", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "gop", "sentiment": "none"}, {"name": "culinary union", "sentiment": "none"}, {"name": "facebook  follow us on twitter & instagram", "sentiment": "none"}, {"name": "democratic party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Elizabeth Llorente \n  Fox News Latino Catherine Cortez Masto (left) and Rep. Joe Heck. (Photos: Getty Images) \nNevada is shaping up to be a toss-up state – not just in the race for president, but in the one to replace retiring Sen. Harry Reid as well.\nPolls have consistently showed Republican U.S. Rep. Joe Heck with a slight lead over Democrat Catherine Cortez Masto, a former Nevada attorney general whom Reid endorsed.\nRepublicans are pouring money into the race, seeing it as their best hope to gain a seat in the Senate.\nCortez Masto’s campaign and supporters are seizing on Heck’s backing of GOP presidential nominee Donald Trump and casting him as a local version of the real estate mogul.\nRecently her campaign announced a grassroots coalition, “Latinos for Cortez Masto,” that includes more than 200 supporters. \nIn a statement, Cortez Masto pointed out that she's a granddaughter of a Mexican immigrant who achieved the American Dream. The United States, she stated, has provided her “the opportunity to be elected as the first Latina U.S. senator in U.S. history.”\nThe statement portrays her opponent as dangerous to Latinos and immigrants.\n“The message that Donald Trump is sending is getting [Latinos] energized,” Cortez Masto told Fox News Latino. “He called Mexicans rapists and criminals. It energizes people to come out and vote against Donald Trump.”\nShe added, “Congressman Heck has not said one thing to take on Donald Trump about this message of hate.”\n“I’m fighting for Latinos in this state,” Cortez Masto said. “Every single one of them is hard-working, working two jobs, and then going home to take care of their siblings.”\nHer mentor, Harry Reid, also recently mentioned Heck and Trump in the same breath.\n“Trump is going to lose Nevada, and Joe Heck deservedly is going to lose the Senate race,” Reid told reporters recently.\nIn 2010, Reid's Senate opponent, Sharron Angle, made immigration a cornerstone of her campaign and famously described the Senate Minority Leader as “the best friend an illegal alien ever had.”\nWhile Trump has consistently employed hardline immigration rhetoric like Angle did, Heck is more centrist on the issue.\nAsked about his support for Trump, Heck told Fox News Latino that he had pledged to back the party’s nominee for president, whoever that turned out to be.\n“My view is that I’m concentrating on the Senate race, while the other side is trying to link me and Donald Trump.”\nThe three-term U.S. representative told FNL that he supports comprehensive immigration reform, but not in one sweeping bill. He’d rather see the issue addressed in piecemeal fashion.\n“The other side tries to twist the narrative,” Heck said. “Things get shoved into a [comprehensive] bill that have nothing to do with immigration. We need to do it in an accountable and transparent way.”\nHeck supports giving undocumented immigrants who were brought here as children – so-called \"Dreamers\" – a path to legal status. But like many Republican elected officials, he does not support President Barack Obama’s executive actions giving Dreamers a reprieve from deportation and the ability to obtain work permits and some government benefits.\n“They’re kids that were brought here through no fault of their own – they need a path to citizenship,” Heck said, adding that he had worked on a bill several years ago that would have given them a chance to legalize, but then lost the support of Dreamers at the last minute.\n“I was shocked,” Heck said, adding that they told him they did not support the draft measure because it didn’t include relief for their parents. Heck said parents had never been part of the discussions his staff had with the young immigrants while working on the bill.\n“It happened for political reasons,” he said.\nWhile Heck holds a slight edge, Cortez Masto leads him among Latino voters, 58-to-24 percent – a considerable advantage, but smaller than Hillary Clinton’s edge over Trump among Latinos.\nMany Latino voters, expected to be about 20 percent of the state's electorate this year, have said in polls that they are not very familiar with either Heck or Cortez Masto.\nFernando Romero – head of Hispanics in Politics, the oldest Hispanic political group in Las Vegas – says that given Cortez Masto's statewide role as attorney general, she should be polling better than she is.\nDespite the strong Democratic machine that Reid offers, the national Democratic Party has not put enough resources into bolstering Cortez Masto, Romero said.\n“I think it will have an adverse effect,” he said. “They’re not giving her the support she needs.”\nThe two candidates are portraying themselves as people in touch with the state’s various communities who understand the struggles and hopes of all Nevadans.\nCortez Masto, the daughter of a Mexican-American father and an Italian-American mother, said she empathizes with immigrant families struggling to improve their lot in life and give their kids a better future.\n“That’s my life,” she said. “My father made it very clear to my sister and me that education is key, and you’re going to get one.”\nHeck told FNL that Hispanics who know him and his positions know he isn't the demagogues that Democrats are portraying him as.\n“We spend a great deal of time in the different communities,” Heck said. “You have to be visible and engaged in those communities all year long. I have Spanish-speakers working in my congressional office. I meet with the consul general of Mexico regularly.”\nPolitical experts say a strong turnout by white working-class voters energized by Trump would help Heck. A strong turnout by minorities, on the flip side, would boost Cortez Masto.\n“It remains to be seen if Hillary Clinton is going to drive voters to the polls the way Barack Obama did,” said Brian Baluta, a Heck campaign spokesman, according to Roll Call . “It’s going to be fought tooth-and-nail, because this is the race that is going to decide the Senate.”\nBut Cortez Masto supporters are hoping that convincing voters, particularly minorities, that Heck is a mirror image of Trump can tilt the election in the former attorney general’s favor.\n“It’s extremely close at all levels of the ticket,” Yvanna Cancela, political director for the Culinary Union, told Roll Call. “The level of anger toward Trump and his policy proposals and rhetoric is real. And I think the more Joe Heck is revealed to be aligned with Donald Trump, the better it is for Catherine.”\n\nElizabeth Llorente is the Politics Editor/Senior Reporter for Fox News Latino, and can be reached at Elizabeth.Llorente@Foxnewslatino.com. Follow her on https://twitter.com/Liz_Llorente \nLike us on Facebook \nFollow us on Twitter & Instagram", "external_links": [], "published": "2016-09-26T03:00:00.000+03:00", "crawled": "2016-09-27T21:30:38.941+03:00", "highlightTitle": ""}