{"organizations": [], "uuid": "968dcdc6c67ceb65dcf52cb48667a52564873f9d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/politics/0/0/Hilary%20Trump.jpg", "site_section": "http://feeds.latino.foxnews.com/home/feed", "section_title": "FOX News", "url": "http://latino.foxnews.com/latino/politics/2016/09/04/poll-finds-young-americans-split-clinton-and-trump-plans-for-immigration-border/", "country": "US", "domain_rank": 185, "title": "Poll finds young Americans split Clinton and Trump's plans for immigration, border control | Fox News Latino", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "Poll finds young Americans split Clinton and Trump's plans for immigration, border control | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2016-09-04T03:00:00.000+03:00", "replies_count": 0, "uuid": "968dcdc6c67ceb65dcf52cb48667a52564873f9d"}, "author": "Fox News Latino", "url": "http://latino.foxnews.com/latino/politics/2016/09/04/poll-finds-young-americans-split-clinton-and-trump-plans-for-immigration-border/", "ord_in_thread": 0, "title": "Poll finds young Americans split Clinton and Trump's plans for immigration, border control | Fox News Latino", "locations": [], "entities": {"persons": [{"name": "asian-ameri", "sentiment": "negative"}, {"name": "clinton", "sentiment": "negative"}, {"name": "trump", "sentiment": "negative"}, {"name": "chase anderson", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "toney", "sentiment": "none"}, {"name": "clare selden", "sentiment": "none"}, {"name": "barack obama", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "glen allen", "sentiment": "none"}, {"name": "hillary", "sentiment": "none"}, {"name": "reese toney", "sentiment": "none"}, {"name": "selden", "sentiment": "none"}], "locations": [{"name": "latino  des moines", "sentiment": "none"}, {"name": "iowa", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "virginia", "sentiment": "none"}, {"name": "arizona", "sentiment": "none"}, {"name": "boston", "sentiment": "none"}, {"name": "spokane", "sentiment": "none"}], "organizations": [{"name": "ap", "sentiment": "negative"}, {"name": "fox news", "sentiment": "negative"}, {"name": "fox news latino", "sentiment": "negative"}, {"name": "isis", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "associated press-norc center for public affairs research", "sentiment": "none"}, {"name": "black youth project", "sentiment": "none"}, {"name": "catherine t. macarthur foundation", "sentiment": "none"}, {"name": "ford foundation", "sentiment": "none"}, {"name": "university of chicago", "sentiment": "none"}, {"name": "facebook  follow us on twitter & instagram", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Published September 04, 2016 Fox News Latino \nDES MOINES, Iowa (AP) –   Young Hispanics, Asian-Americans and African-Americans are much more likely to trust Hillary Clinton than Donald Trump to deal with immigrants living in the United States illegally. But young whites tend to trust Trump more on issues related to illegal immigration, including securing the border.\nAmong young people overall, 47 percent say they think Trump would better handle securing the border, 26 percent say Clinton would, and 18 percent say neither would.\nThat's according to a new GenForward survey of adults age 18 to 30 by the Black Youth Project at the University of Chicago with the Associated Press-NORC Center for Public Affairs Research. There's little division on which candidate would better handle immigrants in the country now without permission, with 39 percent choosing Clinton, 38 percent Trump and 14 percent neither.\nBut on all those questions there are significant divisions based on race and ethnicity.\nAmong young whites, more say that Trump would better handle securing the border than Clinton, by a 57 percent to 19 percent margin, while 49 percent say Trump would deal with immigrants who are currently living in the United States illegally, versus 31 percent for Clinton.\n\"We have issues from ISIS types, also we have a lot of illegal immigrants that are taking away from people and we allow them to take government money,\" said Chase Anderson, 25, of Spokane, Washington, is white and thinks Trump would do better on border security. \"We need to figure out our own stuff.\"\nSignificantly more young Hispanics, African-Americans and Asian-Americans say Clinton than Trump would better handle dealing with immigrants who are already in the country illegally. Each of those groups is closely divided on which candidate would better handle securing the border.\nReese Toney, 24, of Glen Allen, Virginia, said he was from a mixed race background, noting that he had Hispanic, Italian and African-American roots and his grandfather was originally from Mexico. Toney said he has not decided who to support, but will not be voting for Trump. On border security he said, \"I have to say Hillary would do a better job than Trump because Trump would just alienate and agitate the countries around us.\"\nTrump has made immigration — including his plans to build a border wall and deport people in the country illegally— a central issue of his unconventional presidential bid. Clinton would offer a path to citizenship for immigrants in the country illegally and defend President Barack Obama's executive orders that defer enforcement action against children.\nThe poll was conducted before Trump's latest speech on immigration in Arizona this week, a fiery address that reaffirmed his campaign promise to build a wall along the 1,989-mile southern border and force Mexico to pay for it.\nMost young people oppose deporting all immigrants who are in the country illegally, though that's something nearly half of young whites say they support. Young people across racial and ethnic groups favor creating a pathway to citizenship for otherwise law-abiding immigrants who are currently living in the country illegally. That includes 85 percent of all young people, including about 9 in 10 Asian-Americans and Hispanics, along with more than 8 in 10 whites and African-Americans.\n\"I don't want to make convenient pathways to citizenship for everyone coming across. But we need a broader, more tolerant policy,\" said Clare Selden, 29, of Boston, who is white and plans to vote for Clinton. \"You need a path for people who are working and who work harder than I do.\"\nYoung people overall are also supportive of greater efforts to secure the border, but by smaller margins and with greater division among different racial and ethnic groups. Sixty-one percent of all young adults, including 66 percent of whites, 65 percent of Asian-Americans, and 57 percent of African-Americans, say they support increasing government spending on security and enforcement at U.S. borders. Young Hispanics are nearly evenly divided, with 47 percent in support to 52 percent opposed.\nStill, 69 percent of young people, including majorities from each racial and ethnic group, oppose building a border wall to stop illegal immigration.\n\"I don't think the border needs to be better secured,\" Selden said. \"I don't value that as a goal.\"\nMajorities of young people across racial and ethnic groups say they think immigrants are changing American culture and way of live for the better. That includes 64 percent of young people overall, 59 percent of whites, 63 percent of African-Americans, 76 percent of Asians and 75 percent of Latinos.\n\"I think immigration is the backbone of this country. Everybody came here searching for a better life,\" said Toney.\n___\nThe poll of 1,958 adults age 18-30 was conducted Aug. 1-14 using a sample drawn from the probability-based GenForward panel, which is designed to be representative of the U.S. young adult population. The margin of sampling error for all respondents is plus or minus 3.9 percentage points.\nThe survey was paid for by the Black Youth Project at the University of Chicago, using grants from the John D. and Catherine T. MacArthur Foundation and the Ford Foundation.\nRespondents were first selected randomly using address-based sampling methods, and later interviewed online or by phone.\nLike us on Facebook \nFollow us on Twitter & Instagram", "external_links": [], "published": "2016-09-04T03:00:00.000+03:00", "crawled": "2016-09-04T21:24:54.346+03:00", "highlightTitle": ""}