{"organizations": [], "uuid": "6c6320343ca2eb6aaa98a3aa4b95e6d5d085eadb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/694940094001_5111147834001_090316-bullsbears-refugees-1280.jpg", "site_section": "http://www.foxnews.com/costoffreedom/", "section_title": "The Cost of Freedom | Fox News", "url": "http://www.foxnews.com/transcript/2016/09/03/should-refugees-rebuild-detroit/", "country": "IT", "domain_rank": 185, "title": "Should refugees rebuild Detroit?", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "Should refugees rebuild Detroit? | Fox News", "spam_score": 0.001, "site_type": "news", "published": "2016-09-03T03:00:00.000+03:00", "replies_count": 0, "uuid": "6c6320343ca2eb6aaa98a3aa4b95e6d5d085eadb"}, "author": "FoxNews.com", "url": "http://www.foxnews.com/transcript/2016/09/03/should-refugees-rebuild-detroit/", "ord_in_thread": 0, "title": "Should refugees rebuild Detroit?", "locations": [], "entities": {"persons": [{"name": "detroit gary b. smith", "sentiment": "negative"}, {"name": "bill clinton", "sentiment": "negative"}, {"name": "trump", "sentiment": "none"}, {"name": "jonas max ferris", "sentiment": "none"}, {"name": "danielle mclaughlin", "sentiment": "none"}, {"name": "gary b. was", "sentiment": "none"}, {"name": "gina", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "jonas", "sentiment": "none"}, {"name": "gina louden", "sentiment": "none"}, {"name": "gary", "sentiment": "none"}, {"name": "gary b. smith", "sentiment": "none"}, {"name": "hillary", "sentiment": "none"}, {"name": "john layfield", "sentiment": "none"}], "locations": [{"name": "detroit", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "atlantic", "sentiment": "none"}, {"name": "miami", "sentiment": "none"}, {"name": "san diego", "sentiment": "none"}, {"name": "wall street", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "afghanistan", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}, {"name": "alabama", "sentiment": "none"}, {"name": "new york city", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "dagen", "sentiment": "none"}, {"name": "new jersey", "sentiment": "none"}, {"name": "new orleans", "sentiment": "none"}], "organizations": [{"name": "va", "sentiment": "none"}, {"name": "united nations", "sentiment": "none"}, {"name": "fema", "sentiment": "none"}, {"name": "united kingdom", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "\nBill Clinton Suggests 10,000 Syrian Refugees Could Help Rebuild Detroit\nGary B. Smith: Look in the discussion of immigrants taking jobs, you know, a lot of think tanks say well, they don't take our jobs because you know, people wouldn't want to take, you know, jobs in landscaping and maintenance and, you know, maid service because they wouldn't want to get the low wages. And that's true. But in the case of Detroit you're right the Syrian refugees would work at ultralow wages below minimum wage to get those jobs. Trump is right f we said we're just going to do it with U.S. citizens and labor like that, Detroit would probably have to attract drive up wages to attract people to move. So in that case he does have it right. There are jobs there. The question always is, are there jobs at the price people are willing to come and I will tell you what, since, you know, Hillary wants all the government backing that's a great place to put the extra money.\nGina Louden: Yeah, that's exactly right. I live in San Diego, Dagen, and we've taken more of the refugees than any place else in the country and as a result, we've seen many more homeless, many more of these tent cities and it is, I would say, smudging the beautiful reputation that San Diego has to some degree. But not only that, people are really suffering. Let me tell you, I'm a mother of a child with a chronic disease and when you go to hospitals now, the first thing that happens, is they put your child in isolation so that the infectious disease team can come test them and when I asked why, this takes a long time, these children are isolated. When I asked why, we have all of these refugees coming in, we don't know what foreign diseases there. Mix that with the illegals and we have a costly but also inhumane problem. That's -- isolation is for prisoners not for children and if Hillary is president, this is the new normal.\nDanielle McLaughlin: Bill Clinton has it right. This who is we are as a country. We brought in hundreds of thousands of Cuban refugee, Vietnamese refugees. Since 9/11, we've brought in 800,000 refugees. Even if it's 65,000 as Hillary Clinton is suggesting. That's a drop in the bucket. Many of these people are doctors and lawyers. The notion that they will take low paying jobs has no basis in fact. Detroit has 670,000 people in it, down from the peak of 2 million. Detroit needs a tech face. These people can provide it.\nJohn Layfield: And Bill Clinton was talking about low paying jobs. He wasn't talking about them going to work at the hospital as doctors. That argument certainly doesn't hold water. And why in the world are we talking about putting 10,000 refugees in homes in Detroit when we have 50,000 vets that served our country that are homeless right now. This is preposterous. The fact that we're doing something to help the refugee crisis. I went on the United Nations refugee agency website before the show, there are 65.3 Million people that are displaced right now because of conflict and persecution worldwide. 21.3 Mill reason refugee, 10 million are stateless, 33,972 per day are forced out of their homes because of conflict. When you're talking about dealing with 10,000, that is 99.95 percent are still out there. Why are we not dealing with Somalian refugees, 1.1 million there, 2.7 million in Afghanistan. This is a Band-Aid we're doing out there to show the world that we're doing something and by the way, we're spending $17,000 per refugee to get them here before they take social services. That's $170 million that we are spending on these 10,000 refugees while we leave our vets homeless.\nJonas Max Ferris: I don't think the refugees are besmirching the reputation of San Diego. Detroit is the place with low housing prices to Bill Clinton's point unlike San Diego where the median home price is probably 20 times what it is in the Detroit area. That would make sense to use a place basically a shelf its former glory to put -- if we're going to take in refugees that's the place to send them, not to San Diego. As far as the overall economic impact, the areas that took a lot of refugees in the past, Miami with Cubans that came over, economies stronger than they were when the refugees came over there when the place was a burned out not so great city. You could make the case that you can improve a city and go from a decayed structure, a high unemployment area by taking in.\nStates Bracing for Economic Impact as Storm Lashes East Coast\nJonas Max Ferris: Well in the long run because what happens is insured losses go up and if that pattern continues as we've seen recently with a lot of storms going on, then it becomes uninhabitable. The insurance rates they leave the companies or they raise rates so much people can't live in these areas. We're way off that, but there are certain areas of this country that are going in that direction. It's getting unaffordable to have insurance in many parts of Florida. It's been ten years since they've had a hit like this, but you don't want to see a permanent change going on. In the short run it's like free money. Getting a check from the insurance company, insurance company sells bonds and stocks to get that money, but it can damage the whole economy through the whole country about this problem.\nGary B. Smith: I disagree with Jonas on this. I think there are negative impacts long and short term. On the long term, the estimates from Katrina, for example, was they cut the GDP growth in half. It was growing about 3.5 percent Before Katrina and 1.7 percent After Katrina. In the short term an example of a person who owns a restaurant, owns a restaurant worth $500,000, gets a check to rebuild the restaurant for $500,000. That's to Jonas' point, all well and good. The customers stop coming to the restaurant because it's not there so that person that owns the restaurant has a total decrease in revenue. That's the problem. People stop going to movies, they stop taking Uber, all that stuff and that money doesn't come back. So in some cities like New Orleans, you know, maybe we're going to see from the latest in the coast of Florida there, a lot of that revenue and potential profit is gone forever and the long-term impact whether it's tornado or hurricane, has always now studies shown to be negative to the economy.\nGina Louden: A lot of it is. I was in Alabama when the horrible tornadoes took place that killed more than 100 and I can tell you that people think that FEMA goes in and takes care and fixes these problems but they're very expensive. Yes, but also very slow and in some ways ineffective. Counter to most of the things that the federal government involves itself in, this is one place they are supposed to be but perhaps some strategic planning would be in order to predict these disasters and think a little bit more effectively about how that money can be spent on time and below budget because it is very expensive.\nJohn Layfield: The impact is going to be negative. Very smart people like Jonas and Gary have discussed this for some time. That's why the Atlantic published a research report on this that covered 6712 cyclones, typhoons and hurricanes from 1950 to 2008 to measure the impact and what they came up with, was that Gary B. Was right, it always has a negative effect on the economy. Now a smaller type hurricane or cyclone will have an effect of say a currency price, but a bigger one like a Katrina will have the effect they paralleled it to say a systemic financial failure which is exactly what you saw in New Orleans, the same type of economic destruction, so long-term, this is going to be very bad.\nDanielle McLaughlin: I agree it's taken New Orleans to get back to the same number of hotel rooms as it did pre-Katrina. Ten years is a long time in a city like that relies on tourism. It's a holiday weekend. We saw from sandy, New Jersey lost $950 million in tourist revenue. New York City lost $1.2 billion. This is not what Florida needs at this time.\nGovernment Proposing 14 New Rules for Obamacare as Premiums Spike and Insurers Drop Out\nGina Louden: We need to get rid of it. This is exactly what happens when the government dabbles in the human behavior. The choices we make as consumers in our daily lives. We need to let the free market flow. The problem is, that we have someone applying for the job of president who has zero understanding of free market economics and if we taught this more in our schools economic and civics more in our schools people could understand that competition works and that it is the problem when the government medals in that.\nJohn Layfield: They're not going to fix it. What we will see is very much what you see in Europe, a cash medical service. What you're seeing right now in the United States compared to an insurance medical service. She may be right about the economic fallibility of these guys but politically they were spot on if you want to get something passed. Give something free to a bunch of people and pass on the costs until late remember different administrations have to worry about it. That's what they've done. Try taking something free away from a bunch of people. It's not easy to do. The costs are coming up. This is only insurance reform. We need major health care reform. I don't think we're going to repeal it.\nGary B. Smith: I disagree on one point. Hillary Clinton understands the free market based on the evidence how much she got paid from Wall Street on the speeches she gave. But the point is, in medical care, I'm going to say we have a free market and proven a free market can work in health care. It's in plastic surgery. A couple facts since 1992, medical care has gone up, the price of medical care, 118 percent. Price of a physician service is 92 percent. Inflation rate, 64 percent. You know what plastic surgery prices have increased during the same time, 30 percent. It shows that the free market works. People are able to out there and look at price and service and compare and contrast, they can come up with it. Unfortunately, this government doesn't want it for general health care and that's a mistake.\nDanielle McLaughlin: I understand. The thing is that we had problems with health care long before Obamacare. In 2012 before the main parts of the ACA were put into place our per head, per capita cost on health care was 50 percent higher than the united kingdom which has Quote: /unQuote: socialized medicine. We have three systems here. Purely government system with the VA, we have the sort of new market based systems with these the exchanges and a mixture with private health care as it relates to people who have jobs and their employers pay for it. We have bankruptcy and that's an enormous problem.\nJonas Max Ferris: Gina's point, it's our choices that are playing a role in the rising costs. Our choices, had less children in the past, healthy young people to pay in the system, our choices to be fatter, our choice to take drugs in lieu of health care choices to make to not need expensive drugs paid for, these are reasons why it goes up more than inflation. You can't fix magically.\nStock Picks\nGary B. Smith: (AXP) Gains 30 percent in 1 year\nJohn Layfield: (FB) climbs 15 percent in 1 year\nJonas Max Ferris: (VFINX) Returns 10 percent in 1 year", "external_links": [], "published": "2016-09-03T03:00:00.000+03:00", "crawled": "2016-09-06T23:47:28.925+03:00", "highlightTitle": ""}