{"organizations": [], "uuid": "6054edacddcc34db0c19e819c1cbe24748195915", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 201, "shares": 201, "comments": 120}, "stumbledupon": {"shares": 0}}, "site_full": "www.buzzfeed.com", "main_image": "https://img.buzzfeed.com/buzzfeed-static/static/2016-09/1/16/campaign_images/buzzfeed-prod-fastlane02/baffled-republicans-wonder-who-was-trumps-immigra-2-25954-1472760130-0_dblbig.jpg", "site_section": "http://www.buzzfeed.com/politics.xml", "section_title": "BuzzFeed - Politics", "url": "https://www.buzzfeed.com/mckaycoppins/baffled-republicans-wonder-who-was-trumps-immigration-speech", "country": "US", "domain_rank": 137, "title": "Baffled Republicans Wonder: Who Was Trump’s Immigration Speech For?", "performance_score": 2, "site": "buzzfeed.com", "participants_count": 1, "title_full": "Baffled Republicans Wonder: Who Was Trump’s Immigration Speech For?", "spam_score": 0.0, "site_type": "news", "published": "2016-09-02T02:41:00.000+03:00", "replies_count": 0, "uuid": "6054edacddcc34db0c19e819c1cbe24748195915"}, "author": "McKay Coppins", "url": "https://www.buzzfeed.com/mckaycoppins/baffled-republicans-wonder-who-was-trumps-immigration-speech", "ord_in_thread": 0, "title": "Baffled Republicans Wonder: Who Was Trump’s Immigration Speech For?", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "negative"}, {"name": "ralph freso", "sentiment": "negative"}, {"name": "fleischer", "sentiment": "none"}, {"name": "jeb bush", "sentiment": "none"}, {"name": "appell", "sentiment": "none"}, {"name": "nowrasteh", "sentiment": "none"}, {"name": "alex nowrasteh", "sentiment": "none"}, {"name": "ann coulter", "sentiment": "none"}, {"name": "mckay coppins", "sentiment": "none"}, {"name": "david kochel", "sentiment": "none"}, {"name": "kochel", "sentiment": "none"}, {"name": "keith appell", "sentiment": "none"}, {"name": "greg mueller", "sentiment": "none"}, {"name": "ari fleischer", "sentiment": "none"}], "locations": [{"name": "mexico", "sentiment": "none"}, {"name": "rust belt", "sentiment": "none"}, {"name": "phoenix", "sentiment": "none"}], "organizations": [{"name": "cato institute", "sentiment": "none"}, {"name": "republican party", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "buzzfeed news", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Ralph Freso / Getty Images ID: 9546950 \nIn the wake of Donald Trump’s hardline immigration speech Wednesday night, Republicans throughout the party largely abandoned discussion of a late push to win over Latinos, and seemed instead to focus on a new question: Which white voters can the candidate still reach? \nTrump’s much-hyped speech in Phoenix came after two roller-coaster weeks in which the nominee flailed and flip-flopped on the immigration issue, and suggested he was “softening” his stance. This brief flirtation with moderation led many to speculate that Trump was courting Hispanic voters — a theory that was buoyed by the candidate’s last-minute meeting with the Mexican president Wednesday. \nBut interviews with a wide range of Republicans — from unabashed Trump supporters to #NeverTrump bitter-enders — suggested few in the party are still clinging to that hope. \nAri Fleischer, the former White House press secretary and a reluctant Trump supporter, praised the nominee’s visit to Mexico, which he said made Trump “appear more presidential” and could help win over “college-educated voters, a group with whom he’s greatly underperforming.” \nBut as for courting Latinos, Fleischer said, “I’m afraid it’s too late. He likely has already made too many Hispanics think he doesn’t want them in the country. They’re not listening to his next sentence. He’s already lost too much support that his words now won’t make any meaningful difference.” \nDavid Kochel, an Iowa-based Republican operative and former campaign strategist for Jeb Bush, interpreted Trump’s immigration speech as a “decision to play directly to [his] already secured base.” \n“It has to be their calculation that they can drive up turnout in white working-class areas of battleground states to dizzying heights,” Kochel said. “Otherwise this move makes no sense 69 days from the election.” In any case, he added, “The ‘softening’ of Trump’s immigration policy died tragically on Wednesday night in Phoenix. Foul play is suspected.” \nRepublicans and conservatives remained sharply divided over the wisdom and effectiveness of Trump’s immigration tough talk — but there was little disagreement about its intended audience. While right-wing Trump boosters like Ann Coulter celebrated on Twitter Wednesday night, several Hispanic campaign surrogates openly discussed rescinding their support for Trump. \n“I thought a lot about union members, veterans, and moms in Rust Belt states and how they might be receiving this speech … I could easily visualize countless heads nodding ‘yes,’” said Keith Appell, a conservative strategist who supports Trump. \nGreg Mueller, Appell’s business partner and fellow Trump supporter, hailed Wednesday as “one of the best days of [Trump’s] campaign.” \nCato Institute immigration policy analyst Alex Nowrasteh, meanwhile, said, “Trump’s aim was to shore up his base — in late August. … The speech was one big dog whistle to anti-immigration populists.” \nNowrasteh, who opposes Trump, added, “After this speech, nobody can claim Trump has softened his policy. When he loses in November it will be because his immigration stance is wildly out of step with voters.” McKay Coppins is a senior writer for the BuzzFeed News politics team, and the author of The Wilderness , about the battle over the future of the Republican Party. Contact McKay Coppins at .", "external_links": [], "published": "2016-09-02T02:41:00.000+03:00", "crawled": "2016-09-02T01:10:40.225+03:00", "highlightTitle": ""}