{"organizations": [], "uuid": "187ce28ab2455488bd48dad24bf1d4084bfde64d", "thread": {"social": {"gplus": {"shares": 7}, "pinterest": {"shares": 4}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 195, "shares": 195, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/images.foxnews.com/content/fox-news/us/2016/09/23/indonesian-fishermen-who-fled-slavery-in-san-francisco-sue-boat-owner/_jcr_content/par/featured-media/media-0.img.jpg/0/0/1474608047375.jpg?ve=1", "site_section": "http://feeds.foxnews.com/foxnews/national", "section_title": "FOX News", "url": "http://www.foxnews.com/us/2016/09/23/indonesian-fishermen-who-fled-slavery-in-san-francisco-sue-boat-owner.html", "country": "CH", "domain_rank": 185, "title": "Indonesian fishermen who fled slavery in San Francisco sue boat owner", "performance_score": 1, "site": "foxnews.com", "participants_count": 0, "title_full": "Indonesian fishermen who fled slavery in San Francisco sue boat owner", "spam_score": 0.0, "site_type": "news", "published": "2016-09-23T13:11:00.000+03:00", "replies_count": 0, "uuid": "187ce28ab2455488bd48dad24bf1d4084bfde64d"}, "author": "", "url": "http://www.foxnews.com/us/2016/09/23/indonesian-fishermen-who-fled-slavery-in-san-francisco-sue-boat-owner.html", "ord_in_thread": 0, "title": "Indonesian fishermen who fled slavery in San Francisco sue boat owner", "locations": [], "entities": {"persons": [{"name": "scoma", "sentiment": "none"}, {"name": "thoai nguyen", "sentiment": "none"}, {"name": "stephen yale-loehr", "sentiment": "none"}, {"name": "nguyen", "sentiment": "none"}, {"name": "sorihin", "sentiment": "none"}, {"name": "abdul fatah", "sentiment": "none"}], "locations": [{"name": "san francisco", "sentiment": "none"}, {"name": "jakarta", "sentiment": "none"}, {"name": "indonesia", "sentiment": "none"}, {"name": "hawaii", "sentiment": "none"}, {"name": "u.s", "sentiment": "none"}, {"name": "fisherman", "sentiment": "none"}, {"name": "honolulu", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "san francisco", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "san jose", "sentiment": "none"}, {"name": "fiji", "sentiment": "none"}, {"name": "singapore", "sentiment": "none"}, {"name": "southeast asia", "sentiment": "none"}, {"name": "pacific island", "sentiment": "none"}, {"name": "sydney", "sentiment": "none"}], "organizations": [{"name": "twitter", "sentiment": "negative"}, {"name": "facebook", "sentiment": "negative"}, {"name": "pago pago", "sentiment": "none"}, {"name": "hawaii longline association", "sentiment": "none"}, {"name": "border protection", "sentiment": "none"}, {"name": "associated press", "sentiment": "none"}, {"name": "congress", "sentiment": "none"}, {"name": "u.s. coast guard", "sentiment": "none"}, {"name": "cornell university", "sentiment": "none"}, {"name": "american samoa", "sentiment": "none"}, {"name": "customs", "sentiment": "none"}, {"name": "catholic church", "sentiment": "none"}, {"name": "ap", "sentiment": "none"}, {"name": "fatah", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Indonesian fishermen who fled slavery in San Francisco sue boat owner   Facebook 0 Twitter 0 livefyre Email Print In this photo taken Friday, Nov. 6, 2015, is the Sea Queen II docked at Fisherman's Wharf in San Francisco. (AP) \nSAN FRANCISCO – Two Indonesian fishermen who escaped slavery aboard a Honolulu-based tuna and swordfish vessel when it docked at San Francisco's Fisherman's Wharf are suing the boat's owner for tricking them into accepting dangerous jobs they say they weren't allowed to leave. \nAttorneys for Abdul Fatah and Sorihin, who uses one name, say in a lawsuit filed in federal court Thursday that they were recruited in Indonesia seven years ago to work in Hawaii's commercial fishing fleet without realizing they would never be allowed onshore. They have since been issued visas for victims of human trafficking and are living in the San Francisco area. \nThe lawsuit alleges that San Jose, California, resident Thoai Nguyen, owner and captain of the Sea Queen II, forced Sorihin and Fatah to work up to 20-hour shifts, denied them medical treatment and demanded thousands of dollars if they wanted to leave before their contracts expired. Nguyen did not return calls seeking comment. \nThe lawsuit seeks payment for debts the men incurred, fees they paid and compensation promised without specifying a dollar amount, and asks for unspecified damages for \"mental anguish and pain.\" \n\"I want to be compensated because of the suffering I felt on the boat and all the suffering I have endured after I got off the boat,\" Sorihin said Thursday through a translator at his lawyer's San Francisco office. \"And I hope no one will suffer what I have suffered.\" \nThe lawsuit comes two weeks after an Associated Press investigation found around 140 fishing boats based in Honolulu, including Sea Queen II, were crewed by hundreds of men from impoverished Southeast Asia and Pacific Island nations. The seafood is sold at markets and upscale restaurants across the U.S. A legal loophole allows them to work without visas as long as they don't set foot on shore. The system is facilitated by the U.S. Coast Guard, as well as Customs and Border Protection who require boat owners to hold workers' passports. \nAP found some men are paid as little as 70 cents an hour. Others had to use buckets instead of toilets, suffered running sores from bed bugs or sometimes lacked sufficient food. \nIn response, the Hawaii Longline Association representing fishing boat owners has created a universal crew contract that will be required on any boat wanting to sell fish in the state's seafood auction starting Oct. 1. The group says it deplores human trafficking, and that the contract will protect workers. \nThe contracts let owners continue to set their own minimum salaries, allow workers to spend the entire year at sea (15 trips, 10 to 40 days each), and reiterate that they must remain on board with passports held by owners. \nCornell University law professor Stephen Yale-Loehr said the new contract \"reinforces the current deplorable situation by emphasizing that the crew members have no real rights.\" \n\"Congress should repeal the loophole that exempts U.S. fishing captains from having to provide basic labor protections to their crew,\" he said. \nHere's what Sorihin and Fatah say happened to them. \nThey signed contracts promising $350 a month plus bonuses. They borrowed about $300 to pay an agent in Jakarta. They flew from Jakarta to Singapore, then Sydney, on to Fiji and Pago Pago, American Samoa, an exhausting, 12,500-mile trip. \nBecause docking is inconvenient and potentially costly, the fishermen had to swim from one boat to another before sailing to Honolulu to begin fishing. \nThen it got worse. \nOne day as Sorihin wrestled a shark onto the Sea Queen, a fishing line got wrapped around his finger, nearly breaking it off. He said his captain set it straight with a chopstick, rubbing ginger and honey on it. \nAnother time a winch cable snapped, cracking Sorihin in his shoulder; swollen and sore, he was allowed a two-hour rest. A swordfish sliced his face as he pulled it aboard, according to the lawsuit. \nThey say the captain was verbally abusive and gave them only torn and worn-out gear. There was new protective gear on the boat but the captain said they would have to pay for it. Both men asked to see a doctor at various times but were told there was no health insurance. \n\"I knew if I stayed on that boat I was going to die,\" said Sorihin in an interview. \nThey worked from 6 a.m. to 6 p.m. without a food break. Then, after a meal and a few hours' rest, they'd fish some more. After a few trips, three relatives of the captain's joined them as crew. \n\"The captain's nephew kicked me with his feet to wake me up. I never felt safe working on that boat,\" Fatah said in an interview. \nAlthough there was a toilet on board, they had to go to the bathroom in plastic buckets and baggies on deck. And the money, a few hundred dollars a month, just wasn't worth it. \nAfter a few 20-day trips out of Hawaii, they began docking in San Francisco about once a month. They would gaze from Fisherman's Wharf dock over to Scoma's, a classic San Francisco seafood restaurant where diners enjoyed the freshest catch. \nThen they'd head out to sea again. One day Fatah got washed onto a railing by a huge wave. He shivered, cried and cramped up. \"I thought, 'This is probably the end,'\" he said. \nThey asked to go home, but were told they would have to reimburse the captain the $6,000 he spent to bring them there. \nFinally, they decided to run. It was before dawn, six years ago, when the skipper was gone and drunken crewmembers slept. Sorihin and Fatah sneaked into a private room and grabbed their passports. They dashed through San Francisco's historic waterfront and eventually boarded a southbound train toward San Jose, where they sought help from an Indonesian man they knew of. \n\"I didn't think I'd have another chance to survive at sea,\" said Fatah. \"I was really afraid.\" \nThe man took them in and found them help, through the Catholic Church, a shelter, social workers and eventually immigration attorneys. \nToday they both work two jobs. They clerk at a liquor store, and Sorihin also drives a car for hire. Fatah takes inventory at a department store. Neither goes anywhere near Fisherman's Wharf. \nEarlier this year, before filing their lawsuit, they looked at photos of the Sea Queen II and their former captain. \n\"That's him,\" said Sorihin, shaking his head when asked if he would take a short walk to see the boat. \"I'm afraid of this man.\" Advertisement", "external_links": [], "published": "2016-09-23T13:11:00.000+03:00", "crawled": "2016-09-23T08:33:26.418+03:00", "highlightTitle": ""}