{"organizations": [], "uuid": "96523e2c9785f05d823ab8b9e9fd19d0db0d141a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 15, "shares": 15, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/images.foxnews.com/content/fox-news/us/2016/09/18/latest-clinton-condemns-apparent-terrorist-attacks/_jcr_content/par/featured-media/media-0.img.jpg/0/0/1474231776485.jpg?ve=1", "site_section": "http://feeds.foxnews.com/foxnews/national", "section_title": "FOX News", "url": "http://www.foxnews.com/us/2016/09/18/latest-clinton-condemns-apparent-terrorist-attacks.html", "country": "CH", "domain_rank": 185, "title": "The Latest: Clinton condemns 'apparent terrorist attacks'", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "The Latest: Clinton condemns 'apparent terrorist attacks'", "spam_score": 0.0, "site_type": "news", "published": "2016-09-19T04:32:00.000+03:00", "replies_count": 0, "uuid": "96523e2c9785f05d823ab8b9e9fd19d0db0d141a"}, "author": "", "url": "http://www.foxnews.com/us/2016/09/18/latest-clinton-condemns-apparent-terrorist-attacks.html", "ord_in_thread": 0, "title": "The Latest: Clinton condemns 'apparent terrorist attacks'", "locations": [], "entities": {"persons": [{"name": "clinton", "sentiment": "negative"}, {"name": "cheney", "sentiment": "none"}, {"name": "dick cheney", "sentiment": "none"}, {"name": "bush", "sentiment": "none"}, {"name": "tim kaine", "sentiment": "none"}, {"name": "barack obama", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "martha raddatz", "sentiment": "none"}, {"name": "martinez monsivais", "sentiment": "none"}, {"name": "george w. bush", "sentiment": "none"}, {"name": "kaine", "sentiment": "none"}, {"name": "obama", "sentiment": "none"}, {"name": "stephen m. dowell/orlando sentinel", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "african-american", "sentiment": "none"}, {"name": "mike pence", "sentiment": "none"}, {"name": "pence", "sentiment": "none"}, {"name": "chris christie", "sentiment": "none"}], "locations": [{"name": "united states", "sentiment": "none"}, {"name": "minnesota", "sentiment": "none"}, {"name": "miami", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "houston", "sentiment": "none"}, {"name": "portsmouth", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}, {"name": "jacksonville", "sentiment": "none"}, {"name": "fla.", "sentiment": "none"}, {"name": "chelsea", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "kenya", "sentiment": "none"}, {"name": "indiana", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "n.h.", "sentiment": "none"}, {"name": "new jersey", "sentiment": "none"}], "organizations": [{"name": "facebook", "sentiment": "negative"}, {"name": "trump", "sentiment": "none"}, {"name": "congressional black caucus foundation", "sentiment": "none"}, {"name": "remembrance project", "sentiment": "none"}, {"name": "legislative conference phoenix awards dinner", "sentiment": "none"}, {"name": "abc", "sentiment": "none"}, {"name": "senate", "sentiment": "none"}, {"name": "email print republican", "sentiment": "none"}, {"name": "isis", "sentiment": "none"}, {"name": "associated press", "sentiment": "none"}, {"name": "first baptist church of jacksonville", "sentiment": "none"}, {"name": "nbc", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "house", "sentiment": "none"}, {"name": "secret service", "sentiment": "none"}, {"name": "ap", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The Latest: Clinton condemns 'apparent terrorist attacks' Published September 18, 2016 Facebook 0 Twitter 0 Email Print Republican vice presidential candidate Mike Pence speaks at a campaign rally at The Villages, Fla., on Saturday, Sept. 17, 2016. (Stephen M. Dowell/Orlando Sentinel via AP) (The Associated Press) Democratic vice presidential candidate, Sen. Tim Kaine, D-Va. holds up books to show the difference between the two campaigns for president, Thursday, Sept. 15, 2016, in Portsmouth, N.H. (AP Photo/Jim Cole) (The Associated Press) President Barack Obama speaks at the Congressional Black Caucus Foundation's annual Legislative Conference Phoenix Awards Dinner, Saturday, Sept. 17, 2016 in Washington. (AP Photo/Pablo Martinez Monsivais) (The Associated Press) \nWASHINGTON – The Latest on Campaign 2016 (all times EDT): \n4:15 p.m. \nHillary Clinton is condemning what she calls \"apparent terrorist attacks\" in Minnesota, New Jersey and New York. \nOfficials in New York said Sunday they were still trying to determine who was behind an explosion that rocked the Chelsea neighborhood and what the motivation was. New Jersey law enforcement would not say if a pipe bomb that exploded at a seaside community was terror-related. Officials said an attack at a Minnesota mall in which a man stabbed nine people was being investigated as a possible act of terrorism; an Islamic State-run news agency called the attacker a \"soldier of the Islamic State.\" \nIn a statement Sunday, the Democratic presidential candidate said law enforcement officials in New York and New Jersey need support as they investigate. \nClinton said of the Minnesota attack, \"this should steel our resolve to protect our country and defeat ISIS.\" \n___ \n11:15 a.m. \nRepublican running mate Mike Pence says \"we're all troubled in our hearts\" about explosions Saturday in New Jersey and New York and a knife attack in Minnesota. \nPence spoke Sunday during a service at the 7,700-seat First Baptist Church of Jacksonville. Pence did not say if he has been briefed on the two explosions or the mall stabbing where eight people were injured before the attacker was shot and killed by police. No one was killed in either of the explosions Saturday. \nPence is giving thanks that no one else died \"as a result of these horrific attacks.\" Pence says he is praying for those who are recovering from their injuries as well as the first responders and those investigating the incidents. Pence says that whether the incidents were acts of terrorism or inspired by terrorists, \"prayer and vigilance is the order of the day.\" \n___ \n11:00 a.m. \nHillary Clinton's vice presidential running mate has split with her over Clinton's description of some Donald Trump supporters as \"irredeemable.\" \nTim Kaine said on ABC's \"This Week\" on Sunday that irredeemable \"is not a word I would use.\" But he suggested that it's not likely the Democrats would be able to change the minds of hardcore Trump supporters on such issues as where President Barack Obama was born. \nKaine says Clinton was right to call out \"dark emotions.\" \nClinton earlier this month said she considers \"half\" of Trump's supporters to be \"deplorables\" who are \"irredeemable.\" She later apologized for saying \"half\" and acknowledged that many of his supporters are hardworking, but disillusioned. \n___ \n10:45 a.m. \nRepublican vice presidential running mate Mike Pence is dismissing as \"absolute nonsense\" any suggestion that Donald Trump is suggesting violence against Hillary Clinton. \nTrump on Friday told a crowd in Miami that since Clinton is for gun control, her Secret Service detail should disarm and, \"let's see what happens to her.\" \nPence said on ABC's \"This Week\" that Trump was suggesting Clinton has been protected by gun-toting security guards for decades. Pence said Trump's point was that \"she'd change her attitude about the right to keep and bear arms \" if she didn't have a security detail. \nPence said he'd \"bet that's probably true.\" \n___ \n9:35 a.m. \nDonald Trump's most visible supporters are insisting that \"birtherism\" is no longer an issue for the Republican presidential nominee. \nThat's what vice presidential running mate Mike Pence, New Jersey Gov. Chris Christie and others are saying on Sunday news shows. They said Trump's comments Friday acknowledging that President Barack Obama was born in the United States cancels out Trump's five years of suggesting otherwise. The surrogates also insisted that a confidant of Hillary Clinton's started peddling the theory that Obama was born in Kenya, that Trump has been a victim of unfair media coverage over the issue and that Americans don't care about the issue, anyway. \nTrump on Friday falsely claimed that Clinton had started the birther discussion. \nPence declared on ABC's \"This Week\" that \"it's over.\" Host Martha Raddatz replied: \"It's not over.\" \n___ \n9:20 a.m. \nDemocrat Tim Kaine is offering five \"litmus test\" issues that show millennials are more closely aligned with Hillary Clinton, even if they don't like or trust her. \nClinton's running mate appeared on all four Sunday shows in pursuit of young voters who polls show have cooled on Clinton in recent weeks. \nHis main argument is that she stands with young voters on issues they care about, including climate science, women's health, LGBT equality, immigration reform and making college more affordable. \nKaine said on NBC's \"Meet the Press\" that \"it's on our shoulders\" to make the case to millennials that Clinton stands with them on those issues. \n___ \n9:15 a.m. \nDonald Trump's running mate says if elected he would model his vice presidency after Dick Cheney. \nIndiana Gov. Mike Pence told ABC's \"This Week\" in an interview that aired Sunday that he holds Cheney \"in really high regard.\" Cheney served two terms as Vice President under George W. Bush and was known for playing an active role in the Bush White House. \nPence is a former 12-year congressman and says he envisions emulating Cheney in working closely with the House and Senate to implement Trump's agenda. \nPence says he has talked with Trump about what his role would be, but declined to talk more about \"our private conversations.\" \nPence is campaigning in Florida this weekend and was scheduled to be interviewed about his faith by a minister in Jacksonville at a church service Sunday. \n___ \n2:57 a.m. \nPresident Barack Obama is making it clear that he'll take it personally if the African-American community fails to turn out for the presidential election and support Democratic presidential nominee Hillary Clinton. \nObama delivered his final keynote address to the Congressional Black Caucus Foundation Saturday night and said his name may not be on the ballot, but issues of importance to the black community are. \nAnd he realizes that a victory for Republican Donald Trump could undo much of what he has done. Clinton also made a pitch at the same dinner for African-Americans' support. \nThe Republican nominee campaigned in Houston, where he talked to a gathering of the Remembrance Project, a group founded to remember those killed by people living illegally in the U.S. and to press for tougher laws. Advertisement", "external_links": [], "published": "2016-09-19T04:32:00.000+03:00", "crawled": "2016-09-18T23:58:03.232+03:00", "highlightTitle": ""}