{"organizations": [], "uuid": "d42807f11b91d22532ef961da2129f1b4c032777", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "latino.foxnews.com", "main_image": "http://global.fncstatic.com/static/v/all/img/fn_latino_128x128.png", "site_section": "http://feeds.latino.foxnews.com/home/feed", "section_title": "FOX News", "url": "http://latino.foxnews.com/latino/politics/2016/09/09/countdown-to-us-elections-starts-in-north-carolina/", "country": "US", "domain_rank": 185, "title": "Countdown to U.S. elections starts in North Carolina", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "Countdown to U.S. elections starts in North Carolina | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2016-09-09T03:00:00.000+03:00", "replies_count": 0, "uuid": "d42807f11b91d22532ef961da2129f1b4c032777"}, "author": "EFE", "url": "http://latino.foxnews.com/latino/politics/2016/09/09/countdown-to-us-elections-starts-in-north-carolina/", "ord_in_thread": 0, "title": "Countdown to U.S. elections starts in North Carolina", "locations": [], "entities": {"persons": [{"name": "clinton", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "pat mccrory", "sentiment": "none"}, {"name": "carlos casalla", "sentiment": "none"}], "locations": [{"name": "united states", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "north carolina", "sentiment": "none"}, {"name": "charlotte", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "virginia", "sentiment": "none"}, {"name": "arizona", "sentiment": "none"}, {"name": "colorado", "sentiment": "none"}, {"name": "pennsylvania", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}, {"name": "nevada", "sentiment": "none"}, {"name": "ohio", "sentiment": "none"}], "organizations": [{"name": "quinnipiac university", "sentiment": "none"}, {"name": "congress", "sentiment": "none"}, {"name": "efe", "sentiment": "none"}, {"name": "voice group", "sentiment": "none"}, {"name": "board of elections", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "  EFE Charlotte –   The countdown to the Nov. 8 elections in the United States starts Friday with the beginning of voting by mail in North Carolina, the first state to initiate the process.\nStarting this Friday, voters registered in the southeastern U.S. state of North Carolina can request their ballots from the state Board of Elections and, once received, they can fill them out and send them to the board of the county where they live.\n\"People don't have to give a reason for voting by mail in North Carolina - they only have to fill out a request to the state for an absentee ballot to get it sent to them,\" Carlos Casalla of the state's electoral board told EFE Friday.\nHistorically, Republicans have been favored by absentee voting in North Carolina, one of the states without a fixed voting pattern - the population does not traditionally favor one majority party over the other - so that in every presidential election the candidates go all out to win here.\nAccording to the Board of Elections, as of Sept. 8, 152,130 voters were registered as Hispanics, or 2.27 percent of North Carolina's electorate.\nThe latest voter-preference survey taken by Quinnipiac University in four states without a fixed voting pattern, published this Thursday, shows Democratic candidate Hillary Clinton leading Republican Donald Trump in North Carolina by 47 percent to 43 percent, and in Pennsylvania by 48 percent to 45 percent.\nOhio goes the other way, with the Republican magnate 1 percent ahead of his Democratic rival, 46 percent to 45 percent, while the two are tied in Florida, each with 47 percent.\nWith the heated political environment and constant visits by the candidates to North Carolina - as Clinton did this Thursday to Charlotte, the state's commercial hub - the basically Hispanic organizations and groups doubled their efforts not only to register voters but also to urge their participation.\nAccording to a poll published Friday that includes seven states where surveys do not show a clear winner (Arizona, Colorado, Florida, Nevada, North Carolina, Ohio and Virginia), 48 percent of Latino voters in North Carolina say the \"most important\" thing the next president and Congress must tackle is immigration.\nThe survey by the America's Voice group reveals that only 12 percent of Latino voters in North Carolina plan to vote for Trump, while 81 percent have a negative image of the Republican candidate who proposes deporting the 11 million undocumented immigrants estimated to live in the United States and says he will build a wall all along the Mexican border.\nAnother element of the North Carolina elections is the state's voting law, passed in 2013, signed by Republican Pat McCrory and revoked last July 29 by a court of appeals with the argument that it was an attempt at racial discrimination.\nThe law made it obligatory for voters to show a photo ID, despite the fact that in the U.S. no national identification document exists, and reduced the time for early in-person voting, which in North Carolina had generally favored Democrats, and which this year begins Oct. 20.", "external_links": [], "published": "2016-09-09T03:00:00.000+03:00", "crawled": "2016-09-09T22:49:56.810+03:00", "highlightTitle": ""}