{"organizations": [], "uuid": "9436a60a80bb67b7f33340974ecfaa8379bee9ff", "thread": {"social": {"gplus": {"shares": 1}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 884, "shares": 884, "comments": 5}, "stumbledupon": {"shares": 0}}, "site_full": "www.buzzfeed.com", "main_image": "https://img.buzzfeed.com/buzzfeed-static/static/2016-09/8/12/campaign_images/buzzfeed-prod-web04/could-sheriff-joe-arpaio-actually-lose-this-time-2-31746-1473353459-0_dblbig.jpg", "site_section": "http://www.buzzfeed.com/politics.xml", "section_title": "BuzzFeed - Politics", "url": "https://www.buzzfeed.com/adriancarrasquillo/could-sheriff-joe-arpaio-actually-lose-this-time", "country": "US", "domain_rank": 137, "title": "Could Sheriff Joe Arpaio Actually Lose This Time?", "performance_score": 8, "site": "buzzfeed.com", "participants_count": 1, "title_full": "Could Sheriff Joe Arpaio Actually Lose This Time?", "spam_score": 0.0, "site_type": "news", "published": "2016-09-09T00:51:00.000+03:00", "replies_count": 0, "uuid": "9436a60a80bb67b7f33340974ecfaa8379bee9ff"}, "author": "Adrian Carrasquillo", "url": "https://www.buzzfeed.com/adriancarrasquillo/could-sheriff-joe-arpaio-actually-lose-this-time", "ord_in_thread": 0, "title": "Could Sheriff Joe Arpaio Actually Lose This Time?", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "negative"}, {"name": "ross d. franklin", "sentiment": "negative"}, {"name": "joe arpaio", "sentiment": "neutral"}, {"name": "viridiana hernandez", "sentiment": "none"}, {"name": "molera alvarez", "sentiment": "none"}, {"name": "dulce matuz", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "bruce halle", "sentiment": "none"}, {"name": "adrian carrasquillo   adrian carrasquillo", "sentiment": "none"}, {"name": "hernandez", "sentiment": "none"}, {"name": "enrique gutierrez", "sentiment": "none"}, {"name": "ruben alvarez", "sentiment": "none"}, {"name": "adolfo flores", "sentiment": "none"}, {"name": "arpaio", "sentiment": "none"}, {"name": "paul penzone", "sentiment": "none"}, {"name": "juarez", "sentiment": "none"}, {"name": "clinton", "sentiment": "none"}, {"name": "garcia", "sentiment": "none"}, {"name": "penzone", "sentiment": "none"}, {"name": "bazta arpaio", "sentiment": "none"}, {"name": "alvarez", "sentiment": "none"}, {"name": "pita juarez", "sentiment": "none"}, {"name": "mary altaffer", "sentiment": "none"}, {"name": "carlos garcia", "sentiment": "none"}], "locations": [{"name": "phoenix", "sentiment": "none"}, {"name": "pima county", "sentiment": "none"}, {"name": "penzone", "sentiment": "none"}, {"name": "maricopa county", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "arizona", "sentiment": "none"}, {"name": "phoenix", "sentiment": "none"}, {"name": "tucson", "sentiment": "none"}], "organizations": [{"name": "ap", "sentiment": "negative"}, {"name": "republican", "sentiment": "none"}, {"name": "isis", "sentiment": "none"}, {"name": "ngp van", "sentiment": "none"}, {"name": "arizona democratic", "sentiment": "none"}, {"name": "buzzfeed news", "sentiment": "none"}, {"name": "arizona democratic party", "sentiment": "none"}, {"name": "mi familia vota", "sentiment": "none"}, {"name": "democratic party", "sentiment": "none"}, {"name": "supreme court", "sentiment": "none"}, {"name": "univision", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Ross D. Franklin / AP ID: 9571194 \nPHOENIX — Before Donald Trump returned to the state for the fifth time, Latino groups here kept coming back to an old saying: “Dime con quién andas, y te diré quién eres”— tell me who you’re with, and I’ll tell you who you are. \nIn Arizona, the activists are quick to tell you, Donald Trump is with Sheriff Joe Arpaio, the infamous hard-line sheriff of Maricopa County. \nKnown for his raids in heavily-Latino neighborhoods, and media-seeking, brutal measures — requiring inmates to don pink underwear or making them sleep outside in his “Tent City” jail — the 84-year-old sheriff hasn’t moderated. He has, however, become a constant presence during the 2016 campaign, frequently appearing before Trump in Arizona. \nAnd across the street from Trump’s recent rally last week, protesters blasted ranchera songs, and held signs bearing things like, “Arizona rejects your racism. Dump Trump. Dump Arpaio.” They didn’t go inside the rally, fearing violence, but they linked the two men outside. Some groups drop the distinction: “Trumpaio.” \nThat idea — Trump and Arpaio as two-headed monster — is just the thing those activists hope could defeat Arpaio, deliver unprecedented Latino voting, and upend the landscape of Arizona politics. If 2016 has given new life to hardline immigration policies, activists think their community, who is also listening, can produce a sharp turn in the other direction. \nNew Hispanic voter registration and get out the vote efforts are underway — One Arizona, a coalition of more than a dozen groups created after the SB1070 immigration fight, recently launched an initiative to register 75,000 new Latino voters, but privately expects to get closer to 100,000. Canvassers in Phoenix, Pima County, and Tucson are out every day from 3 p.m. to 8 p.m., targeting low-propensity voters. \nBazta Arpaio — a play on “stop Arpaio” in Spanish — is a political organization funded by Unbound Philanthropy’s Four Freedoms Fund and is allowed to go after him, rather than just register voters. Taking the baton from groups like One Arizona, it is using its access to the NGP VAN voter data system, to target Latino voters that didn’t vote in 2012 or those who turned 18 since the last election. The group currently has 20 staffers and is looking to add 100 canvassers for the painstaking door-to-door work. \n“It’s about ending Arpaio’s reign and stopping Trump’s rise,” said Carlos Garcia, a well-respected activist in the community who works to stop deportations of parents and families. “Taking two people out with one vote.” \nSince becoming sheriff in 1993, Arpaio has been re-elected five times. But he did not become a national figure until immigration battles in Arizona went cross-country in the past decade. His national celebrity has coincided with a series of legal battles that have embroiled his office and damaged his reputation in Arizona, however, particularly since his last re-election. \nIn 2013, a federal district court ruled Arpaio had racially profiled Hispanic drivers. Two years later, Arpaio said under oath that he had hired a private investigator to investigate a judge’s wife. Three weeks ago, that same judge referred a ruling to the U.S. attorney’s office to determine whether Arpaio should be held in criminal contempt of court for his repeated refusal to abide by orders to stop profiling. \nSeizing on Arpaio’s problems with the law, activists believe him to be more vulnerable than ever. Longtime Arizona activist Dulce Matuz, who was undocumented for 12 years, said she couldn’t help thinking of Arpaio as she studied for her citizenship test and came upon a question about the “rule of law.” \nArpaio, she said, has acted as if he’s “untouchable” and above the law. “He was investigating the judge’s wife, who is he to do that to a federal judge?” \n“He’s weaker than ever and that’s because of the community,” Viridiana Hernandez of Bazta Arpaio said, adding that what is being exposed in court is what Latinos already knew Arpaio was doing. A common chant at protests has long been “Arrest Arpaio, not the people!” \n“Community members are no longer afraid — the same community members that were targeted and separated, those are the same people organizing and hitting the streets,” she said. \nBut despite the energy, much will depend on whether some Republican voters turn on Arpaio. \nSeated under a white board that reads “Enjoy the ride” and “#ItsTime,” Paul Penzone — the same man that Arpaio defeated four years ago by six points — looks the part of a detective from “Law & Order” and at 49-years-old is seen as a more seasoned challenger by Democrats. He was quick to say Republicans walk up to him to tell him they support him this time around. \n“Well, why not last time?” he recalled saying to one. \n“I’m tired of the sheriff, I’m tired of the nonsense,” the voter responded. \nBut there are also those who write him off because of his party identification. \n“I encounter that,” Penzone acknowledged. \n“But you have to simplify the message. If you or your family is in need of law enforcement to protect them, you don’t care who shows up at the door, whether there’s a D or R next to their name, you care that they’re competent,” he said. Talking about the Trump immigration speech hours later, Penzone joked he would give someone a “c-note” if they wore a Paul Penzone for Sheriff sign to the rally. \nAnd while the rally was full of Arpaio fans, he garnered 60,000 less votes a day earlier in the Republican primary than he did in 2012, even though more people voted this time around. \nTurning to the general election, polling has been scant. A Penzone commissioned poll showed him up by 4, while a Republican firm showed him up 45-42. Mary Altaffer / AP ID: 9583461 \nArpaio plays dirty, Penzone argued, showing BuzzFeed News one of the sheriff’s flyers, which detailed how the Democrat will give porn and cigarettes back to inmates and that he’s soft on the border and is going to let ISIS in. (Penzone, meanwhile, said, “Arpaio brought up his age last night, his energy. I’m not going to judge him on his age, I’m going to judge him on his record, which has diminished, but I’m going to let him answer for the reason for that. Maybe it’s because he’s spending most of his time in court.”) \nHe’s floated some changes to Arpaio policies — an end to racial profiling and a focus instead on immigration enforcement on criminal organizations that bring drugs into the country. But he’s less firm on what his election would mean for tent city’s fate. He may eliminate it if it’s a drag on taxpayers or he may keep it, he said. \nSo activists aren’t exactly in love with him, not entirely unlike the voters who say Trump is unacceptable but Clinton isn’t great herself. That’s fine with Penzone. \n“I don’t expect to be a white knight, but I do expect a fair evaluation of what I’ve done,” he said, stressing that he will work with activists in good faith. \nPenzone said he has worked with the Hispanic community his whole career, focusing on getting drug traffickers out of neighborhoods, with the Testigo Silencioso or Silent Witness program. He said he had two detectives who were bilingual do outreach to Hispanics so “they didn’t have to come to us.” \nGarcia of Bazta Arpaio said he would meet with Penzone if he wins, but the experience with Arpaio means he will enter the meeting with eyes wide open, and won’t be easily swayed. \n“If we go talk to Penzone of course he’s going to tell us he’s going to give us the moon and the stars,” Garcia said. “But if Penzone decides to be Arpaio we’re going to be standing in the same place in four years to get him out.” \nOn the heels of Spanish-language media in the state banding together to register Latino voters , Univision and Mi Familia Vota invited Arpaio and Penzone to a September 20 debate, but only Penzone has accepted, BuzzFeed News has learned. If Arpaio does not accept, the event will be turned into a townhall conversation with Penzone. \nPenzone said he’s worried about two things — voter turnout and having enough polling stations, after issues during the primary because of reduced polling stations and unexpectedly high turnout. In Phoenix, where Latinos comprise 40% of the population, the New Yorker recently reported , “There was one station for every hundred and eight thousand residents. Some precincts in the south of the city, where the majority is Latino, had no polling places at all.” \n(The year after Penzone last ran, in 2013, the Supreme Court overturned parts of the Voting Rights Act, which allowed Arizona to reduce the number of polling stations without federal review.) \nThis year, voting regulation changes in Arizona no longer allow groups like One Arizona, a nonpartisan 501C3, to collect ballots from residents, which the group says was helpful when dealing with lower propensity Latino voters. \n“That was important because you have to keep reminding people,” said Pita Juarez of One Arizona. “That’s when that came in handy, ‘Your ballot is due in two days, I can even take it for you, if you want.’” \nActivists have also taken things beyond the election, to what they call direct action. When Bruce Halle, the multi-billionaire owner of Discount Tire, put signs in the windows of his stores last month reading, “Re-Elect Sheriff Joe Arpaio,” he was picketed for four weeks by Bazta Arpaio and other groups until the signs were taken down. They’ve bristled too that Democrats are taking credit for things they’re doing —“Stop stealing the credit from a 17-year-old kid who is registering people to vote because his mom is undocumented,” Juarez said was her message to local Democrats. \nBut in the last month the party’s coordinated campaign field efforts have seen investment from the Clinton campaign and a small, six-figure Arizona ad buy was announced last week. The Arizona Democratic Party has 160 field staff and is focusing on hiring organizers that are fluent in Spanish. Penzone has been added to the coordinated field efforts and the party is highlighting his candidacy when it speaks to Maricopa County voters. \n“As we engage Latino voters with this particular race, we’re not just talking about how terrible Arpaio has been for Maricopa County, but we’re educating voters on the Democratic Party’s nominee,” said Arizona Democratic spokesman Enrique Gutierrez, citing daily phone banks and canvassing shifts to warn voters of the danger of continuing Arpaio’s policies. \nRuben Alvarez, co-founder of Molera Alvarez, and a 25-year Republican veteran of Arizona politics, said defeating Arpaio will still be a challenge: Voter registration is dominated by the Republican vote and he has raised millions of dollars from donors outside of the state. \n“One of the reasons [Penzone] lost the last time around is because he was painted in a negative way by Arpaio’s campaign,” Alvarez said, advising Penzone to harp on what Arpaio’s legal problems are costing taxpayers. \nDemocrats say the real impact of having two divisive figures on the ballot is that it is accelerating the demographic changes that were already happening in Arizona. \n“The Democratic shift is naturally occurring but what Trump is doing is helping us accelerate it,” said a Clinton official. “Trump and Arpaio are motivating people to get involved, whether we get there this year, we still have a lot of work to do. But this is accelerating it in a way we couldn’t have planned for.” \nBack in the Bazta Arpaio offices the next afternoon, Garcia and Hernandez mulled the question of what it would mean to the community to have Arpaio lose. \n“Growing up, I didn’t know Arpaio, but I knew we should be afraid of him,” Hernandez said, recalling that her parents once told her not to go protest in an area he patrolled. “He’s been around 24 years — I’ve been alive 25. But my niece, she’s one, she doesn’t need to know who the hell Arpaio is.” \nBuzzFeed News’ Adolfo Flores contributed reporting. Adrian Carrasquillo   Adrian Carrasquillo at .", "external_links": [], "published": "2016-09-09T00:51:00.000+03:00", "crawled": "2016-09-08T20:29:42.216+03:00", "highlightTitle": ""}