{"organizations": [], "uuid": "0a6d8832e04f1b7cf117d389fbe3243aeebbd83b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 61, "shares": 61, "comments": 1}, "stumbledupon": {"shares": 0}}, "site_full": "www.buzzfeed.com", "main_image": "https://img.buzzfeed.com/buzzfeed-static/static/2016-09/16/16/campaign_images/buzzfeed-prod-web08/latino-registration-efforts-with-mexican-rock-ban-2-25166-1474059340-0_dblbig.jpg", "site_section": "http://www.buzzfeed.com/politics.xml", "section_title": "BuzzFeed - Politics", "url": "https://www.buzzfeed.com/adriancarrasquillo/latino-voter-registration-efforts-with-mexican-rock-band-hit", "country": "US", "domain_rank": 137, "title": "Latino Registration Efforts With Mexican Rock Band Maná Hit A Snag In Las Vegas", "performance_score": 0, "site": "buzzfeed.com", "participants_count": 1, "title_full": "Latino Registration Efforts With Mexican Rock Band Maná Hit A Snag In Las Vegas", "spam_score": 0.0, "site_type": "news", "published": "2016-09-17T04:52:00.000+03:00", "replies_count": 0, "uuid": "0a6d8832e04f1b7cf117d389fbe3243aeebbd83b"}, "author": "Adrian Carrasquillo", "url": "https://www.buzzfeed.com/adriancarrasquillo/latino-voter-registration-efforts-with-mexican-rock-band-hit", "ord_in_thread": 0, "title": "Latino Registration Efforts With Mexican Rock Band Maná Hit A Snag In Las Vegas", "locations": [], "entities": {"persons": [{"name": "clinton", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "maria teresa kumar", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "voto latino", "sentiment": "none"}, {"name": "jim murren", "sentiment": "none"}, {"name": "yvanna cancela", "sentiment": "none"}, {"name": "maná", "sentiment": "none"}, {"name": "adrian carrasquillo", "sentiment": "none"}, {"name": "murren", "sentiment": "none"}], "locations": [{"name": "las vegas chris pizzello", "sentiment": "none"}, {"name": "las vegas", "sentiment": "none"}, {"name": "miami", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "denver", "sentiment": "none"}, {"name": "maná", "sentiment": "none"}, {"name": "phoenix", "sentiment": "none"}, {"name": "nevada", "sentiment": "none"}], "organizations": [{"name": "mgm grand", "sentiment": "none"}, {"name": "buzzfeed news", "sentiment": "none"}, {"name": "latin grammys", "sentiment": "none"}, {"name": "culinary union", "sentiment": "none"}, {"name": "mgm", "sentiment": "none"}, {"name": "usa today", "sentiment": "none"}, {"name": "mgm resorts international", "sentiment": "none"}, {"name": "gotv", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Chris Pizzello / AP ID: 9633371 \nA key Latino group won’t be able to operate one of its voter registration efforts in Las Vegas — highlighting a weird intersection between pop culture, politics, and casinos. \nThe program works like this: As popular Mexican rock band Maná kicks off their Latino Power Tour, the group Voto Latino is meeting Hispanics in cities like Phoenix, Denver, and Miami where they are — at the arena, to register concert-goers before the show. \nThe initiative is one of many new efforts that Democrats and Latino advocacy groups hope, along with Donald Trump’s candidacy, will fuel record Hispanic voting in November . \nBut a recent snag also highlights the limits and challenges of pulling off new efforts quickly during these pivotal weeks. \nThe issue arose because registering voters at MGM Grand, the site of Maná’s Friday Las Vegas show, would run afoul of a policy the company has against solicitations from outside groups on its properties, two sources familiar with the discussions said. \nVoto Latino settled for a compromise: MGM does not control what the artists do onstage, and Maná— which has been vocal in its opposition to Donald Trump, unfurling a sign saying Latinos shouldn’t vote for racists at the Latin Grammys — is free to implore its fans to go to an app or website on their phones to register if they choose to do so. \n“MGM said they’re not going to impede or obstruct anything the artists wants to do, so [Maná] can say, ‘Take out your cell phone and go to an app and register to vote,’” a source said. \nVoto Latino declined to comment on the matter and MGM corporate communications told BuzzFeed News the attempt to register voters on its property would violate its no solicitations policy. A source said MGM was sympathetic and sought to be helpful on the issue, but did not want to open itself up to further legal issues from groups it has banned from passing out forms or soliciting on its properties in the past. \nIn an interview last week on registration efforts, Voto Latino’s Maria Teresa Kumar said 100 to 150 people might register at each concert. “I don’t know what the results will be because it’s the first time we’re doing it,” she said. \nWhile the dispute may seem minor, it caused considerable consternation among a group of Democrats who view the largest owner of casino sites in Nevada as a strong partner. The message from those Democrats and unions was clear: Don’t piss off MGM. \n“They let us do GOTV, and park buses on their property,” a source said. “We’re able to drive their employees to early vote sites, we get thousands of Latinos to vote that way.” \nA source close to Maná said the band will continue to support Voto Latino and Hispanic voter registration efforts from the stage and noted that all other shows have gone off without a hitch but confirmed the policy had to be honored and worked around in Las Vegas. \nYvanna Cancela, political director for the Culinary Union in Las Vegas, which counts majority Latino membership, said MGM has always supported its efforts. \n“MGM has a long history of working with our union to ensure members have access to all parts of the electoral process; from citizenship drives to early voting mobilization,” she said. “This year has been no different.” \nJim Murren, MGM Resorts International chairman and CEO, is a Republican who endorsed Clinton in a USA Today editorial, saying he disagreed with Trump on trade, and believed Clinton was best when it comes to embracing diversity and immigration. \nWhile both candidates would secure the border, Murren wrote, “Clinton is the only candidate who will continue to make America a welcoming home for legal immigrants from around the world.” \nStill, skittish Nevada operatives really wanted MGM to know that having to work around one long-standing policy was not a problem for a company they feel has worked well with them. \n“They’re the biggest owner of casino sites,” an operative said. “If we can’t drive culinary members and casino workers — if we can’t do that, we might as well pack it up.” Adrian Carrasquillo   New York. Contact Adrian Carrasquillo at .", "external_links": [], "published": "2016-09-17T04:52:00.000+03:00", "crawled": "2016-09-17T00:56:59.275+03:00", "highlightTitle": ""}