{"organizations": [], "uuid": "49ea70096f180a3e6d40a3e44928f0af99c6e127", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 76, "shares": 76, "comments": 16}, "stumbledupon": {"shares": 0}}, "site_full": "www.buzzfeed.com", "main_image": "https://img.buzzfeed.com/buzzfeed-static/static/2016-09/13/5/social_promotion/buzzfeed-prod-fastlane01/facebook-social-promotion-32182-1473758855-1.jpg", "site_section": "", "section_title": "", "url": "https://www.buzzfeed.com/albertonardelli/the-uk-wants-to-split-single-market-and-free-movement-into-s", "country": "US", "domain_rank": 137, "title": "The UK Wants To Split Single Market And Free Movement Into Separate Brexit Talks", "performance_score": 0, "site": "buzzfeed.com", "participants_count": 0, "title_full": "The UK Wants To Split Single Market And Free Movement Into Separate Brexit Talks", "spam_score": 0.079, "site_type": "news", "published": "2016-09-13T08:00:00.000+03:00", "replies_count": 0, "uuid": "49ea70096f180a3e6d40a3e44928f0af99c6e127"}, "author": "Alberto Nardelli Buzzfeed Europe Editor", "url": "https://www.buzzfeed.com/albertonardelli/the-uk-wants-to-split-single-market-and-free-movement-into-s", "ord_in_thread": 0, "title": "The UK Wants To Split Single Market And Free Movement Into Separate Brexit Talks", "locations": [], "entities": {"persons": [{"name": "tusk", "sentiment": "none"}, {"name": "matteo renzi", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "francois hollande", "sentiment": "none"}, {"name": "donald tusk", "sentiment": "none"}, {"name": "angela merkel", "sentiment": "none"}, {"name": "josé manuel barroso", "sentiment": "none"}, {"name": "schulz", "sentiment": "none"}, {"name": "garibaldi", "sentiment": "none"}, {"name": "david cameron", "sentiment": "none"}, {"name": "enda kenny", "sentiment": "none"}, {"name": "viktor orban laszlo balogh", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "merkel", "sentiment": "none"}, {"name": "juncker", "sentiment": "none"}, {"name": "mateusz morawiecki", "sentiment": "none"}, {"name": "viktor orban", "sentiment": "none"}], "locations": [{"name": "brexit talks neil hall", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "ukraine", "sentiment": "none"}, {"name": "luxembourg", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "malta", "sentiment": "none"}, {"name": "ventotene", "sentiment": "none"}, {"name": "italy", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "hungary", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "copenhagen", "sentiment": "none"}, {"name": "poland", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}, {"name": "rome", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "budapest", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}, {"name": "bratislava", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "european council", "sentiment": "none"}, {"name": "european parliament", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "buzzfeed news", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "european commission", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Neil Hall / Reuters ID: 9605156 \nThe British government has suggested in meetings with European counterparts that it would like to negotiate single market access and free movement separately, BuzzFeed News has learned. \nSenior EU government sources said the UK was aiming to split the negotiations in an attempt to explore tradeoffs between the two. \nBut one European head of government told BuzzFeed News: “I don’t think anyone will take the bait.” \nBritish officials in Brussels and European capitals are also understood to be trying to break through the EU’s position of “no negotiation without notification” of Article 50. So far, those attempts appear to have been fruitless, BuzzFeed News has been told by UK and EU sources. \nAsked for a comment, Number 10 told BuzzFeed News that it would not be providing a running commentary on the negotiations. \nDetail of Britain’s early negotiation manoeuvres have emerged ahead of a meeting of the other 27 remaining governments in Bratislava on Friday – a meeting to which the UK has not been invited. \nThe substance of future relations with Britain will not be top of the agenda. EU officials believe there will not be much to discuss until the UK triggers Article 50, and hope to focus most of this week’s discussions elsewhere, on issues such as trade deals and security. \nOfficials are keen to play down expectations ahead of Friday’s meeting. It will be only the second time the 27 leaders have met since the UK referendum. The informal summit is seen as the first real opportunity for the 27 to take stock of Brexit and brainstorm the EU’s post-Brexit future. \nBratislava is the initial step of a process that will continue into next year with meetings scheduled in Malta and Italy. \nOfficially, the primary goal of the Bratislava meeting will be to set forth a road map for the EU’s future. Major announcements are expected to be made only after this exercise ends in Rome next March, when EU leaders will gather to celebrate the 60th anniversary of the Treaty of Rome, the EU’s founding agreement. \nBut the priority will be to put on a show of unity. \nIn the wake of Britain’s decision to leave the European Union, Europe’s heads of government and state all lined up to say that full access to the single market was dependent on accepting freedom of movement. \nSince then, despite some differences over how hard Brexit should be, officials have been firm that this specific condition will remain a red line in future negotiations. Interviewed by an Irish radio station on Monday, Irish prime minister Enda Kenny said the issue had been “very directly addressed” with the British government. Britain’s prime minister Theresa May and Irish taoiseach Enda Kenny hold a joint news conference. Pool New / Reuters ID: 9614212 \nFor some countries, freedom of movement takes on an emotional and historical note. Speaking to BuzzFeed News in Budapest last week, a senior government official close to Hungarian prime minister Viktor Orban described freedom of movement as the “freedom to leave a country and live freely”. \n“It is the most important achievement of post-war Europe alongside European integration,” the official said. \n“Politically, we have to defend this right, and the four freedoms (of movement of goods, services, people, and capital).” \nFreedom of movement is seen as one of the few direct benefits of EU membership that voters understand, the official added. All this, they said, has been made clear to senior British officials in meetings since the referendum: “When we met, I told them that at the end of these negotiations, you cannot come out as winners in the eyes of ordinary people. There must be a price to pay.” \nBut a strong attachment to free movement is not a feature exclusive to more recent member states. Days after the UK referendum, a British official described the way German chancellor Angela Merkel talked about the principle with former UK prime minister David Cameron as “almost evangelical”. \nOne area where Europe’s more hawkish governments have softened their stance in recent weeks, though, is on the timing of the UK invoking Article 50 , the formal procedure to exit the EU. \nFollowing meetings with Theresa May, EU officials suggest that most governments have accepted that the UK needs time to figure out what Brexit means, and are resigned to the fact that the mechanism will not be triggered before the end of the year. \nA eurozone government official told BuzzFeed News that in meetings their UK counterparts have been “candid” in making clear that they are absolutely not ready yet and need some time to define the direction the UK will want to go. \nThe expectation among governments BuzzFeed News has spoken to is that the UK will invoke Article 50 between January and February 2017. The belief in Europe’s major capitals is that economic uncertainty and increasing pressure from Leave politicians and voters will give the government no choice but to begin withdrawal procedures within an acceptable timeframe. Italian prime minister Matteo Renzi, German chancellor Angela Merkel, and French president Francois Hollande arrive for a press conference on aircraft carrier Garibaldi off the coast of Ventotene island in August. Reuters ID: 9605206 \nAhead of Friday’s meeting, the 27 member states broadly agree on what are the most important challenges facing the European Union: the refugee crisis, security threats, and winning back voters’ trust. \nUncontrolled irregular migration, terrorism and fear of globalisation are three main challenges for Europe — Donald Tusk (@eucopresident) ID: 9598648 \nHowever, on many aspects of these themes the EU is beset by divisions – nowhere more so than in how to deal with the refugee crisis, and how to handle migration from outside the European Union. \nAlthough there is agreement on the need to secure Europe’s external borders in order to avoid the “chaos” of last year, for some member states the debate about refugees and non-EU migration is not just about numbers. \n“There is also an issue of provenance,” the senior Hungarian official told BuzzFeed News. Assuming arrivals were controlled, and procedures were respected, “we wouldn’t have an issue with refugees from Ukraine,” the official said. “The problem here is also cultural, demographic, and religious.” \n“Some Muslims do not respect the European way of life,” they added. \nThe official alleges that there are areas in European cities, including Paris and Copenhagen, that are dangerous because many North African migrants have not integrated, live in isolation, and polarise communities. \nOn Tuesday, Luxembourg’s foreign minister told a German newspaper that Hungary should be kicked out of the EU for treating refugees worse than “wild animals”, and allegedly violating fundamental EU principles. Hungarian prime minister Viktor Orban Laszlo Balogh / Reuters ID: 9605397 \nAlthough the tone may be different, central Europe isn’t the only place where European identity is a sensitive issue. It is set to take centre stage in next year’s French and German elections. A heated debate about multiculturalism is already taking place in both countries, setting dividing lines between presidential candidates in France and within political parties in Germany, where chancellor Merkel has been weakened by a string of poor state election results following her refusal to back down on her welcoming stance towards refugees. \nFor the governments of central Europe, the refugee crisis and attempts to force migrant quotas on member states are also a proxy of what they believe is an overreaching European Commission – and Brexit presents an opportunity to revisit the balance of powers between EU institutions and member states. \nIn an interview with BuzzFeed News at the beginning of September, Poland’s deputy prime minister spoke of the need to bridge a democratic divide between institutions and member states. Mateusz Morawiecki also said member states shouldn’t be overshadowed by EU institutions. \nHungarian officials are more direct: “European Commission president Juncker and European Parliament president Schulz are not doing their job.” \n“The commission misinterprets its role. It should be the guardian of EU treaties, and should not be allowed to overwrite what member states decide,” the senior official said. \nThey also accuse the commission of double standards, recalling how in 2010 the former commission president José Manuel Barroso refused to grant Hungary the same fiscal flexibility now being offered to other member states. “This makes our membership look second-class,” the official claimed. \nBoth the Polish and Hungarian governments, which have pledged to wage a “cultural counter-revolution” to reform Europe post-Brexit, worry that the EU’s core and founding member states will decide Europe’s future among themselves. \nIn Bratislava, leaders will want to stay away from discussions about the commission’s powers. “The 27 will not go there,” a senior official told BuzzFeed News. Most member states, including Germany, are in no mood to open lengthy treaty renegotiations. \nAt the same time, though, capitals do not want to see this as an excuse for Brussels to grab more powers. In a letter sent by Donald Tusk to the 27 leaders on Tuesday, the president of the European Council noted that a conclusion he has drawn from consulting member states over the past few weeks was that “the institutions should support the priorities as agreed among member states, and not impose their own ones”. \nHowever, the ongoing turf war between the commission and member states is unlikely to go away soon. In a document seen by BuzzFeed News, European Commission officials describe Tusk and Merkel’s shuttle diplomacy, and the past months’ meetings between groups of EU leaders and ones between blocs of countries and Socialist party leaders, as serving as “megaphones for national agendas” with member states offering little in terms of alternatives to commission proposals. \nDivisions between governments also remain on how to enable greater competitiveness across the continent, between those that would like to embrace more expansionary policies and those that see fiscal discipline as the guiding light. \nStill, on other issues, such as greater cooperation on defence (aspects of which would have previously been blocked by the UK), strengthening external border controls, working towards closer security relations (possibly including a US-style visa system ), and supporting measures to boost youth employment , the differences between member states are narrower – and are more likely to be bridged in the months to come. \nIn his letter to the 27 leaders, Tusk says that on the one hand, the EU should establish the best possible relations with the UK, but on the other hand, should be “coolheaded, consistent, and fully united as well as firm in insisting on a balance of rights and obligations”. \n“If we do so, there will be no room for doubt that it is a good thing to be a member of the Union”. ", "external_links": [], "published": "2016-09-13T08:00:00.000+03:00", "crawled": "2016-09-15T21:39:53.349+03:00", "highlightTitle": ""}