{"organizations": [], "uuid": "4339c3c2ba38f1ff9071c58dba46e46a804c36cc", "thread": {"social": {"gplus": {"shares": 6}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 6}, "facebook": {"likes": 39, "shares": 39, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nbcnews.com", "main_image": "http://media4.s-nbcnews.com/j/newscms/2016_39/1725526/160926-debate-mbe-1214a_4_ea1c4e2766c12beec86fe157f65ca0b8.nbcnews-fp-1200-800.jpg", "site_section": "", "section_title": "", "url": "http://www.nbcnews.com/news/latino/immigration-s-absence-debate-disappointed-delighted-viewers-n655411", "country": "US", "domain_rank": 478, "title": "Immigration's Absence from Debate Disappointed, Delighted Viewers - NBC News", "performance_score": 0, "site": "nbcnews.com", "participants_count": 0, "title_full": "Immigration's Absence from Debate Disappointed, Delighted Viewers - NBC News", "spam_score": 0.022, "site_type": "news", "published": "2016-09-27T08:00:00.000+03:00", "replies_count": 0, "uuid": "4339c3c2ba38f1ff9071c58dba46e46a804c36cc"}, "author": "Suzanne Gamboa", "url": "http://www.nbcnews.com/news/latino/immigration-s-absence-debate-disappointed-delighted-viewers-n655411", "ord_in_thread": 0, "title": "Immigration's Absence from Debate Disappointed, Delighted Viewers - NBC News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Sep 27 2016, 11:00 am ET Immigration's Absence from Debate Disappointed, Delighted Viewers by Suzanne Gamboa advertisement \nImmigration, the issue that has been an attention hog in much of this year's presidential race, was nearly absent from Monday night's presidential debate, to the disappointment of some who were counting on a blowout over it. \nDonald Trump attempted to squeeze in tidbits here and there but they were never enough to ensnarl him and Hillary Clinton into the always contentious issue where they have starkly different views. Play Birtherism to Stamina: Top Moments From Trump and Clinton's First Debate 3:44 autoplay autoplay Copy this code to your website or blog <iframe src=\"http://www.nbcnews.com/widget/video-embed/773769795623\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen></iframe> \nThe absence of immigration disappointed some but left others praising Clinton from keeping Trump from spending too much time on the issue that resonates with his supporters. advertisement \n\"If he had been able to stay o the immigration question the whole night ... I think that would have been friendlier territory for Trump to be debating on than whether or not Sean Hannity did talk to him about his opposition to the Iraq war and that Sydney Blumenthal was first to call into question Obama's birth certificate,\" said Brent Wilkes, executive director of the League of United Latin American Citizens, which advocates for immigration reform. \nWilkes said Clinton was able to keep Trump from his \"hysteria\" over immigration even though one of the topics of the debate was national security. \nRELATED: GOP Convention Opens with Hard Line on Immigration, Security \n\"From immigrant advocate perspective, Clinton was able to stop him from going off on immigration instead was able to get him on (other) terrain to effectively make him look stupid,\" Wilkes said. \nBut Greisa Martinez, advocacy director of United We Dream Action, the political arm of an immigrant advocacy group, blamed moderator Lester Holt and Hillary Clinton for a \"missed opportunity to make the case for why Trump's deportation doctrine is dangerous and why providing relief for immigrants is right.\" advertisement \n\"Our community and the country deserves a robust and sober discussion about immigration,\" Martinez said in a statement. \nThe virtual absence of immigration, was an attempt to hurt Trump to some and a pass for him to others, according to some tweets: Not 1 question about GDP at near zero. Not 1 question about immigration. Debate meant to hurt Trump. All negative questions. Terrible. ", "external_links": [], "published": "2016-09-27T08:00:00.000+03:00", "crawled": "2016-09-28T02:21:27.133+03:00", "highlightTitle": ""}