{"organizations": [], "uuid": "c71ff386832e4896789bf6d4c14c9c03c51eb180", "thread": {"social": {"gplus": {"shares": 1}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 3, "shares": 3, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/images.foxnews.com/content/fox-news/us/2016/09/28/friend-starbucks-shooting-victim-became-us-citizen-in-2004/_jcr_content/par/featured-media/media-0.img.jpg/0/0/1475106494546.jpg?ve=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/us/2016/09/28/friend-starbucks-shooting-victim-became-us-citizen-in-2004.html", "country": "EU", "domain_rank": 185, "title": "Friend: Starbucks shooting victim became US citizen in 2004 | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Friend: Starbucks shooting victim became US citizen in 2004 | Fox News", "spam_score": 0.002, "site_type": "news", "published": "2016-09-28T08:00:00.000+03:00", "replies_count": 0, "uuid": "c71ff386832e4896789bf6d4c14c9c03c51eb180"}, "author": "", "url": "http://www.foxnews.com/us/2016/09/28/friend-starbucks-shooting-victim-became-us-citizen-in-2004.html", "ord_in_thread": 0, "title": "Friend: Starbucks shooting victim became US citizen in 2004 | Fox News", "locations": [], "entities": {"persons": [{"name": "garcia", "sentiment": "none"}, {"name": "l.e. baskow/las vegas sun", "sentiment": "none"}, {"name": "edward kane", "sentiment": "none"}, {"name": "khutsishvili", "sentiment": "none"}, {"name": "aleksandr khutsishvili", "sentiment": "none"}, {"name": "pedro jose garcia", "sentiment": "none"}, {"name": "dan mcgrath", "sentiment": "none"}, {"name": "shtromberg", "sentiment": "none"}, {"name": "holly stoberski", "sentiment": "none"}, {"name": "david shtromberg", "sentiment": "none"}, {"name": "eduard shevardnadze", "sentiment": "none"}, {"name": "sasha", "sentiment": "none"}], "locations": [{"name": "us", "sentiment": "none"}, {"name": "las vegas", "sentiment": "none"}, {"name": "clark county", "sentiment": "none"}, {"name": "regional justice center", "sentiment": "none"}, {"name": "las vegas strip", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "southern california", "sentiment": "none"}, {"name": "hollywood", "sentiment": "none"}, {"name": "soviet union", "sentiment": "none"}, {"name": "georgia", "sentiment": "none"}, {"name": "tblisi", "sentiment": "none"}, {"name": "los angeles", "sentiment": "none"}], "organizations": [{"name": "facebook", "sentiment": "negative"}, {"name": "starbucks", "sentiment": "negative"}, {"name": "clark county detention center/las vegas metropolitan police department", "sentiment": "none"}, {"name": "associated press", "sentiment": "none"}, {"name": "las vegas metropolitan police department", "sentiment": "none"}, {"name": "ap", "sentiment": "none"}, {"name": "twitter", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Friend: Starbucks shooting victim became US citizen in 2004 Published September 28, 2016 Facebook 0 Twitter 0 Email Print Pedro Jose Garcia reads documents as he makes his first court appearance at the Regional Justice Center in Las Vegas Wednesday, Sept. 28, 2016. A court date was postponed until Friday for the ex-felon accused of killing a Starbucks customer during a weekend coffee shop shooting in Las Vegas. (L.E. Baskow/Las Vegas Sun via AP) (The Associated Press) Justice of the Peace Pro Tem Holly Stoberski addresses Pedro Jose Garcia as he makes makes his first court appearance at the Regional Justice Center in Las Vegas Wednesday, Sept. 28, 2016. A court date was postponed until Friday for the ex-felon accused of killing a Starbucks customer during a weekend coffee shop shooting in Las Vegas. (L.E. Baskow/Las Vegas Sun via AP) (The Associated Press) This undated booking photo provided by Las Vegas Metropolitan Police Department shows Pedro Jose Garcia. Garcia, is being held pending an initial court appearance on murder, robbery, burglary and weapon charges in the Sunday, Sept. 25, 2016, shooting death of a 41-year-old man at a Starbucks coffee shop in Las Vegas. (Clark County Detention Center/Las Vegas Metropolitan Police Department via AP) (The Associated Press) Previous Next \nLAS VEGAS – The man killed in a weekend shooting at a Starbucks coffee shop in Las Vegas was a naturalized U.S. citizen from the country of Georgia, where he served in the military and learned not to back away from conflict, a lifelong friend said Wednesday. \nAleksandr Khutsishvili enlisted after his country broke from the Soviet Union, and he served a stint in a military unit protecting then-Georgian President Eduard Shevardnadze, said David Shtromberg, who grew up with Khutsishvili in the Georgian capital city, Tblisi. \nAccording to police, Khutsishvili was sitting Sunday morning in a Starbucks several miles west of the Las Vegas Strip when a man later identified as Pedro Jose Garcia, a five-time felon, entered the store after his credit card was declined at the drive-thru. \nAn employee told detectives the man tried to make another purchase and then took a seat, according to a police report. \nAnother witness reported hearing people talking loudly \"but not quite yelling\" before the gunman \"got up, pulled out a gun and shot the man in the opposite corner.\" An employee yelled for everyone to get down. \nKhutsishvili, who police said had argued with the gunman, was shot in the chest and fell to the floor just inside the door. Other people dove for cover. \nIt wasn't clear from the police report what was said or if the loud exchange the witness reported was between the shooter and the victim. \nThree shots were fired, police said, before the weapon malfunctioned with a bullet stuck in the barrel. \nThere was no evidence that Khutsishvili had a weapon, homicide Lt. Dan McGrath said Wednesday, just a cellphone and a laptop computer. \nKhutsishvili, known to friends as \"Sasha,\" didn't talk much about his military experience. But it wouldn't have been like him to be a bystander, said Shtromberg, who emigrated to the U.S. as a refugee in 1992 and lives in Los Angeles. \nThe twice-divorced father of three became a U.S. citizen in 2004, Shtromberg said. He worked as a longshoreman, a plumber and a construction worker in Southern California before moving to Las Vegas about three years ago. \n\"Because he was military, he would react,\" the friend told The Associated Press in a telephone interview. He said Khutsishvili also sometimes worked with him at his computer services business in Hollywood. \n\"He's not the type of person to walk away from a fight,\" Shtromberg said, \"or someone else's fight.\" \nGarcia, 34, made an initial court appearance Wednesday on murder and other charges in the slaying. A judge postponed his arraignment until Friday to let the Clark County public defender's office determine if it can represent him. \nDefense attorney Edward Kane said outside court that he expects Garcia will plead not guilty. \nAccording to a police report, a man who identified himself as Garcia called 911 and said he had shot a person who appeared to have been reaching for something. \nPolice later recovered a .22-caliber handgun that witnesses said Garcia used. It had been fired three times, according to police, before malfunctioning \nOn the 911 call, a male voice could be heard moaning in the background, according the police report, while Garcia is heard saying, \"Go for it dog, I'm not gonna tell you again, go for it; play cowboy with me dog.\" Advertisement ", "external_links": [], "published": "2016-09-28T08:00:00.000+03:00", "crawled": "2016-09-29T03:14:21.586+03:00", "highlightTitle": ""}