{"organizations": [], "uuid": "806b972b891b9e042e2b3e5b21b88f337e9d338b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 8}, "facebook": {"likes": 88, "shares": 88, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.buzzfeed.com", "main_image": "https://img.buzzfeed.com/buzzfeed-static/static/2016-09/13/17/campaign_images/buzzfeed-prod-web04/democrats-worried-young-latinos-are-cool-to-clint-2-25661-1473801286-0_dblbig.jpg", "site_section": "http://www.buzzfeed.com/politics.xml", "section_title": "BuzzFeed - Politics", "url": "https://www.buzzfeed.com/adriancarrasquillo/democrats-worried-young-latinos-are-cool-to-clinton-ahead-of", "country": "US", "domain_rank": 137, "title": "Democrats Worried Young Latinos Are Cool To Clinton Ahead Of Key Stretch", "performance_score": 0, "site": "buzzfeed.com", "participants_count": 1, "title_full": "Democrats Worried Young Latinos Are Cool To Clinton Ahead Of Key Stretch", "spam_score": 0.0, "site_type": "news", "published": "2016-09-14T05:14:00.000+03:00", "replies_count": 0, "uuid": "806b972b891b9e042e2b3e5b21b88f337e9d338b"}, "author": "Adrian Carrasquillo", "url": "https://www.buzzfeed.com/adriancarrasquillo/democrats-worried-young-latinos-are-cool-to-clinton-ahead-of", "ord_in_thread": 0, "title": "Democrats Worried Young Latinos Are Cool To Clinton Ahead Of Key Stretch", "locations": [], "entities": {"persons": [{"name": "john locher", "sentiment": "negative"}, {"name": "clinton", "sentiment": "negative"}, {"name": "bernie", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "lorella praeli", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "antonio gonzalez", "sentiment": "none"}, {"name": "clinton latino", "sentiment": "none"}, {"name": "maria teresa kumar", "sentiment": "none"}, {"name": "george lopez", "sentiment": "none"}, {"name": "rosario dawson", "sentiment": "none"}, {"name": "maná", "sentiment": "none"}, {"name": "bernie sanders", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "kumar", "sentiment": "none"}, {"name": "voto latino", "sentiment": "none"}, {"name": "julian castro", "sentiment": "none"}, {"name": "dawson", "sentiment": "none"}, {"name": "fher olvera", "sentiment": "none"}, {"name": "obama", "sentiment": "none"}, {"name": "sanders", "sentiment": "none"}, {"name": "sylvia manzano", "sentiment": "none"}, {"name": "gonzalez", "sentiment": "none"}, {"name": "ed perlmutter", "sentiment": "none"}, {"name": "hillary", "sentiment": "none"}, {"name": "janet murguia", "sentiment": "none"}, {"name": "adrian carrasquillo", "sentiment": "none"}, {"name": "manzano", "sentiment": "none"}], "locations": [{"name": "washington", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "las vegas", "sentiment": "none"}, {"name": "miami", "sentiment": "none"}, {"name": "rhode island", "sentiment": "none"}, {"name": "tampa", "sentiment": "none"}, {"name": "phoenix", "sentiment": "none"}, {"name": "orlando", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "puerto rico", "sentiment": "none"}, {"name": "north carolina", "sentiment": "none"}, {"name": "arizona", "sentiment": "none"}, {"name": "denver", "sentiment": "none"}, {"name": "pennsylvania", "sentiment": "none"}, {"name": "colorado", "sentiment": "none"}, {"name": "nevada", "sentiment": "none"}], "organizations": [{"name": "nclr", "sentiment": "none"}, {"name": "nuestro voto", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "univision/ washington post", "sentiment": "none"}, {"name": "southwest voter registration education project", "sentiment": "none"}, {"name": "buzzfeed news", "sentiment": "none"}, {"name": "facebook live", "sentiment": "none"}, {"name": "hud", "sentiment": "none"}, {"name": "congressional hispanic caucus institute", "sentiment": "none"}, {"name": "mi familia vota", "sentiment": "none"}, {"name": "democratic party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "John Locher / AP ID: 9609802 \nWASHINGTON — Democrats and Latino groups are getting ready to ramp up voter registration efforts during Hispanic Heritage Month, hoping that the traditionally successful post-Labor Day period is juiced by anti-Trump energy and calls for Latino voting power to finally perform at impressive levels. \nBut they also worry that young Latinos won’t come out in high enough numbers. \n“Bernie Sanders was telling voters the system is rigged,” said Voto Latino president Maria Teresa Kumar. “When two candidates say the system is rigged and one of your candidates doesn’t make it, you’re suspicious.” \nKumar didn’t have to go far during the primary to see that sentiment up close, as her partner at Voto Latino Rosario Dawson whipped up young voters in support of Sanders, while trashing Hillary Clinton, the eventual nominee. Kumar acknowledged that it was an issue but looked forward to the work in front of Latino groups like hers that hope to bring young voters back into the fold. \n“We haven’t had a discussion along those lines, but it has been challenging — she’s helping people register to vote now,” she said of Dawson, before addressing charges of a rigged system. “When people say the system is against us, people are doing two things: discouraging you from voting and then getting up on Nov. 8 to vote.” \nKumar detailed the vast reach of voter registration efforts as Voto Latino in conjunction with groups like Mi Familia Vota, launches a month of action that looks to blow 2015 efforts out of the water. \n“Last year we had 130 organizations, which registered 10,000 voters,” Kumar said. “This year we have 300 organizations to date and the goal is to get 500,” she said of a coalition that includes Spotify, Twitter, and AirBnB as well as celebrities like Dawson and George Lopez and the Latino secretary of states in California, Pennsylvania, Rhode Island, and New York. \nVoto Latino will also undertake an effort to have 24 celebrities and “changemakers” in Puerto Rico calling Orlando voters, with a deluge of Puerto Ricans who have high voter participation rates from the island rapidly moving into the city. \nEveryone, from the Clinton campaign to immigration advocacy groups and the Democratic Party, has leaned into a message that Donald Trump has put forth racist and xenophobic rhetoric and policies levied against Mexicans and immigrants since the day he launched his campaign. Democrats also fear that message isn’t enough from the campaign to get young Hispanics to vote. \nThey point to polls showing the Latinos most prone to dislike her are 18 to 35, with her unfavorables highest among that group and worry that she is lagging Obama’s Hispanic support as the stretch run begins despite running against what they see as the most hostile presidential candidate to Latinos ever. \nA Univision/ Washington Post released Tuesday found Clinton behind Obama’s 2012 showing in four key battleground states of Colorado (-13), Florida (-7), Nevada (-6) and Arizona (-6). \nThe poll found that close to half of Latinos polled in Florida (46%) and Nevada (49%), two states where the race is tight, said Clinton is a liar. \n“Do you think she’s a liar, it’s split half say yes, half say no,” one concerned Democrat said. “How is that helping the enthusiasm gap?” \nSylvia Manzano, a lead pollster at Latino Decisions, which saw its two principles join the Clinton campaign as consultants last year, said while their poll last week showed that 51% of Latinos are more enthusiastic to vote now than they were in 2012, 76% said it was more important to do so. \n“I suspect people may not be feeling enthusiastic because of the [Trump] attacks,” Manzano said. “But is it important? 76% say this election is really important, that’s worth paying attention to.” Manzano said enthusiasm has a positive connotation, so while the enthusiasm of voters under 40 is low, 80% said it was more important to vote in November. \nThe large-scale repudiation of Trump by Hispanics, means the support is there for Clinton, but the turnout is key. A Latino Decisions national poll last week found her up with18-to-39-year-old voters, 68% to 18%. \nClinton will kickoff the key stretch for voter registration, which includes Hispanic Heritage Month (HHM), in a speech to the Congressional Hispanic Caucus Institute on Thursday and the campaign is launching “Fe en Nuestro Voto,” a national voter registration program aimed at the faith community from Sept. 19 to Sept. 25. \nThe campaign’s HHM efforts will largely be concentrated in battleground states, where the Florida team will be hosting voter registration efforts at eight different Latino festivals, including in Orlando, Tampa, and Miami. There will be registration efforts in North Carolina as part of the recently launched faith and small business programs aimed at Hispanics, a tacos and beer night in Nevada for young Hispanics, and salsa lessons followed by phone banking in Colorado. \nIn fact, Colorado is a good example of the campaign’s efforts to reach young Hispanics. Sandwiched around those salsa lessons, Lorella Praeli, the Latino vote director, will take part in a Facebook Live video featuring young Hispanics to discuss college affordability, one of Bernie Sanders’ pet issues, and the campaign will host a “Get Out the Taco Truck and Vote” registration effort with Rep. Ed Perlmutter, after a Trump surrogate warned of the imminent danger of delicious taco trucks on every corner should Clinton win. \nThere is also a unique effort, powered by a popular Mexican rock band that has called Trump a racist, hitting swing states with large Latino populations. Maná’s “Latino Power Tour” will make a dozen stops in the midst of ramped up Hispanic registration efforts and has partnered with Voto Latino to register concert-goers at its shows in cities like Phoenix, Denver, Las Vegas, and Miami. \n“We are suggesting and bringing awareness to the Latin community to use their power during the voting process as they are key in the next elections,” said Maná frontman Fher Olvera in a statement to BuzzFeed News. “Today Latinos can rewrite the history of the United States.” \nStill, Latino groups worry that the Hispanic vote was talked up by Democrats but commensurate resources were not allocated to them. Antonio Gonzalez, a 30-year veteran of Latino vote efforts who now runs the Southwest Voter Registration Education Project said last cycle Obama’s team did a lot of voter registration themselves, but this time around Clinton’s team didn’t put a similar focus into registration. \n“Hillary and her donor class were worried about Bernie, they figured we have Trump so the Mexicans will register themselves,” Gonzalez said. “The Latino vote didn’t grow, donors didn’t do it, groups didn’t do it. Groups like us, you can’t run a car without gas.” \nNCLR president Janet Murguia, who once drew Obama’s ire by calling him the deporter-in-chief, said that while NCLR’s voter registration funding dropped from $7 million in 2012 to $1.5 million now, her organization zeroed in on the importance of registering young Hispanic voters in partnership with mitú and a voter registration app, as well as a high school senior registration curriculum. \n“It’s very reasonable to be concerned about our young cohort of millennials, particularly some who perhaps were Bernie supporters,” she said. Pointing to the Obama years, she added, “remember some of the younger millennials were disillusioned because some promises were made and not fulfilled and they want to know what is going to be different.” \nMany doing the work around the country hope the stakes of the election will ultimately be so high that they lead young Hispanics to the polls. \n“I usually love this game of trying to get people to participate,” Voto Latino’s Kumar said. “But speaking to moms who are saying their kids come home crying because they hear in school they will get deported — but they’re born in America — how are we going to heal after this?” \nHUD Secretary Julian Castro, a top Clinton Latino surrogate who was on her shortlist for vice president, said in the end Trump’s toxic rhetoric will bring young Latinos to Clinton. \n“I’ve never heard out there as much of a groundswell to vote in the Latino community as I’ve heard this cycle,” he said. “I’m convinced the vast majority of Bernie voters, including Latinos who supported Bernie, are going to come out for Hillary in November, because of their front row seat to how bigoted Trump and his campaign has been.” \nWhich is part of the rub. Many Democrats privately worry that Clinton needs to have more of a positive message for why Hispanics should support her, but ultimately many believe Trump will be enough. \nIn its poll of 3,729 registered Latino voters, Manzano of Latino Decisions said that in looking at why 80% of voters under 40 said they felt it was important to vote in this election, she noticed a key motivating factor. \nOnly 23% said they were voting to support Clinton — 51% said they were doing it to stop Trump. Adrian Carrasquillo is a political reporter for BuzzFeed News and is based in New York. Contact Adrian Carrasquillo at .", "external_links": [], "published": "2016-09-14T05:14:00.000+03:00", "crawled": "2016-09-14T02:57:28.323+03:00", "highlightTitle": ""}