{"organizations": [], "uuid": "68518e2fdaf38f4cee59261ace8093e7dc72b066", "thread": {"social": {"gplus": {"shares": 1}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 3}, "facebook": {"likes": 155, "shares": 155, "comments": 51}, "stumbledupon": {"shares": 0}}, "site_full": "www.buzzfeed.com", "main_image": "https://img.buzzfeed.com/buzzfeed-static/static/2016-09/8/17/social_promotion/buzzfeed-prod-fastlane01/facebook-social-promotion-29806-1473371046-13.jpg", "site_section": "", "section_title": "", "url": "https://www.buzzfeed.com/rosiegray/sean-hannity-didnt-change-we-did", "country": "US", "domain_rank": 137, "title": "Sean Hannity Didn’t Change. We Did - BuzzFeed News", "performance_score": 1, "site": "buzzfeed.com", "participants_count": 0, "title_full": "Sean Hannity Didn’t Change. We Did - BuzzFeed News", "spam_score": 0.119, "site_type": "news", "published": "2016-09-08T08:00:00.000+03:00", "replies_count": 0, "uuid": "68518e2fdaf38f4cee59261ace8093e7dc72b066"}, "author": "Rosie Gray Buzzfeed News Reporter", "url": "https://www.buzzfeed.com/rosiegray/sean-hannity-didnt-change-we-did", "ord_in_thread": 0, "title": "Sean Hannity Didn’t Change. We Did - BuzzFeed News", "locations": [], "entities": {"persons": [{"name": "sean hannity", "sentiment": "negative"}, {"name": "facebo", "sentiment": "neutral"}, {"name": "jeb bush", "sentiment": "none"}, {"name": "drudge", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "bush", "sentiment": "none"}, {"name": "jonah goldberg", "sentiment": "none"}, {"name": "greta van susteren", "sentiment": "none"}, {"name": "brian stelter", "sentiment": "none"}, {"name": "rush limbaugh", "sentiment": "none"}, {"name": "mike lee", "sentiment": "none"}, {"name": "van susteren", "sentiment": "none"}, {"name": "jordan", "sentiment": "none"}, {"name": "brian rosenwald", "sentiment": "none"}, {"name": "thor", "sentiment": "none"}, {"name": "brad thor", "sentiment": "none"}, {"name": "julian assange", "sentiment": "none"}, {"name": "paul", "sentiment": "none"}, {"name": "matt drudge", "sentiment": "none"}, {"name": "delgado", "sentiment": "none"}, {"name": "stephens", "sentiment": "none"}, {"name": "bill shine", "sentiment": "none"}, {"name": "obama", "sentiment": "none"}, {"name": "clinton", "sentiment": "none"}, {"name": "john mccain", "sentiment": "none"}, {"name": "marco rubio", "sentiment": "none"}, {"name": "lee", "sentiment": "none"}, {"name": "assange", "sentiment": "none"}, {"name": "hannity duffy-marie arnoult", "sentiment": "none"}, {"name": "chris christie", "sentiment": "none"}, {"name": "mccain", "sentiment": "none"}, {"name": "elise jordan", "sentiment": "none"}, {"name": "aj delgado", "sentiment": "none"}, {"name": "rosie gray", "sentiment": "none"}, {"name": "hannity", "sentiment": "none"}, {"name": "rosenwald", "sentiment": "none"}, {"name": "roger ailes", "sentiment": "none"}, {"name": "gretchen carlson", "sentiment": "none"}, {"name": "bret stephens", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "breitbart", "sentiment": "none"}, {"name": "nielsen", "sentiment": "none"}, {"name": "gabriel sherman", "sentiment": "none"}, {"name": "fox", "sentiment": "none"}, {"name": "newt gingrich", "sentiment": "none"}, {"name": "tom williams", "sentiment": "none"}, {"name": "ailes", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "mitt romney", "sentiment": "none"}, {"name": "romney", "sentiment": "none"}, {"name": "murdoch", "sentiment": "none"}, {"name": "sean", "sentiment": "none"}, {"name": "gingrich", "sentiment": "none"}, {"name": "gq", "sentiment": "none"}, {"name": "alan colmes", "sentiment": "none"}, {"name": "cruz", "sentiment": "none"}, {"name": "mike pence", "sentiment": "none"}, {"name": "glenn beck", "sentiment": "none"}, {"name": "beck", "sentiment": "none"}], "locations": [{"name": "ailes", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "cleveland", "sentiment": "none"}, {"name": "hannity", "sentiment": "none"}, {"name": "hollywood", "sentiment": "none"}, {"name": "d.c. gray", "sentiment": "none"}, {"name": "iowa", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "new york city", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "indiana", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "utah", "sentiment": "none"}], "organizations": [{"name": "democratic national committee", "sentiment": "none"}, {"name": "fox news", "sentiment": "none"}, {"name": "republican", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "republican party", "sentiment": "none"}, {"name": "fox news channel", "sentiment": "none"}, {"name": "cnn", "sentiment": "none"}, {"name": "cpac", "sentiment": "none"}, {"name": "ecuadorian embassy", "sentiment": "none"}, {"name": "new york times", "sentiment": "none"}, {"name": "supreme court", "sentiment": "none"}, {"name": "wall street journal", "sentiment": "none"}, {"name": "national review", "sentiment": "none"}, {"name": "wsj", "sentiment": "none"}, {"name": "gop", "sentiment": "none"}, {"name": "breitbart news", "sentiment": "none"}, {"name": "hannity & colmes", "sentiment": "none"}, {"name": "university of pennsylvania", "sentiment": "none"}, {"name": "trump tv", "sentiment": "none"}, {"name": "cq-roll call,inc", "sentiment": "none"}, {"name": "buzzfeed news", "sentiment": "none"}, {"name": "premiere networks", "sentiment": "none"}, {"name": "washington post", "sentiment": "none"}, {"name": "fox", "sentiment": "none"}, {"name": "wikileaks", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Your Post Has Been Launched! Fabulous! Don't forget to share with your friends on Twitter and Facebook. This year, the Fox News and radio host’s shows have become an object of fascination, rage, and at times mockery. But Hannity isn’t doing anything he hasn’t done before — he’s as loyal as ever. In the Trump era, though, that’s turned him into a polarizing figure. Rosie Gray BuzzFeed News Reporter \nOn Tuesday evening, Sean Hannity had a special guest. It was someone who has played an important role in highlighting Hillary Clinton’s email and foundation scandals, someone who threw a wrench into the election by bringing questionable behavior among Democrats to light. Long story short, this person was the perfect Hannity guest. \nThe weird thing about it was that it was Julian Assange. The WikiLeaks founder appeared from his exile in the Ecuadorian Embassy in London, clad in a suit, beamed across the Fox News airwaves to Hannity’s studio in New York, and causing cognitive dissonance everywhere as Hannity questioned Assange on upcoming Clinton releases that Assange promises are coming. WikiLeaks has already been a player in this election, making waves earlier this summer when it released unflattering hacked emails from the Democratic National Committee. \nThen, Hannity signed off with some praise for the man he once criticized. “I do hope you get free someday,” the host told him. “I wish you the best.” \nHannity has said that he isn’t a journalist and that he openly wants Trump to win. The Assange interview was the apotheosis of Hannity’s commitment to doing what it takes to oppose Clinton: going after her even if it meant giving a sympathetic platform to an anti-American, pro-Russian figure hated by the right. \nThis year, Hannity’s program has become an object of fascination, rage, and at times mockery, particularly among the conservatives still not on board with Donald Trump. Hannity is one of the loudest voices in the media constellation of Trump boosters — from Breitbart News, whose chairman is now the CEO of the Trump campaign, to Matt Drudge — who appear at times to work in tandem with the campaign. Any casual viewer of Hannity’s television show or listener to his radio program can see that Hannity devotes a large amount of time to Trump. The New York Times reported that Hannity has even become a kind of informal adviser to the candidate. \nBut Hannity isn’t the one who’s changed. He gave John McCain and Mitt Romney similarly generous treatment when it came to the general election. The difference this time is that Trump is an intensely polarizing figure, and Hannity has broken with much of the conservative punditry establishment in backing him to such a pronounced degree. His show is now a glimpse into the mind-meld of a certain segment of the conservative media with Trump’s campaign and the movement he represents. Hannity’s story plays into some dominant themes of this election; how the Trump campaign has broken new ground by becoming a sort of media organization in its own right, and how the conservative movement has tried and failed to stamp out the ascendant nationalist Trumpist movement, forcing longtime conservative warriors like Hannity to either get on board or risk irrelevance. Winning has become an ideology of its own, and Hannity is dead set on winning. \n“It’s boosterism,” said Brad Thor, a conservative author who has harshly criticized Trump but thinks highly of Hannity, whom he says “has always been very nice to me,” in an email last month. “Sean, Drudge, and Breitbart saw a wave coming and they decided to ride it. That’s their job — to do well. They are private businesses. And they have done very well backing Trump.” \n“Conservatives in general, though, have been far too trusting of rightwing media to be gatekeepers and ambassadors of their brand,” Thor said. “Not all of us are aligned.” “I told the audience what I was going to do, I did it, and now people are critical I did it that way,” Hannity says. ID: 9586026 \nHannity says this isn’t his first time coming under fire for his aggressive advocacy. \n“Eight years ago I was vetting Obama in probably the most aggressive fashion in the country,” Hannity told BuzzFeed News. “I took a lot of heat then. I had prominent conservatives calling me and saying I was ruining my career.” \nAnd Hannity points out that he never hid his intentions. In speeches to CPAC last year and this year, Hannity said that he would give each of the primary candidates as much time as possible on radio and TV and that he would support whoever the voters chose as the nominee. Hannity sees this as “a service to the audience.” \n“I told the audience what I was going to do, I did it, and now people are critical I did it that way,” Hannity says. \nHannity says there hasn’t been an honest effort on the part of the media to understand his motivations: “Nobody who interviews me gives a rip about why I do what I do and say what I say,” he said. \nStill, friends and friendly colleagues — and Hannity has many — don’t quite know what to make of this year. Some are dismayed with Hannity’s Trump support; others think he’s been criticized too harshly for doing what he always has. He’s known as a hard worker, spending hours a day on air both on the radio and on TV. “He is the most loyal and kind person to work for and he’s passionate,” said a former Hannity producer. \n“He gets to know everyone’s staff and he really is just such a friendly person, and what’s almost refreshing about it for people is he’s not corrupted by being a New York City star,” said Elise Jordan, a Republican operative who worked on Rand Paul’s campaign and who used to go on Hannity’s show semi-regularly. \n“I just don’t get the whole outrage over his role in this election,” Jordan said, noting that Hannity has been open about not being a journalist and that she believes Hannity would do the same with any Republican nominee. “I might completely disagree with his ideology but I still really like him and think the world of him as a person.” \nBut his role vis-a-vis Trump this cycle has confounded many, including colleagues at Fox. “I don’t watch his show anymore,” said one Fox News source. “It’s very predictable. He’s had Donald Trump on more than anyone, and how many of those shows have made news? None.” \n“I will enthusiastically pull the lever for Donald Trump,” Hannity said, reeling off a list of issues including the Supreme Court, border security, and taxes, on which he believes Trump is clearly a better choice than Clinton. Conservatives who are still resisting Trump, Hannity said, should “suck it up” and are showing a “stubbornness and arrogance that is bordering on sabotage, because I think some elites want to be able to stick their fingers in the faces of the voters.” “I can understand ratings… I can’t understand the abandonment of conservatism.” ID: 9586030 \nSome ascribe a more cynical motive to Hannity when it comes to Trump: ratings. \n“I can understand ratings,” the Fox News source said. “I don’t like them, but I understand them. I can’t understand the abandonment of conservatism.” \nHannity, a registered Conservative in New York, argues that it’s his critics who are the ones doing the abandoning. \nThe ratings are good, however. His radio program, which has been syndicated since the day before the 9/11 attacks, is only bested by Rush Limbaugh when it comes to audience size. According to Nielsen ratings figures provided by a Fox News spokesperson, Hannity’s TV show averages 2.4 million in total viewers and 500,000 in the 25-54 demographic, and is up double-digits from the same time last year. \nThose shows have seen different iterations over the last 15 years. For 12 years, Hannity wasn’t just Hannity: He was one half of Hannity & Colmes , facing off every night against liberal co-host Alan Colmes. The program was in the vein of the Crossfire -style point-counterpoint programs that have now gone by the wayside in favor of greater ideological uniformity at the cable networks. Hannity told the New York Times in 1999 that Roger Ailes had asked him, “You know any good liberals?” and that the show’s working title had been “Hannity & LTBD”—“Liberal To Be Determined.” Colmes left in 2008. Hannity appears to think fondly of him; in 2013, he told the Hollywood Reporter that the two talk “almost every day.” Alan Colmes (left) and Hannity Duffy-marie Arnoult / WireImage ID: 9586081 \nYears later, Hannity still relies on the occasional liberal guest to spice things up. But in Colmes’ absence, his show has struck many as becoming one-note — sometimes literally, as Hannity has hosted a number of townhalls with Trump that take up the entire show. \nAt his core, Hannity is a party guy despite his image as a smashmouth conservative talker. While he often criticizes Republican establishment figures, in the end he’s most interested in taking on liberals and defeating Democrats electorally. “Hannity has long been among the biggest party loyalists on talk radio. While he would identify himself as a conservative first and a Republican second, he has long embraced a party leadership role,” said Brian Rosenwald, a University of Pennsylvania professor who studies conservative media. Rosenwald says he has “uncovered tons of cases in which he emceed rallies, hosted fundraisers, etc for GOP candidates.” \nThat enthusiasm for party sent Hannity down a peculiar path over the last five years. After the Republicans failed to win the White House in 2012, Hannity announced that he was “evolving” on immigration and that he supported a pathway to citizenship — in line with the thinking at the time. On air, he was friendly with Marco Rubio, who then seemed poised to be the next GOP nominee. \nThe evolution didn’t last long. And in the run-up to the 2016 election, with the Gang of Eight immigration bill fiasco a close memory, Hannity no longer evinced an affinity for establishment figures and causes. \nLast year, Hannity interviewed several of the presumptive presidential candidates onstage at the Conservative Political Action Conference. According to two sources, Hannity became agitated backstage before Jeb Bush’s appearance. There were rumors that the crowd would loudly boo Bush and even walk out of the venue. Hannity “freaked out,” according to a source who witnessed the scene. Worried about being booed, Hannity attempted to convince Bush to change to a sit-down interview to calm the crowd. Bush ended up going ahead with his original plan of standing up, but “Hannity had to be talked off a ledge,” the source said. \nHannity disputes that characterization of the incident, saying that when he was giving his own speech to CPAC earlier that day and mentioned Bush, whose name was booed, and that he had simply warned Bush about the booing. “I just had a standing ovation — why would I be afraid to go out there?” Hannity said. “Number one, I’m actually very chill, I don’t freak out. I can do this in my sleep.” \nThe interview itself went on without incident, and no walkout occurred. Hannity is known for his kid-glove approach to Republican politicians of whom he approves, and for a while most of the Republican candidates could count on his show as a safe haven to spread their message and not have to answer tough questions. Hannity hosted hour-long townhalls with Cruz and Trump during the primary, a practice he has continued with Trump in the general election. Hannity told BuzzFeed News that he offered Cruz a town hall every time he offered Trump one during the waning days of the primary when they were the two remaining viable candidates, but that Cruz was harder to book. Hannity is known as a hands-on kind of host, not leaving everything to his producers ID: 9586042 \nHannity is known as a hands-on kind of host, not leaving everything to his producers, and is known as being competitive about landing interviews. According to a Republican operative who has worked on campaigns that dealt with Hannity, Hannity calls candidates and their staff personally to book interviews. \n“He would call you personally and make it impossible to say no,” the operative said. \n“He’s competitive when it comes to this election and winning for the Republican Party,” said the former Hannity producer. “That has always been at the root of his hard work, efforts. But Sean is also very talented and knows it’s important to bring in ratings and be competitive on TV as well. If Trump was doing that — then he would make it a priority to have him on.” \nHannity’s gotten personally involved in key campaign moments. During the period in which Newt Gingrich, Chris Christie, and Mike Pence were all vying to be Trump’s running mate, Hannity was one of the key people pushing Gingrich. CNN reported that he flew Gingrich out to meet with Trump in Indiana before Trump made his final decision. Former Speaker of the House Newt Gingrich, right, and Fox News host Sean Hannity, talk off air. Tom Williams / CQ-Roll Call,Inc. ID: 9586053 \nHannity’s efforts to promote Trump have at times struck observers almost like a tacit job application. Rumors swirled during the Republican convention in Cleveland that Hannity had expressed interest in serving as White House chief of staff in the Trump administration. (Hannity denies these, saying he has never asked for a job with Trump. He also dismissed rumors that he might join some kind of future Trump media organization in the event Trump loses. Would he ever consider any sort of job with Trump? “If I had no money and no job,” Hannity says, he’d consider it.) And he has defended Trump privately, too; a source with knowledge of the incident told BuzzFeed News that in the Fox News greenroom in Cleveland, Hannity cornered Utah Sen. Mike Lee — a Trump critic who became one of the most prominent figures in the Free the Delegates movement at the convention — and berated him for not getting on board with Trump, telling Lee he needed to get over his ego. \n“At first it started out in a stern but friendly tone but it was enough that there were people who left the green room” as the conversation became “heated,” the source said. \nHannity said he and Lee are “friends” and that he didn’t remember such an argument. “I think maybe once we might have discussed [Lee’s opposition to Trump] mildly or briefly but I don’t remember where,” Hannity said. “We’ve never had a negative word towards each other at all.” \nThere’s no doubt that in giving Trump such a major platform over the course of months, Hannity played a role in his ascendancy to the nomination (though the same could be said for a number of other figures in the cable news world). Hannity has a friendly relationship with Trump going back years (“I do like Donald Trump’s ties”, he told GQ in 2011). And Trump is a ratings boon. These two factors — combined with the fact that Hannity’s move to the 10 p.m. slot in 2013 put him at a disadvantage ratings-wise — have been viewed as a driving force behind Trump’s omnipresence on Hannity’s show. According to a source with direct knowledge of the conversation, Hannity called Trump after Trump made his initial Iowa appearance in January 2015, urging him to enter the presidential race. Hannity told BuzzFeed News he never urged Trump to get in the race. “I’m friends with Donald Trump, I talk to him, and I talk to every other candidate,” Hannity said. \nBut that’s not to say that Hannity has always favored Trump in this particular election, or that his motivation during that time was to help him succeed in the race. Last summer, Hannity held a panel on his show with two guests. The topic was the nascent primary campaign that summer, and particularly Trump, who at the time was still considered an entertaining anomaly by most of the media and political class. After the segment wrapped up, according to one of the guests on the panel, Hannity turned to his two guests to ask them if they thought Trump could win. Neither did — and nor did Hannity, who laughed about Trump’s candidacy and said he didn’t think he could win the nomination, referring to him as an “idiot” in over his head, according to one of the panelists who spoke on the condition of anonymity. Hannity says he never said any of this and described the anecdote as “total bullshit,” saying “those words never came out of my mouth.” \nTimes, clearly, have changed. And not just in the campaign. Hannity’s increased behind-the-scenes Trump advocacy has come at a time of extreme turmoil in his network. Hannity is seen as a loyalist of Roger Ailes, the Fox News boss ousted following revelations that he allegedly sexually harassed female employees at the network. Hannity called the allegations “all BS” on Twitter — an assertion that hasn’t aged well considering Fox settled with Gretchen Carlson, the first Ailes accuser, for $20 million. Ailes, for his part, is now advising Trump and assisting with debate preparations. “I do think that he thinks he’s under attack,” a Fox News source said. ID: 9586033 \nHannity has been relatively tight-lipped in public about the drama at Fox, telling the Washington Post on Wednesday, that “I have no comment about any of these topics involving the Fox News Channel and what’s happened.” But his public persona has become more conflict-driven over the past few months as his feuds with various other media and political figures have become increasingly aggressive. He’s recently gotten in drawn-out public spats with CNN’s Brian Stelter and with the Wall Street Journal’s Bret Stephens — another prominent voice from the Murdoch media empire, whom Hannity referred to as a “dumbass” and an “asshole” after Stephens called him “America’s dumbest anchor.” \n“I do think that he thinks he’s under attack,” a Fox News source said. \nRecently, Hannity traded barbs with Glenn Beck, who has staunchly opposed Trump. “Glenn Beck is like on a — it’s a holy war for him at this point. I mean, he’s off the rails attacking me every day,” Hannity said on his show. Beck responded : “Don’t condemn him. Please. The pressure on this job, the pressure on him, is enormous. Enormous! I truly believe he is trying to do the right thing. We just strongly disagree.” And earlier this week he got into a drawn-out Twitter fight with National Review’s Jonah Goldberg. The spats don’t bother him, he says. Asked if he’s worried about burning bridges with former allies, Hannity dismissed the idea. \n“Burning bridges? Who am I serving here? Am I going to live my life caring what people at WSJ and the NRO think of me?” Hannity said. “You can’t live your life caring how the punditry class thinks of you.” \nHannity blasted Beck and others who still oppose Trump for their “mysterious reluctance and sabotage” and he partly blames them for the fact that Republicans have not fully unified behind Trump. Hannity calls them out for their “constant negativity towards Trump, who’s offering you a pretty good vision.” \nRegardless of whether Trump is offering a clear vision, or the vision is to your taste, Sean Hannity hasn’t done much different. The outrage about Hannity’s support of Trump from conservative figures didn’t happen when Hannity was similarly supporting McCain or Romney. In a year where Republicans are more divided than ever, Hannity has become a symbol of that division and a flashpoint for anti-Trump frustrations. \n“I think the reason you’re seeing it’s appearing he’s going out of his way for Trump is you might not be taking into account that this is a unique election because the GOP is splintered in media, there’s an anti-Trump faction in media,” said AJ Delgado, a Trump surrogate and adviser who regularly goes on Hannity’s show. “Normally where you see the entire GOP pundit class behind one person, that’s why Sean appears to stick out.” \nDelgado said she never feels pressured to say anything on Hannity’s show and that she appreciates how he hasn’t pigeonholed her to just speak about Hispanic issues. As for the rumors of Trump TV, she dismissed them as “just rumors.” \nHannity says he is under contract for both radio and TV until the end of 2020. He makes millions of dollars hosting his radio show, for which he signed a contract with Premiere Networks in 2013. It’s for this reason that some dismiss out of hand the rumors that Hannity wants some kind of role with Trump in the future. But as speculation ramps up that Trump is building some kind of media organization for after the election, a possible future for Hannity could take shape. One Fox News host speculated to New York magazine’s Gabriel Sherman that Hannity would join Trump’s media outlet in a recent story. “I have no idea where that mysterious story popped up from,” Hannity says of Trump TV rumors, and he says no one in Trump’s world has approached him about such a move. \nOn Tuesday, Greta Van Susteren announced she was leaving Fox News, taking advantage of a “key man” clause in her contract that allowed her to leave in the event of Ailes leaving, which he has. In a statement, Van Susteren said that Fox no longer felt like home to her. It’s believed that other big names at Fox, including Hannity, also have the key-man clause in their contracts. In an interview with BuzzFeed News, Hannity would not talk about details of his contract beyond its length. \nBut “it would take a lot for him to leave,” the former Hannity producer said, pointing out that Ailes is not the only higher-up Hannity is close with. Bill Shine, who is now in control of the network, was once his producer. \nSo Hannity may stay where right where he is — the same “cheerful soldier,” as one Fox News source put it, continuing to do the same work he’s always done. It’s the world that has shifted around him. \n“At the end of all this he’ll still be cheerful,” the source said, “but who knows what he’ll believe.” Rosie Gray is a reporter for BuzzFeed News and is based in Washington, D.C. Gray reports on politics and foreign policy. Contact Rosie Gray at . ", "external_links": [], "published": "2016-09-08T08:00:00.000+03:00", "crawled": "2016-09-09T07:46:34.146+03:00", "highlightTitle": ""}