{"organizations": [], "uuid": "d04b605fa481e8aeb61c3e1bc56af410291287e3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 3, "shares": 3, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "latino.foxnews.com", "main_image": "http://global.fncstatic.com/static/v/all/img/fn_latino_128x128.png", "site_section": "http://feeds.latino.foxnews.com/home/feed", "section_title": "FOX News", "url": "http://latino.foxnews.com/latino/news/2016/09/25/panama-neglecting-its-own-house-in-diplomatic-fight-against-climate-change/", "country": "US", "domain_rank": 185, "title": "Panama neglecting its own house in diplomatic fight against climate change", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "Panama neglecting its own house in diplomatic fight against climate change | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2016-09-25T03:00:00.000+03:00", "replies_count": 0, "uuid": "d04b605fa481e8aeb61c3e1bc56af410291287e3"}, "author": "EFE", "url": "http://latino.foxnews.com/latino/news/2016/09/25/panama-neglecting-its-own-house-in-diplomatic-fight-against-climate-change/", "ord_in_thread": 0, "title": "Panama neglecting its own house in diplomatic fight against climate change", "locations": [], "entities": {"persons": [{"name": "ramos", "sentiment": "none"}, {"name": "espitia", "sentiment": "none"}, {"name": "geronimo espitia", "sentiment": "none"}, {"name": "isaias ramos", "sentiment": "none"}, {"name": "olmedo carrasquilla", "sentiment": "none"}], "locations": [{"name": "panama city", "sentiment": "none"}, {"name": "panama", "sentiment": "none"}, {"name": "matusagarati lagoon", "sentiment": "none"}, {"name": "panama bay", "sentiment": "none"}, {"name": "colombia", "sentiment": "none"}, {"name": "juan diaz river", "sentiment": "none"}], "organizations": [{"name": "tourism authority", "sentiment": "none"}, {"name": "environmental impact center-panama", "sentiment": "none"}, {"name": "paris accord", "sentiment": "none"}, {"name": "public works ministry", "sentiment": "none"}, {"name": "public services authority", "sentiment": "none"}, {"name": "efe", "sentiment": "none"}, {"name": "education ministry", "sentiment": "none"}, {"name": "environment ministry", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "  Panama City –   Panama's commitment to fight climate change seems convincing, given its ratification of the Paris Accord and its proposal to host a world emissions reductions center, but there is a gap between this foreign policy issue and the way it's handling things at home.\nOn the one hand, Panama is signing agreements and on the other it is approving the expansion of power plants. Thousands of hectares (acres) of trees are being planted in a public-private alliance, but the cutting of another 11,000 hectares (about 28,000 acres) per year is continuing, Collective Ecological Voices activist Olmedo Carrasquilla said.\nPanama belongs to the mechanism to Reduce Emissions from Deforestation and Forest Degradation, or REDD+, and as part of the Paris Accord it agreed to host the international center to implement that strategy, but the capital's rapid urban growth and spread is destroying surrounding wetlands.\n\"States are coming to international agreements to present an image to the multilateral financial entities ... but the reality is that most governments are responding to economic interests that link them to those agreements and Panama is no different,\" Panamanian environmentalist and urban planner Geronimo Espitia told EFE.\nIn Panama, where tropical forests cover 60 percent of its territory, many economic activities are being undertaken in areas adjacent to protected zones, or in areas that deserve special attention but are not getting it.\nThe protected ecosystems cannot survive in an isolated manner because \"the territory is like the human body, it's interconnected,\" said Espitia.\nHe said that just a short distance east of the capital the Environment Ministry has avoided dealing with the deforestation of part of the Juan Diaz wetlands, which is adjacent to the Panama Bay wetland, a refugee for two million migratory birds each year.\nAlthough only low-density housing may be built in the surrounding zone, huge apartment towers have been approved and the floodbasin of the Juan Diaz River has been refilled to meet housing demand over the opposition of environmental organizations.\nA similar risk faces the Darien jungle, bordering on Colombia, and the Matusagarati Lagoon, which have been placed at the mercy of agricultural development.\nThe Environment and Justice Ministries have not responded to the devastation of the zone and the contamination of the waters there, activists say.\nBiologist Isaias Ramos, with the Environmental Impact Center-Panama, attributes the lack of action to bureaucratic \"a lack of coordination.\"\n\"On one hand, the Environment Ministry says it's going to protect the area, but the Public Services Authority issues permits; the Public Works Ministry allows highways to be built; the Tourism Authority allows unsustainable tourist growth and the Education Ministry builds schools\" that attract urban development, Ramos told EFE.\nSo far, 60 states comprising slightly more than 47.5 percent of global emissions have joined the Paris Accord, including Panama, just shy of the threshold for the pact's entry into force.", "external_links": [], "published": "2016-09-25T03:00:00.000+03:00", "crawled": "2016-09-26T04:03:37.427+03:00", "highlightTitle": ""}