{"organizations": [], "uuid": "55c989c7e437af3178b3fb129168e7d906403389", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 62, "shares": 62, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/news/0/0/172555083.jpg", "site_section": "http://feeds.latino.foxnews.com/home/feed", "section_title": "FOX News", "url": "http://latino.foxnews.com/latino/opinion/2016/09/16/opinion-lets-stop-pricing-people-out-citizenship/", "country": "US", "domain_rank": 185, "title": "Opinion: Let’s stop pricing people out of citizenship", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "Opinion: Let’s stop pricing people out of citizenship | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2016-09-16T03:00:00.000+03:00", "replies_count": 0, "uuid": "55c989c7e437af3178b3fb129168e7d906403389"}, "author": "New Americans Campaign", "url": "http://latino.foxnews.com/latino/opinion/2016/09/16/opinion-lets-stop-pricing-people-out-citizenship/", "ord_in_thread": 0, "title": "Opinion: Let’s stop pricing people out of citizenship", "locations": [], "entities": {"persons": [{"name": "charles kamasaki", "sentiment": "none"}, {"name": "eric cohen", "sentiment": "none"}, {"name": "stewart kwoh", "sentiment": "none"}, {"name": "ali noorani", "sentiment": "none"}, {"name": "josh hoyt", "sentiment": "none"}, {"name": "van de weerd", "sentiment": "none"}, {"name": "arturo vargas", "sentiment": "none"}, {"name": "mark o’brien", "sentiment": "none"}], "locations": [{"name": "la", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "los angeles", "sentiment": "none"}], "organizations": [{"name": "immigrant legal resource center", "sentiment": "none"}, {"name": "national council of la raza", "sentiment": "none"}, {"name": "u.s. citizenship and immigration services", "sentiment": "none"}, {"name": "lpr", "sentiment": "none"}, {"name": "npna", "sentiment": "none"}, {"name": "u.s. programs", "sentiment": "none"}, {"name": "national partnership", "sentiment": "none"}, {"name": "uscis", "sentiment": "none"}, {"name": "national immigration forum", "sentiment": "none"}, {"name": "irc", "sentiment": "none"}, {"name": "naleo educational fund", "sentiment": "none"}, {"name": "nclr", "sentiment": "none"}, {"name": "asian americans advancing justice", "sentiment": "none"}, {"name": "naleo", "sentiment": "none"}, {"name": "international rescue committee", "sentiment": "none"}, {"name": "facebook  follow us on twitter & instagram", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By New Americans Campaign \n  Fox News Latino Getty Images \nToo many would-be new American citizens are facing barriers to citizenship that we can help them overcome.\nThose who are able and choose to live permanently in the United States don’t need to be convinced of the enormous opportunities this country presents. But the opportunities are greater still for legal immigrants who become citizens.\nCitizenship alone can boost individual earnings by 8 to 11 percent, benefiting families, communities and the nation as a whole. Naturalization in greater numbers can even grow our national economy by $21 billion to $45 billion over 10 years, depending on how aggressively we promote it. - New Americans Campaign\nNearly 9 million citizenship-eligible lawful permanent residents (LPR) live in the U.S. today. Yet fewer than 10 percent naturalize each year.\nWe should ask why more LPRs are not taking the critical next step toward citizenship. For many, the reason is cost.\nTo apply for naturalization as an individual costs $680, not including the cost of legal representation. This price has increased by more than 500 percent in just 20 years. And next month, on the heels of Constitution Day and Citizenship Day , that amount is likely to rise again to $725, part of an agency-wide average fee increase of 21 percent at U.S. Citizenship and Immigration Services (USCIS) that the administration has proposed.\nThis proposed fee increase has implications that extend beyond just the naturalization application. Costs associated with other immigration forms also could increase significantly.\nThe application for certificate of citizenship could rise from $600 to $1,170, a 95 percent increase. And appeals for a denied naturalization application are set to increase from $650 to $700, making it more expensive for applicants to challenge erroneous denials.\nAll of these increases will serve to deter some eligible permanent residents and their children from applying for U.S. citizenship.\nBut there’s some good news.\nUSCIS also proposed plans to expand the current fee waiver program for lower-income applicants. The agency’s proposal, a partial fee waiver for citizenship-eligible LPRs who earn between 150 and 200 percent of the federal poverty level, would put citizenship in closer reach for more aspiring Americans.\nFor a family of four, 150 percent of the federal poverty level is income of only $36,450 per year. The administration estimates that more than a million people would become eligible for this 50 percent discount on the citizenship application.\nThat’s a big step in the right direction, and it’s something for which we’ve advocated through the New Americans Campaign.\nBut it doesn’t go far enough. The partial fee waiver affects only 12 percent of all citizenship-eligible LPRs. If this fee waiver were expanded to include those who earn up to 250 percent of the federal poverty level, almost 1 million more LPRs could benefit.\nIt serves our national interest if the privilege of U.S. citizenship is within everyone’s reach. To encourage citizenship is to encourage a stronger American economy.\nCitizenship alone can boost individual earnings by 8 to 11 percent , benefiting families, communities and the nation as a whole. Naturalization in greater numbers can even grow our national economy by $21 billion to $45 billion over 10 years, depending on how aggressively we promote it.\nIn 1787, the U.S. Constitutional Convention produced the document our nation looks to as a beacon for guidance on the toughest issues we face. Constitution Day and Citizenship Day gives us an opportunity to recognize and celebrate all who have become, or aspire to become, citizens of the United States.\nLet’s do more to put citizenship within reach of everyone.\nEric Cohen is the executive director of the Immigrant Legal Resource Center, which leads the New Americans Campaign, a nationwide network that promotes immigrant integration through citizenship.  \nJosh Hoyt is the executive director of the National Partnership for New Americans (NPNA). NPNA is a national partner of the New Americans Campaign. \nCharles Kamasaki is the Senior Cabinet Adviser for the National Council of La Raza (NCLR). NCLR is a national partner of the New Americans Campaign. \nStewart Kwoh is the founding president and executive director of Asian Americans Advancing Justice – Los Angeles (Advancing Justice – LA). Advancing Justice – LA is a national partner of the New Americans Campaign. \n\nAli Noorani is the executive director of the National Immigration Forum. The Forum is a national partner of the New Americans Campaign. \nMark O’Brien is the co-founder and executive director of Pro Bono Net, a national nonprofit that increases access to justice for the poor and other vulnerable populations through innovative uses of technology, collaboration and volunteer mobilization. Pro Bono Net is a national partner of the New Americans Campaign. \nHas Van de Weerd is the Vice President of U.S. Programs at the International Rescue Committee (IRC). The IRC is a national partner of the New Americans Campaign. \nArturo Vargas is the executive director of NALEO Educational Fund,   the leading national nonprofit organization that promotes the full participation of Latinos in American civic life.   NALEO is a national partner of the New Americans Campaign. \nLike us on Facebook \nFollow us on Twitter & Instagram", "external_links": [], "published": "2016-09-16T03:00:00.000+03:00", "crawled": "2016-09-16T20:42:41.446+03:00", "highlightTitle": ""}