{"organizations": [], "uuid": "55199f487abf4e500287fe7b0355ab8416cf5ded", "thread": {"social": {"gplus": {"shares": 4}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 2}, "facebook": {"likes": 403, "shares": 403, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/politics/0/0/Cuban%20eagle%20hat.jpg", "site_section": "", "section_title": "", "url": "http://latino.foxnews.com/latino/politics/2016/09/18/cuban-americans-in-florida-could-tilt-most-populous-presidential-battleground/", "country": "US", "domain_rank": 185, "title": "Cuban-Americans in Florida could tilt most populous presidential battleground state | Fox News Latino", "performance_score": 4, "site": "foxnews.com", "participants_count": 0, "title_full": "Cuban-Americans in Florida could tilt most populous presidential battleground state | Fox News Latino", "spam_score": 0.001, "site_type": "news", "published": "2016-09-19T04:05:00.000+03:00", "replies_count": 0, "uuid": "55199f487abf4e500287fe7b0355ab8416cf5ded"}, "author": "", "url": "http://latino.foxnews.com/latino/politics/2016/09/18/cuban-americans-in-florida-could-tilt-most-populous-presidential-battleground/", "ord_in_thread": 0, "title": "Cuban-Americans in Florida could tilt most populous presidential battleground state | Fox News Latino", "locations": [], "entities": {"persons": [{"name": "gutierrez", "sentiment": "none"}, {"name": "castro", "sentiment": "none"}, {"name": "barack obama", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "moreno", "sentiment": "none"}, {"name": "george w. bush", "sentiment": "none"}, {"name": "brian ballard", "sentiment": "none"}, {"name": "hugo chavez", "sentiment": "none"}, {"name": "karen giorno", "sentiment": "none"}, {"name": "fernandez", "sentiment": "none"}, {"name": "joe", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "fidel castro", "sentiment": "none"}, {"name": "ramiro naval", "sentiment": "none"}, {"name": "suarez", "sentiment": "none"}, {"name": "kennedy", "sentiment": "none"}, {"name": "tejera", "sentiment": "none"}, {"name": "carlos gutierrez", "sentiment": "none"}, {"name": "francis suarez", "sentiment": "none"}, {"name": "rubio", "sentiment": "none"}, {"name": "roberto rodriguez tejera", "sentiment": "none"}, {"name": "amandi", "sentiment": "none"}, {"name": "tomas regalado", "sentiment": "none"}, {"name": "rudy fernandez", "sentiment": "none"}, {"name": "fernand amandi", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "mitt romney", "sentiment": "none"}, {"name": "john f. kennedy", "sentiment": "none"}, {"name": "gary johnson", "sentiment": "none"}, {"name": "obama", "sentiment": "none"}, {"name": "clinton", "sentiment": "none"}, {"name": "mike fernandez", "sentiment": "none"}, {"name": "marco rubio", "sentiment": "none"}, {"name": "carlos curbelo", "sentiment": "none"}, {"name": "ileana ros-lehtinen", "sentiment": "none"}, {"name": "dario moreno", "sentiment": "none"}], "locations": [{"name": "florida", "sentiment": "none"}, {"name": "miami city hall", "sentiment": "none"}, {"name": "cuba", "sentiment": "none"}, {"name": "miami", "sentiment": "none"}, {"name": "south america", "sentiment": "none"}, {"name": "getty images  miami", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}, {"name": "latino miami", "sentiment": "none"}, {"name": "miami-dade county", "sentiment": "none"}, {"name": "tallahassee", "sentiment": "none"}, {"name": "venezuela", "sentiment": "none"}, {"name": "havana", "sentiment": "none"}, {"name": "little havana", "sentiment": "none"}, {"name": "versailles", "sentiment": "none"}], "organizations": [{"name": "florida international university", "sentiment": "none"}, {"name": "fox news", "sentiment": "none"}, {"name": "republican", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "congress", "sentiment": "none"}, {"name": "gop", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "republican national committee", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "democratic", "sentiment": "none"}, {"name": "ap", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Cuban-Americans in Florida could tilt most populous presidential battleground state Published September 18, 2016 Fox News Latino MIAMI - FEBRUARY 19: Ramiro Naval wears an American flag hat as he reacts to the news that Cuban President Fidel Castro announced he will not accept a new term in office in front of the Versailles restaurant in the Little Havana neighborhood February 19, 2008 in Miami, Florida. Castro has announced he is stepping down after 49 years in power, saying he is no longer healthy enough to hold office. (Photo by Joe Raedle/Getty Images) 2008 Getty Images \nMIAMI (AP) – Francis Suarez comes from a long line of civic and political leaders who have formed the Republican bedrock in south Florida's Cuban community for a half-century. Yet the 38-year-old Miami city commissioner hasn't decided whether he will vote for his party's presidential nominee. \nAnd he's not alone. Many Cuban-Americans express solidarity with other Latin-Americans who see Donald Trump as anti-Hispanic. Still others hear in Trump's nationalistic populism echoes of the government strongmen they once fled. \n\"There are aspects of Trump that appeal to parts of the Cuban-American culture: strong leadership, the ability and willingness to say bold things,\" says Suarez, the son of a former Miami mayor and a potential chief executive himself. The concern, Suarez says, comes when Trump's boorishness, bullying and slapdash policy pronouncements \"cross the line from bold to wild, unpredictable.\" \nHow those misgivings influence the votes of hundreds of thousands of Cuban-Americans could tilt the nation's most populous presidential battleground state and, depending on circumstances elsewhere, determine whether Trump or Democrat Hillary Clinton wins the election. \nRoberto Rodriguez Tejera, a well-known Spanish-language radio and television host in Miami, says he won't endorse Trump or Clinton, arguing neither has engaged in genuine, personal outreach to average Cuban and other Hispanic voters. But Tejera asks his audiences to compare Trump's assertions that \"I am your voice\" and \"I alone can solve\" societal ills to the initial appeals of authoritarian rulers like Cuba's Fidel Castro and the late Hugo Chavez in Venezuela. \n\"It goes well beyond immigration to the very nature of our Latin-American problem,\" Tejera said in an interview. \"Many of us remember how it starts. It starts with questioning institutions. Then you destroy institutions — you being the only person in the world who can save the nation from collapse.\" \nFernand Amandi, a Democratic south Florida pollster, estimates the Cuban-American vote could approach 8 percent of the 8 million-plus ballots cast in Florida in November. Amandi said Cuban-Americans are \"the only Hispanic group in the country\" to support Trump over Clinton in preference polling, but not by a margin victorious Republican nominees have managed. \nTrump aides note support from some elected officials and volunteers within the Cuban-American community, but Trump adviser Karen Giorno said his strategy ultimately considers Cuban-Americans as it does anyone else: \"They are worried about safety and security. They are worried about the economy. They are worried about drugs on the street. They are worried about the same things other Americans are worried about.\" \nSuarez, the Miami commissioner, applauds that approach, but he says it doesn't account for some Cubans-Americans who are thinking of themselves, for the first time in presidential politics, as aligned with immigrants from Mexico and the nations of Central and South America — a collective class of people who have never enjoyed Cubans' favored immigration status. \n\"Some Cubans don't consider themselves Hispanic,\" says Amandi, the Democratic pollster. But now, says Republican pollster Dario Moreno, Trump has made immigration a \"symbolic issue\" that penetrates the Cuban psyche. \"Anti-immigration rhetoric is taken as anti-Hispanic,\" Moreno said, \"and you see that even among the old Cubans\" who were the first to arrive in Florida as refugees after Castro came to power in 1959. \nClinton certainly sees an opening. In the last week, she launched an advertising blitz featuring the endorsement of Carlos Gutierrez, a Cuban-American Republican and commerce secretary for President George W. Bush. Speaking in Spanish, Gutierrez calls Trump dangerous and says: \"For me, it's country first, and then party.\" \nOne of the GOP's top financiers, health-care billionaire Mike Fernandez, recently called Trump an \"abysmally unfit candidate\" and endorsed Clinton. \nOther prominent Republicans — Miami Mayor Tomas Regalado and U.S. Reps. Carlos Curbelo and Ileana Ros-Lehtinen — have said they will not support Trump, though they've stopped short of endorsing Clinton. \nTejera, the broadcaster, says heavyweights like Gutierrez and Fernandez \"won't move one vote,\" but their public backing of a Democratic nominee is a striking development in Cuban-American politics. \nFor decades, the equation was simple: U.S. politicians of all persuasions blasted the Castro government and supported the trade embargo first imposed under President John F. Kennedy, a Democrat. Despite mostly bipartisan agreement, initial Cuban arrivals to the U.S. aligned overwhelmingly with Republicans, largely out of anger at Kennedy's handling of the failed Bay of Pigs invasion intended to topple Castro in 1961. Yet many in that generation have died or are old, and their children and grandchildren, along with more recent Cuban immigrants, aren't as hard line or simply don't vote exclusively on \"the Cuba question.\" \n\"We're starting to see them think and vote like everybody else, not be driven by a single issue,\" says Moreno, the Republican pollster and a professor at Miami's Florida International University. \nExit polls in the 2012 election found Cuban-Americans essentially split between President Barack Obama and Republican Mitt Romney, less than a decade after George W. Bush won the Cuban vote overwhelmingly. Obama has since normalized diplomatic relations with Havana, traveled to the island for a state visit and called on Congress to lift the trade embargo. \nClinton has forcefully ratified Obama's stance. Until last week, Trump effectively endorsed it, as well, with vague qualifiers that he'd get \"a better deal\" than Obama. Yet on Friday in Miami, he reversed himself, embracing the hard-liners' longstanding views and promising to roll back Obama's actions unless the Castro government expanded political freedoms on the island. \nRudy Fernandez, 43, who spent almost a decade working at the Republican National Committee and in the White House under George W. Bush, doesn't mention Cuba when explaining why he will choose between Clinton and Libertarian Gary Johnson. Rather, he argues that Trump has been \"deeply divisive\" and adds a common GOP establishment critique that the billionaire \"is not a Republican ... not a conservative\" and \"lacks the temperament required for the job.\" \nTo be clear, Clinton doesn't have a lock on Cuban-American votes Trump may lose. Amandi notes that Clinton's Spanish-language media presence began months later than Obama's general election efforts. \nTejera dismissed Clinton's south Florida outreach as \"meeting with the usual Democratic officials and donors\" and perhaps the highest-profile Republicans who can't abide Trump. \nThen there's Florida Sen. Marco Rubio's re-election campaign. Moreno described Rubio, the son of Cuban refugees, as a \"role model in the Cuban-American community the way Barack Obama is in the African-American community.\" Rubio trounced Trump in Miami-Dade County in the March presidential primary, despite Trump's easy statewide win. \nBrian Ballard, a top Florida lobbyist in Tallahassee and a Trump fundraiser, predicted Rubio will attract Cuban-Americans who will then vote for Trump, even though he mocked the senator earlier this year as \"Little Marco.\" \nBack at Miami City Hall, Suarez says that's possible, but he argued Cuban-American Republicans are just as likely to see Rubio as an easy out: They can abandon Trump and still call themselves party loyalists, like always. \n\"A presidential election of this magnitude,\" Suarez said, \"the electorate is going to make up its mind all on its own.\" \nLike us on Facebook ", "external_links": [], "published": "2016-09-19T04:05:00.000+03:00", "crawled": "2016-09-18T23:05:40.363+03:00", "highlightTitle": ""}