{"organizations": [], "uuid": "c8a2191998c381430adda1b7b1c2960de74c93f8", "thread": {"social": {"gplus": {"shares": 3}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 14}, "facebook": {"likes": 215, "shares": 215, "comments": 0}, "stumbledupon": {"shares": 9}}, "site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/media2.foxnews.com/BrightCove/694940094001/2016/09/04/0/0/694940094001_5112066620001_29f66342-690f-4d4e-9a47-24d257e5294b.jpg?ve=1", "site_section": "http://feeds.foxnews.com/foxnews/politics", "section_title": "FOX News", "url": "http://www.foxnews.com/politics/2016/09/05/bolstered-by-polls-team-trump-attacks-clinton-says-americans-understand-illegal-immigration-plan.html", "country": "CH", "domain_rank": 185, "title": "Bolstered by polls, Team Trump attacks Clinton, says Americans understand illegal immigration plan", "performance_score": 2, "site": "foxnews.com", "participants_count": 12, "title_full": "Bolstered by polls, Team Trump attacks Clinton, says Americans understand illegal immigration plan | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2016-09-05T03:00:00.000+03:00", "replies_count": 17, "uuid": "c8a2191998c381430adda1b7b1c2960de74c93f8"}, "author": "FoxNews.com", "url": "http://www.foxnews.com/politics/2016/09/05/bolstered-by-polls-team-trump-attacks-clinton-says-americans-understand-illegal-immigration-plan.html", "ord_in_thread": 0, "title": "Bolstered by polls, Team Trump attacks Clinton, says Americans understand illegal immigration plan", "locations": [], "entities": {"persons": [{"name": "clinton", "sentiment": "negative"}, {"name": "kellyanne conway", "sentiment": "none"}, {"name": "enrique pena nieto", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "tim kaine", "sentiment": "none"}, {"name": "kaine", "sentiment": "none"}, {"name": "martha", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "conway", "sentiment": "none"}, {"name": "mike pence", "sentiment": "none"}, {"name": "pence", "sentiment": "none"}, {"name": "vladimir putin", "sentiment": "none"}], "locations": [{"name": "united states", "sentiment": "none"}, {"name": "hamptons", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}, {"name": "virginia", "sentiment": "none"}, {"name": "tampa", "sentiment": "none"}, {"name": "arizona", "sentiment": "none"}, {"name": "indiana", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}, {"name": "pennsylvania", "sentiment": "none"}, {"name": "ohio", "sentiment": "none"}], "organizations": [{"name": "team trump", "sentiment": "negative"}, {"name": "foxnews.com      top trump", "sentiment": "neutral"}, {"name": "democratic national committee", "sentiment": "none"}, {"name": "abc", "sentiment": "none"}, {"name": "fbi", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "nbc", "sentiment": "none"}, {"name": "gop", "sentiment": "none"}, {"name": "rcp", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "state department", "sentiment": "none"}, {"name": "clinton foundation", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Published September 05, 2016 FoxNews.com     \nTop Trump campaign officials on Sunday expressed optimism about recent poll numbers amid the fallout from Democratic rival Hillary Clinton’s FBI email investigation and sought to defend the Republican presidential nominee's immigration plan in advance of the White House race intensifying after Labor Day.\n\n“The polling data that you showed earlier really tells the tale,” Trump campaign manager Kellyanne Conway told ABC’s “This Week.” “Hillary Clinton is having a hard time being accepted as a truthful and honest candidate vis-à-vis the American people.” \nClinton’s poll numbers have dropped in recent weeks amid further revelations about her use of a private email server while secretary of state and connections between Clinton Foundation donors and the State Department during and after her tenure at the agency.\nThe RealClearPolitics polls average showed Clinton leading Donald Trump by as many as 8 percentage points in mid-August, when the first-time candidate made a series of campaign missteps that some political analysts predicted would be too damaging to overcome.\nHowever, the RCP average is now at about 4 points, though Trump trails by larger margins in such key battleground states as Ohio and Pennsylvania.\n“We're taking Pennsylvania very seriously,” said Conway, acknowledging Democrats have won there in the past six presidential elections but dismissing the argument that the state is do-or-die for Trump.\n2016 Election Headquarters The latest headlines on the 2016 elections from the biggest name in politics. See Latest Coverage → \n“We have several different paths to victory,” she said.\nThe Trump campaign also faced repeated questions Sunday about Trump’s immigration plan, which critics argue is vague on the issues of deportation for illegal immigrants and whether the United States or Mexico will pay for Trump’s proposed wall along the southern U.S. border.\nGOP vice-presidential nominee Gov. Mike Pence said on NBC’s “Meet the Press” that the plan begins with building the wall for border security and makes a priority of “enforcing the laws of this country,\" including removing “criminal aliens” and people who've overstayed visas.\nThe Indiana governor also shot back that voters understood the plan, despite repeated questions from some in the media.\n\"What the American people want to see today is to establish the borders of this country, enforce the laws of this country. And Donald Trump has created a road map to do that,\" said Pence, who bristled at the suggestion that Trump hadn't been definitive enough in explaining his plan.\n\"Some 10,000 people in Arizona last week, it wasn't the way they see it,\" Pence said. \"As I travel across this country campaigning with Donald Trump and for Donald Trump, I think people hear him loud and clear. And he's been completely consistent on this point.\"\n\nConway faced similar questions -- including one about managing the deportation of millions of people -- after a week in which Trump hinted about a possible “softening” in his immigration stances, met Wednesday with Mexican President Enrique Pena Nieto, then delivered the Arizona speech hours later in which he appeared to return to his hardline positions on immigration. \n“He'll manage it the way it should have been managed all along, by enforcing the law and relying upon those law enforcement officers and those (federal immigration) officers to do their job,” Conway said. “But at least you have a presidential candidate putting forth a 10-point plan.”\nShe also criticized Clinton for failing to hold a full-fledged press conference in 274 days and for staying off the campaign trail for several days to fundraise in such wealthy enclaves as the Hamptons and Martha’s Vineyard while campaign spokespeople and surrogates such as running-mate Virginia Gov. Tim Kaine pushed forward in the effort.\nThe Clinton campaign announced Sunday that Clinton would return to the trail Tuesday with an event in Tampa and issued a statement on Trump’s immigration plan, saying it’s an attempt to “mislead” Americans.\n“Donald Trump has stated very clearly throughout his campaign that he will deport everyone who is undocumented, something that was reinforced in his speech in Arizona,” the campaign said. “What we saw today is Mike Pence and Trump’s top campaign officials attempt to mislead voters about their mass deportation policy by using soft words to describe harsh tactics.”\nKaine on Sunday brushed off repeated questions about the FBI investigation of Clinton's secret server, saying she requested the public release of her secretary of state emails and the release of the FBI notes from the agency’s interview with her last month. The federal investigation found that some emails sent or received by Clinton included classified information. However, no criminal charges were recommended.\n“The reason these materials are being made public is that Hillary Clinton said I want the public to see them,” Kaine told ABC. “She said it was a mistake.”\nKaine instead pivoted to Trump's refusal to release his tax returns -- many of which Trump says he can't release because they're under audit -- and statements from Trump that appear to show support for how Russian President Vladimir Putin runs his country.\n“Talk about national security,” Kaine said. “He has openly encouraged Russia to engage in cyber hacking to try to find more emails or materials, and we know that this cyberattack on the (Democratic National Committee) was likely done by Russia...This is serious business.”", "external_links": [], "published": "2016-09-05T03:00:00.000+03:00", "crawled": "2016-09-05T12:08:15.140+03:00", "highlightTitle": ""}