{"organizations": [], "uuid": "0549a5b3c6fd3c09c9465ca0612c822485ce8980", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 2, "shares": 2, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "latino.foxnews.com", "main_image": "http://global.fncstatic.com/static/v/all/img/fn_latino_128x128.png", "site_section": "http://feeds.latino.foxnews.com/home/feed", "section_title": "FOX News", "url": "http://latino.foxnews.com/latino/sports/2016/09/08/paralympics-kick-off-with-music-and-color-in-rio-de-janeiro/", "country": "US", "domain_rank": 185, "title": "Paralympics kick off with music and color in Rio de Janeiro | Fox News Latino", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "Paralympics kick off with music and color in Rio de Janeiro | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2016-09-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "0549a5b3c6fd3c09c9465ca0612c822485ce8980"}, "author": "EFE", "url": "http://latino.foxnews.com/latino/sports/2016/09/08/paralympics-kick-off-with-music-and-color-in-rio-de-janeiro/", "ord_in_thread": 0, "title": "Paralympics kick off with music and color in Rio de Janeiro | Fox News Latino", "locations": [], "entities": {"persons": [{"name": "philip craven", "sentiment": "none"}, {"name": "ibrahim al hussein", "sentiment": "none"}, {"name": "purdy", "sentiment": "none"}, {"name": "adria rocha", "sentiment": "none"}, {"name": "nuzman", "sentiment": "none"}, {"name": "vik muniz", "sentiment": "none"}, {"name": "clodoaldo silva", "sentiment": "none"}, {"name": "amy purdy", "sentiment": "none"}, {"name": "craven", "sentiment": "none"}, {"name": "antonio delfino", "sentiment": "none"}, {"name": "michel temer", "sentiment": "none"}, {"name": "fred gelli", "sentiment": "none"}, {"name": "aaron wheelz", "sentiment": "none"}, {"name": "marcelo rubens paiva", "sentiment": "none"}, {"name": "carlos arthur nuzman", "sentiment": "none"}, {"name": "seu jorge", "sentiment": "none"}, {"name": "marcia malsar", "sentiment": "none"}, {"name": "clodoaldo", "sentiment": "none"}, {"name": "bossa nova", "sentiment": "none"}, {"name": "joao carlos martins", "sentiment": "none"}], "locations": [{"name": "rio de janeiro", "sentiment": "none"}, {"name": "brazil", "sentiment": "none"}, {"name": "sochi", "sentiment": "none"}, {"name": "maracana stadium", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "paralympics", "sentiment": "none"}, {"name": "organizing committee", "sentiment": "none"}, {"name": "samba", "sentiment": "none"}, {"name": "international paralympic committee", "sentiment": "none"}, {"name": "rio 2016 paralympics", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Published September 08, 2016 EFE Rio de Janeiro –   Rio de Janeiro, Brazil, Sep 7 (efe_epa).- The opening ceremony of the first Paralympics on South American soil was a tropical celebration full of colors and Samba music, filling the Maracana Stadium for almost four hours in Rio de Janeiro.\nThe ceremony began with a video which starred Sir Philip Craven, a British wheelchair athlete who competed in five Paralympic games from 1972 to 1988. He later waved from one of the stands as the president of the International Paralympic Committee.\nAaron Wheelz, an American wheelchair athlete, delighted the audience with an impressive jump from a steep ramp on one of the highest stands of the stadium.\nAfter that moment, music took a leading role. With rhythms such as Samba, Tropical and Bossa Nova, performances with colors, lights and sounds illuminated the night in Rio de Janeiro.\nWith a single piano, the maestro Joao Carlos Martins was in charge of adding music to the anthem of Brazil and the hoisting of the flag of the country.\nThen, one by one, representatives from the 164 participating countries paraded around the stadium, including Ibrahim Al Hussein, a Syrian refugee who joins the Paralympics as an independent athlete.\nThe entrance of the Brazilian team, the last one in the parade, led the audience to rejoice and completed the unfinished heart-shaped puzzle on the stadium floor, illuminating a metaphor of life.\nThat moment was the prelude to the official speech from Carlos Arthur Nuzman, president of the Organizing Committee for the Rio 2016 Paralympics, who was the first to speak.\n\"We celebrate a great challenge, the challenge to build a new world with is more accessible to all, fairer, more fraternal where everyone can walk unhindered. The athletes inspire us with their passion. You all are super human, you do not know the impossible. Let's build a new world together\", said Nuzman.\nPhilip Craven, the president of the International Paralympic Committee, later spoke, highlighting the \"true meaning of sport\" for athletes with disabilities.\n\"'You all have the power to change communities, countries and cities. You are the heroes of today's sport. You have the opportunity to make the world a better place. Hope always defeats fear and we are all part of one world\", said Craven.\nAfter this the president of Brazil, Michel Temer, declared open the Paralympic Games.\nCreated by three directors, the designer Fred Gelli, the writer Marcelo Rubens Paiva and the artist Vik Muniz, the ceremony aimed to reflect the human condition of athletes, their feelings, difficulties and their solidarity.\nOne of the stars of the ceremony was the American athlete Amy Purdy, a Paralympic medalist in snowboarding in the Sochi 2014 Winter Paralympics. Purdy, who lost both legs when she was 19 years old, performed a Samba dance.\nThe most emotional moment of the ceremony came near the end with the lighting of the Paralympic cauldron. Having traveled across the five regions of Brazil over seven days with 500 carriers, the flame arrived at the stadium in the hands of four Brazilian athletes with disabilities: Antonio Delfino, Marcia Malsar, Adria Rocha and Clodoaldo Silva.\nClodoaldo was in charge of carrying the torch to the cauldron, where he had to overcome three slopes with the additional difficulty of wet surfaces from earlier rain.\nReflecting the four Paralympic values: courage, determination, inspiration and equality, the colorful quadrangular torch did not burn out and gave way to the final show.\nSeu Jorge, who was in charge of wrapping up the ceremony, was accompanied by musicians Circle Samba and made the Maracana audience move their bodies.\nThe Paralympics in Rio de Janeiro has participants from 159 countries and 4,432 athletes who will compete in 22 categories, two more categories than in the London 2012 Paralympics due to the inclusion of triathlon and canoeing.", "external_links": [], "published": "2016-09-08T03:00:00.000+03:00", "crawled": "2016-09-08T06:30:42.883+03:00", "highlightTitle": ""}