{"organizations": [], "uuid": "0a4539a0e8009fb1417901a1842a11e0c9b90c29", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 2, "shares": 2, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/images.foxnews.com/content/fox-news/us/2016/09/06/latest-clinton-trump-wont-visit-sept-11-attack-site/_jcr_content/par/featured-media/media-0.img.jpg/0/0/1473191378358.jpg?ve=1", "site_section": "http://feeds.foxnews.com/foxnews/national", "section_title": "FOX News", "url": "http://www.foxnews.com/us/2016/09/06/latest-clinton-trump-wont-visit-sept-11-attack-site.html", "country": "CH", "domain_rank": 185, "title": "The Latest: Clinton, Trump won't visit Sept 11 attack site", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "The Latest: Clinton, Trump won't visit Sept 11 attack site", "spam_score": 0.0, "site_type": "news", "published": "2016-09-07T03:43:00.000+03:00", "replies_count": 0, "uuid": "0a4539a0e8009fb1417901a1842a11e0c9b90c29"}, "author": "", "url": "http://www.foxnews.com/us/2016/09/06/latest-clinton-trump-wont-visit-sept-11-attack-site.html", "ord_in_thread": 0, "title": "The Latest: Clinton, Trump won't visit Sept 11 attack site", "locations": [], "entities": {"persons": [{"name": "clinton", "sentiment": "negative"}, {"name": "trump", "sentiment": "negative"}, {"name": "enrique pena nieto", "sentiment": "none"}, {"name": "nick merrill", "sentiment": "none"}, {"name": "mike morell", "sentiment": "none"}, {"name": "tim kaine", "sentiment": "none"}, {"name": "barack obama", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "mike vickers", "sentiment": "none"}, {"name": "kaine", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "pena nieto", "sentiment": "none"}, {"name": "jennifer palmieri", "sentiment": "none"}, {"name": "paul ryan", "sentiment": "none"}, {"name": "pence", "sentiment": "none"}, {"name": "hicks", "sentiment": "none"}, {"name": "pam bondi", "sentiment": "none"}, {"name": "zack roday", "sentiment": "none"}, {"name": "r. smith", "sentiment": "none"}, {"name": "obama", "sentiment": "none"}, {"name": "michelle obama", "sentiment": "none"}, {"name": "john mccain", "sentiment": "none"}, {"name": "ryan", "sentiment": "none"}, {"name": "mike pence", "sentiment": "none"}, {"name": "john allen", "sentiment": "none"}, {"name": "linwood holton", "sentiment": "none"}, {"name": "harnik", "sentiment": "none"}], "locations": [{"name": "south pool", "sentiment": "none"}, {"name": "wilmington", "sentiment": "none"}, {"name": "tampa", "sentiment": "none"}, {"name": "syria", "sentiment": "none"}, {"name": "ground zero", "sentiment": "none"}, {"name": "camp lejeune", "sentiment": "none"}, {"name": "canfield", "sentiment": "none"}, {"name": "northern virginia", "sentiment": "none"}, {"name": "iowa", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}, {"name": "bondi", "sentiment": "none"}, {"name": "r-ind.", "sentiment": "none"}, {"name": "honduras", "sentiment": "none"}, {"name": "westchester", "sentiment": "none"}, {"name": "good morning america", "sentiment": "none"}, {"name": "indiana", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "wisconsin", "sentiment": "none"}, {"name": "nevada", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "ohio", "sentiment": "none"}, {"name": "virginia", "sentiment": "none"}, {"name": "n.y.", "sentiment": "none"}, {"name": "philadelphia", "sentiment": "none"}, {"name": "atlanta", "sentiment": "none"}, {"name": "new york city", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}, {"name": "world trade center", "sentiment": "none"}, {"name": "arizona", "sentiment": "none"}, {"name": "westchester county airport", "sentiment": "none"}, {"name": "north carolina", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "racine", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}, {"name": "georgia", "sentiment": "none"}, {"name": "virginia beach", "sentiment": "none"}, {"name": "pennsylvania", "sentiment": "none"}], "organizations": [{"name": "veterans administration", "sentiment": "none"}, {"name": "wsb-tv", "sentiment": "none"}, {"name": "islamic state", "sentiment": "none"}, {"name": "republican", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "congress", "sentiment": "none"}, {"name": "house of representatives", "sentiment": "none"}, {"name": "u.s. marine corps", "sentiment": "none"}, {"name": "trump university", "sentiment": "none"}, {"name": "abc", "sentiment": "none"}, {"name": "msnbc", "sentiment": "none"}, {"name": "senate", "sentiment": "none"}, {"name": "isis", "sentiment": "none"}, {"name": "associated press", "sentiment": "none"}, {"name": "gop", "sentiment": "none"}, {"name": "the associated press", "sentiment": "none"}, {"name": "world trade center", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "senate armed services and foreign relations committee", "sentiment": "none"}, {"name": "house", "sentiment": "none"}, {"name": "wrjn", "sentiment": "none"}, {"name": "memorial & museum", "sentiment": "none"}, {"name": "ap", "sentiment": "none"}, {"name": "trump foundation", "sentiment": "none"}, {"name": "democratic party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The Latest: Clinton, Trump won't visit Sept 11 attack site   FILE - In this Sept. 11, 2015 file photo, a flag is placed along the South Pool prior to a ceremony at the World Trade Center site in New York. Neither of the two New Yorkers vying for the White House is expected to commemorate the 15th anniversary of the Sept. 11th terror attacks with a visit to Ground Zero. Hillary Clinton and Donald Trump are not slated to attend the annual commemoration at the former World Trade Center site, a spokesman for the memorial told The Associated Press on Tuesday, Sept. 6, 2015. (AP Photo/Bryan R. Smith, File) (The Associated Press) Democratic presidential candidate Hillary Clinton, accompanied by traveling press secretary Nick Merrill, left, and director of communications Jennifer Palmieri, right, listens to a question from a member of the media as her campaign plane prepares to take off at Westchester County Airport in Westchester, N.Y., Tuesday, Sept. 6, 2016, to head to Tampa for a rally in Tampa. (AP Photo/Andrew Harnik) (The Associated Press) Republican presidential candidate Donald Trump, center left, waves as he walks with vice presidential candidate Gov. Mike Pence, R-Ind., center right, during a visit to the Canfield Fair, Monday, Sept. 5, 2016, in Canfield, Ohio. (AP Photo/Evan Vucci) (The Associated Press) \nWASHINGTON – The Latest on Campaign 2016 (all times Eastern): \n3:35 p.m. \nNeither New Yorker vying for the presidency is expected to commemorate the 15th anniversary of the September 11th attacks with a visit to the site where two hijacked airliners took down the World Trade Center towers and killed thousands of people. \nA spokesman for the National September 11 Memorial & Museum told The Associated Press on Tuesday that Hillary Clinton and Donald Trump are not slated to attend the annual commemoration at the former World Trade Center site on Sunday. \nThere is precedent for presidential candidates to visit the former Ground Zero on the anniversary of the terror attacks. In 2008, Barack Obama and John McCain made a joint appearance at the site in New York. \nNeither Clinton nor Trump has unveiled their schedules for Sunday. \nBut both have pledged to refrain from campaigning or advertising that day. \n___ \n3:25 p.m. \nHillary Clinton's presidential campaign is venturing onto Georgia airwaves, but if metro Atlanta residents blink they might miss it. \nAccording to a contract with WSB-TV, Clinton has purchased $5,000 for 30-second spots during four Wednesday time slots: the early morning local news, Good Morning America and the local news shows broadcast at 5 p.m. and 6 p.m. \nGeorgia is a GOP-leaning state but polls suggest Republican nominee Donald Trump's struggles among college-educated whites, particularly in the Atlanta suburbs, could make the state competitive for Clinton. \nStill, the small ad buy suggests Clinton, for now, is more interested in coaxing Trump or independent groups that back him into spending money in Georgia. \nSeparately, the Clinton campaign has confirmed it will invest money to pay for more field staff to work out of Democratic Party offices already open in Georgia. \n___ \n3:25 p.m. \nDemocratic vice presidential nominee Tim Kaine is talking up his own national security credentials as he begins a speech on the topic in Wilmington, North Carolina. \nKaine, a senator from Virginia and former governor, is a member of the Senate Armed Services and Foreign Relations Committee. And his son is a member of the U.S. Marine Corps based at Camp Lejeune. All of this, he says, makes national security issues real and personal to him. \nHe says Hillary Clinton, like any president, needs a \"solid partner\" in the White House. He's arguing that Clinton is a president who would have a \"steady demeanor, solid judgment and really thick skin.\" \n___ \n3:00 p.m. \nHillary Clinton says her Republican rival is insulting veterans with his campaign rhetoric. \nThe Democratic presidential nominee questioned Donald Trump's readiness and foreign policy expertise for the White House as she campaigned in Tampa, Florida, Tuesday. She said his presidential bid has been \"one long insult to all those who have worn the uniform.\" \nClinton said that \"a man who is so wrong about our veterans isn't right to serve as commander in chief.\" \nClinton attacked Trump for seemingly contradictory plans to combat ISIS, saying he's both promised to send American ground troops into Syria and let Syria become a free zone for the militants. \nBoth candidates will address national security issues at a forum in New York City scheduled for Wednesday night. \n___ \n2:30 p.m. \nDonald Trump says his Democratic opponent would treat immigrants in the country illegally better than veterans. \nThe Republican presidential nominee attacked Hillary Clinton as he courted veterans Tuesday in Virginia Beach, Virginia. He referenced Clinton and President Barack Obama's policies, saying, \"You have illegal immigrants that she wants and he wants treated better than veterans.\" \nTrump promised he would fix bureaucratic problems in the Veterans Administration. In the meantime, he said veterans waiting for care could go to private doctors or hospitals and the government would pick up the bill. \nTrump and Clinton are aggressively courting veterans this week ahead of a national security forum scheduled for Wednesday evening. \n___ \n1:57 p.m. \nHillary Clinton says that the military officials who have backed her candidacy for president believe she will \"protect our country and our troops.\" \nClinton was asked about a letter signed by 88 retired military officials in support of Donald Trump during a briefing with reporters on her campaign plane Tuesday. She responded, \"I think we're up to 89, but who's counting?\" \nSaid she was proud to have endorsements of military, intelligence and defense officials like retired Gen. John Allen, Mike Morell and Mike Vickers. \nShe said that they \"know they can count on me to be the kind of commander in chief who will protect our country and our troops.\" \nShe added that those same individuals view Trump as \"a danger and a risk.\" \n___ \n1:55 p.m. \nHillary Clinton is blasting Donald Trump for saying that he would have left a G-20 summit in China after a logistical flap over the staircase that President Barack Obama used to depart Air Force One. \nClinton told reporters aboard her campaign plane en route to Florida that Trump's views offer \"yet another strong piece of evidence as to why he should never be anywhere near the White House.\" \nClinton said sometimes these types of logistical dust-ups are \"annoying\" but they're not the reason a president attends these types of meetings. She said Obama made \"exactly the right decision to get off the plane and go to those meetings.\" \nObama got off his presidential plane from a secondary exit after arriving in China. It was viewed as a snub by Chinese officials. Trump said it was a sign of disrespect and he would have left immediately if he had been president. \n___ \n1:10 p.m. \nRepublican vice presidential candidate Mike Pence will return to his old stomping grounds and speak to House Republicans next week. \nPence represented Indiana in the House for 12 years. He left Congress in January 2013 before becoming governor. \nSpeaker Paul Ryan and other GOP leaders invited Pence to address Republican lawmakers. Ryan spokesman Zack Roday says Pence agreed to speak to them next Tuesday. \nPence will appear less than two months before Election Day. \nTwo months ago, Donald Trump, now the GOP presidential candidate, addressed House and Senate Republicans in separate closed-door meetings. Trump lambasted some GOP critics at those meetings. \nRyan has had a cool relationship with Trump. Ryan called Pence \"a great friend and a true conservative\" and said Pence has \"added tremendous value\" to Trump's campaign. \n___ \n12:45 p.m. \nDonald Trump's campaign spokeswoman says that he had spoken to Florida's attorney general in 2013, but the two never discussed Trump's beleaguered Trump University endeavor. \nHope Hicks made the clarification Tuesday, after Trump said a day earlier that he had never spoken to Pam Bondi about the issue, without providing specifics. \nTrump has distanced himself from an improper $25,000 donation from his personal foundation to a political group supporting Bondi's re-election campaign made as her office was deliberating whether to pursue fraud allegations involving Trump University. \nBondi's spokesman told The Associated Press in June that she personally solicited the 2013 donation from Trump by phone. The Trump Foundation check was received days after Bondi's office told a newspaper it was deliberating whether to join a multi-state lawsuit against Trump University. Charities are barred from supporting political activities. \n___ \n11:10 a.m. \nHouse Speaker Paul Ryan is discussing what would happen if the House of Representatives had to decide the presidential election. \nRyan was asked about the scenario in an interview Tuesday on WRJN in Racine, Wisconsin. If neither Hillary Clinton nor Donald Trump gets a majority of electoral college votes it would be up to the House to decide — something that hasn't happened since the 19th century. \nRyan responded that \"I haven't really looked too deep into this because I'm not planning having to do this.\" \nBut he made clear he was knowledgeable about the scenario, explaining that the House would have to pick from the candidates who've received electoral votes, with each state delegation casting one vote. \n___ \n9:45 a.m. \nDonald Trump's campaign has released an open letter from retired military leaders promoting his candidacy. \nThe letter, signed by 88 retired generals and admirals, cites an urgent need for a \"course correction\" in national security. \nThe military leaders write, \"We believe that such a change can only be made by someone who has not been deeply involved with, and substantially responsible for, the hollowing out of our military and the burgeoning threats facing our country around the world.\" \nIt continues: \"For this reason, we support Donald Trump's candidacy to be our next commander-in-chief.\" \nDemocrats have pounded Trump on national security and aggressively warned voters that he lacks the temperament to control the world's most powerful military. \nDozens of Republican national security leaders released a letter last month warning that Trump would risk the nation's \"national security and well-being.\" \n___ \n9:35 a.m. \nHillary Clinton is unveiling a new ad appealing to military veterans, aiming to undercut Donald Trump's message on defense. \nThe ad, called \"Sacrifice,\" shows military veterans watching clips of provocative statements by Trump, including his claim to know more about the Islamic State group than military generals and his criticism of Arizona Sen. John McCain, a former prisoner of war. \nIt also shows Trump saying he had sacrificed a lot in comparison to families who have lost loved ones in conflict. \nThe ad is airing on cable and in Ohio, Florida, Iowa, Nevada and Pennsylvania. \nIt comes as Trump and Clinton are set to appear in an MSNBC forum on Wednesday night on national security \n___ \n8:10 a.m. \nDemocratic running mates Hillary Clinton and Tim Kaine have released their campaign book, which is named after the campaign's slogan, \"Stronger Together.\" \nThe 256-page book, released Tuesday, details their policy proposals, including ideas for economic growth, uniting the American people, and foreign policy and policy. \nA statement from the campaign Tuesday said the introduction, entitled \"Love and Kindness — And Action\" details Clinton's upbringing and the things \"she learned from her mother's difficult childhood.\" Kaine's introduction, entitled \"Fighting for Right,\" describes his service in Honduras and the inspiration he drew from his father-in law, former Virginia Governor Linwood Holton. \n___ \n7:10 a.m. \nDonald Trump says the Mexican president violated some \"ground rules\" by admitting that the two did actually discuss payment of his proposed border wall between the two countries. \nBut the Republican presidential nominee adds: \"That's ok.\" \nTrump spoke in an interview aired Tuesday on ABC's \"Good Morning America.\" He says, \"it was discussed that it wouldn't be discussed, but they know my stance and I know their stance.\" \nTrump made a last minute trip to Mexico last week to meet with President Enrique Pena Nieto. At a joint press conference, Trump told reporters that payment of his proposed border wall was not discussed. \nPena Nieto later tweeted that it was discussed and he \"made it clear\" that Mexico would not pay. \nTrump said, \"See who wins in the end, who will win. A hundred percent, they will pay for the wall.\" \n___ \n7:05 a.m. \nMichelle Obama is preparing for her first campaign appearance for Democratic presidential candidate Hillary Clinton. \nClinton's campaign says the first lady will rally voters behind the former secretary of state during a Sept. 16 event in Northern Virginia. The location was not announced. \nMrs. Obama's task will be to urge all voters, but especially young people, in hotly contested Virginia to support Clinton and running mate Tim Kaine in the Nov. 8 election. \nShe'll also urge people not to miss the state's Oct. 17 deadline to register to vote. \nA few days before Mrs. Obama hits the trail, her husband, President Barack Obama, is scheduled to hold his first solo campaign event for Clinton on Sept. 13 in Philadelphia. \n___ \n3:05 a.m. \nDonald Trump and Hillary Clinton are pushing ahead in top presidential battlegrounds with Labor Day behind them. \nTrump, the Republican nominee, is set to campaign in Virginia and North Carolina on Tuesday, two critical states in his path to the presidency. \nClinton, the Democrat, is campaigning in Florida in search of an advantage in the nation's largest swing state. A Clinton victory in Florida would make it virtually impossible for Trump to overcome her advantage in the race for 270 electoral votes. \nThe day before in swing state Ohio, Trump softened his stance on immigration while Clinton blasted Russia for suspected tampering in the U.S. electoral process. Advertisement", "external_links": [], "published": "2016-09-07T03:43:00.000+03:00", "crawled": "2016-09-06T23:16:38.662+03:00", "highlightTitle": ""}