{"organizations": [], "uuid": "dba27c29518b1b49d679c996d9d21bf9265db48f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 3, "shares": 3, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.foxnews.com", "main_image": "http://www.foxnews.com/content/dam/fox-news/logo/og-fn-foxnews.jpg", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/us/2016/09/24/ap-norc-poll-most-in-us-frustrated-over-presidential-race.html", "country": "EU", "domain_rank": 185, "title": "AP-NORC Poll: Most in US frustrated over presidential race | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "AP-NORC Poll: Most in US frustrated over presidential race | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2016-09-24T17:34:00.000+03:00", "replies_count": 0, "uuid": "dba27c29518b1b49d679c996d9d21bf9265db48f"}, "author": "", "url": "http://www.foxnews.com/us/2016/09/24/ap-norc-poll-most-in-us-frustrated-over-presidential-race.html", "ord_in_thread": 0, "title": "AP-NORC Poll: Most in US frustrated over presidential race | Fox News", "locations": [], "entities": {"persons": [{"name": "clinton", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "bill", "sentiment": "none"}, {"name": "jones", "sentiment": "none"}, {"name": "swanson", "sentiment": "none"}, {"name": "barack obama", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "shirley", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "carol jones", "sentiment": "none"}], "locations": [{"name": "us", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "arkansas", "sentiment": "none"}], "organizations": [{"name": "facebook", "sentiment": "negative"}, {"name": "islamic state", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "associated press-norc center for public affairs research", "sentiment": "none"}, {"name": "norc", "sentiment": "none"}, {"name": "social security", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "AP-NORC Poll: Most in US frustrated over presidential race Published September 24, 2016 Facebook 0 Twitter 0 Email Print \nWASHINGTON – Carol Jones knows what she wants to hear Hillary Clinton and Donald Trump discuss during their first televised debate: education and jobs. She's far from sure which candidate will earn her vote on Election Day. \n\"All we see is the cat fighting,\" says the Shirley, Arkansas, retired substitute teacher. At Monday's debate, the 70-year-old says, \"they need to talk about their programs ... but I don't think they will.\" \nA majority of Americans, like Jones, say they're frustrated, angry — or both — with the 2016 presidential election, according to a new poll by the Associated Press-NORC Center for Public Affairs Research. Most Americans aren't feeling proud or hopeful about the race, and half feel helpless, the results find. Majorities of Americans want more focus on issues that are important to them, starting with health care, Social Security, education, terrorism and homeland security. \nApathy isn't the problem, the survey found. Eighty-six percent of Americans are paying at least some attention to the race. \nThe campaign is certainly hard to miss. Trump and Clinton are the two least popular presidential candidates in history, and their ferocious battle is smashing precedents and dominating public discourse. \nTrump has built his campaign in large part on attention-getting — and frequently untrue — accusations, such as that his opponent \"is the devil\" and President Barack Obama \"founded\" the Islamic State group. But he's found success linking the nation's immigration woes to its national security concerns, the latter of which is rated by Americans as among the top issues facing the country. \nClinton is a former senator and secretary of state who is an avowed foreign and domestic policy wonk. She has tried to make the election, in part, a referendum on Trump's fitness for office. Her recent stumble during an abrupt exit from this year's 9/11 memorial ceremony, captured on video, added to the reality-show quality of the election. Her campaign disclosed that she'd been diagnosed with pneumonia. \nClinton and Trump have clear political and stylistic objectives during their first debate Monday, the first of three such showdowns certain to influence the race in its final six weeks. For both, it's about rattling the other candidate — and not being baited into a less-than-presidential performance. Trump is looking to shore up his credibility with moderate white voters, particularly women, after more than a year of remarks that appeared intolerant or bigoted. Clinton is trying to appeal to young Americans, who are unenthusiastic about her candidacy. \nIssues? Jones suggests the candidates owe more on that front it to potential voters who don't have access to the internet or the time she has to hunt down their policy positions. \n\"I went looking on the internet for (Clinton's) position on free (college) education, and it was hard, but I finally found it,\" says the lifelong Democrat, who isn't sold on Clinton because she doesn't trust her, or husband Bill, the former president and governor of Jones' state. \"They need to talk about their programs on this, this and that.\" \nWhether the candidates ever get to informative discussions of their policy positions and their professional qualifications is unclear. But the demand is there. \nThe survey found that nearly two-thirds of Americans say the campaign focuses too little on the issues that matter to them personally. More than 6 in 10 Americans of both parties agree. A bit more than half say there's been too little focus on the candidates' qualifications, with Democrats being more likely than Republicans to feel that way, 61 percent to 45 percent. And more than half of Americans in the survey said the campaign is focused too much on the personal characteristics of the candidates, with Republicans and Democrats about equally likely to feel that way. \nThe issues Americans care most about? Health care comes in first, with 81 percent listing that as very or extremely important, while similarly high percentages said the same about Social Security, education, terrorism and homeland security. The next most-cited issues: crime and economic growth, which three-quarters of respondents listed as at least very important. Similar majorities cited poverty and taxes. Ranking lower, according to the findings: immigration, with just 61 percent listing the issue as very or extremely important to them. \nThere's bipartisan agreement on the importance of some issues. Nearly identical percentages of Democrats and Republicans call crime and unemployment top issues. At least three-quarters from both parties call Social Security very important. \nOn many other issues, their priorities diverge: Democrats are particularly likely to call health care and poverty top issues, while Republicans are particularly likely to rank terrorism, taxes, debt and foreign policy as very important. About 7 in 10 Democrats but less than half of Republicans named as top issues call gun control and income inequality. Three-quarters of Democrats, but only about a third of Republicans, say the same about racism, the environment and climate change. \nRepublicans are far more likely to name international trade agreements as a very or extremely important issue. And 7 in 10 Republicans, but only about half of Democrats, call immigration a top priority. Among Americans with a favorable opinion of Trump, nearly 8 in 10 say so. \n___ \nThe AP-NORC poll of 1,022 adults was conducted Sept. 15-18 using a sample drawn from NORC's probability-based AmeriSpeak panel, which is designed to be representative of the U.S. population. The margin of sampling error for all respondents is plus or minus 3.7 percentage points. \nRespondents were first selected randomly using address-based sampling methods, and later interviewed online or by phone. \n___ \nOn Twitter, follow at http://www.twitter.com/APLaurieKellman and Swanson at http://www.twitter.com/El_Swan \n___ ", "external_links": [], "published": "2016-09-24T17:34:00.000+03:00", "crawled": "2016-09-24T17:02:32.374+03:00", "highlightTitle": ""}