{"organizations": [], "uuid": "96310d0e753612fad9a75294b2066865d6d46570", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/images.foxnews.com/content/fox-news/us/2016/09/30/latest-some-violence-vandalism-in-police-protests/_jcr_content/par/featured-media/media-0.img.jpg/0/0/1475215456423.jpg?ve=1", "site_section": "http://feeds.foxnews.com/foxnews/national", "section_title": "FOX News", "url": "http://www.foxnews.com/us/2016/09/30/latest-some-violence-vandalism-in-police-protests.html", "country": "IT", "domain_rank": 185, "title": "The latest: Some violence, vandalism in police protests", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "The latest: Some violence, vandalism in police protests | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2016-09-30T03:00:00.000+03:00", "replies_count": 0, "uuid": "96310d0e753612fad9a75294b2066865d6d46570"}, "author": "Associated Press", "url": "http://www.foxnews.com/us/2016/09/30/latest-some-violence-vandalism-in-police-protests.html", "ord_in_thread": 0, "title": "The latest: Some violence, vandalism in police protests", "locations": [], "entities": {"persons": [{"name": "bill wells", "sentiment": "none"}, {"name": "alfred", "sentiment": "none"}, {"name": "shane harris", "sentiment": "none"}, {"name": "alfred olango", "sentiment": "none"}, {"name": "jeff davis", "sentiment": "none"}, {"name": "olango", "sentiment": "none"}, {"name": "dan gilleon", "sentiment": "none"}, {"name": "wells", "sentiment": "none"}, {"name": "dumanis", "sentiment": "none"}, {"name": "benge", "sentiment": "none"}, {"name": "virginia kice", "sentiment": "none"}, {"name": "bonnie dumanis", "sentiment": "none"}, {"name": "pamela benge", "sentiment": "none"}], "locations": [{"name": "california", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}, {"name": "san diego", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "san diego county", "sentiment": "none"}, {"name": "el cajon", "sentiment": "none"}, {"name": "olango", "sentiment": "none"}, {"name": "uganda", "sentiment": "none"}, {"name": "el cajon", "sentiment": "none"}, {"name": "calif", "sentiment": "none"}], "organizations": [{"name": "associated press", "sentiment": "negative"}, {"name": "knsd-tv", "sentiment": "none"}, {"name": "cajon police department", "sentiment": "none"}, {"name": "el cajon police department", "sentiment": "none"}, {"name": "customs enforcement", "sentiment": "none"}, {"name": "national action network", "sentiment": "none"}, {"name": "san diego union-tribune", "sentiment": "none"}, {"name": "u.s. supreme court", "sentiment": "none"}, {"name": "ap", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "  Associated Press   Email Print In this Tuesday, Sept. 27, 2016 frame from video provided by the El Cajon Police Department, a man, second from left, faces police officers in El Cajon, Calif. The man reportedly acting erratically at a strip mall in suburban San Diego was shot and killed by police after pulling an object from his pocket, pointing it at officers and assuming a \"shooting stance,\" authorities said. Some protesters claimed the man was shot with his hands raised, but police disputed that and produced the frame from cellphone video taken by a witness that appeared to show the man in the \"shooting stance\" as two officers approached with weapons drawn. (El Cajon Police Department via AP)  (The Associated Press) \nThis undated cellphone photo released by Dan Gilleon, the attorney for the family of Alfred Olango, shows Alfred Olango, the Ugandan refugee killed Tuesday, Sept. 27, 2016, in El Cajon, Calif. The fatal police shooting of Olango, who drew something from his pocket and extended his hands in a \"shooting stance\" happened about a minute after officers in a San Diego suburb arrived at the scene where a mentally unstable man was reportedly walking in traffic, a police spokesman said Wednesday. (Olango Family via AP)  (The Associated Press) \nPamela Benge, center, spoke of her son, Alfred Olango, at a press conference on Thursday Sept. 29, 2016, in San Diego, Calif., to address the killing of Olango, a Ugandan refugee shot by an El Cajon police officer on Tuesday. In an emotional appearance before reporters, Benge said her son Alfred was joyful and loving and was not mentally ill. (AP Photo/Don Boomer)  (The Associated Press) \nPrevious Next EL CAJON, Calif. –   The Latest on the fatal shooting of an unarmed black man in El Cajon, California (all times are local):\n11 p.m.\nPolice say two men were arrested as some of the people protesting the police shooting of an unarmed black man became destructive and violent.\nEl Cajon police say between 50 and 75 protesters were in the streets blocking traffic on Thursday night until they used pepper-spray balls to break up the crowd.\nSome protesters fought with drivers angry about the blocked road, breaking car windows and in once case knocking a man off his motorcycle.\nSome threw bottles at police in riot gear.\nPolice say a 19-year-old man and a 28-year-old man were arrested for taking part in an unlawful assembly. Their names were not released.\nIt was the third night of protests over the death of Alfred Olango, who was killed on Tuesday after pulling an object from his pocket and pointing it at police.\n___\n9:15 p.m.\nA few dozen people gathered for a third night of protests over the shooting of an unarmed black man in a San Diego suburb.\nKNSD-TV reports that some of the protesters got into arguments and shoving matches Thursday night with motorists angry about blocked intersections in El Cajon.\nThat brought police and sheriff's deputies in riot gear closer to the protesters, some of whom threw water bottles and beer cans at them.\nThe scene grew calm again soon after and there were no immediate reports of arrests or more serious violence.\nThe group was protesting Tuesday's shooting of Alfred Olango by El Cajon police.\nThe officers say he pulled a vape smoking device from his pocket and mistook it for a gun when he pointed it at them.\n___\n5:45 p.m.\nSan Diego County's district attorney says there's no timetable for when she will allow the release of video of an unarmed black man being shot by police.\nDistrict Attorney Bonnie Dumanis said Thursday her office is working quickly to take the steps necessary before releasing the video of El Cajon police shooting Alfred Olango.\nUnder a countywide agreement, the DA may release the video but must first finish an independent review of the incident and provide the findings to police. She won't release the video if an officer is being criminally charged.\nMayor Bill Wells said he met Thursday with black community leaders who told him releasing the video immediately could help prevent violence. He says he wants to meet with Dumanis to discuss how it can happen.\nDumanis approved the release of a single still from the video showing Olango pointing an object at an officer before he was shot.\n___\n4:35 p.m.\nThe mayor and police chief of El Cajon, California, are defending a decision to release just a single frame of cellphone video showing police shooting an unarmed black man.\nMayor Bill Wells told The San Diego Union-Tribune (http://bit.ly/2dImtAR ) on Thursday that he lobbied for the district attorney to release the frame showing Alfred Olango in what police call a \"shooting stance\" as he pointed an object at officers.\nPolice Chief Jeff Davis says he agreed with the move. Both said they wanted to dispute people's accounts to reporters that Olango's hands were up.\nWells says the video doesn't \"shed much more light on the incident.\"\nOlango's family is calling for release of the entire video. Their attorney said the single image was cherry-picked to fit the police narrative.\nThe district attorney controls the video's release.\n___\n2 p.m.\nThe mother of an unarmed black man who was fatally shot by police in El Cajon, California, has called for peaceful protests.\nIn an emotional appearance before reporters, Pamela Benge said Thursday her son Alfred Olango was joyful and loving and was not mentally ill.\nBenge told of how the family came from war-torn Uganda 25 years ago and just wanted to be safe.\nShe referred to other similar shootings of black men around the country and said she never imagined that the pain of losing a loved one would come to her.\nOlango was shot Tuesday in a suburban San Diego strip mall parking lot. Police say he pulled an object from his pants pocket and clasped it in both hands pointing at an officer in a \"shooting stance.\"\nOlango turned out to be holding an e-cigarette.\n___\n1:40 p.m.\nA family lawyer is demanding release of a video of the fatal shooting of an unarmed black man by police in the San Diego suburb of El Cajon.\nAttorney Dan Gilleon told a news conference Thursday that the release of a single still photo from the video cherry-picked an image that serves the El Cajon Police Department's narrative of the shooting of Alfred Olango.\nThe image shows Olango with his hands clasped together and pointed to one of two officers in what police have described as a \"shooting stance.\" Olango turned out to be holding an e-cigarette.\nThe Rev. Shane Harris of the civil rights group National Action Network says Olango's family is calling for peaceful, non-violent protest.\n___\n8 a.m.\nU.S. authorities tried twice to deport the unarmed black man fatally shot by police in El Cajon, California, but his native Uganda refused to take him.\nThe U.S. Immigration and Customs Enforcement said Thursday in a statement to The Associated Press that Alfred Olango stopped reporting to officers in February 2015. Spokeswoman Virginia Kice didn't know if officers tried to find him after that.\nOlango arrived as a refugee in 1991 and was ordered deported in 2002 after being convicted on drug charges. He was released under a U.S. Supreme Court ruling barring detention of foreign nationals if deportation is unlikely.\nImmigration authorities took Olango into custody in 2009 after a firearms conviction but were again unable to obtain travel documents.\n___\n1:30 a.m.\nIt took more than an hour for police to arrive at the shopping center in a San Diego suburb where a distressed black man had been wandering into traffic. It took about a minute for him to be shot and killed.\nAlfred Olango pulled a large electronic cigarette, known as a vape pen, from his pocket and pointed at the police officer who fired, while a second officer stood nearby trying to subdue him with a stun gun, El Cajon police said.\nThe details emerged Wednesday in the shooting of Olango, who was having an emotional breakdown over the recent death of his best friend, an attorney said.", "external_links": [], "published": "2016-09-30T03:00:00.000+03:00", "crawled": "2016-09-30T09:23:51.660+03:00", "highlightTitle": ""}