{"organizations": [], "uuid": "2428462f43d1f56c2e8054d45e7ee05798e1292a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 105}, "facebook": {"likes": 770, "shares": 770, "comments": 1}, "stumbledupon": {"shares": 0}}, "site_full": "www.buzzfeed.com", "main_image": "https://img.buzzfeed.com/buzzfeed-static/static/2016-09/19/22/campaign_images/buzzfeed-prod-web02/new-initiative-looks-to-fuel-next-administrations-2-25717-1474338050-12_dblbig.jpg", "site_section": "http://www.buzzfeed.com/politics.xml", "section_title": "BuzzFeed - Politics", "url": "https://www.buzzfeed.com/adriancarrasquillo/new-initiative-looks-to-fuel-next-administrations-latino-pol", "country": "US", "domain_rank": 137, "title": "New Initiative Looks To Fuel Next Administration's Latino Political Appointments", "performance_score": 7, "site": "buzzfeed.com", "participants_count": 1, "title_full": "New Initiative Looks To Fuel Next Administration's Latino Political Appointments", "spam_score": 0.0, "site_type": "news", "published": "2016-09-20T21:01:00.000+03:00", "replies_count": 0, "uuid": "2428462f43d1f56c2e8054d45e7ee05798e1292a"}, "author": "Adrian Carrasquillo", "url": "https://www.buzzfeed.com/adriancarrasquillo/new-initiative-looks-to-fuel-next-administrations-latino-pol", "ord_in_thread": 0, "title": "New Initiative Looks To Fuel Next Administration's Latino Political Appointments", "locations": [], "entities": {"persons": [{"name": "alex padilla", "sentiment": "none"}, {"name": "xavier becerra", "sentiment": "none"}, {"name": "hector sanchez", "sentiment": "none"}, {"name": "cristobal alex", "sentiment": "none"}, {"name": "blanco", "sentiment": "none"}, {"name": "oscar ramirez", "sentiment": "none"}, {"name": "cesar blanco", "sentiment": "none"}, {"name": "obama", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "clinton", "sentiment": "none"}, {"name": "ken salazar", "sentiment": "none"}, {"name": "ramirez", "sentiment": "none"}, {"name": "sanchez", "sentiment": "none"}, {"name": "adrian carrasquillo", "sentiment": "none"}], "locations": [{"name": "california", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "colorado", "sentiment": "none"}], "organizations": [{"name": "lgbtq", "sentiment": "none"}, {"name": "latino victory foundation", "sentiment": "none"}, {"name": "podesta group", "sentiment": "none"}, {"name": "labor council for latin american advancement", "sentiment": "none"}, {"name": "state", "sentiment": "none"}, {"name": "nhla", "sentiment": "none"}, {"name": "buzzfeed news", "sentiment": "none"}, {"name": "ford foundation", "sentiment": "none"}, {"name": "lvf", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "AP images ID: 9645495 \nA Hispanic group that has helped Latino Democrats get elected and a coalition of 40 national Latino organizations are joining forces to identify, elevate and nominate Hispanics to join the next administration. \nThe Latino Victory Foundation (LVF) and the National Hispanic Leadership Agenda (NHLA) will announce Tuesday the Latino Talent Initiative, with a goal of creating a pipeline and increasing the pool of Hispanic candidates considered for the roughly 6000 political roles, about half of which are full-time positions. \nNHLA said that Latinos make up only 8% of political appointments at all levels and wants to see representation on the same level as Hispanics in the U.S. population — about 17% to 18%, and the partnership is calling for four Latinos in next cabinet, the same number at the moment in the Obama administration. \n“The fact that we are the most underrepresented group in the most important spaces of power in our nation correlates with the challenges facing our community and the way our families are doing,” said Hector Sanchez, NHLA chair and executive director of the Labor Council For Latin American Advancement. \nThe goal is to create a sophisticated resume bank, said LVF interim director Cesar Blanco, and serve as a resource for the White House in the way other communities have done a better job of to gain political appointees. The searchable database will include 40 questions to detail previous employment, skill sets and strengths. \n“We’re focusing from entry level to cabinet secretaries to ambassadors,” Blanco said. \nSanchez said a chronic problem in politics is people saying that they can’t find qualified Latinos to fill positions, one he argues is because they aren’t looking. \nHe told the story of meeting with a secretary in the administration who said they didn’t have quotas and only hire the best and the brightest, but understood they had a serious problem of underrepresentation of Latinos. \n“There’s a serious problem of nepotism,” Sanchez said. “We want a system that is fair. Structurally in the nation there are high levels of favoritism, of friends hiring friends, and friends hiring family members. \nThe new effort follows in the footsteps of NHLA’s Latino Appointments Program, created after a $250,000 Ford Foundation grant secured by Cristobal Alex, who went on to head Latino Victory before taking a leave to join Hillary Clinton’s campaign. \nSanchez points to the fact that there were no Latino cabinet officials at the campaign’s outset and there are now four as evidence that the efforts are paying off. \nLatino operatives believe former Colorado Sen. Ken Salazar’s role leading the transition will help Hispanics gain attention in hopes of joining the administration, should Clinton win. \nOscar Ramirez, a Democratic strategist at the Podesta Group, said public narratives of who is up for administration roles after the election often exclude qualified Latinos, women and minorities who are being considered. He pointed to California Secretary of State Alex Padilla and Rep. Xavier Becerra as two who will be considered for cabinet positions. \nA key to the Latino appointment effort is to create a pipeline of officials to step in when positions open up in a couple years, Ramirez said, echoing Blanco’s argument that it is important Hispanics not to be limited to positions involving immigration, housing or labor. \nThe campaign’s stated goal is to build on the NHLA initiative modeled after other programs like the Gay and Lesbian Victory Fund, which has found success in increasing the number of LGBTQ appointees. \n“Enough is enough,” Sanchez said. “As Latinos we have been structurally excluded from a lot of these spaces of power and there will be no more excuses to say there aren’t qualified Latinos for those spots.” Adrian Carrasquillo is a political reporter for BuzzFeed News and is based in New York. Contact Adrian Carrasquillo at .", "external_links": [], "published": "2016-09-20T21:01:00.000+03:00", "crawled": "2016-09-20T17:38:53.921+03:00", "highlightTitle": ""}