{"organizations": [], "uuid": "7dbbc5a195f53c7a02b63f9ea7c1d993e6815d71", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/media2.foxnews.com/BrightCove/694940094001/2016/08/31/0/0/694940094001_5106884367001_2553565088001-vs.jpg?ve=1", "site_section": "http://feeds.foxnews.com/foxnews/latest", "section_title": "FOXNews.com", "url": "http://www.foxnews.com/politics/2016/10/01/trump-us-has-right-to-choose-immigrants-most-likely-to-flourish.html", "country": "CH", "domain_rank": 185, "title": "LAYING OUT HIS PLAN: Trump says US has right to choose immigrants 'likeliest to thrive and flourish'", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "LAYING OUT HIS PLAN: Trump says US has right to choose immigrants 'likeliest to thrive and flourish'", "spam_score": 0.0, "site_type": "news", "published": "2016-09-01T10:00:00.000+03:00", "replies_count": 0, "uuid": "7dbbc5a195f53c7a02b63f9ea7c1d993e6815d71"}, "author": "foxnewsonline@foxnews.com (Fox News Online)", "url": "http://www.foxnews.com/politics/2016/10/01/trump-us-has-right-to-choose-immigrants-most-likely-to-flourish.html", "ord_in_thread": 0, "title": "LAYING OUT HIS PLAN: Trump says US has right to choose immigrants 'likeliest to thrive and flourish'", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "negative"}, {"name": "trump", "sentiment": "negative"}, {"name": "john podesta", "sentiment": "none"}, {"name": "clinton", "sentiment": "none"}, {"name": "enrique pena nieto", "sentiment": "none"}, {"name": "pena nieto", "sentiment": "none"}], "locations": [{"name": "us", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}, {"name": "mexico city", "sentiment": "none"}, {"name": "arizona", "sentiment": "none"}, {"name": "phoenix", "sentiment": "none"}], "organizations": [{"name": "associated press", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DEVELOPING \nDonald Trump, in a speech on immigration Wednesday, said U.S. policies must serve the American people and the government should choose immigrants “we think are the likeliest to thrive and flourish and love us.” \nIn the long-awaited speech in Phoenix, Arizona, amid accusations he was softening his hardline stance on the subject, Trump said that America’s current immigration system “serves the needs of wealthy donors, political activists and powerful politicians.” \n“Let me tell you who it does not serve, it does not serve you the American people. It doesn’t serve you,” he said. \nHe also called for politicians to talk about the subject, saying that for too long the legitimate fears of the American people have been ignored by politicians and the media. \n“If we’re going to make our immigration system work, then we have to be prepared to talk honestly and without fear about these important and very sensitive issues,” he said. 2016 Election Headquarters \nThe latest headlines on the 2016 elections from the biggest name in politics. See Latest Coverage → \nHe told the vibrant crowd that there are some immigrants who will be unable to assimilate into American society. \n“It’s our right as a sovereign nation to choose immigrants we think are the likeliest to thrive and flourish and love us,” he said. \nTrump’s speech comes after he met with Mexican President Enrique Pena Nieto earlier in the day and asserted America’s “right” to build a border wall during a surprise visit to Mexico City. \nBoth leaders adopted a measured and respected tone at the press conference, with Pena Nieto saying through a translator that their countries will face “common challenges” and urged a relationship based on “mutual respect.” \n“We had a very substantive, direct and constructive exchange of ideas,” Trump said. \nTrump, who has made illegal immigration the foremost issue of his campaign – including his promise to build a wall across the southern border and make Mexico pay for it – said the pair touched on the issue during their meeting. \nOn this there was disagreement. While Trump told reporters “we didn’t discuss payment of the wall,” Pena Nieto later contradicted Trump and said the subject was among those discussed. He also tweeted that he made it clear \"that Mexico will not pay for the wall.\" \nThe Clinton campaign ridiculed Trump’s meeting, and the ensuing controversy, with Clinton campaign chairman John Podesta accusing Trump of having “got beat in the room and [then] lied about it.” \nTrump has been accused of stoking tensions on the subject ever since he announced his campaign in June of last year in which he accused Mexico of not sending their best people across the border. \n“When Mexico sends its people, they’re not sending their best. They’re not sending you. They’re not sending you. They’re sending people that have lots of problems, and they’re bringing those problems with us. They’re bringing drugs. They’re bringing crime. They’re rapists. And some, I assume, are good people,” he said. \nIn recent weeks, Trump has been accused of softening his tone on the subject, and had been forced to clarify whether he favored a path to citizenship for those here legally, and whether he still planned to build a wall. \nThe Associated Press contributed to this report. Advertisement", "external_links": [], "published": "2016-09-01T10:00:00.000+03:00", "crawled": "2016-09-01T05:16:39.427+03:00", "highlightTitle": ""}