{"organizations": [], "uuid": "4a48fc70ccc3b6e8081b9504e25bc01534d4b6b7", "thread": {"social": {"gplus": {"shares": 2}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 72}, "facebook": {"likes": 793, "shares": 793, "comments": 2}, "stumbledupon": {"shares": 0}}, "site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/media2.foxnews.com/BrightCove/694940094001/2016/08/31/0/0/694940094001_5107427476001_056655ad-8e6c-43af-b7bb-8c49b5868987.jpg?ve=1", "site_section": "http://feeds.feedburner.com/foxnews/affiliates/kpth?format=xml", "section_title": "FOX News", "url": "http://www.foxnews.com/opinion/2016/09/01/american-immigration-lawyers-assoc-president-trump-speech-was-fantasy-not-policy.html", "country": "US", "domain_rank": 185, "title": "American Immigration Lawyers Assoc. President: Trump speech was fantasy, not policy", "performance_score": 7, "site": "foxnews.com", "participants_count": 1, "title_full": "American Immigration Lawyers Assoc. President: Trump speech was fantasy, not policy | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2016-09-01T03:00:00.000+03:00", "replies_count": 0, "uuid": "4a48fc70ccc3b6e8081b9504e25bc01534d4b6b7"}, "author": "FoxNews.com", "url": "http://www.foxnews.com/opinion/2016/09/01/american-immigration-lawyers-assoc-president-trump-speech-was-fantasy-not-policy.html", "ord_in_thread": 0, "title": "American Immigration Lawyers Assoc. President: Trump speech was fantasy, not policy", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "neutral"}, {"name": "william a. stock", "sentiment": "neutral"}, {"name": "trump", "sentiment": "neutral"}, {"name": "joe arpaio", "sentiment": "none"}, {"name": "bill clinton", "sentiment": "none"}, {"name": "pete wilson", "sentiment": "none"}], "locations": [{"name": "california", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "maricopa county sherriff", "sentiment": "none"}, {"name": "arizona", "sentiment": "none"}], "organizations": [{"name": "american immigration lawyers assoc.", "sentiment": "neutral"}, {"name": "national review", "sentiment": "none"}, {"name": "congress", "sentiment": "none"}, {"name": "american immigration lawyers association", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By William A. Stock \nPublished September 01, 2016 FoxNews.com   livefyre Email Print   \nDonald Trump began his immigration speech Wednesday by promising a “detailed policy address” rather than a rally speech.  It is true that he provided a bit more detail in the ten points he recited before a git crowd in Arizona than he has listed on his website since last fall but most of the additional detail came in the form of a chorus of talking points from anti-immigration hardline groups.\nHis policy proposals were a wish-list of the “enforcement only” approach that has been tried, and failed, for the past twenty years.  In fact, the entire speech was a full-throated endorsement of the immigration restrictionists’ approach to the immigration debate.  Trump’s vision of America is not a shining city on a hill, but a city under siege from dark forces.\nTrump’s speech provided no “pivot” to a more reasonable immigration policy, and explicitly shut down the possibility of a path to legal status for any immigrant who has overstayed a visa or has entered without authorization.  It is here that the contradiction at the heart of the “enforcement only” immigration policy lies.  What Mr. Trump failed to mention is that we have 11 million people living without legal status in the United States precisely because there are vanishingly few routes through which they can obtain legal status under current law, but there is significant demand from American employers for their work, and from American communities for their contributions.\nIf we are going to “enforce all of our immigration laws,” which provide no path back to legal status regardless of how good a person is or how long they have lived in the United States, then it does not matter how “fair, just and compassionate” the deportation process is.  At the end of that process, with no path to legal status, families will be torn apart and American communities will be devastated.\nFew people discussing the immigration issue today highlight the law at the root of this current immigration dilemma.  In 1996, shortly after Pete Wilson won reelection as governor of California on a strongly anti-immigration platform, the Republican-controlled Congress passed, and Democratic President Bill Clinton signed, a bill called the Illegal Immigration Reform and Immigrant Responsibility Act, or IIRIRA.  It is that bill which closed of many of the paths people had been able to use to “get legal” if they had fallen out of status.  It created a “one strike and you are out” rule of deportation for a broad range of nonviolent crimes, and it gave sweeping powers to the immigration agencies to deport and remove suspected undocumented immigrants with only limited legal process.\nFrom 2002 to 2006, a “no tolerance” immigration policy was imposed within the immigration agencies, and local police departments were given the unfunded mandate of enforcing immigration law through 287(g) agreements.  Mr. Trump promises to return to these policies with a vengeance, forgetting that they were ended because police departments wanted them to end due to the damage they did to police-community relations. \n2016 Election Headquarters The latest headlines on the 2016 elections from the biggest name in politics. See Latest Coverage → \nIt is no surprise that one of the speakers introducing Mr. Trump was the Maricopa County Sherriff, Joe Arpaio, who was recently referred for criminal prosecution for his disregard of a federal judge’s order to cease the unconstitutional profiling of U.S. citizens and legal residents who are Latino.\nMr. Trump’s speech peddled the fantasy that doubling down on these failed policies will miraculously end crime and unemployment mere months after his election.  Twenty years after IIRIRA was passed, these enforcement-only approaches to immigration control have resulted in more than twice as many people without status (5 million in 1996, 11 million today), and a California completely controlled by the Democratic party.  The National Review recently suggested rebranding this approach as “enforcement first,” doubling down on the enforcement-only approach with the goal of having as many people as possible self-deport before discussing any path to legal status for those who remain.\nThe enforcement-only or enforcement-first approach ignores two fundamental realities:\n1. A majority of Americans support a path to legal status for many of the people presently without one.\n2. Unless immigration law provides both workable paths for legal immigration and credible enforcement against those who do not follow those paths, it will not be sustainable.  At present, our immigration laws fail to provide such workable paths.\nAfter the election, Republicans will have to decide on a path forward with regard to immigration.  \nIf Mr. Trump wins the election, they will be asked to go along with his plans for building a wall across the U.S.-Mexico border, to grant significant additional funding to immigration enforcement agencies, and to federalize local police to assist with enforcement of immigration laws in their communities.\nIf he does not win, there will be an opportunity for us to define a different path forward, one which recognizes that those immigrants Mr. Trump referred to just last week as “good people” need a path under our laws to legal status and full integration in our communities. We should seize that opportunity to enact laws that resolve the contradiction at the heart of “enforcement only” policies, provide such a path for the “good people,” and continue the American tradition of welcoming and assimilating immigrants from around the world.\n\nWilliam A. Stock is an attorney and president of the American Immigration Lawyers Association.", "external_links": [], "published": "2016-09-01T03:00:00.000+03:00", "crawled": "2016-09-01T07:01:45.938+03:00", "highlightTitle": ""}