{"organizations": [], "uuid": "6386db9f55cb802189ceaa0a4ce97eedf4dbdd8a", "thread": {"social": {"gplus": {"shares": 2}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 4}, "facebook": {"likes": 404, "shares": 404, "comments": 144}, "stumbledupon": {"shares": 0}}, "site_full": "www.freep.com", "main_image": "http://www.gannett-cdn.com/-mm-/419df1258358286dca38b10542338b4da245f27b/c=0-24-766-457&amp;r=x633&amp;c=1200x630/local/-/media/2016/09/23/DetroitFreePress/DetroitFreePress/636102421153258031-IMG-trumphill.jpg-1-1-GBFNS.JPG", "site_section": "http://rssfeeds.freep.com/freep/business", "section_title": "Detroit Free Press - Business", "url": "http://www.freep.com/story/news/politics/2016/09/24/donald-trump-hillary-clinton-presidential-debate/90830158/", "country": "US", "domain_rank": 2980, "title": "Your fact-checking guide to Monday's presidential debate", "performance_score": 4, "site": "freep.com", "participants_count": 0, "title_full": "Your fact-checking guide to Monday's presidential debate", "spam_score": 0.0, "site_type": "news", "published": "2016-09-25T11:14:00.000+03:00", "replies_count": 0, "uuid": "6386db9f55cb802189ceaa0a4ce97eedf4dbdd8a"}, "author": "", "url": "http://www.freep.com/story/news/politics/2016/09/24/donald-trump-hillary-clinton-presidential-debate/90830158/", "ord_in_thread": 0, "title": "Your fact-checking guide to Monday's presidential debate", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "negative"}, {"name": "todd spangler", "sentiment": "none"}, {"name": "ryan garza", "sentiment": "none"}, {"name": "assad", "sentiment": "none"}, {"name": "j. christopher stevens", "sentiment": "none"}, {"name": "barack obama", "sentiment": "none"}, {"name": "kasim reed", "sentiment": "none"}, {"name": "bill clinton", "sentiment": "none"}, {"name": "george bush", "sentiment": "none"}, {"name": "george w. bush", "sentiment": "none"}, {"name": "hank paulson", "sentiment": "none"}, {"name": "dennis williams", "sentiment": "none"}, {"name": "clinton foundation", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "evan vucci/associated press)  trump", "sentiment": "none"}, {"name": "greg gardner", "sentiment": "none"}, {"name": "brent snavely", "sentiment": "none"}, {"name": "saul loeb", "sentiment": "none"}, {"name": "donald trump jr.", "sentiment": "none"}, {"name": "amir hekmati", "sentiment": "none"}, {"name": "evan vucci", "sentiment": "none"}, {"name": "tom lynn", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "mitt romney", "sentiment": "none"}, {"name": "pam bondi", "sentiment": "none"}, {"name": "comey", "sentiment": "none"}, {"name": "michael bloomberg", "sentiment": "none"}, {"name": "al seib", "sentiment": "none"}, {"name": "matt lauer", "sentiment": "none"}, {"name": "mark twain", "sentiment": "none"}, {"name": "obama", "sentiment": "none"}, {"name": "john kasich", "sentiment": "none"}, {"name": "clinton", "sentiment": "none"}, {"name": "tannen", "sentiment": "none"}, {"name": "winston churchill", "sentiment": "none"}, {"name": "james comey", "sentiment": "none"}, {"name": "sean smith", "sentiment": "none"}, {"name": "lester holt", "sentiment": "none"}, {"name": "saul loeb", "sentiment": "none"}], "locations": [{"name": "iran", "sentiment": "none"}, {"name": "montmorency county", "sentiment": "none"}, {"name": "indonesia", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}, {"name": "iraq", "sentiment": "none"}, {"name": "d.c.", "sentiment": "none"}, {"name": "new hampshire", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "bondi", "sentiment": "none"}, {"name": "jordan", "sentiment": "none"}, {"name": "middle east", "sentiment": "none"}, {"name": "ohio", "sentiment": "none"}, {"name": "pacific rim", "sentiment": "none"}, {"name": "virginia", "sentiment": "none"}, {"name": "atlanta", "sentiment": "none"}, {"name": "libya", "sentiment": "none"}, {"name": "new york city", "sentiment": "none"}, {"name": "benghazi", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "wayne county", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "michigan", "sentiment": "none"}, {"name": "colorado", "sentiment": "none"}, {"name": "pennsylvania", "sentiment": "none"}, {"name": "mackinac county", "sentiment": "none"}, {"name": "flint", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "washtenaw county", "sentiment": "none"}, {"name": "syria", "sentiment": "none"}, {"name": "wayne", "sentiment": "none"}, {"name": "cleveland", "sentiment": "none"}, {"name": "ford michigan assembly plant", "sentiment": "none"}, {"name": "toledo", "sentiment": "none"}, {"name": "upper peninsula", "sentiment": "none"}, {"name": "lower peninsula", "sentiment": "none"}, {"name": "iowa", "sentiment": "none"}, {"name": "detroit", "sentiment": "none"}, {"name": "manbij", "sentiment": "none"}, {"name": "wisconsin", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "nevada", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "new york state", "sentiment": "none"}, {"name": "mexico city", "sentiment": "none"}, {"name": "roku", "sentiment": "none"}, {"name": "hawaii", "sentiment": "none"}, {"name": "bishop international airport", "sentiment": "none"}, {"name": "oval", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "north carolina", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "volkswagen", "sentiment": "none"}, {"name": "schoolcraft county", "sentiment": "none"}, {"name": "fiat chrysler", "sentiment": "none"}, {"name": "quicken loans arena", "sentiment": "none"}, {"name": "cnn", "sentiment": "none"}, {"name": "trump university", "sentiment": "none"}, {"name": "clinton foundation", "sentiment": "none"}, {"name": "nbc", "sentiment": "none"}, {"name": "amazon fire", "sentiment": "none"}, {"name": "house", "sentiment": "none"}, {"name": "united nations", "sentiment": "none"}, {"name": "u.s. senate", "sentiment": "none"}, {"name": "islamic state", "sentiment": "none"}, {"name": "uaw", "sentiment": "none"}, {"name": "irs", "sentiment": "none"}, {"name": "getty images)  trump", "sentiment": "none"}, {"name": "hawaii department of health", "sentiment": "none"}, {"name": "apple", "sentiment": "none"}, {"name": "detroit free press", "sentiment": "none"}, {"name": "facebook your", "sentiment": "none"}, {"name": "united and concerned citizens of hamtramck", "sentiment": "none"}, {"name": "washington post", "sentiment": "none"}, {"name": "treasury", "sentiment": "none"}, {"name": "general motors", "sentiment": "none"}, {"name": "nbc/wall street journal", "sentiment": "none"}, {"name": "center on budget and policy priorities", "sentiment": "none"}, {"name": "internal revenue service", "sentiment": "none"}, {"name": "shah of iran", "sentiment": "none"}, {"name": "hyundai", "sentiment": "none"}, {"name": "mazda", "sentiment": "none"}, {"name": "tax foundation", "sentiment": "none"}, {"name": "post", "sentiment": "none"}, {"name": "department of treasury", "sentiment": "none"}, {"name": "toyota", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "census bureau", "sentiment": "none"}, {"name": "congress", "sentiment": "none"}, {"name": "factcheck.org", "sentiment": "none"}, {"name": "ford", "sentiment": "none"}, {"name": "nissan", "sentiment": "none"}, {"name": "nbc news", "sentiment": "none"}, {"name": "fbi", "sentiment": "none"}, {"name": "isis", "sentiment": "none"}, {"name": "state", "sentiment": "none"}, {"name": "associated press", "sentiment": "none"}, {"name": "ford focus", "sentiment": "none"}, {"name": "national security council", "sentiment": "none"}, {"name": "nafta", "sentiment": "none"}, {"name": "honda", "sentiment": "none"}, {"name": "state department", "sentiment": "none"}, {"name": "trump foundation", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "  Your fact-checking guide to Monday's presidential debate Is Donald Trump engaging in hate speech? Is Hillary Clinton corrupt? Post to Facebook Your fact-checking guide to Monday's presidential debate Is Donald Trump engaging in hate speech? Is Hillary Clinton corrupt?  //on.freep.com/2dsOU5P   Your fact-checking guide to Monday's presidential debate Todd Spangler, Greg Gardner, Brent Snavely, Detroit Free Press 11:14   Presidential candidates Hillary Clinton and Donald Trump. (Photo: Associated Press) \nThere's an old saying: \"A lie gets halfway around the world before the truth has a chance to get its pants on.\" Fittingly, it's been attributed to both Winston Churchill and Mark Twain. \nOn Monday, both the candidates — and the truth — will be tested as Democrat Hillary Clinton and Republican Donald Trump face off in the first presidential debates. \nIt will be a moment of firsts. It's the first time a woman takes the stage in a one-on-one debate for America's top job. And, for Trump, it will be first two-person debate of his political career. The stakes are huge for both candidates as Americans get an up-close look at their choices. \nHowever, it's unlikely this debate will be much different than the campaign, where falsehoods have been commonplace. Expect Monday's debate to be business-as-usual with the truth taking a backseat to spurious accusations. The Detroit Free Press is hosting a Clinton-Trump debate-watching party Monday night. Click here for details. \nThe political truth-squadding site Factcheck.org has called Trump the \"King of Whoppers\" for his numerous and frequent inaccuracies, but Clinton has stumbled as well with cagey answers and meandering campaign positions. \nThe debate, which lasts 90 minutes without commercial interruption, will focus on “America's direction,” “achieving prosperity,” and “securing America.” Moderator Lester Holt will pose a question. Each candidate will have two minutes for an initial response and then will be allowed to respond to each other. \nBut more than ever, fact-checking may be a frustrating task. To prepare you for the debate, the Free Press put together some preemptive fact-checking on topics expected to come up. This briefing should catch you up on the issues and give you key facts to compare with candidates' actual answers on Monday night. \nThis first debate airs on NBC Monday, September 26 at 9 p.m. It will be broadcast live on each of the major networks and leading cable news sites. It will also be streamed live at NBCNews.com and MSNBC.com and on the NBC News apps on Roku, Apple TV and Amazon Fire. Just how bad - or good - is the jobs news? \nRepublican presidential candidate Donald Trump speaks during a campaign rally on Wednesday in Toledo. (Photo: Evan Vucci/Associated Press) \nTrump's position: Trump claims the economy is severely crippled, and the job market is bad. \nClinton's position: The economic situation is a lot better than when President Barack Obama took office in 2009 but could be doing better. \nWhy you should care: However you cut it, the recovery since the recession of 2008-09 has been a slow one, with complaints that more could be done to spur economic growth — though there's much debate on whether that means more government investment or lower taxes and reduced regulations. \nWhat you should know: Despite an official unemployment rate of 4.9% in August and the creation of an average of 200,000 jobs per month since early 2010, according to the Center on Budget and Policy Priorities, Trump has repeatedly asserted that the \"real\" unemployment rate is \"anywhere between 18% and 49%.\" Some claim that the budget center has Democratic ties and is \"left-leaning,\" though it is officially nonpartisan. \nThat 4.9% rate doesn't factor in people who have stopped looking for work or who have retired voluntarily, so it doesn't catch everyone. It also doesn't include people who are working part-time but are still seeking full-time work. \nBut even if you want to look at the total unemployed, included those working part-time or those not looking but would want to work, the rate goes up to 9.7% of the labor market — not 18% or anywhere near 49%. \nThe job totals don't account for stagnant wages over the past 20 years. But Census Bureau data released earlier this month showed median household income grew 5.2%, or $2,800, between 2014 and 2015. Median income fell in six out of the previous seven years. \nMichigan's August jobless rate was 4.5% — well below its record highs of a few years back — but that varies widely by geography. Within metro Detroit, unemployment ranged from 4.1% in Washtenaw County to 7.4% in Wayne County. In the Upper Peninsula, Mackinac County had the lowest rate at 3.6% while Schoolcraft County had a 8.2% rate, second highest after Montmorency County in the northern Lower Peninsula at 8.9%. Who has the better tax plan? \nMatt Lauer looks on as democratic presidential nominee former Secretary of State Hillary Clinton speaks during the NBC News Commander-in-Chief Forum on Wednesday in New York City. (Photo: Getty Images) \nTrump's position: He has proposed tax cuts to income brackets, investment and business income and would cut the corporate tax rate from the current statutory 35% to 15%. He has also suggested allowing for a greater deduction of child care expenses from personal income taxes. \nClinton's position: She has proposed a 4% surcharge for those with more than $5 million in taxable income, and a 24% top tax rate for dividend income and long-term capital gains. She also would implement the “Buffett Rule,” which would establish a 30% minimum tax on those with adjusted gross income of more than $1 million. The minimum tax would phase-in between $1 million and $2 million. \nWhy you should care: This affects your take-home pay and year-end bottom line and whether the government has enough money to pay its bills. \nWhat you should know: Trump says Clinton's plan will cost jobs and that his will bring business income back into the U.S. from overseas, encouraging growth. Clinton says Trump's plan — including his child care proposal — is more geared to helping wealthy Americans than lower-income ones. \nBoth have some solid points. Trump's plan could have a larger impact on higher-wage earners even if the effects are felt across the board somewhat. Clinton's plan might impact the wealthy, potentially having an impact on their earnings, but also provides more funding for benefits while keeping taxes on lower-income earners down. \nAdditional state corporate taxes bump the official total rate on businesses up closer to 40%, but the statutory rate doesn't reflect the write-offs in the tax code that reduce the \"effective rate\" on corporate profits — what corporations actually pay in taxes as a share of their profits, which tends to be lower. \nAccording to an analysis released earlier this week by the Tax Foundation, Trump's proposal would reduce federal revenue by between $4.4 trillion and $5.9 trillion from corporate and individual taxes. Trump says he would make up that number by job growth and cutting waste, fraud and abuse. But without drastic cuts, it's nearly certain to lead to higher deficits. \nThe Tax Foundation estimates that Clinton's plan would yield $191 billion in additional tax revenue over the next decade when accounting for decreased economic output, but it also could reduce the economy's size by as much as 1% in the long run, with a small decrease in the number of jobs which might otherwise be created. Has NAFTA (the North American Free Trade Agreement) been bad for America? Buy Photo \nUAW President Dennis Williams endorsed Hillary Clinton for the Democratic Presidential nomination. (Photo: Ryan Garza, Detroit Free Press) \nTrump's angle/position: Trump has called NAFTA \"the worst trade deal in history,\" has said he would renegotiate the deal, which includes Mexico and Canada, to get \"a better deal for our workers. \nClinton angle/position: NAFTA was a good idea at the time but is a flawed agreement that should be re-evaluated. \nWhy you should care: NAFTA has been in place for 23 years, and corporations have made billion-dollar decisions based on the existing ground rules. Millions of jobs are either directly or indirectly connected to trade with Mexico and Canada. Any major change to NAFTA could impact the U.S. economy and your job. \nWhat you should know: In 1993, former President Bill Clinton signed the North American Free Trade Agreement, which lifted most tariffs on goods traded among the United States, Mexico and Canada. However, the deal was largely negotiated under the administration of President George Bush. \nHillary Clinton was a supporter of NAFTA in the 1990s. However, she began to back away from NAFTA as a candidate for U.S. Senate in New York in 2000, calling it \"flawed,\" and as a presidential candidate in 2008, Clinton said the pact should be re-evaluated. \nTrump's opposition is unusual for a Republican. In 1993, the strongest support in the House came from Republicans, who cast 132 votes for the trade plan and 43 against it. Among Democrats, 102 voted for the agreement and 156 opposed it. \nWhile the trade deal has had a direct impact on American manufacturing jobs most economists argue that it has had a positive impact on America's economy. \nAccording to the Council on Foreign Relations: Most estimates conclude that the deal had a modest but positive impact on U.S. GDP of less than 0.5%, or a total addition of up to $80 billion dollars to the U.S. economy upon full implementation, or several billion dollars of added growth per year. Such upsides of trade often escape notice, because while the costs are highly concentrated in specific industries like auto manufacturing, the benefits of a deal like NAFTA are distributed widely across society. The Trans-Pacific Partnership — who is for it? \nSupporters of Republican presidential candidate Donald Trump listen as he speaks during a campaign rally, Wednesday, Sept. 21, 2016, in Toledo. (Photo: Evan Vucci, Associated Press) \nTrump's angle/position: He's against the Pacific Rim trade deal saying it's bad for America — and that's a real break for most of his Republican colleagues. He says Clinton is secretly for it. \nClinton's angle/position: She's against it, too. Though she wasn't always and has a complicated stance on the issue. \nWhy you should care: Trade deals let the U.S. compete more favorably in overseas markets by reducing tariffs and other obstacles but Democrats — especially from industrial states like Michigan — argue the deals result in jobs being shipped to low-wage countries. \nWhat you should know: Clinton supported the TPP as a member of the Obama administration but now says she's against it. Trump has called her out on that — saying she's not genuine in her disapproval and noting that she also was for the NAFTA when her husband signed it into law in the 1990s — but if anyone has benefited from low-cost markets overseas it may be Trump, whose businesses have imported products from elsewhere. \nThat said, many economists argue that while the damage caused by jobs leaving the country for lower-cost labor is often very apparent, less obvious are the jobs in other sectors that are created, because they are more spread out and hard to see. Obama has also argued that if the U.S. doesn't pass TPP it will provide China even more impetus to move toward its own deals and cut the U.S. out in the region. \nFinally, presidents of either party tend to become supporters of trade agreements once in office, because global markets exist whether we want them to or not. What's truly different about this year is Trump railing against trade deals when Republicans almost always pledge support to them. \nIn fact, the Obama administration is trying to win approval of the deal before his term expires. Obama said earlier this month he is confident he will be able to get it passed. \nOn Sept. 16 Ohio Gov. John Kasich, former New York City Mayor Michael Bloomberg, former George W. Bush administration Treasury Secretary Hank Paulson, Atlanta Mayor Kasim Reed and others joined Obama in the Oval office to express support for TPP and to urge Congress to approve the deal. \nThe issue puts a number of Republicans, especially those up for re-election in November, in a difficult position because they typically support free trade deals. Should Ford move small car production to Mexico? \nThis file photo shows a lineup of Ford Focus vehicles on an assembly line at the Ford Michigan Assembly Plant in Wayne, Michigan in January 2015 (Photo: SAUL LOEB, AFP/Getty Images) \nTrump's position: Trump has said he would stop Ford from moving jobs to Mexico if he is elected and would impose a 35% tax on Ford's cars made in Mexico and sold in the U.S. \nClinton position: Clinton has not directly attacked Ford or other automakers for expansion plans in Mexico. \nWhy you should care: The Detroit Three have shut down a number of auto plants in the U.S. over the past 25 years, leading to massive job losses, while expanding in Mexico. That said, imposing a 35% tariff now would potentially create chaos and turmoil in the automotive industry and could hurt America's relationship with a key ally. \nWhat you should know: Ford is moving all small car production to Mexico but will continue to make SUVs and pickups in U.S. plants. Ford plans to end production of the Ford Focus and Ford C-Max at its plant in Wayne in 2018 and make those cars in Mexico. \nStill, Trump's decision to repeatedly single out for Ford for criticism over Mexico seems bizarre. Why? Because nearly all other automakers — including Fiat Chrysler Automobiles and General Motors — are either investing in their Mexican auto plants or are building new plants in Mexico. Honda, Hyundai, Nissan, Mazda, Toyota and Volkswagen also have announced plans to either expand existing plants or build new ones in Mexico. \nFord isn't eliminating U.S. jobs. That plant in Wayne will remain open as it begins to build two new vehicles. \nLast fall, the automaker made a commitment to invest $9 billion in U.S. plants and create or retain more than 8,500 jobs as part of a new four-year contract with the UAW. Of that, $4.8 billion goes to 11 facilities in Michigan. \n\"When it comes to Ford, our commitment to creating and investing in jobs in the U.S. has never been bigger,\" Fields said on CNN earlier this month. \"We will continue to do that no matter who is in the White House.\" Is Donald Trump engaging in hate speech? \nDonald Trump (Photo: Tom Lynn) \nClinton's position: She took back a statement that “half” of Trump’s supporters are bigoted but has stuck to her stance that his statements “have given a national platform to hateful views and voices.” \nTrump's position: He says Clinton demeaned millions of working-class families who want a better future by calling them “deplorables.” \nWhy you should care: Trump's comments are seen as disqualifying by many Americans, including some Republicans; Clinton’s “deplorables” comment, however, was portrayed as a gaffe by those who say it’s improper for her — as it was for Mitt Romney in 2012 — to try to assign motivations to her opponent’s supporters. \nWhat you should know: Here are some of Trump's statements and proposed policies: Trump has compared all Mexicans to “rapists” and criminals and insinuated an American judge could not be fair to Trump in a lawsuit because of the judge’s Mexican heritage after Trump talked of deporting 11 million undocumented immigrants. Trump initially calling for a ban on Muslims — including American Muslims — entering the U.S. after terrorist attacks last year. He and others associated with his campaign have used images and phrases linked to white nationalist movements. Some Trump critics have noted poll results show his supporters are more likely to view African Americans negatively, though those same results showed as many as a third of Clinton supporters had similar views. Trump has repeatedly defended himself, denying any connection with white nationalist websites or materials and calling Mexicans \"tremendous\" during a visit to Mexico City. He also has walked back any ban on Muslims and now supports a process he calls \"extreme vetting,\" which would block immigration by anyone who doesn't meet a test of what he calls American \"values. Is Hillary Clinton corrupt? \nDemocratic presidential candidate Hillary Clinton. (Photo: Al Seib, TNS) \nTrump's position: Trump and his allies argue that Clinton broke the law by having a private e-mail server as secretary of state and suggested repeatedly that donors to the nonprofit Clinton Foundation got special treatment from her while she was in her cabinet position. \nClinton's position: Clinton has said use of the personal e-mail server was a mistake but an unintentional one that did not threaten national security. On the Clinton Foundation, her campaign has said there was no conflict of interest with it and the State Department. \nWhy you should care: The question of Clinton’s trustworthiness is perhaps her biggest liability in the campaign. There have been few if any official findings of wrongdoing against her, but FBI Director James Comey concluded that Clinton was \"extremely careless\" in having a private e-mail server but he declined to bring any criminal charges. \nWhat you should know: According to polls, whether voters can trust Clinton continues to be a major liability for her; the NBC/Wall Street Journal poll last week showed only 31% of respondents considering her \"honest and straightforward,\" compared with 41% for Trump. The private e-mail server complaint came from a Republican-led congressional investigation into her handling of the 2012 embassy attack in Benghazi, Libya, when two U.S. compounds were attacked on Sept. 11 that year, killing U.S. Ambassador J. Christopher Stevens and U.S. Foreign Service Information Management Officer Sean Smith. The congressional investigation this summer found no evidence of wrongdoing by Clinton related to Benghazi. (Other investigations have concluded the same.) The FBI looked into Clinton's private server she kept for e-mails and concluded that some confidential material was sent through that server but that there was no indication the system had been compromised or that Clinton had acted with criminal intent. FBI Director Comey called Clinton “extremely careless” in how she handled the e-mails. Clinton Foundation : While there have been media reports suggesting people connected with the Clinton Foundation asked State Department officials for favors linked to donors, there is no direct evidence to date that Clinton or her agency made a decision or provided access to someone it otherwise would not have based on any donation. That said, any questions about favoritism are fair if only because there are indications the foundation wasn’t as transparent about foreign donations as Clinton suggested during her confirmation hearings. Who’s leading in the polls? Buy Photo \nMichigan voters give Hillary Clinton slight lead over Donald Trump. (Photo: DFP) \nTrump's position: Trump likes to tout his position in the polls, especially when he’s doing well. Lately, he’s been tweeting his standing in polls in some potential battleground states. \nClinton's position: Clinton doesn’t talk much about polls, at least compared with Trump, even when she’s doing well. \nWhy you should care: By this point in an election season, the polls should give a pretty good idea of the actual state of the race. \nWhat you should know: The Real Clear Politics average of national polls shows about a 1-percentage-point spread for Clinton: effectively a tie. But winning the presidency is not about winning nationally, it’s about winning battleground states (though the national polls are good for suggesting trends including those in battleground states). Most agree that to win, it really comes down to a group of states including Colorado, Florida, Iowa, Nevada, New Hampshire, Ohio and Virginia — with a few others like Michigan, North Carolina, Pennsylvania and Wisconsin thrown in for good measure. As a matter of demographics, Clinton has a built-in lead from the start because there are more states like New York and California, with lots of electoral votes, that are considered locks for the Democrat. And polls show that Clinton is winning most of the key battleground states — enough that experts are giving her the best chance of winning (FiveThirtyEight, a polling outfit, said Wednesday Clinton had a 57% chance of winning). But Trump has narrowed her lead in several states (including Michigan) and has gone ahead in some recent battleground state polls. In other words: He can’t claim to be winning but he can absolutely argue that he’s catching up. Has Trump made illegal or improper donations or contributions? \nIn this July photo, Donald Trump takes the podium to deliver his address during the final day of the 2016 Republican National Convention at Quicken Loans Arena in Cleveland (Photo: Tannen Maury/EPA) \nClinton's position: Supporters of Clinton have raised questions about Trump’s $25,000 contribution to Florida Attorney General Pam Bondi at a time when her office was considering whether to pursue an investigation into Trump University’s dealings. They have also questioned whether Trump broke the law by spending $258,000 from his charitable foundation to settle lawsuits involving his for-profit businesses, per the Washington Post. \nTrump's position: Trump says he never spoke to Bondi about Trump University and says his foundation made no improper donations, including those revealed by the Post, because the donations were reported to the Internal Revenue Service. \nWhy you should care: Is Trump being hypocritical for suggesting a special prosecutor should be appointed to investigate Clinton Foundation dealings if Trump — as some of his critics say — was engaged in his own “pay-to-play” activities, as he himself has suggested he has done as a businessman. \nWhat you should know: \nTrump University, which offered to teach students real estate techniques, has been the subject of civil lawsuits and a legal suit filed by the New York attorney general claiming that consumers were duped by Trump's celebrity into paying for a series of courses that did not deliver on their promises. Trump has defended the courses as a success. \nEven though Trump’s contribution to Bondi came around the time her office was looking at Trump University, there is no indication that she had a direct role in what was largely a staff decision not to investigate, and an investigation was already underway in New York State. As for the spending by the Trump Foundation, the Post correctly notes that while Trump’s campaign complains of inaccuracies in the story, it doesn’t cite any specific errors and that “self-dealing” — using nonprofit foundation funds raised for some other purpose to benefit a trustee’s other independent interests — can violate the tax law. No such determination has been made on the Trump Foundation’s spending, however, and the Trump campaign seems to suggest that if there had been anything wrong about the contributions, the IRS would have already seen it. Who’s more to blame for promoting questions about President Barack Obama’s birth, Clinton or Trump? \nPresident Barack Obama speaks following a National Security Council meeting on the Islamic State at the Department of Treasury in Washington, D.C., June 14, 2016. (Photo: Saul Loeb, AFP/Getty Images) \nClinton's position: Trump’s been sowing doubts about Obama’s birthplace dating to his first term. Clinton says she had nothing to do with it. \nTrump's position: He has a newly minted position that he accepts Obama was born in the U.S. and that it was Clinton, not Trump, who started the questions in 2008, when she was facing Obama in the Democratic primary. \nWhy you should care: Because there has never been any doubt that Obama was born in the U.S., since his campaign made his birth certificate public when he was running for president. The repeated attempts on Trump’s part to raise questions about it amounted to his trying to undermine Obama’s constitutional qualifications to be president, which were never in any doubt. \nWhat you should know: Clinton at no point questioned Obama’s citizenship. A campaign adviser at one point in a private strategy memo suggested to others in the campaign that his “lack of American roots” could be used against him in Clinton’s own race for the Democratic nomination in 2008. That strategy was rejected. The memo in question was more focused on his youth spent in Hawaii and Indonesia as somehow being out of the American mainstream than an effort to question his U.S. citizenship. Trump started raising questions about Obama’s birthplace in 2011 – three years after Obama’s campaign produced a birth certificate. It did produce a longer form from the Hawaii Department of Health that year. If Trump took that as proof of Obama's U.S. citizenship, which he now claims, he had a strange way of showing it, claiming (per Factcheck.org) on multiple occasions thereafter that the certificate might still be a fraud. Trump on Sept. 16 abandoned any questions of Obama's citizenship, saying \"Hillary Clinton and her campaign of 2008 started the birther controversy. I finished it. I finished it. You know what I mean. President Barack Obama was born in the United States. Period. Now we all want to get back to making America strong and great again.\" Did the U.S. pay a $400-million “ransom” to Iran for the release of four prisoners? \nFormer U.S. Marine Amir Hekmati, center, 32, arrives at Bishop International Airport on Thursday, Jan. 21, 2016, in Flint. (Photo: Salwan Georges Special to DFP) \nTrump's position: Trump and several other Republicans say the Obama administration was wrong to pay what it considers a “ransom” delivered to Iran at the same time of the release of the prisoners, a group which included Amir Hekmati of Flint. \nClinton's position: Clinton has not taken a direct role in the payment — she was already gone from the State Department at the time — but she says Obama has addressed the controversy. \nWhy you should care: The U.S. makes a point of not paying ransom for the release of prisoners, as it is seen as potentially encouraging others to be taken. \nWhat you should know: The U.S. sent Iran $400 million — and another $1.3 billion in the weeks that followed, per the Wall Street Journal — to settle a long-standing debt In 1979, after the Shah of Iran was overthrown, the U.S. had received $400 million for weapons which, after the overthrow, it had no intention of providing the country. Over the decades that followed, Iran has demanded repayment along with interest far in excess of the $1.7 billion known to be paid to date. As the U.S. was negotiating a deal for Iran to drastically scale back its nuclear program and allow international inspectors in return for a lifting of western economic sanctions, two side deals were reached — one involving the release of the prisoners (in exchange for charges to be dropped against Iranian prisoners by the U.S.), the other for the return of the money plus (some) interest. State Department officials have acknowledged that the money was sent at the same time the prisoners were released as “leverage” to ensure they made it out of the country but repaying a debt that was already owed is not the same as “ransom,” Obama and U.S. officials say. Did President Barack Obama (and, by extension, his former secretary of state, Clinton) “create” ISIS? Buy Photo \nOver one hundred people gather with the United and Concerned Citizens of Hamtramck to demonstrate against ISIS. (Photo: Detroit Free Press) \nTrump's position: Trump walked back earlier statements that Obama found ISIS, otherwise known as the Islamic State or ISIL, calling those “sarcasm.” But he has continued to blame the Obama administration and Clinton for the rise of the group. \nClinton's position: Her campaign says such suggestions are wrong and display Trump's woeful understanding of the real complications around the situation in the Middle East. \nWhy you should care: ISIS continues to be a threat to U.S. interests, and its recruits have been linked to terrorism around the world, including attacks in Paris and elsewhere. Some attacks in the U.S. have been linked to ISIS-inspired, if not trained, attackers. Clinton, as U.S. senator from New York, voted to authorize troops in Iraq. Trump has said he opposed it from the start, which isn’t true. \nWhat you should know: ISIS grew out of al-Qaida in Iraq, but many experts consider it far too simplistic to suggest that it came about because of the U.S. pulling troops out in 2011. Pulling out the troops was a decision made initially by former President George W. Bush and one that Trump, in the past, supported. Per Factcheck.org and others, there were other consequential decisions made by the Iraqis, including the weakening of the army in 2014, that led ISIS to regain strength. Most significantly, the civil war in Syria gave space for ISIS to rise. The Obama administration has been in a complicated position in the war: opposing Syrian President Assad but also battling ISIS, which is battling Assad. The U.S. has been working with rebel groups against both. Meanwhile, as ISIS has lost ground, it has appealed for attacks elsewhere, fueling terrorism in other parts of the world. Do refugees from the Syrian civil war pose a threat to the U.S.? \nA Syrian woman, who fled the assault in the town of Manbij, talks to a Kurdish fighter at an encampment on the outskirts of the town.ages (Photo: DELIL SOULEIMAN/AFP/Getty Images) \nTrump's position: Trump’s position on this has changed several times but the upshot is this: He and his advisers feel that the U.S. is vulnerable to potential terrorists entering the U.S. through refugee resettlement programs. Trump wants stricter rules on people entering the country from nations seen as breeding grounds for anti-western terrorists \nClinton's position: Clinton has said it is the responsibility of the U.S. to help those displaced by war and called for a substantial increase in the resettlement of Syrian refugees, from about 12,000 this year to 65,000. \nWhy you should care: Michigan welcomes about 10% of those refugees from Syria — more than just about any other state in the nation. \nWhat you should know: An estimated 11 million Syrians have been displaced by the civil war that began in 2011. While most of those are from Syria, the United Nations estimates 4.8 million have been displaced outside the nation. Germany has resettled more than 300,000 during the crisis. The U.S. has resettled 14,051 Syrians since the beginning of 2012 — the vast majority, 11,524, this year. Michigan has received 1,514 Syrians since the beginning of 2012, 1,257 this year. Donald Trump Jr.’s suggestion that a few bad Skittles poison the whole box misses the point that terrorist acts by refugees resettled in the U.S. are extremely limited. Nearly all of the recent attacks were committed by citizens born in the U.S. It’s true that FBI Director Comey told Congress the obvious — that government checks on people’s backgrounds are only as good as the records available to them, which for millions living in camps in Jordan displaced by war in Syria, are not always robust. But the screening process for refugees is a long one — taking a year and a half or more — and is considered tougher than those for other people entering the U.S.  //on.freep.com/2dsOU5P More Stories", "external_links": [], "published": "2016-09-25T11:14:00.000+03:00", "crawled": "2016-09-25T06:42:42.830+03:00", "highlightTitle": ""}