{"organizations": [], "uuid": "2ac1f85cb51267c5a9c050fa467ace002f01e6b5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "drugpolicycentral.com", "main_image": "", "site_section": "http://drugpolicycentral.com/bot/rss", "section_title": "breaking drug news latest 25", "url": "http://drugpolicycentral.com/bot/xarticle/nbcnews8029.htm", "country": "CA", "title": "Carly Fiorina Makes Her Pitch in Iowa - NBC News", "performance_score": 0, "site": "drugpolicycentral.com", "participants_count": 1, "title_full": "[BOT] Carly Fiorina Makes Her Pitch in Iowa - NBC News", "spam_score": 0.0, "site_type": "news", "published": "2016-09-17T03:00:00.000+03:00", "replies_count": 0, "uuid": "2ac1f85cb51267c5a9c050fa467ace002f01e6b5"}, "author": "drugpolicycentral.com", "url": "http://drugpolicycentral.com/bot/xarticle/nbcnews8029.htm", "ord_in_thread": 0, "title": "Carly Fiorina Makes Her Pitch in Iowa - NBC News", "locations": [], "entities": {"persons": [{"name": "carly fiorina", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "dale guge", "sentiment": "none"}, {"name": "angela merkel", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "dan schermerhorn", "sentiment": "none"}, {"name": "ted cruz", "sentiment": "none"}, {"name": "charlie neibergall", "sentiment": "none"}, {"name": "ben carson", "sentiment": "none"}, {"name": "okoboji", "sentiment": "none"}, {"name": "guge", "sentiment": "none"}, {"name": "chuck grassley", "sentiment": "none"}, {"name": "jesus christ", "sentiment": "none"}, {"name": "vladimir putin", "sentiment": "none"}, {"name": "bob hemesath", "sentiment": "none"}, {"name": "fiorina", "sentiment": "none"}, {"name": "bernie sanders", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "frank", "sentiment": "none"}, {"name": "susan henrich", "sentiment": "none"}, {"name": "abdullah", "sentiment": "none"}, {"name": "carroll", "sentiment": "none"}, {"name": "obama", "sentiment": "none"}, {"name": "vaughn hillyard", "sentiment": "none"}, {"name": "chuck andreasen", "sentiment": "none"}, {"name": "christopher rants", "sentiment": "none"}, {"name": "david cameron", "sentiment": "none"}, {"name": "jimmy buffett-esque", "sentiment": "none"}], "locations": [{"name": "iowa", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "jordan", "sentiment": "none"}, {"name": "le mars", "sentiment": "none"}, {"name": "remsen", "sentiment": "none"}, {"name": "ames", "sentiment": "none"}, {"name": "decora", "sentiment": "none"}, {"name": "carroll", "sentiment": "none"}, {"name": "scranton", "sentiment": "none"}, {"name": "neibergall", "sentiment": "none"}, {"name": "des moines", "sentiment": "none"}, {"name": "ohio", "sentiment": "none"}], "organizations": [{"name": "nbc news    carly fiorina", "sentiment": "none"}, {"name": "nsa", "sentiment": "none"}, {"name": "consumer financial protection bureau", "sentiment": "none"}, {"name": "monmouth", "sentiment": "none"}, {"name": "nbc news artboard", "sentiment": "none"}, {"name": "hp", "sentiment": "none"}, {"name": "nbc news carly fiorina", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "blue bell ice cream factory", "sentiment": "none"}, {"name": "social security", "sentiment": "none"}, {"name": "iowa corn growers association", "sentiment": "none"}, {"name": "hewlett-packard", "sentiment": "none"}, {"name": "nbc news", "sentiment": "none"}, {"name": "iowa state fair", "sentiment": "none"}, {"name": "iowa state university", "sentiment": "none"}, {"name": "gop", "sentiment": "none"}, {"name": "google", "sentiment": "none"}, {"name": "ap", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "  \nCarly Fiorina Makes Her Pitch in Iowa - NBC News \nFound: Sat Sep 17 08:48:55 2016 PDT\nWebpage: http://www.nbcnews.com/politics/2016-elect...   \nCarly Fiorina Makes Her Pitch in Iowa - NBC News Carly Fiorina Makes Her Pitch in Iowa - NBC News Artboard 1Facebook LogoTwitter LogoGoogle Plus LogoEmail Icon \nWATCH LIVE: Bernie Sanders campaigns for Hillary Clinton in Ohio \nGet Alerts \nNBC News \n* Top Videos \n* Created with Sketch. Today \n* Share on Facebook * Share on Twitter * Share on Google Plus * Email page link \nSecondary Navigation \nSections * U.S. \n* Local \n* Peacock Productions \n* Next Steps for Vets \n* Parent Toolkit \nNBC News works best with JavaScript turned on Feedback \nCarly Fiorina Makes Her Pitch in Iowa \nby Vaughn Hillyard \nRepublican presidential candidate Carly Fiorina greets fairgoers during a visit to the Iowa State Fair, Monday, Aug. 17, 2015, in Des Moines, Iowa. ( AP Photo/Charlie Neibergall) Charlie Neibergall / AP \n* Share \n* Share \n* Tweet \n* Share \n* Comment \nFor Republican presidential candidate Carly Fiorina, it's about much more than making that next main debate stage -- or being the second-choice candidate in the polls. \n\"I know this, in your heart of hearts, everybody here cannot wait to see me debate Hillary Clinton,\" Fiorina told 500 Republicans, slightly grinning, at Sen. Chuck Grassley's Jimmy Buffett-esque summer picnic in northern Iowa last Thursday. \n\"And you know, there's only one way that happens\" -- by winning the GOP presidential nomination, she added. \nOn the campaign trail, Fiorina is making her pitch as the businesswoman. The citizen. The woman of faith. The toughest candidate on the world stage. The reasonable outsider listening to Iowa's farmers. \nThe former Hewlett-Packard CEO logged 11 hours -- and even hit one deer -- in her car over a four-day, eight-stop stint that ended on Saturday through the northwestern corner of Iowa, a region filled with evangelical voters and an economy fueled by agriculture. \n\"When I walked into that [second-stage] debate, less than 40 percent of Republican primary voters had ever heard my name,\" Fiorina told NBC News this weekend. \"So they didn't know who I was. They didn't even know I was running.\" \nAnd with the next GOP debate coming up in two weeks -- the main stage is limited to the top 10 GOP candidates in national polls -- Fiorina is trying to introduce herself to more Republicans. \n\"I don't know her history. I just know today I was very impressed,\" Susan Henrich, 68, of Remsen, Iowa, said of Fiorina after a town hall event at the Blue Bell Ice Cream Factory in Le Mars. \nDan Schermerhorn, 69, a retired mail carrier from Scranton, Iowa, was more emphatic: \"She knows where she's going. She has the experience. She's not saying this is wrong, this is wrong, but she says this is what I'm going to do to change it.\" \nA Monmouth poll released on Monday had her in third place in Iowa at 10 percent. \nIn a Des Moines Register/Bloomberg Politics Iowa Poll released on Saturday, just five percent of Iowans named Fiorina as their top choice. But 11 percent said Fiorina would be their second choice. \n\"We're right where we ought to be. Honestly, I would be worried if we had suddenly skyrocketed to the top after that first debate because that's not necessarily a sustainable trajectory,\" Christopher Rants, Fiorina's Iowa state chairman, said after the release of the latest poll. \n\"Last cycle, you saw every candidate sort of had their flavor of the month and then went away. I like the trajectory that we're on -- continue to introduce ourselves. We want people who want more from us.\" \nThe CEO Liability? \nFiorina's business record -- 30,000 employees of Hewlett-Packard lost their jobs during her tenure as CEO -- is considered a potential major liability to her campaign, yet on this Iowa swing, her time at HP registered nearly no concern among voters. \n\"Politics plays out in the board room -- the same way as it plays out other places, and she got involved in a fight,\" Dale Guge, 68, of Okoboji said. \nHis friend, Chuck Andreasen, 70, cut Guge off: \"I ran a company for 28 years, and somebody has to make decisions. And she was brought into the company to make those decisions. And if you're going to say, I'm sorry I had to do that, you'd be foolish. But she did what she had to do to save that company.\" \nGuge added: \"The other part of Carly at HP, they act like she ruined the company. But you have to remember that all was occurring at the same time as the bubble.\" \nThe Immigration Pitch \nFiorina, in an interview with NBC News over the weekend, criticized Donald Trump for the most polarizing proposals of his immigration plan. \n\"I've been very clear I don't support deportation. I don't support amending the Constitution or challenging the 14th Amendment,\" Fiorina said. \n\"I think these are ideas that stoke anger but don't solve problems . I think Donald Trump is stoking anger without solving problems . And I think others, now, are sadly pandering to him.\" \nIt's a pivot from the last two weeks ago, when Fiorina refused to criticize Trump's impact on the debate over immigration beyond her stated opposition to ending birthright citizenship. \nFiorina's stump speeches include demands for the federal government to secure the border and establish an effective employer-verification system. \nBut absent from the events are specific calls to undo President Obama's executive actions. \nFollowing her town hall at Iowa State University in Ames, Fiorina said she would be open to passing a version of the Dream Act to grant citizenship for young undocumented immigrants who came to the U.S. as children . \n\"Perhaps their children can earn citizenship because I don't think we should punish children for the sins of their fathers and mothers. I don't.\" \nThe Agriculture Pitch \nFiorina made her final stop on Saturday morning in Des Moines at the Iowa Corn Growers Association's policy conference -- telling the nearly 250 corn growers that she supported allowing the Renewable Fuel Standard to expire in 2022, as current law states, if subsidies for fossil fuels also end. \n(The Renewable Fuel Standard requires a certain amount a biofuel be blended into U.S. fuel supplies, guaranteeing ethanol access into the gas market -- which seen as a big boon to Iowa farmers.) \n\"Government shouldn't be giving certain fuels tax credits, access to markets that is beneficial to one industry over another,\" Fiorina, the only candidate to accept the association's invitation to attend, told the growers. \n\"Government shouldn't be setting prices. Government shouldn't be picking winners and losers .\" \nAfter that line, the room -- for perhaps the only time on her entire trip -- failed to applaud when the candidate finished her specific thought. But her position is not necessarily an unpopular one with the growers. \n\"If she believes that [the RFS] should go away after 2022, that's fine, but I'd like to see oil put on a level playing field and take away the subsidies, and we'd be more than willing to play that game,\" stated Bob Hemesath, president of the association and a corn grower in Decora. \nThe Religious Pitch \nThe last two Republican winners of the Iowa caucuses won with significant portions of the state's large evangelical population. \nSen. Ted Cruz, who hosted a \"Religious Liberty Rally\" in Des Moines one week ago, and Ben Carson, who is targeting members of church congregations across the state, are each making strong ploys for the evangelical vote. \nBut Fiorina is, too. At each of her events, she speaks forwardly about her faith, repeating the phrase \"God-given gifts\" several times over the course of an event. \nIn Le Mars, after referencing her bout with cancer and loss of her daughter to drug addiction , Fiorina told the crowd: \"Through the good times and the bad times, I have been sustained by my personal relationship with Jesus Christ.\" \nThe Businesswoman Pitch \n\"Sometimes people ask me how I went from secretary to CEO. Truth is, I didn't have a plan,\" Fiorina hashes out to the crowds on the road. \nAnd she reminds everyone that her husband, Frank, \"started out as a tow-truck driver in a family-owned auto body shop.\" \nOn taxes, Fiorina told a crowd in Carroll: \"Lower every rate. Close every loophole.\" \nFiorina also noted to an Iowa State University gathering of about 200 people that she will sidestep taking on Social Security reforms until she \"can demonstrate to the American people that the federal government is competent at its job\" by addressing other issues like \"securing the border.\" \nAlso in Carroll, the former CEO blasted Dodd-Frank -- the 2010 law that set up tighter regulations on financial institutions -- calling it \"crony capitalism\" and responsible for creating \"even bigger, more powerful, more corrupt Wall Street banks\" and putting \"thousands of community banks\" out of business. \nAnd she warned those in attendance about the Consumer Financial Protection Bureau created under the law. \"Word to the wise, they're in there looking at all of our credit card receipts to see if they can detect signs of fraud. I'll tell you what: That worries me a whole lot more than the NSA, to be honest,\" Fiorina said. \nFiorina also embraces and emphasizes her own foreign-policy credentials. \n\"I know more world leaders on the stage than anyone running,\" Fiorina would recite at her stops--this one in Le Mars. \n\"Perhaps Hillary Clinton has met a few more than I have, but she did photo ops -- I had business, or charity, or policy discussions. I have sat this close to Vladimir Putin. To Angela Merkel. To David Cameron. To the Chinese premiership over three successive generations. King Abdullah of Jordan. The Saudi royal family. You name it -- I probably know them.\" \nVaughn Hillyard * Twitter \n* Email \nTopics 2016 Election \nFirst Published Aug 31 2015, 1:33 pm ET \nNext Story Analysis: Trump's Lengthy History of Conspiracy Theories and Rumors", "external_links": [], "published": "2016-09-17T03:00:00.000+03:00", "crawled": "2016-09-17T19:22:48.918+03:00", "highlightTitle": ""}