{"organizations": [], "uuid": "6c16a8c49873eba3473bb11d77ff48a708f2abfc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 180, "shares": 180, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/images.foxnews.com/content/fox-news/us/2016/09/29/us-tried-to-deport-refugee-shot-killed-by-california-police/_jcr_content/par/featured-media/media-0.img.jpg/0/0/1475170205429.jpg?ve=1", "site_section": "http://feeds.foxnews.com/foxnews/national", "section_title": "FOX News", "url": "http://www.foxnews.com/us/2016/09/29/us-tried-to-deport-refugee-shot-killed-by-california-police.html", "country": "CH", "domain_rank": 185, "title": "US tried to deport refugee shot, killed by California police", "performance_score": 1, "site": "foxnews.com", "participants_count": 0, "title_full": "US tried to deport refugee shot, killed by California police", "spam_score": 0.0, "site_type": "news", "published": "2016-09-30T01:09:00.000+03:00", "replies_count": 0, "uuid": "6c16a8c49873eba3473bb11d77ff48a708f2abfc"}, "author": "", "url": "http://www.foxnews.com/us/2016/09/29/us-tried-to-deport-refugee-shot-killed-by-california-police.html", "ord_in_thread": 0, "title": "US tried to deport refugee shot, killed by California police", "locations": [], "entities": {"persons": [{"name": "bill wells", "sentiment": "none"}, {"name": "gilleon", "sentiment": "none"}, {"name": "alfred olango", "sentiment": "none"}, {"name": "dan gilleon", "sentiment": "none"}, {"name": "olango", "sentiment": "none"}, {"name": "christopher rice-wilson", "sentiment": "none"}, {"name": "wells", "sentiment": "none"}, {"name": "drago", "sentiment": "none"}, {"name": "richard gonsalves", "sentiment": "none"}, {"name": "chuck drago", "sentiment": "none"}, {"name": "virginia kice", "sentiment": "none"}, {"name": "gonsalves", "sentiment": "none"}], "locations": [{"name": "california", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "san diego", "sentiment": "none"}, {"name": "el cajon", "sentiment": "none"}, {"name": "syria", "sentiment": "none"}, {"name": "uganda", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}, {"name": "iraq", "sentiment": "none"}, {"name": "charlotte", "sentiment": "none"}, {"name": "tulsa", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}, {"name": "oklahoma", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "north carolina", "sentiment": "none"}, {"name": "el cajon", "sentiment": "none"}, {"name": "colorado", "sentiment": "none"}], "organizations": [{"name": "facebook", "sentiment": "negative"}, {"name": "alliance san diego", "sentiment": "none"}, {"name": "city council", "sentiment": "none"}, {"name": "associated press", "sentiment": "none"}, {"name": "customs enforcement", "sentiment": "none"}, {"name": "el cajon", "sentiment": "none"}, {"name": "u.s. supreme court", "sentiment": "none"}, {"name": "el cajon police", "sentiment": "none"}, {"name": "twitter", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "US tried to deport refugee shot, killed by California police Published September 29, 2016 Facebook 0 Twitter 0 Email Print Police released this image of the suspect assuming a shooting stance (El Cajon Police) \nEL CAJON, Calif. – U.S. authorities tried twice to deport the unarmed black man fatally shot by police in a San Diego suburb, but his native Uganda refused to take him, resulting in his release. \nImmigration and Customs Enforcement said in a statement to The Associated Press that Alfred Olango stopped reporting to officers in February 2015. Spokeswoman Virginia Kice didn't know if officers tried to find him after that. \nOlango arrived as a refugee in 1991 and was ordered deported in 2002 after being convicted on drug charges. He was released under a U.S. Supreme Court ruling barring detention of foreign nationals after six months if deportation is unlikely. \nImmigration authorities took Olango into custody in 2009 after a firearms conviction in Colorado but were again unable to obtain travel documents. \nOlango, 38, was shot and killed Tuesday by police in El Cajon after pulling out a large electronic cigarette, known as a vape pen, from his pocket and pointing it at the police officer who fired, while a second officer stood nearby trying to subdue him with a stun gun, according to police. A family attorney said Olango was having an emotional breakdown over the recent death of his best friend. \nThe investigation centers on a video taken by a bystander. Police have produced a single frame from the cellphone video to support their account, saying it shows Olango in a \"shooting stance.\" \nThe photo shows Olango's hands clasped together and pointed directly at an officer who had assumed a similar posture with his gun a few feet away. \nThe vaping device in his hands had two components, a box about the size of a cellphone and a metallic cylinder that was 3 inches long and 1 inch wide. Police said the cylinder was pointed right at the officer. \nOlango's relatives demanded the full video be released, according to Dan Gilleon, a lawyer who says he is representing the family. \n\"They're cherry-picking part of the video,\" Gilleon said. \"This is exactly what police have said is unfair when only portions of video are released against them.\" \nMayor Bill Wells said he had seen the video and that it was not \"tremendously complicated to figure out what happened.\" \nWells was asked how he would feel if it was his child that had been shot. \n\"I saw a man who was distraught, and a man acting like he was in great pain,\" Wells said. \"And I saw him get gunned down and killed. If he was my son, I would be devastated.\" \nOlango arrived in the U.S. years ago as a refugee from Uganda. Since then he ran afoul of the law several times: selling cocaine, driving drunk, and illegally possessing a 9mm semi-automatic handgun when he was arrested in Colorado in 2005 with pot and ecstasy in his car, according to court records. He pleaded guilty in federal court and was sentenced to nearly four years for being a felon in possession of a gun. \nThe fatal shooting happened less than two weeks after black men were shot and killed by police in Tulsa, Oklahoma, and Charlotte, North Carolina, where violent protests broke out. \nProtests in El Cajon Wednesday night had heated moments, but remained mostly peaceful. \nScores of people gathered quietly around candles lining a curb in front of bloodstained pavement at the strip mall where Olango was shot. \nMore than 200 people marched in the streets near the site, yelling \"no justice, no peace, no racist police!\" \nPolice in riot gear, some of them with dogs, faced off with protesters occasionally, bringing some tense moments, but mostly kept their distance. \nExperts said it was too early to conclude whether the California shooting was justified or could have been prevented. \nChuck Drago, a former Florida police chief who consults about police use of force, said that once Olango struck the shooting pose, officers would have had to react quickly if he drew an unknown object from his pocket. \n\"An officer doesn't have enough time to wait to determine if that's a gun in his hand,\" Drago said. \"If a person is pointing something at an officer and he believes it's a gun and it is a gun and that officer doesn't have his gun out, that officer will lose that gunfight.\" \nPolice have not named the officers involved, though Wells said both were 21-year veterans and one was Officer Richard Gonsalves. \nGonsalves was demoted last year after allegations that he sexually harassed a lesbian colleague. The City Council had to defend the move to angry citizens who had called for him to be fired. \nChristopher Rice-Wilson, associate director of the civil rights group Alliance San Diego, questioned why one officer felt non-lethal force was appropriate while the other did not. Both officers have been put on administrative leave while the incident is investigated, per department policy. Officials have not revealed which officer fired the shots. \nEl Cajon, a city of 100,000 people about 15 miles northeast of San Diego, has become home for many refugees fleeing Iraq and, more recently, Syria. Advertisement", "external_links": [], "published": "2016-09-30T01:09:00.000+03:00", "crawled": "2016-09-29T21:10:14.188+03:00", "highlightTitle": ""}