{"organizations": [], "uuid": "bb3e8e8ee8b7444e79c255bbca80a6df716e67b6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/694940094001_5129047433001_4e289850-b9ef-49a3-a466-6669dcf69ade.jpg", "site_section": "http://www.foxnews.com/hannity/", "section_title": "Hannity | Sean Hannity | Fox News", "url": "http://www.foxnews.com/transcript/2016/09/16/ari-fleischer-obama-economy-inspiring-change-election/", "country": "IT", "domain_rank": 185, "title": "Ari Fleischer: Obama's economy inspiring 'change' election", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "Ari Fleischer: Obama's economy inspiring 'change' election | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2016-09-16T03:00:00.000+03:00", "replies_count": 0, "uuid": "bb3e8e8ee8b7444e79c255bbca80a6df716e67b6"}, "author": "FoxNews.com", "url": "http://www.foxnews.com/transcript/2016/09/16/ari-fleischer-obama-economy-inspiring-change-election/", "ord_in_thread": 0, "title": "Ari Fleischer: Obama's economy inspiring 'change' election", "locations": [], "entities": {"persons": [{"name": "ari fleischer", "sentiment": "negative"}, {"name": "obama", "sentiment": "negative"}, {"name": "jim crow", "sentiment": "none"}, {"name": "debbie wasserman schultz", "sentiment": "none"}, {"name": "james t. harris", "sentiment": "none"}, {"name": "sid blumenthal", "sentiment": "none"}, {"name": "bush", "sentiment": "none"}, {"name": "austan goolsbee", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "fleischer", "sentiment": "none"}, {"name": "khan", "sentiment": "none"}, {"name": "bill clinton", "sentiment": "none"}, {"name": "george w. bush", "sentiment": "none"}, {"name": "darrell scott", "sentiment": "none"}, {"name": "ari", "sentiment": "none"}, {"name": "john avlon", "sentiment": "none"}, {"name": "bryant", "sentiment": "none"}, {"name": "larry", "sentiment": "none"}, {"name": "conway", "sentiment": "none"}, {"name": "joe biden", "sentiment": "none"}, {"name": "mark penn", "sentiment": "none"}, {"name": "reggie love", "sentiment": "none"}, {"name": "biden", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "donna brazile", "sentiment": "none"}, {"name": "kerrey", "sentiment": "none"}, {"name": "james", "sentiment": "none"}, {"name": "joe biden", "sentiment": "none"}, {"name": "austan goolsbee", "sentiment": "none"}, {"name": "scott", "sentiment": "none"}, {"name": "james harris", "sentiment": "none"}, {"name": "sid vicious", "sentiment": "none"}, {"name": "al gore", "sentiment": "none"}, {"name": "clinton", "sentiment": "none"}, {"name": "baden", "sentiment": "none"}, {"name": "savata", "sentiment": "none"}, {"name": "hillary", "sentiment": "none"}, {"name": "mercedes schlapp", "sentiment": "none"}, {"name": "c.l. bryant", "sentiment": "none"}, {"name": "kellyanne conway", "sentiment": "none"}, {"name": "barack obama", "sentiment": "none"}, {"name": "kellyanne", "sentiment": "none"}, {"name": "darrell scott", "sentiment": "none"}, {"name": "goolsbee", "sentiment": "none"}, {"name": "bob kerrey", "sentiment": "none"}, {"name": "jfk", "sentiment": "none"}, {"name": "linda starr", "sentiment": "none"}, {"name": "james asher", "sentiment": "none"}, {"name": "george w. bush", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "c.l. bryant", "sentiment": "none"}, {"name": "bob", "sentiment": "none"}, {"name": "african-american", "sentiment": "none"}, {"name": "kennedy", "sentiment": "none"}, {"name": "hannity", "sentiment": "none"}, {"name": "scott", "sentiment": "none"}, {"name": "mcclatchey", "sentiment": "none"}, {"name": "patty solis doyle", "sentiment": "none"}, {"name": "reagan", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "putin", "sentiment": "none"}, {"name": "ted kennedy", "sentiment": "none"}, {"name": "mitt romney", "sentiment": "none"}, {"name": "larry elder", "sentiment": "none"}, {"name": "philip burg", "sentiment": "none"}, {"name": "david brock", "sentiment": "none"}, {"name": "sean", "sentiment": "none"}, {"name": "bill", "sentiment": "none"}, {"name": "james t. harris", "sentiment": "none"}, {"name": "tim russert", "sentiment": "none"}, {"name": "clinton", "sentiment": "none"}, {"name": "sid", "sentiment": "none"}, {"name": "morsi", "sentiment": "none"}, {"name": "harris", "sentiment": "none"}, {"name": "c.l.", "sentiment": "none"}, {"name": "schlapp", "sentiment": "none"}, {"name": "austan", "sentiment": "none"}, {"name": "wolf blitzer", "sentiment": "none"}, {"name": "caesar chavez", "sentiment": "none"}, {"name": "kellyanne conway", "sentiment": "none"}, {"name": "chris matthews", "sentiment": "none"}], "locations": [{"name": "united states", "sentiment": "none"}, {"name": "iran", "sentiment": "none"}, {"name": "newsbreak", "sentiment": "none"}, {"name": "indonesia", "sentiment": "none"}, {"name": "north korea", "sentiment": "none"}, {"name": "afghanistan", "sentiment": "none"}, {"name": "penn", "sentiment": "none"}, {"name": "iowa", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}, {"name": "baton rouge", "sentiment": "none"}, {"name": "d.c.", "sentiment": "none"}, {"name": "iraq", "sentiment": "none"}, {"name": "detroit", "sentiment": "none"}, {"name": "kenya", "sentiment": "none"}, {"name": "indiana", "sentiment": "none"}, {"name": "hannity", "sentiment": "none"}, {"name": "georgetown", "sentiment": "none"}, {"name": "wisconsin", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "nevada", "sentiment": "none"}, {"name": "ohio", "sentiment": "none"}, {"name": "atlantic", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "illinois", "sentiment": "none"}, {"name": "hawaii", "sentiment": "none"}, {"name": "libya", "sentiment": "none"}, {"name": "egypt", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}, {"name": "arizona", "sentiment": "none"}, {"name": "north carolina", "sentiment": "none"}, {"name": "michigan", "sentiment": "none"}, {"name": "colorado", "sentiment": "none"}, {"name": "pennsylvania", "sentiment": "none"}, {"name": "flint", "sentiment": "none"}], "organizations": [{"name": "foxnews.com facebook", "sentiment": "negative"}, {"name": "twitter", "sentiment": "negative"}, {"name": "foxnews.com", "sentiment": "none"}, {"name": "fox news", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "congressional hispanic caucus", "sentiment": "none"}, {"name": "national diversity coalition for trump", "sentiment": "none"}, {"name": "dhs", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "cnn", "sentiment": "none"}, {"name": "mercedes", "sentiment": "none"}, {"name": "salem radio network larry elder", "sentiment": "none"}, {"name": "fbi", "sentiment": "none"}, {"name": "msnbc", "sentiment": "none"}, {"name": "isis", "sentiment": "none"}, {"name": "mercedes sclapp", "sentiment": "none"}, {"name": "dnc", "sentiment": "none"}, {"name": "politico", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "united farmworkers", "sentiment": "none"}, {"name": "department of homeland security", "sentiment": "none"}, {"name": "washington post", "sentiment": "none"}, {"name": "mercedes schlapp", "sentiment": "none"}, {"name": "fmr", "sentiment": "none"}, {"name": "state department", "sentiment": "none"}, {"name": "electoral college", "sentiment": "none"}, {"name": "democratic party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Published September 16, 2016 FoxNews.com Facebook 0 Twitter 0 Email 16, And welcome to \"Hannity.\" Donald Trump puts the birther issue to rest while Hillary Clinton ignores the fact that her supporters actually created the controversy in the first place. Now, tonight, we expose the big lie in a \"Hannity\" history lesson.\nNow, earlier today at a press conference in Washington, D.C., Donald Trump declared this whole birther controversy, which Hillary Clinton is desperately trying to revive, is no longer a campaign issue. Take a look.\n(BEGIN VIDEO CLIP)\nDONALD TRUMP (R), PRESIDENTIAL NOMINEE: Hillary Clinton...\n(BOOS)\nTRUMP: ... and her campaign of 2008 started the birther controversy. I finished it! I finished it. You know what I mean. President Barack Obama was born in the United States, period. Now we all want to get back to making America strong and great again. Thank you.\n(CHEERS AND APPLAUSE)\n(END VIDEO CLIP)\nHANNITY: Now, while Donald Trump has moved on from the birther conspiracy, Hillary Clinton and her minions -- they're falsely pushing a narrative that Trump is to blame for starting it. Tonight, we'll set the record straight.\nAccording to The Atlantic, not exactly a conservative publication, back in 2007, Clinton's then chief strategist, Mark Penn -- he wrote a campaign memo about wanting to craft an image of then Senator Barack Obama as, Quote: , \"un-American or other.\" Now, Penn detailed the plan, writing, Quote: , \"His roots to basic American values and culture are at best limited.\nI cannot imagine America electing a president during a time of war who is not at his center fundamentally American in his thinking and in his values.\" He went on to write, \"Let's explicitly own American in our programs, the speeches and the values he doesn't.\"\nThen in 2008, as Obama was ascending past Clinton to claim the Democratic nomination, her supporters -- yes, Hillary Clinton's own supporters -- they circulated an e-mail rumor that Obama was not born in America. The Telegraph reported that e-mail said, Quote: , \"Barack Obama's mother was living in Kenya with his Arab African father late in her pregnancy. She was not allowed to travel by plane then, so Barack Obama was born there, and his mother then took him to Hawaii to register his birth.\"\nAnd after that, John Avlon detailed in his book about the birther moment that a Clinton volunteer named Linda Starr (ph) actually played a very key role in further spreading this rumor. Then in August of that year, attorney Philip Burg (ph) -- he filed a lawsuit in federal court stating that, Quote: , \"Obama carries multiple citizenships, is ineligible to run for the presidency of the United States.\"\nNow, on top of all that, Politifact also points out that Clinton campaign volunteers in Iowa -- well, they worked to spread the rumor that Obama's a Muslim. And Obama reportedly confronted Hillary Clinton about this in an airport tarmac back in 2007.\nThe president's former aide, Reggie Love, detailed this exchange in his book, \"Power Forward,\" writing that Clinton was apologizing to Obama for her campaign raising questions about his past drug use when this happened. Quote: , \"The candidate very respectfully told her the apology was kind, but largely meaningless, given that the e-mails it was rumored that her camp had been sending out labeling him a Muslim.\" Now, before he could finish his sentence, she exploded on Obama, and in a matter of seconds, she went from composed to furious. Now, it had not been Obama's intention to upset her, but he wasn't going to play the fool, either.\nNow, would you think the heated exchange would have set Clinton straight, but of course, it didn't. On \"60 Minutes\" in 2008, when she was given the opportunity to put an end to the Muslim rumor, this is what she said.\n(BEGIN VIDEO CLIP)\nUNIDENTIFIED MALE: You don't believe that Senator Obama is a Muslim.\nCLINTON: Of course not. I mean, that's -- you know, there is no basis for that. You know, I take him on the basis of what he says. And you know, there isn't any reason to doubt that.\nUNIDENTIFIED MALE: You said you take Senator Obama at his word that he's a Muslim.\nCLINTON: No.\nUNIDENTIFIED MALE: You don't believe that...\nCLINTON: No. No.\n(CROSSTALK)\nUNIDENTIFIED MALE: ... or implying (INAUDIBLE)\nCLINTON: No. No, there's nothing to base that on, as far as I know.\n(END VIDEO CLIP)\nHANNITY: I guess not. Nothing to base it on.\nHere with reaction, Donald Trump's campaign manager, Kellyanne Conway. What bothered me is the press coverage of this. I read The Washington Post-- Donald Trump said that Hillary started it, but that's not true. Well, the reality is, when you look at the facts, it really is true.\nKELLYANNE CONWAY, TRUMP CAMPAIGN MANAGER: And Sean, in today's day and age, with Twitter and Facebook, you know, our campaign is constantly being held to account for every tweet, every side glance, everything people we've never met and we don't know and aren't associated with our campaign. We're always asked to own that.\nYet the Clinton campaign will not own the fact that, according to Patty Solis Doyle, in an exchange, Twitter, exchange yesterday with Ari Fleischer and also on Wolf Blitzer's show later, said, yes, it was some -- some guy in Iowa. I don't know if he was a volunteer (INAUDIBLE) what he was doing.\nAnd we got rid of him when we knew.\nBut he (sic) admitted that it was somebody connected with the campaign.\nAnd so I think the media is very disappointed here because they were expecting Hillary Clinton to use this in the debate. It is now off the table. You see Mr. Trump has been focusing on jobs and prosperity and child care...\nHANNITY: Well, I think it was actually a stroke of genius...\n(CROSSTALK)\nHANNITY: ... if you watch the networks, he's going to talk about the birther issue!\nCONWAY: (INAUDIBLE) half an hour of coverage of the veterans, who by the way, deserve a half an hour of coverage.\nHANNITY: They did.\nCONWAY: So shame on the media outlets now saying, Oh, my God, they forced us to give a half an hour of coverage to generals and -- and Mr. Savata (ph), a Mexican-American...\nHANNITY: And Medal of Honor winners.\nCONWAY: And Medal of Honor winners, recipients. And so they just didn't know...\nHANNITY: Recipients...\n(CROSSTALK)\nCONWAY: They just didn't know what to do with this, Sean. And look, the fact is very clear. Mr. Trump has put this to rest. He stated very clearly that he's the one who got closure to this issue. He's not the one who started it. You just laid out in five minutes for everyone to see where it got started, how it was pushed. People need to go back and remember...\nHANNITY: It even goes further than this.\nCONWAY: ... just how nasty and vicious the 2008 campaign was.\nCONWAY: James Asher (ph), who was the former Washington bureau chief for McClatchey -- he actually tweeted out, \"CNN says the Hillary team never in 2008 raised Obama's birth in Kenya. Who is closer to Hillary than Sid Blumenthal\"...\nCONWAY: Sid Blumenthal!\nHANNITY: ... \"who told me face to face?\" Wow! That was a pretty powerful indictment. And good for him for telling the truth.\nHANNITY: His nickname is Vicious Sid, as you know.\nHANNITY: Yes, Sid Vicious.\nCONWAY: So I think that's completely plausible. But this is what's going to happen now. If you deny that your camp had nothing to do with it, chances are that other people are going to come forward and say, Well, wait a second. Somebody was trying to push this over the transom in 2008.\nHANNITY: Listen, there's nobody that has been obsessed with the birther issue more than Chris Matthews. Let's go back to Chris Matthews. I know, thrill up his leg, the whole bit. But he said something that was relevant at the time, in 2007, blaming Hillary. Watch this.\n(BEGIN VIDEO CLIP)\nUNIDENTIFIED MALE: I've watched the blogs try to say that you can't trust him because he spent a little bit of time in a secular madrassa.\nCHRIS MATTHEWS, MSNBC: So is Hillary Clinton backer Bob Kerrey pretending to sell Obama, but clearly putting the shiv in? Here's Hillary Clinton defending him and Bob Kerrey.\n\"I think the remarks were very positive. I know Bob. He was being very complimentary of Senator Obama. He was making a point that Senator Obama makes himself all the time, that because of his upbringing and his heritage, it's in his view -- in his view, catch that line -- very well suited to communicate with the rest of the world. And he has just said himself that he wants to have a particular outreach to the Islamic world. So I think Secretary Kerrey was being, you know, very generous in what he said.\"\nBut didn't Hillary dump on Obama a few days ago for playing up his Indonesian roots? So what's she up to here? Is she pushing how great he is for having been (INAUDIBLE) in Indonesia or what, or simply reminding everybody about his background, his Islamic background?\n(END VIDEO CLIP)\nHANNITY: Which, by the way, goes right to Mark Penn's memo, doesn't it.\nCONWAY: It does. And I just want to tell everybody who Mark Penn was. He's the chief strategist pollster, long-time Bill and Hillary Clinton confidant. It wasn't like some summer intern who just didn't -- you know, just made a mistake.\nIf you look at his memo, he went into great detail not just with what he thought were the facts, but how to strategically use them to discredit Barack Obama.\nAlso, in the original \"Game Change\" book after the 2008 race, they clearly mentioned that Mark Penn totally missed the Obama rise, and that at a Georgetown dinner party at his home, he -- someone -- a woman said, Hey, that senator from Illinois was really impressive at the 2004 convention. Do you think he'd actually run? And Mark Penn, one of his wrist (ph) flickers (ph), famously said, Flash in the pan, flash in the pan.\nSo they missed the Obama (INAUDIBLE) all around. Feeling desperate at having missed it, they went and they tried to discredit him.\nBut remember, as Donald Trump said today, Sean, it is he who had to put an end to this and it's he who I think took the stage today in...\nHANNITY: It was a stroke of genius today.\nCONWAY: ... his own terms, on his own timeline, as he always does.\nHANNITY: One sentence -- Now let's get back to making America great.\nCONWAY: And I just want to say something else. You know, I'm old enough to remember a week ago Thursday, when Hillary Clinton's campaign said she was going to start being aspirational and (INAUDIBLE) and make sure the voters know what's in her heart.\nOh, my goodness! She had four days rest and rejuvenation, and she came out with the same negative messages. She does not have a positive, affirmative message. It's always an anti-Trump birther racist sexist message. They're not going to win on that message. You see the polls. They're not winning.\nHANNITY: Well, and there was a Politico article that came out -- Trump has cracked the Electoral College lock.\nCONWAY: That's right.\nHANNITY: You talk about the polls. He's up in very important states, Florida, Ohio, within just 3 points in Wisconsin and Michigan, up by 8 points in Iowa. He's now up in Colorado by 2 and he's also up in Nevada.\nCONWAY: Pennsylvania looks good.\nHANNITY: Pennsylvania looking...\nCONWAY: North Carolina.\nHANNITY: So they're saying that he's cracked the Electoral College lock, and now you have one of Hillary's biggest supporters and propagandists, David Brock, offering a cash reward for dirt on Donald Trump. I thought she was above all of this. Apparently not, when you're desperate?\nCONWAY: And by the way, where is the Democratic Party of yore that was very inspirational, uplifting, tried to speak to the working class? You had Barack Obama, Bill Clinton, JFK always talking about hope and change and the man from Hope and aspirational, forward-looking. She's out there every day -- she gave a speech yesterday and a speech today, and it was the same message, that, you know, Don't vote for Donald Trump, and here's why.\nDonald Trump is out there. He's very tough. He's a natural leader. He's there on his own terms. He's got excellent instincts. The man is brilliant and savvy. Don't underestimate him in the debates at your peril. However, he is also showing -- he's also being uplifting and aspirational by telling people, Your pocketbook, your prosperity and your safety will be much better...\nHANNITY: Economic speech was as close to Reagan as any politician...\nCONWAY: At least he has one! You know what the -- you know what the Hillary people are saying? Look at our Web site.\nHANNITY: Yes.\nCONWAY: I mean, where are the policy speeches? Where's the uplifting, aspirational...\n(CROSSTALK)\nHANNITY: I don't think she has the energy or the stamina to do it.\nCONWAY: ... look at her Web site. Are we going to run this election based on the Web sites?\nHANNITY: Let me ask you a very important question. There are three debates that are not far away now, and I think Hillary can't talk about Obama's economic record, which she says she will continue. I don't think she can talk about Libya, Iran, Afghanistan, Iraq, Morsi, which she supported in Egypt, or China, North Korea or Putin. So I guess her option is -- she can't talk about honesty...\nCONWAY: ObamaCare.\nHANNITY: ... ObamaCare, honestly and trustworthiness. So the only option that remains on the table, from my perspective, is to follow through and try and aggravate, agitate, upset, hurt and pop the bubble of Donald Trump and anger him in the debates. Is he prepared and will he be prepared for those attacks, like water off a duck's back? Is he ready for that?\nCONWAY: He's ready for that, and we actually welcome that.\nHANNITY: He knows it's coming.\nCONWAY: Oh, absolutely, he knows it's coming. He's not afraid of Hillary Clinton and...\nHANNITY: I didn't mean it that way, but I mean...\n(CROSSTALK)\nHANNITY: She wants (ph) in the bubble like Alka-Seltzer and water.\nCONWAY: No, I know. And Sean, you're right. I'm sure that's part of their strategy over at the Clinton campaign. However, who seems more rattled, who seems more off script...\nHANNITY: That's a great question.\nCONWAY: ... off-message these days? Who's losing in the polls a big gain that they had just a month ago?\nHANNITY: You're up 6 this week! Do you realize you are up 6?\nCONWAY: Yes, and...\nHANNITY: There's been a 15-point swing in this campaign!\nCONWAY: Yes, but that's all Donald Trump. He goes out and he delivers his message directly to the voters. That's what voters deserve and respect.\nAnd look, I think -- I think Secretary Clinton also has a risk of perhaps going a little bit too far against Donald Trump because you saw her at the commander-in-chief forum when he wasn't sitting next to her, very defensive, a bit off-kilter, a little bit angry.\nShe got seven questions. Donald Trump got...\nHANNITY: Thirteen.\nCONWAY: ... sixteen -- thirteen...\nHANNITY: Sixteen? I thought it was 13.\nCONWAY: Why? Well, it was many more than her, but why? Because her answers are so lengthy and lawyerly.\nHANNITY: She's running out the clock.\nCONWAY: His are very concise and confident. No, well, she's also got to explain. You don't know if she answered the question because it's always the chutes and ladders and explanations and...\n(LAUGHTER)\nCONWAY: ... conjugating the...\nHANNITY: Chutes and ladders! That's...\nCONWAY: That's not going to help. You know...\nHANNITY: You're aging us here, OK?\nCONWAY: Debates are -- debates are -- debates are about moments and they're about facts and figures. The facts and figures are on our side. She can't go up there and defend \"Obama care\" and...\nHANNITY: Well, said.\nCONWAY: ... all the exchanges closing. She can't go there and defend her foreign policy record, and she can't go there and defend the birth and growth of ISIS in just the last three years alone. She can't go up there and defend...\nHANNITY: He looks like he's having fun, Kellyanne.\nCONWAY: He's having a great time. And that matters to people. By the way, I told him when I took this job, You're running against the most joyless candidate in presidential political history.\nHANNITY: Yes.\nCONWAY: And so let's see who she is not and what she will never be, and let's go do it and be it. And he is all of that. He's having a great time. You know who feels and absorbs it? The people. These crowds -- they love...\nHANNITY: (INAUDIBLE)\nCONWAY: ... being around him because they feel like they're part of his movement and he's there for them. (INAUDIBLE) tremendous sacrifice to run for president. People in politics, it's status, power, money, fame. He had all of that. It's a huge sacrifice...\nHANNITY: Kellyanne...\nCONWAY: ... for him and his family.\nHANNITY: ... 53 days to go.\nCONWAY: We're saddled up. We're ready.\nHANNITY: All right, thank you...\nCONWAY: Thank you.\nHANNITY: ... as always.\nAnd coming up, we have highlights from Donald Trump's rally tonight in Florida.\nAlso later, Hillary Clinton has a disastrous week. Donald Trump continues surging in the polls. Ari Fleischer, Austan Goolsbee -- they'll weigh in.\nPlus, which candidate do you believe is better for minority voters? We'll give you the facts as our panel weighs in straight ahead.\n(COMMERCIAL BREAK)\n(NEWSBREAK)\nHANNITY: Welcome back. Donald Trump continues his non-stop campaigning. He had a rally earlier tonight, this time in Florida. Let's take a look.\n So new polls have just come in, and we're leading in many of the battleground states all over the country...\n(CHEERS AND APPLAUSE)\nTRUMP: ... including being 4 points up in a certain state known as Florida.\n(CHEERS AND APPLAUSE)\nTRUMP: Hey, look, November 8th, you go and vote, we're winning. I'll tell you what. If you vote, we're winning. There's no way they can beat us.\n(CHEERS AND APPLAUSE)\nTRUMP: There's no way she can beat us because her people have no enthusiasm whatsoever. They're not going to turn out. They don't have the enthusiasm. Who could possibly have enthusiasm? What are you getting? You turn out, we're winning big league.\nAnd I think -- and they're all saying the Trump people are going to turn out. We have a movement like they have never, ever seen in this country.\n(CHEERS AND APPLAUSE)\nTRUMP: And they say in terms of enthusiasm, they have never had polling higher. So I think -- I have very little doubt, turnout, we're going to have a tremendous November 8th. Probably will say November 8th plus the next four years and then four years after that, OK?\n(CHEERS AND APPLAUSE)\n(END VIDEO CLIP)\nHANNITY: Joining us now, radio talk show host C.L. Bryant -- I'm a regular guest on his program -- and the CEO for National Diversity -- the National Diversity Coalition for Trump -- that's the Reverend Darrell Scott. Guys, good to see you both.\nUNIDENTIFIED MALE: Thank you, Sean.\nHANNITY: Reverend Scott, let me begin with you. You know, you watch what's happening. You see this outreach to the black community, and you keep seeing demographically that the black community is responding. Hillary keeps playing the race card. It keeps backfiring!\nWhat's going on in terms of the black vote, if you can break it down demographically for us?\nREV. DARRELL SCOTT, NATIONAL DIVERSITY COALITION FOR TRUMP: Well, I talked to a delivery man today that came to my house. He was a young black guy, mid to late 20s. And I asked him, I said, Who do you like, Trump or do you like Hillary? And he said something I thought was very insightful. He said, Hillary, something's fishy about that.\n(LAUGHTER)\nHANNITY: Yes.\nSCOTT: There's something fishy there. I just don't trust her. She'll say anything to get my vote. So he said, I like Trump because Trump keeps it real. And that's one thing I think that resonates with the black community, with the black voters, the fact that Trump does speak realistically, and he doesn't seem to be pandering or groveling or sniveling to get black votes.\nHANNITY: We'll get to this later, we got a tape of Hillary -- you know, I don't feel no ways tired. I've come too far. You know, this happens a lot when Democrats go before predominantly black audiences. They change their pitch, their tone, their cadence.\nC.L., what are you hearing down in Baton Rouge where you are in the black community?\nREV. C.L. BRYANT, RADIO TALK SHOW HOST: I believe that the prime example for young entrepreneurship, whether you're white or black, is Donald Trump, someone who has made money in the free market system and someone who understands capitalism.\nWhen we want to address the work ethic of an American who has made his own money, you have to look very closely at a person like Donald Trump. And that should play very well...\nHANNITY: But you know -- but here's the thing...\nBRYANT: ... to black young people.\nHANNITY: Here's -- here are the statistics I give out every night, and it is profound that black Americans are so disproportionately impacted by Obama's economic record that Hillary wants to continue.\nYou've got what, the worst labor participation rate since the '70s, 95 million Americans out of the labor force. You got 12 million more Americans on food stamps, a 58 percent increase in the black community. You got 8 million more Americans in poverty, 20 percent increase of black Americans out of the labor force, 51-year low, home ownership rate in America, worst recovery since the '40s, a doubling of our national debt. One in five American families, Pastor Scott, don't have a single family member working.\nTell me why people are going to buy in to the same lies and promises they were given eight years ago!\nSCOTT: Well, I don't believe that they are, Sean. When Donald Trump stated, What do you have to lose, it rang a bell in the black community. It caused, you know, a number of African-Americans to become more introspective and contemplative, and then they examined themselves and said, You know what? That guy is right.\nAnd so now the Dems are trying to play on, you know, the emotions and the sensitivities of the black community by arousing their anger against Trump. But when they examine and when they think through what he has said, they're right. What do we have to lose? It can't get too much worse than it already is.\nHe wants to make jobs. He wants to rebuild our inner cities. What's wrong with that? Let's give this guy a shot!\nHANNITY: And by the way, one of the worst things that I think this country and our government has done to black Americans, especially inner city schools, is they have put them in inferior, broken-down, dilapidated, at best, institutionalized mediocrity, C.L. Bryant. And that is -- we have taken all of that natural God-given talent and we're wasting it!\nBADEN: And for that reason, Sean, we should be very grateful that the age of Obama is finally over. Now black people have a need to come out of their political closets that they have been in for the last eight years because of the emotional games that have been played on them by progressive liberals. In fact, they have been played for the last 60 years.\nAnd so now there's a chance to break free of those shackles and actually take on personal responsibility for your own pocketbook, and Donald Trump is, in fact, the prime example of someone who can show the way to all of us back to the prosperity and the greatness that this country is about!\nHANNITY: Got to hope. Fifty-three days to go, guys. Good to see you both. Appreciate it.\nSCOTT: God bless you.\nHANNITY: And coming up -- Donald Trump keeps rising in the polls, Hillary Clinton keeps sinking. Well, he's now ahead of her in a number of very important key swing states. How nervous is the Clinton campaign tonight?\nAlso coming up...\n(BEGIN VIDEO CLIP)\nTRUMP: Flint will come back. Most importantly, we'll bring jobs back to Flint.\nHILLARY CLINTON, D-PRESIDENTIAL NOMINEE: Yes, indeed, black girl magic is real!\n(END VIDEO CLIP)\nHANNITY: What is black girl magic? What does that mean? Donald Trump, Hillary Clinton both pushing for the African-American vote. But why do Democrats -- what have they done for minorities, and why do they always seem to change their tone, their pitch, their cadence? We'll ask those important questions Welcome back to \"Hannity.\" It's been a rough week for the Hillary Clinton campaign, and now Democrats -- they're getting nervous, and they have good reason to. Donald Trump keeps climbing in the polls, and according to the RealClearPolitics average, out of the all-important swing state of Ohio in a two-way race, Donald Trump is now leading Clinton 44.7 percent to 43.7. And according to the RealClearPolitics average in Florida, Trump also leads 45.1 percent to Clinton's 44.4.\nHere with reaction, former White House press secretary Ari Fleischer -- he, of course, worked for George W. Bush -- and former Obama economic adviser. He's in part responsible for the worst recovery since the '40s, the lowest home ownership rate in 41 years, the lowest labor participation rate since the '70s, and 12 million more Americans on food stamps and 8 million more in poverty.\nWelcome, Austan. How are you?\nAUSTAN GOOLSBEE, FORMER OBAMA ECONOMIC ADVISER: You lost me at hello, Sean.\n(LAUGHTER)\nHANNITY: It's all true. But I do believe, Ari, that those numbers will mean something to the voters this year. Eight years of Obama followed by Clinton saying she's going to continue the same madness I think will impact a lot of people. It hits their pocketbook.\nARI FLEISCHER, FMR. GEORGE W. BUSH PRESS SECRETARY: No question, Sean. The most important factor is that most Americans think the economy is on the wrong track, the country's moving in the wrong direction.\nHANNITY: By 37 points.\nFLEISCHER: And that's what signals a change election. So on the one hand, the Democrats and Hillary are benefiting from the demographic changes in America. On the other hand, Republicans are benefiting from the argument that we need to go in a different direction from President Obama. Even in a week where we just learned that poverty did drop and income rose for the first time, the greatest amount in history, but it's still way below the levels it was in 2007. We still haven't gotten back to where we were before the Great Recession began.\nHANNITY: Yes, I think that's -- and on top of it, he's accumulated more debt than every single other president before him combined. And I remember, Austan, when he was running, your guy Obama, that he said $9 trillion in debt -- you know, we're taking a credit card to the bank of China in the name of our children, and we keep pushing up the debt. That's irresponsible. That's unpatriotic. Well, he just...\n(CROSSTALK)\nGOOLSBEE: To do that in a boom, you're right.\nHANNITY: Well, he just added $9 trillion himself. So is he irresponsible and unpatriotic...\n(CROSSTALK)\nGOOLSBEE: No. That happened in a recession...\nHANNITY: Oh, it's Bush's fault. OK.\nGOOLSBEE: ... when he did it. As you know, Sean, he said that he would cut the deficit in half by the end of his first term, which he did. Now, I was going to grant you that it was not a good week for Hillary Clinton, it was a good week for Donald Trump and that there are -- not me, but there are people who did get nervous from that.\nBut I think when Ari raises the fact that if you look at incomes, they literally rose the most last year that they ever have for the middle class in all the years that we have the data, I think you got to be a little circumspect because...\nHANNITY: Well, maybe that'll make...\n(CROSSTALK)\nGOOLSBEE: ... while people are saying we're on the wrong track, they're also...\nHANNITY: That's not -- I didn't hear Ari say that!\nGOOLSBEE: Obama's popularity is going way up...\nHANNITY: Ari...\nGOOLSBEE: ... and that's going to spill over.\nHANNITY: Do you remember a president that went around the country saying that you're going to keep your doctor, keep your plan and on average save $2,500 per family per year? Do you remember that?\nFLEISCHER: Absolutely.\nHANNITY: Since Obama has been president --\nFLEISCHER: These are the reasons people think we're on the wrong track and they have this unsettled feeling. But let me get back to this core economic issue. What's going on now, the president's popularity is rising, and that could be a significant factor, although it's very late here. But if the Democrats continue to score runs in the bottom of the ninth, the problem is they're still down by too many runs. That's the verdict on the Obama years, that's the verdict that's heading into this election, why it seems to be a change election. So that late-breaking data is probably not going to do enough good to turn the mood of the country around.\nNow, the Trump-Hillary race is totally different because so long as Donald Trump can focus on Hillary Clinton and not on the Khan family and not on a judge from Indiana, he's got a real chance. This is what he has to keep doing.\nHANNITY: And he's been doing that. And I would even argue today when he brought up the issue of birtherism, it was one line and it was done, and it took the issue away from Hillary.\nAustan, I know you love your president. I really do. I know you really believe the things you say. But he's the only president in the history of the country not to have three percent GDP growth in a single year of his presidency. Does that not say anything to do?\nGOOLSBEE: Sean, I would say two things. One we've been through the story of the tortoise and the hare. So a slow recovery at the beginning it is no longer the slowest recovery. We now have the longest string of private sector job creation ever. And Donald Trump's problem --\nHANNITY: You could say the unemployment numbers are down, but we don't count the chronically unemployed.\nGOOLSBEE: Look, Donald Trump's problems and advantages are two sides of the same coin. I think Ari is right that there is a lot of hunger for change, and that's helping Donald Trump. The thing hurting Donald Trump is that as soon as a focus gets off of Hillary Clinton and on to what Donald Trump himself is proposing, his tax plan was roundly condemned by people on both sides of the aisle, and you have Republican economists saying it would lead to a recession in the first year of his presidency. As long as he talks about his ideas, he's going to lose.\nHANNITY: OK, we'll see. I'll take that bet. You're going to regret.\nComing up, both candidates are trying to secure the African-American vote, but what have the Democrats really done? Have they helped black America and Hispanic America? I don't think so and the numbers prove it. Larry Elder, James Harris, Mercedes Schlapp, will weigh in on that tonight on\n\"Hannity.\"\n(COMMERCIAL BREAK)\nHANNITY: Welcome back to \"Hannity.\" Now this week both Donald Trump and Hillary Clinton continue to reach out to African-American voters. First on Wednesday Donald Trump, he visited a predominantly black church in Flint, Michigan, and here's part of what he said.\n(BEGIN VIDEO CLIP)\nTRUMP: It used to be cars were made in Flint and you couldn't drink the water in Mexico. Now the cars are made in Mexico and you can't drink the water in Flint. That's not good.\nIt will be fixed quickly and effectively and Flint will come back. Most importantly we'll bring jobs back to Flint.\n(END VIDEO CLIP)\nHANNITY: Now while Donald Trump, he vowed to tackle serious issues important to the black community, Hillary Clinton, she took time to pander to African-American voters at a luncheon. This was earlier today. Take a look.\n(BEGIN VIDEO CLIP)\nCLINTON: So many of you who have been on the front lines, everyone associated with the black women's agenda, I'm thrilled to be with you, I'm thrilled to be associated with you.\nYou are proof that yes indeed black girl magic is real.\nBlack women deserve more than a seat at the table. It's past time you had a fair chance to run the meeting.\n(END VIDEO CLIP)\nHANNITY: Joining us now, nationally syndicated radio host for Salem Radio Network Larry Elder, talk show host James T. Harris, and FOX News contributor Mercedes Schlapp. Well, at least, Larry, she didn't go into \"I don't feels no ways tired, I's come too far.\"\n(LAUGHTER)\nHANNITY: So we've made some improvement. It's not like Al Gore screaming Republicans don't even want to count you in the census. Why do Democrats do that? Why do they change their pitch, tone, and cadence all of the time.\nLARRY ELDER, SALEM RADIO NATIONAL SYNDICATED HOST: And don't forget Joe Biden talking to a group of black people about how Mitt Romney does not want additional regulations on Wall Street, \"unchain Wall Street, going to put you all back in chains.\" Of course it's pandering to tell these black women they can't run meetings for crying out loud. There are black women running meetings all over the pace. It is absurd. That's their mantra, raising the remains of America, we wear the white hat. We ride the White House. Those guys over there, they're twirling their mustaches and they want to drag you back, as Debbie Wasserman Schultz once said, to Jim Crow. It is absurd. They ought to just stop it, cut the crap. And Obama could do something about that by suggesting maybe, just maybe, people can have differences of opinion without calling the other side a bigot.\nHANNITY: I think that's well said. James T. Harris, let me play for you Hillary Clinton's southern accent. And let me play telling a black radio talk show host that she always carries hot sauce, and maybe you can put this in context why she acts this way in front of predominantly black audiences. Let's play it.\n(BEGIN VIDEO CLIP)\nCLINTON: I don't feel no ways tired. I come too far from where I started from.\n(APPLAUSE)\nCLINTON: Nobody told me that the road would be easy.\nUNIDENTIFIED FEMALE: What's something you always carry with you?\nCLINTON: Hot sauce.\nUNIDENTIFIED MALE: Really?\nCLINTON: Yes, yes.\nUNIDENTIFIED MALE: Really?\n(LAUGHTER)\nUNIDENTIFIED MALE: Hot sauce in my bag swag.\nCLINTON: Hot sauce.\nUNIDENTIFIED MALE: Really?\nCLINTON: Yes.\nUNIDENTIFIED MALE: I want you to know, people are going to see this and say, OK, she's pandering to black people.\n(LAUGHTER)\nCLINTON: OK. Is it working?\n(LAUGHTER)\nCLINTON: No seriously, hot sauce. I've been eating a lot of hot sauce.\n(END VIDEO CLIP)\nHANNITY: James, one other thing I want to add to that. You've got Biden saying Obama, he's clean and he's articulate. I'm like, OK. And then you've got Bill Clinton, this was from The New Yorker back in 2012, Tim Russert told me according to sources Bill Clinton in an effort to secure an endorsement from Hillary Clinton from Ted Kennedy said to Kennedy, a few years ago this guy would have been carrying our bags. Ouch.\nJAMES T. HARRIS, RADIO TALK SHOW HOST: We have that, and now we have the \"black girl magic.\" I have to tell you, Sean, I called my sister today because I didn't know what black girl magic was.\n(LAUGHTER)\nHARRIS: But I bet Hillary Clinton, I bet she hopes that Donna Brazile has a lot of it because since she's been put over at the DNC, we've watched Hillary Clinton's poll numbers drop. This is just another in a long line of pandering, and it's further evidence that Democrats are -- there's a racial ting that runs through this, and they're not comfortable with their own message, so they have to find a way to pander to people to show that they are sort of a part of them or they can get along with them. I don't understand.\nHANNITY: Isn't it insulting? And Donald Trump, Mercedes, I don't know why Democrats get the pass. Let's play the Biden tape to make another example out of this.\n(BEGIN VIDEO CLIP)\nJOE BIDEN, D-VICE PRESIDENT: You got the first sort of mainstream African-American who is articulate and bright and clean, a nice looking guy. I mean, that's a story.\n(END VIDEO CLIP)\nHANNITY: He's a mainstream African-American, the first one, and he's articulate and he's actually bright.\nSCHLAPP: That's not racist, right?\nHANNITY: And he's clean. By the way, he's clean. Wow.\nSCHLAPP: You know what's really insulting to me, Sean, is the fact that for 40 or 50 years the Democrats have used the same exact formula of expanding the welfare system in hopes that that in any way can save the African-American community and inner cities. And what have we seen?\nHigher poverty rates amongst African-Americans, more African-Americans on foot stamps, more unemployment for African-Americans. You look at Detroit, you look at these inner cities, and let me tell you, the families have suffered. The African-American children have suffered. And then you have Hillary Clinton talking about hot sauce? That's what bothers me so much about this.\nHANNITY: I agree.\nSCHLAPP: What we need to be talking about is economic solutions. Also pro-family policies, because when you look at the African-American children, you're talking about 72 percent of these children have single moms. They're not being raised in a family environment necessarily, which leads to crime and an inability to have education attainment. These are the issues we should be talking about, Sean.\nHANNITY: Guys, stay right there. We'll come back with the panel. More right after this break. And also coming up next --\n(BEGIN VIDEO CLIP)\nCLINTON: We're going to end family detention, close private detention facilities, and stop the raids and roundups.\n(APPLAUSE)\n(END VIDEO CLIP)\nHANNITY: Hillary Clinton vowing to close detention centers if elected president, this as sources now telling FOX News tonight that Obama's DHS is now sitting on a very damning report that reveals the real number of illegals that actually cross our borders. What are they trying to hide? We'll tell you that next.\n(COMMERCIAL BREAK)\nHANNITY: Welcome back to \"Hannity.\" Sources have told FoxNews.com that the Department of Homeland Security is sitting on a report that reveals that the actual number of illegals crossing the border while this report was done almost a year ago. Why aren't they telling us? What are they trying to hide? The DHS finally responded in part by saying \"any suggestion the DHS is delaying release of a report on new border enforcement measures for political reasons is false. This report could impact the 2016 election and bolster Donald Trump's border proposal. Last night in a speech to the Congressional Hispanic Caucus, Hillary Clinton discussed what her immigration policy would be. Listen to this.\n(BEGIN VIDEO CLIP)\nCLINTON: We need a simple, straightforward system where other people with sympathetic cases who are contributing to their communities can make their case and be eligible for deferred action, too. Like people who experience and report extreme labor abuses.\nAnd we won't stop there. We're going to end family detention, close private detention facilities, and stop the raids and roundups.\n(END VIDEO CLIP)\nHANNITY: Now, we continue now with Larry Elder, James T. Harris, Mercedes Sclapp. Mercedes, Hispanics seem to think, they're not seemingly going along with the idea that, well, we support illegal immigration because we're Hispanic. And if you look at numbers and demographic breakdowns, Trump is doing better with the black community, Hispanic community than past Republican presidential candidates. Why?\nSCHLAPP: First of all, I think for Hispanic immigration has never been the top issue. You look at polls and clearly the economy and actually terrorism are the top issues. Immigration is important for the Hispanic community, Sean. Obviously, it's a way, the tone you talk about in immigration policy.\nWith that being said, Hispanics and Republican Hispanics in particular want border security. They think that is important. They do agree there should be a pathway for those who have been here past 20 years, 10 years, five yards. The problem becomes is the way Hillary Clinton is presenting this is the fact that she is moving forward a radical immigration plan, which is she literally is basically saying all of you out there, come over here because I'm going to let you just stay if you come here illegally. What does that mean is that we're not enforcing our immigration laws. That becomes a big problem. That is a signal you're sending to the rest of the world. It's why you have to wonder why is DHS not releasing this report and allowing to figure out what are the true numbers of individuals crossing here illegally.\nHANNITY: Larry, aren't Democrats playing long ball here. They look at illegal immigration and refugees as potential Democratic voters. So they want as many as possible. They want to spread them around the country as Obama has been doing because they want a new electoral map drawn with new immigrations. True or false?\nELDER: I couldn't agree more. I've said if four out of five of these new citizens would vote Republican, the border would be shut tighter than a clam's behind.\n(LAUGHTER)\nELDER: They know that eventually these are going to be Democratic voters. And what Donald Trump has said the other day is that his agenda is jobs, jobs, jobs. And Caesar Chavez, the founder of the United Farmworkers, he was not a civil rights leader. He was a union leader, and he opposed illegal immigration because he knew it put downward pressure on jobs and on wages for the people that he cared about.\nHANNITY: I think this is a very important point. James, if we build the wall, it's in our best national security interest because radical Islamists can't cross our border, that's what I would worry about first and foremost. But more importantly, we have 95 million Americans out of work. In the Obama years we have had a 58 percent increase of black Americans that are on food stamps and a 20 percent increase in black Americans not participating in the labor force. Obama's policies have not been good for black America. We've chronicled this a lot in the program.\nBut if you allow 11 million illegal immigrants in, they're competing with 95 million Americans that don't have jobs and they're driving down wages. So I would think this is an important issue for the black community. Is it?\nHARRIS: Well, it's not just an important issue for the black community. It's an important issue for everyone. And, you know, it shouldn't be a surprise to us that DHS is not giving out this information. We have seen the FBI doesn't give out information if it is going to hurt Hillary. We've seen that the State Department doesn't give out information if it's going to hurt Hillary. So if something is going to help Trump, they're certainly going to sit on it.\nBut Hillary and the Democrats are pandering to members of the Hispanic community in the same way they're pandering to Americans of African descent. And your guess is right. This is not the number one issue in Arizona where I'm from. The issue is security. And we're for legal immigration. No one has a problem with that. But the problem is that the borders are wide open and we don't know who is coming across. Border patrol is patrolling 70 miles from the border and they only raiding and rounding up that's going on, Sean, are with ranchers by the cartels that are operating on our side of the border.\nHANNITY: All right, guys, thanks for being with us. Appreciate it.\nAnd when we come back, we need your help, a very important \"Question of the Day\" is straight ahead.\n(COMMERCIAL BREAK)\nHANNITY: Time for our \"Question of the Day\" tonight. So who do you think won the week? I don't think it was close. Look at the polls. Trump or Clinton? We always want to hear from you. Go to Twitter, let us know what you think.\nThat's all the time we have left this evening. When we're back here Monday, only 50 days to go until Election Day. Thanks for being with us. We'll see you back here on Monday night.\nEND\n ", "external_links": [], "published": "2016-09-16T03:00:00.000+03:00", "crawled": "2016-09-17T18:38:51.166+03:00", "highlightTitle": ""}