{"organizations": [], "uuid": "c9eec68056f866bc8896d33768dda0cd1fbdf7de", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/media2.foxnews.com/BrightCove/694940094001/2015/12/19/0/0/694940094001_4668519365001_1a0ca66e-4c6f-4510-b007-02a28ffeb13e.jpg?ve=1", "site_section": "http://feeds.foxnews.com/foxnews/national", "section_title": "FOX News", "url": "http://www.foxnews.com/us/2016/09/08/immigrants-preying-on-americans-with-false-tales-abuse-to-stay-in-us-experts-say.html", "country": "CH", "domain_rank": 185, "title": "Immigrants preying on Americans with false tales of abuse to stay in US, experts say", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "Immigrants preying on Americans with false tales of abuse to stay in US, experts say", "spam_score": 0.0, "site_type": "news", "published": "2016-09-08T21:16:00.000+03:00", "replies_count": 0, "uuid": "c9eec68056f866bc8896d33768dda0cd1fbdf7de"}, "author": "Malia Zimmerman", "url": "http://www.foxnews.com/us/2016/09/08/immigrants-preying-on-americans-with-false-tales-abuse-to-stay-in-us-experts-say.html", "ord_in_thread": 0, "title": "Immigrants preying on Americans with false tales of abuse to stay in US, experts say", "locations": [], "entities": {"persons": [{"name": "renee sun", "sentiment": "negative"}, {"name": "elena maria lopez", "sentiment": "none"}, {"name": "vaughan", "sentiment": "none"}, {"name": "michael steinberg", "sentiment": "none"}, {"name": "dani bennett", "sentiment": "none"}, {"name": "lopez", "sentiment": "none"}, {"name": "sampson", "sentiment": "none"}, {"name": "sun", "sentiment": "none"}, {"name": "bennett", "sentiment": "none"}, {"name": "john sampson", "sentiment": "none"}, {"name": "claude arnold", "sentiment": "none"}, {"name": "arnold", "sentiment": "none"}, {"name": "steinberg", "sentiment": "none"}, {"name": "jessica vaughan", "sentiment": "none"}], "locations": [{"name": "us", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "mongolia", "sentiment": "none"}, {"name": "new jersey", "sentiment": "none"}, {"name": "colo.", "sentiment": "none"}, {"name": "arapahoe county", "sentiment": "none"}], "organizations": [{"name": "suns", "sentiment": "none"}, {"name": "csi consulting and investigations", "sentiment": "none"}, {"name": "university of colorado-boulder", "sentiment": "none"}, {"name": "u.s. citizenship and immigration services", "sentiment": "none"}, {"name": "customs enforcement", "sentiment": "none"}, {"name": "homeland security investigations", "sentiment": "none"}, {"name": "department of homeland security", "sentiment": "none"}, {"name": "customs and immigration services", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "  livefyre Email Print \nRenee Sun’s 21-year-old son always wondered why his girlfriend of three months regularly ended her tearful breakup speeches by pulling him close and whispering into his ear, “Text me.” \nThe brief but tempestuous relationship began when the two were students at University of Colorado-Boulder -- he an admittedly naïve engineering student and she a foreign scholar from Mongolia. Related Image Expand / Contract Deportation proceedings can be stopped in their tracks if the subject can obtain a restraining order, say experts. \nShe approached him, asked him on a date, took yoga classes with him, and learned about his religion, according to Sun, who asked that her son not be named. In retrospect, Sun and her family believe he was being played. \n“This was a setup that trapped a simple American young man for the benefit of gaining legal status for this woman's entire family, her mother, and her brother,” Sun said. “By finding a victim like my son, they can stay in this country and immediately enjoy all the social benefits.” Related Image Expand / Contract Both Steinberg and Vaughan warn the US visa system is being exploited by immigrants. \nThe reason for the parting double message seemed to become clear when Sun’s son was arrested and learned his erstwhile paramour had gone to campus police claiming he was stalking her. \nEvery time he texted her, he unknowingly provided digital evidence to prove her claim. That made her and her family members eligible for the only prize they were ever really after, according to Sun and immigration experts: A green card known to bureaucrats and applicants as the “U” visa, which would allow them to stay in the U.S. legally and ultimately gain citizenship. \nImmigrants, whether legal or illegal, may apply for the U visa if they are victims of certain crimes, including stalking and domestic violence, and if they help law enforcement in the investigation or prosecution. The U visa, created as part of the Victims of Trafficking and Violence Protection Act of 2000, allows the alleged victims to remain in the U.S. while assisting law enforcement, and they can then become eligible to adjust to lawful permanent resident status. \nAccording to the Department of Homeland Security, the U visa is in place largely to protect women and children who may be victims of crimes such as human trafficking, domestic violence, sexual assault and other abuse, but are afraid to report the crimes due to factors including the language barrier, cultural differences, lack of knowledge of U.S. laws and deportation fears. \nFormer Arapahoe County (Colo.) District Attorney Michael Steinberg, who now specializes in such cases, said, \"anyone who enters the country illegally and can produce a restraining order or affidavit, even with no hard evidence of abuse, is likely to be approved for a work permit and permanent residency.\" \nSteinberg, in a paper posted on his website, notes that accused individuals such as Sun's son are not allowed to offer Customs and Immigration Services evidence, even if it shows the petitioner has engaged in criminal behavior. The U visa provision even brings to a halt deportation proceedings that may have already been under way, Steinberg said. \nA local prosecutor charged Sun’s son with stalking, and while the first trial ended in a hung jury, he was convicted on retrial. \n“It has been devastating for my son, our family and the people who know about this relationship and care about my son,” Sun said, noting the family is considering an appeal. \nIf it was a con, it was not the first of its kind, say experts. While foreign nationals unquestionably experience domestic violence in America, savvy scammers know that playing the card opens up loopholes to legal residency and even citizenship. \n“Every week we hear from people who have been taken advantage of by fraudsters,” said Jessica Vaughan, director of policy studies for the Washington-based Center for Immigration Policy. “It’s hard to hear these stories of citizens who are duped and not only have their hearts broken, but often their bank account drained and lose their good name to false accusations of abuse, but is a predictable consequence of giving out green cards to anyone who claims to have been the victim of a crime.” \nThe number of people submitting U visa applications to the U.S. Citizenship and Immigration Services claiming to be victims of crime has increased dramatically in recent years, rising to 52,666 last year from 24,768 applicants in 2012. The number is on track to reach nearly 58,000 by year’s end. \n“It can’t be that there has suddenly been a wave of domestic violence or victimization of immigrants,” Vaughan said. “Instead, the advocates for illegal immigrants have realized that these special green card programs are a way to launder the status of many illegal aliens in the absence of a larger amnesty.” \nJohn Sampson, a retired Immigration and Customs Enforcement agent, who now operates CSI Consulting and Investigations, which specializes in helping U.S. citizens victimized by foreign national visa scams, was an expert witness in the Suns’ case. \n\"If he was harassing her, why didn't she block his number, get a new phone, tell his parents about him, or get a restraining order before a year's time? Why subject herself to a year's long harassment that turned into stalking?\" \nSampson said claiming to be a victim of stalking, harassment or domestic violence to obtain a U visa is a common scenario. “Unfortunately, most of the courts and prosecutors are fully unaware of what is going on. They have no idea,” Sampson said. \nThe so-called “domestic violence” visas are even easier to obtain if the underlying relationship blooms into a marriage, Sampson warned. \nOf the more than 450,000 immigrant visas issued on the basis of a marriage to a U.S. citizen each year, nearly 30 percent are fraudulent, Sampson said, citing US ICE statistics. \n“It is these one-sided immigration marriage fraud schemes that cause the most damage to unsuspecting U.S. citizens and their families,” Sampson said. “They are abused emotionally, financially, psychologically and, often times, physically. And no one seems to be interested in stopping this heinous crime.” \nAll the foreign nationals have to do, Sampson said, is allege they are the victim of domestic violence or abuse, even on the same day of marriage, and then they become a permanent resident alien “in an instant.” \nObstacles that normally prevent a foreign national from obtaining a green card – or being deported – are waived for those claiming domestic violence because the foreign national is now the victim, said Sampson. \n“It's the mother of all ‘Get Out of Jail Free Cards,’” Sampson said. \nIn addition to having their hearts broken, U.S. citizens taken in by the scam can have their lives ruined and even be sent to prison. Some have seen their bank accounts emptied by newly-minted resident aliens, who often go straight onto the government dole, Sampson said. \nNew Jersey resident Elena Maria Lopez claims she was targeted in an immigration marriage fraud scheme, and now runs an advocacy website to educate the public about such scams. \n“The easiest way to get a quick green card is by claiming domestic violence against your American spouse,” Lopez said. “Making such unsubstantiated, uninvestigated allegations can help you bypass background checks and is almost a guaranteed green card for foreign nationals that would've been flagged on many other levels.” \nWhile immigrants are often eligible for pro bono legal help, including immigration fraud, no such help is available to U.S. citizens and legal permanent residents scammed by immigrants for legal status, Lopez said. \nDani Bennett, spokesman for ICE’s Homeland Security Investigations, said the agency places a high priority on investigating identity and benefit fraud. \n“These types of fraud pose a severe threat to homeland security and public safety because they create a vulnerability that enables criminals and other nefarious actors to gain entry and remain in the United States,” Bennett said. \nIn 2015, Homeland Security Investigations arrested 873 individuals on federal criminal charges related to benefit fraud and another 1,282 individuals on federal document fraud charges, Bennett said. \nThere’s no doubt there are true victims of domestic violence, and the Violence Against Women Act, initially signed into law in 1994, has been key in getting the abused much-needed protection, said Claude Arnold, a retired U.S. Immigration and Customs Enforcement special agent in charge of Homeland Security Investigations. \n“This is a tough situation,” Arnold said. “You want to have the law protect domestic violence victims, yet the law also creates another vulnerability in our immigration system that is exploited by fraudsters.” Advertisement", "external_links": [], "published": "2016-09-08T21:16:00.000+03:00", "crawled": "2016-09-08T17:50:49.928+03:00", "highlightTitle": ""}