{"organizations": [], "uuid": "88a6307ba1b28cb8bf87d93f290f678f267d9dad", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.buzzfeed.com", "main_image": "https://img.buzzfeed.com/buzzfeed-static/static/2016-09/28/15/social_promotion/buzzfeed-prod-cron01/facebook-social-promotion-2091-1475089521-5.jpg", "site_section": "http://digg.com/rss/top.rss", "section_title": "Digg Top Stories", "url": "https://www.buzzfeed.com/davidnoriega/meet-the-charming-terrifying-face-of-the-anti-islam-lobby", "country": "US", "domain_rank": 137, "title": "Meet The Charming, Terrifying Face Of The Anti-Islam Lobby", "performance_score": 0, "site": "buzzfeed.com", "participants_count": 0, "title_full": "Meet The Charming, Terrifying Face Of The Anti-Islam Lobby", "spam_score": 0.0, "site_type": "news", "published": "2016-09-29T12:06:00.000+03:00", "replies_count": 0, "uuid": "88a6307ba1b28cb8bf87d93f290f678f267d9dad"}, "author": "", "url": "https://www.buzzfeed.com/davidnoriega/meet-the-charming-terrifying-face-of-the-anti-islam-lobby", "ord_in_thread": 0, "title": "Meet The Charming, Terrifying Face Of The Anti-Islam Lobby", "locations": [], "entities": {"persons": [{"name": "brigitte gabriel", "sentiment": "negative"}, {"name": "david yerushalmi", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "michael flynn", "sentiment": "none"}, {"name": "brigitte gabriel courtesy", "sentiment": "none"}, {"name": "michelle goldberg", "sentiment": "none"}, {"name": "kingsbury", "sentiment": "none"}, {"name": "yvonne ray", "sentiment": "none"}, {"name": "ted cruz", "sentiment": "none"}, {"name": "gabriel", "sentiment": "none"}, {"name": "zeze rwasama", "sentiment": "none"}, {"name": "brigitte", "sentiment": "none"}, {"name": "haddad", "sentiment": "none"}, {"name": "walid phares", "sentiment": "none"}, {"name": "hawkins", "sentiment": "none"}, {"name": "terrence edwards", "sentiment": "none"}, {"name": "eujayl", "sentiment": "none"}, {"name": "suzanne hawkins", "sentiment": "none"}, {"name": "phares", "sentiment": "none"}, {"name": "nathan lean", "sentiment": "none"}, {"name": "joe jaszewski", "sentiment": "none"}, {"name": "rodgers", "sentiment": "none"}, {"name": "omerefendic", "sentiment": "none"}, {"name": "bannon", "sentiment": "none"}, {"name": "dino omerefendic", "sentiment": "none"}, {"name": "jo cox", "sentiment": "none"}, {"name": "mohamed akram", "sentiment": "none"}, {"name": "rwasama", "sentiment": "none"}, {"name": "frank gaffney", "sentiment": "none"}, {"name": "abiade", "sentiment": "none"}, {"name": "gaffney", "sentiment": "none"}, {"name": "shawn barigar", "sentiment": "none"}, {"name": "yvonne haddad", "sentiment": "none"}, {"name": "charles tudor", "sentiment": "none"}, {"name": "pat robertson", "sentiment": "none"}, {"name": "hanan qahwaji", "sentiment": "none"}, {"name": "guy rodgers", "sentiment": "none"}, {"name": "breitbart", "sentiment": "none"}, {"name": "imad eujayl", "sentiment": "none"}, {"name": "richard hofstadter", "sentiment": "none"}, {"name": "harper", "sentiment": "none"}, {"name": "hofstadter", "sentiment": "none"}, {"name": "ruf", "sentiment": "none"}, {"name": "nour saman", "sentiment": "none"}, {"name": "steve bannon", "sentiment": "none"}, {"name": "kalia abiade", "sentiment": "none"}, {"name": "lamb", "sentiment": "none"}, {"name": "newt gingrich", "sentiment": "none"}, {"name": "grant loebs", "sentiment": "none"}, {"name": "yerushalmi", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "craig kingsbury", "sentiment": "none"}, {"name": "franklin lamb", "sentiment": "none"}, {"name": "flynn", "sentiment": "none"}, {"name": "david gaubatz", "sentiment": "none"}, {"name": "michelle malkin", "sentiment": "none"}, {"name": "akram", "sentiment": "none"}, {"name": "julie ruf", "sentiment": "none"}, {"name": "otto kitsinger", "sentiment": "none"}, {"name": "goldwater", "sentiment": "none"}, {"name": "rick martin", "sentiment": "none"}, {"name": "mike mitchell", "sentiment": "none"}, {"name": "fawnbrook", "sentiment": "none"}, {"name": "birchers", "sentiment": "none"}, {"name": "david noriega", "sentiment": "none"}, {"name": "edwards", "sentiment": "none"}], "locations": [{"name": "idaho", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "middle america", "sentiment": "none"}, {"name": "people magic valley", "sentiment": "none"}, {"name": "west", "sentiment": "none"}, {"name": "syria", "sentiment": "none"}, {"name": "lebanon", "sentiment": "none"}, {"name": "capitol hill", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "israel", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}, {"name": "iraq", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "city park", "sentiment": "none"}, {"name": "breitbart", "sentiment": "none"}, {"name": "d.c", "sentiment": "none"}, {"name": "twin falls islamic center", "sentiment": "none"}, {"name": "dallas", "sentiment": "none"}, {"name": "sharia", "sentiment": "none"}, {"name": "democratic republic of the congo", "sentiment": "none"}, {"name": "georgetown", "sentiment": "none"}, {"name": "eritrea", "sentiment": "none"}, {"name": "magic valley", "sentiment": "none"}, {"name": "palestine", "sentiment": "none"}, {"name": "nevada", "sentiment": "none"}, {"name": "middle east", "sentiment": "none"}, {"name": "atlantic", "sentiment": "none"}, {"name": "north america", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "eurabia", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}, {"name": "sudan", "sentiment": "none"}, {"name": "twin falls", "sentiment": "none"}, {"name": "middle east television", "sentiment": "none"}, {"name": "egypt", "sentiment": "none"}, {"name": "omerefendic", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "mar-a-lago", "sentiment": "none"}, {"name": "twin falls county", "sentiment": "none"}, {"name": "fawnbrook", "sentiment": "none"}, {"name": "africa", "sentiment": "none"}, {"name": "southern idaho", "sentiment": "none"}, {"name": "new jersey", "sentiment": "none"}, {"name": "virginia beach", "sentiment": "none"}, {"name": "snake river canyon", "sentiment": "none"}, {"name": "marjayoun", "sentiment": "none"}, {"name": "jerusalem", "sentiment": "none"}, {"name": "los angeles", "sentiment": "none"}, {"name": "twin falls sheriff’s department", "sentiment": "none"}], "organizations": [{"name": "twin falls high school", "sentiment": "none"}, {"name": "congress for truth", "sentiment": "none"}, {"name": "brotherhood", "sentiment": "none"}, {"name": "fox news", "sentiment": "none"}, {"name": "people magic valley", "sentiment": "none"}, {"name": "center for new community", "sentiment": "none"}, {"name": "fawnbrook apartments", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "us department of agriculture", "sentiment": "none"}, {"name": "house of representatives", "sentiment": "none"}, {"name": "georgetown university", "sentiment": "none"}, {"name": "three percenters club", "sentiment": "none"}, {"name": "holy land foundation", "sentiment": "none"}, {"name": "general strategic goal for the group", "sentiment": "none"}, {"name": "city council", "sentiment": "none"}, {"name": "muslim mafia", "sentiment": "none"}, {"name": "southern poverty law center", "sentiment": "none"}, {"name": "committee to end the csi refugee center", "sentiment": "none"}, {"name": "mitchell", "sentiment": "none"}, {"name": "twin falls police department", "sentiment": "none"}, {"name": "bahia, inc.", "sentiment": "none"}, {"name": "john birch society", "sentiment": "none"}, {"name": "christian broadcasting network", "sentiment": "none"}, {"name": "islamic terror warns america", "sentiment": "none"}, {"name": "united nations", "sentiment": "none"}, {"name": "act for america", "sentiment": "none"}, {"name": "palestine liberation organization", "sentiment": "none"}, {"name": "nra", "sentiment": "none"}, {"name": "islam", "sentiment": "none"}, {"name": "congress", "sentiment": "none"}, {"name": "twin falls city council", "sentiment": "none"}, {"name": "cair", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "new york times", "sentiment": "none"}, {"name": "al-ahram", "sentiment": "none"}, {"name": "isis", "sentiment": "none"}, {"name": "islamic center", "sentiment": "none"}, {"name": "anti-defamation league", "sentiment": "none"}, {"name": "tea party", "sentiment": "none"}, {"name": "college of southern idaho", "sentiment": "none"}, {"name": "muslim brotherhood", "sentiment": "none"}, {"name": "christian coalition", "sentiment": "none"}, {"name": "’” college of southern idaho refugee center", "sentiment": "none"}, {"name": "muslim brotherhood council", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Reporting From Twin Falls, Idaho TRENDING 95,011 VIEWS \nBrigitte Gabriel, the most influential leader in America’s increasingly influential anti-Islam lobby, is a master of tonal contrasts. It’s part of what makes her a gifted public speaker: She’ll charm you before she terrifies you. \nAnd Gabriel is, if nothing else, in the business of terrifying people. When she took the stage in Twin Falls, Idaho, in early August, it sounded like the opening track to a live rock album: “Hello, Idaho! I love you too!” she yelled, while the crowd of nearly a thousand whooped and cheered. Then things got dark, fast. \n“All of us know something is not right with our country,” she said. Gabriel is 51, with thick black hair and heavy-lidded eyes, and she speaks her staccato sentences with a slight Arabic accent. Part of what has entranced Gabriel’s audiences over the years is that she looks and sounds, superficially, like the people she calls the enemy: She was born and raised a Maronite Christian in southern Lebanon, where, in her telling, radical Muslims destroyed her bucolic childhood at the onset of civil war in 1975. As a speaker and pundit, Gabriel bills herself as an expert on national security, a credential she bases partially on her experience as a “survivor of Islamic terror.” In the Idaho town, population 47,468, she explained how the seeds of war were sown when Lebanon — multicultural, open-minded, misguided Lebanon — welcomed refugees from Palestine. A man in the crowd growled under his breath: “Screwed yourselves.” Brigitte Gabriel Courtesy ACT for America ID: 9693907 \nGabriel told of roving Islamists finding Christian families cowering in bomb shelters. “They would take the baby, tie one leg to the mother and another leg to the father, and pull the parents apart, splitting the child in half,” she said. Someone groaned in disgust; people shifted in their seats. “As ugly and uncomfortable as these stories are, we must hear them to understand the barbarity that is coming our way.” \nFor the audience that evening, this notion of “barbarity” had recently become less of an abstraction. Gabriel was invited to Twin Falls by the local chapter of ACT for America — the grassroots organization she founded in 2007 — in the thick of the most heated political controversy to have visited the small agricultural city in decades. On June 2, two months before Gabriel’s speech, three boys aged 7, 10, and 14, Muslim refugees from Iraq and Eritrea, were accused of sexually assaulting a 5-year-old girl in the laundry room of a low-income housing complex called the Fawnbrook Apartments. All were charged with felonies. In concert with a smattering of other groups, members of ACT for America launched a publicity campaign around the Fawnbrook case, accusing the local government of covering up the assault. (In truth, officials had sealed the case, as they would with any incident in which both victim and perpetrator are juveniles.) The story caught fire in the right-wing press, where it served as a shocking index of the dangers posed by Muslim refugees. \nIn Twin Falls, Gabriel laid out her conspiratorial vision: Refugee resettlement is one weapon in a vast scheme by radical Islam, led by the Muslim Brotherhood and with the complicity of the United Nations and the US government, to colonize and destroy America from within. “You think you are an isolated situation here in Twin Falls, Idaho. I am here to tell you that you are not alone,” Gabriel said. \nAs she spoke, people in the audience shook their heads contemptuously in the direction of a row of empty seats near the front, which had been reserved for officials in the City Council and local law enforcement. None had shown up. “Shame on those who are covering up what happened to this little girl,” Gabriel said, to huge applause. “You should be ashamed of yourselves!” In this Dec. 8, 2015 photo, Rick Martin, the head of the Committee to End the CSI Refugee Center, works to gather petition signatures in Twin Falls, Idaho. Otto Kitsinger / AP Photo ID: 9692284 \nMuch has been made of Donald Trump’s ties to the far fringes of the American right. Nowhere is the connection more direct than with ACT for America, which is considered a hate group by organizations that track extremism — such as the Southern Poverty Law Center, the Anti-Defamation League, and the Center for New Community — and which has nevertheless contributed two board members, one former and one sitting, as national security advisers to the Trump campaign. The sitting board member is retired army Lt. Gen. Michael Flynn, who has become Trump’s top military surrogate and who recently called Islam “a cancer” at an ACT chapter meeting. (The Trump campaign did not respond to a request for comment.) \nThis shouldn’t come as a surprise. From the early months of his campaign, Trump’s positions on Islam and national security have drawn directly from the work of the anti-Islam lobby. This clique of activists and intellectuals preaches that violence and terror are inherent to Islam, and that “every practicing Muslim is a radical Muslim,” as Brigitte Gabriel said in an interview in 2007. Trump, for instance, supported his first big pronouncement on Islam (that the US should ban Muslim immigrants from entering the country until we “figure out what is going on”) by citing a specious poll produced by the Center for Security Policy, run by Frank Gaffney, another of the anti-Islam lobby’s central figures. \nTrump’s positions on Islam and national security have drawn directly from the work of the anti-Islam lobby. ID: 9692557 \nYet in terms of sheer influence, Gabriel stands apart. Since 2007, following the model set in the 1990s by the Evangelical right, she has assiduously built a bona fide grassroots organization, mobilizing thousands of Americans around the premise that ordinary Muslims living among them constitute a covert threat. “Our enemy is not an organization of people living overseas plotting to attack,” Gabriel writes in her 2006 New York Times best-seller, Because They Hate: A Survivor of Islamic Terror Warns America. “Our enemies are the neighbors next door, the doctors practicing in our hospitals, and the workers who share our lunch break.” \nWith ACT for America — often styled ACT! for America — Gabriel brought to the masses what was once a set of ideas confined to a cadre of conspiracy theorists in Washington, New York, and California. Today, the group has an annual budget of more than $1 million and claims 300,000 members in 1,000 chapters across the country. Even if these numbers are inflated or represent a largely idle membership, as some observers believe, the group has a substantial and dedicated core that has translated into political clout. The organization has recently taken to calling itself “the NRA of national security.” Gabriel is reliably invited to comment on national television after every terrorist attack, including, most recently, an appearance on Fox News’ The Kelly File in the wake of the bombings in New York and New Jersey. \n“They embody this idea that Islamophobia is not fringe,” said Kalia Abiade, advocacy director for the Center for New Community, which monitors what it calls “organized bigotry” and has tracked ACT for America nearly since its inception. “Their positions might be extreme, but they are not a fringe movement. They have really good relationships with lawmakers. They’ve got members of Congress speaking at their briefings. In terms of direct impact, I don’t know who else would compete with them.” \nGabriel dismisses her critics as naive and blinded by “political correctness.” She declined to be interviewed for this story, in keeping with her organization’s general approach to the media. ACT for America’s manual for local chapter founders, The Art of Chapter Leadership — an internal document that was not made public before now — has strict instructions never to give interviews that can be edited in any way. “The vast majority of ‘stories’ done on the subject of radical Islam and Sharia law are very unfriendly to the truth. The average reporter comes from a world view that fundamentally opposes ACT! for America’s mission,” the manual says . “Rarely will a media interview result in making a positive difference.” \n“Patriotism is not hatred, and we do not concern ourselves with the opinions of those who believe it is.” ID: 9692564 \nGabriel did, however, provide written responses to a letter detailing the contents of this story, in which she said that she and her organization “do not consider ourselves anti-Islam. We are anti–radical Islam and the political ideology behind terrorism.” (In other contexts, Gabriel regularly conflates the two; in her 2008 book They Must Be Stopped , she writes of the roots of terrorism: “It’s not radical Islam. It’s what Islam is at its core.”) \nGabriel also rejected the extremist label pinned on ACT for America by hate-tracking organizations. “Ad hominem attacks from anti-American groups such as these are as baseless as they are cliché,” she said. “Patriotism is not hatred, and we do not concern ourselves with the opinions of those who believe it is.” Fawnbrook Apartments photographed in Twin Falls, Idaho on Sept. 20th, 2016. Joe Jaszewski for BuzzFeed News ID: 9691994 \nWhat happened at the Fawnbrook Apartments — a complex of two-story clapboard buildings arranged around courtyards and parking lots in northern Twin Falls — has been the subject of such furious debate that it’s difficult to disentangle fact from rumor. This is what we know: \nSometime around 5 p.m. on Thursday, June 2, an elderly Fawnbrook resident found three boys in a laundry room with a 5-year-old girl, who is white. Two of the boys, ages 10 and 14, belong to an Eritrean family that was resettled in Twin Falls from a refugee camp in Sudan. The third boy, age 7, belongs to a family of Iraqi refugees. \nInside the laundry room, the 7-year-old boy allegedly touched the girl in ways that included genital-to-oral contact. Officials investigating the case believe the 10-year-old may have touched the girl as well. At least one boy allegedly urinated on the girl. The 14-year-old allegedly took video with a mobile phone. \nThe first 911 call came at 5:20 p.m. Craig Kingsbury, the Twin Falls chief of police, told me that dispatchers interpreted that first report as a “bullying-type call”— an incident where a child had been mistreated but which did not necessarily rise to the level of a crime. Dispatchers confirmed the child was safe in the care of her family. A second call came 20 minutes later, this time clearly reporting a sexual assault. Paramedics and deputies from the Twin Falls Sheriff’s Department arrived 26 minutes later. Officers and detectives from the Twin Falls Police Department were on scene shortly afterward. Felony charges were filed against all three boys, with maximum sentences of imprisonment until the age of 21; the prosecution is ongoing. \nA rumor circulated after the incident that police had taken more than two hours to arrive at Fawnbrook. This notion — and the often futile attempts by officials to dispel it — was one indication that the case was quickly becoming a magnet for speculation and mistrust. On June 13, a group of activists attended a meeting of the Twin Falls City Council to demand answers. Among them were members of the local chapter of ACT for America, including its founder, Julie Ruf, a 49-year-old resident of Twin Falls County. \nNo one on the City Council had heard about the reported crime at Fawnbrook. At that point, only one brief news item had appeared on a local TV station; moreover, the council has no jurisdiction over criminal matters, and law enforcement had seen no reason to brief it on the incident, one of about 30 cases of sexual assault against children in Twin Falls this year. “It caught us flat-footed,” said Shawn Barigar, the mayor of Twin Falls. “We had no response.” \nThe accusations came right away. “I think there’s a method of cover-up here in the community, and I think it starts with the police department,” said Terrence Edwards, a member of the local ACT chapter. \n“ISIS is here,” Edwards said. “The Muslim Brotherhood is here. There’s been violations already occurred by Muslims here.” \nThe story went viral on the conservative web. ID: 9692575 \nSoon after, a right-wing website called BehindMyBack.org published an ostensible account of the incident from an anonymous Twin Falls resident, who claimed to know several new details: The attackers were Syrian; they held a knife to the girl’s throat before dragging her into the laundry room, where they “gang raped” her; the father of one of the boys, on finding out about the assault, high-fived his son. \nThe story went viral on the conservative web — Michelle Malkin published a piece titled “Horror and Hush-Up in Twin Falls, Idaho” praising the “righteous citizen rebellion” of ACT and other activists — and local officials went into damage-control mode. At the next City Council meeting, on June 20, Chief Kingsbury addressed the chambers in full uniform. All three boys had been charged with serious felonies, he said, and although the case was sealed by law, he could reassure the public that many of the details being reported were either provably false or unsubstantiated by any evidence. Twin Falls has no Syrian refugees. Police did not take two hours to respond. There was no evidence of a knife or a high-five. Kingsbury took a brief detour to dismiss another allegation: The buildings department had not, in fact, covertly expedited the local Islamic Center’s permit for the construction of a new mosque. \nGrant Loebs, the chief criminal prosecutor for Twin Falls County, released a statement that similarly denied the rumors around the case. This only helped to fan the flames. Every official correction or denial was seen either as evidence of a cover-up or, at minimum, a sign that the government was trying to downplay the significance of what had occurred, and the local press was now considered just as culpable. Activists said it didn’t matter that the accused weren’t Syrian; what mattered was that they were refugees from countries with large Muslim populations. Local officials started receiving threats. One voicemail promised to send someone to the mayor’s house to sodomize his wife and children, while another praised the murder of British member of Parliament Jo Cox, who was killed in June partly for her positions in favor of admitting refugees. \nAll the while, anti-refugee activists, led by ACT’s chapter founder Julie Ruf, cultivated a relationship with the mother of the 5-year-old girl. They raised funds to move the family out of Fawnbrook. One Twin Falls resident bought them a car. Other than text messages exchanged with Michelle Goldberg of Slate , the alleged victim’s mother gave interviews only to the right-wing press. When I visited the family’s home in August, a couple who publish a Tea Party–affiliated blog in northern Idaho came to the door; they declined to let me speak with the girl’s mother. \nFor all the activists’ claims that they were seeking justice and protection for the family, their actions sometimes had the opposite effect. Twice over the summer, activists organizing fundraisers or rallies for the girl released the family’s identifying information on social media. Loebs, the county prosecutor, said he felt this crossed a line. “As a result of this, everybody’s going to know who she is and what she’s gone through,” he said. \nThe coalition mobilizing around the Fawnbrook case was not limited to ACT for America — it included a handful of gun rights, libertarian, and other groups from the Magic Valley, as the stretch of southern Idaho around Twin Falls is known. Nevertheless, the accusations they leveled at local government had their unmistakable origin in the teachings of Gabriel and the anti-Islam lobby. At a City Council meeting on July 11, Ruf invited every member of the council to go see Gabriel speak at the high school auditorium. “I believe you need to be informed,” she said. Julie Ruf and “We the People Magic Valley” hold a press conference in City Park in Twin Falls, ID after a speech by Brigitte Gabriel the night before. Joe Jaszewski for BuzzFeed News ID: 9692218 \nBrigitte Gabriel was born Hanan Qahwaji in 1964 in Marjayoun, a picturesque mountain town on Lebanon’s southern border with Israel. Her arrival in the world, as she writes in Because They Hate , was destiny. Her mother, having been married and childless for 20 years, assumed she was barren, until one day in her mid-fifties she experienced symptoms of pregnancy. “I always knew there would be a special meaning and purpose for my life,” Gabriel writes. She describes her first decade as an idyll: Her parents were affluent and doting, and they lived in a “majestic two-story stone house … set into the side of a hill and surrounded by beautiful gardens of fruit trees and flowers.” \n“All that came to an end when a religious war, declared by the Muslims against the Christians … tore my country and my life apart,” Gabriel writes. In 1975, according to her account, a Palestinian militia bombed a military facility near Marjayoun, destroying her childhood home. Thus began the tribulations that Gabriel credits with shaping her worldview and that she describes, sometimes with varying details, in her books, speeches, and promotional materials. She was injured in the blast and spent days in the hospital, where her father explained the catastrophe by saying that “the Muslims” wanted them dead because they were Christian “infidels.” Over the next seven years, Gabriel and her parents lived in a cramped underground bomb shelter, subsisting on dandelions and grass. “To get some water, we would crawl under snipers’ bullets to a nearby spring,” she told her audience in Twin Falls. \nOver the years, many observers have taken issue with elements of Gabriel’s autobiography. ID: 9692583 \nHer saviors, Gabriel writes, were the Israelis, who invaded and occupied Lebanon in 1982. After her mother was injured and ended up in an Israeli hospital, Gabriel was amazed to find that doctors were treating Muslim people, their enemies. The Muslim patients, she writes, were not so noble, including a woman who would say to the doctors “with an evil, hate-filled look on her face, ‘I hate you all. I wish you were all dead.’” \n“And for the first time in my life I saw evil,” Gabriel writes. “I realized that this Muslim couldn’t love the Jews even after they had saved her life. And when you are unable to be grateful to the people who saved your life, you have no soul.” \nOver the years, many observers have taken issue with elements of Gabriel’s autobiography. In his book The Islamophobia Industry , Nathan Lean calls her origin story “tendentious if not outright deceitful.” There is, to begin with, her characterization of the Lebanese civil war as a plainly religious conflict started by Muslims out of hatred for Christians and Jews. “Her narrative is not historically accurate,” said Yvonne Haddad, a historian at Georgetown University. Like Gabriel, Haddad is an Arab Christian — she was born in Syria and lived in Lebanon for four years. Unlike Gabriel, when Haddad looks at the Lebanese civil war, she (along with most scholars) sees a conflict with an elaborate cocktail of sociopolitical causes, in which religion is only one ingredient. Even the major player in what Gabriel describes as the radical Muslim side, the Palestine Liberation Organization, was composed mainly of secular socialist blocs. facebook.com ID: 9692251 \nIn 2008, an American lawyer and journalist named Franklin Lamb published an article in the weekly magazine of Al-Ahram , Egypt’s state-owned newspaper, that included interviews with some of Gabriel’s former neighbors in Marjayoun. These neighbors, Lamb wrote, “say she may have spent a few nights in her home’s shelter at times, or more likely in her basement, as did many in Marjayoun, but to their knowledge Brigitte lived fairly normally in her family home.” Others have pointed out that Gabriel’s depiction of Marjayoun as perpetually besieged by snipers and shells, requiring her family to live for years on weeds and grass, requires some embellishment; the Lebanese civil war, like many conflicts, consisted of stretches of calm punctured by violence. (In the statement she provided for this story, Gabriel accused Lamb of fabricating his interviews and otherwise dismissed her skeptics. “I have my reality,” she said.) \nTwo years after the Israeli invasion, in 1984, Gabriel moved to Jerusalem and took a job at Middle East Television, a news station owned by the Christian Broadcasting Network, itself owned by the famous American televangelist Pat Robertson. As an evening news anchor, she adopted the name Nour Saman — the first of two name changes in her career. (Gabriel says that everyone at the network had a pseudonym for security reasons.) In the contrast between Jerusalem’s eastern and western halves, Gabriel writes, she saw a perfect illustration of “the differences between Arabic and Jewish culture”: Whereas the Israeli side was clean and organized and planted with flowers, the Arabic side was perpetually squalid. “In my six years living in Jerusalem I never once saw an Arab man sitting with a book in his hand,” Gabriel writes. “The difference between the two cultures has nothing to do with money, and everything to do with values. It is truly the clash of civilizations in its rawest form.” \nDuring her tenure at Middle East Television, Gabriel met Charles Tudor, an American working for the network as a camera operator. The two married and, in 1989, moved to the US and settled in Virginia Beach, where the Christian Broadcasting Network is headquartered and where, according to public records, they still live. Years later, on Sept. 11, 2001, while watching the twin towers fall on TV, Gabriel writes, “I was struck by the same fear that I experienced during the war in Lebanon. As I watched, words instinctively came from my mouth as I spoke to the TV screen: ‘Now they are here.’” College of Southern Idaho Refugee Center director Zeze Rwasama (far left) talks with staff member Yvonne Ray (center) at the center’s office in Twin Falls, ID on Sept. 20, 2016. Joe Jaszewski for BuzzFeed News ID: 9692090 \nThe Snake River Canyon, which runs along the northern edge of Twin Falls, is deep and broad enough to confuse one’s sense of scale. From the rusted steel bridge that traverses the canyon, objects seem at once impossibly distant and perfectly clear. This gives a charmed quality, like a living children’s book illustration, to what would otherwise be a humdrum town. The effect is heightened by the fact that Twin Falls, unlike many small cities in Middle America, does not give the impression of being in trouble; absent, for the most part, are shuttered businesses, homeless people, or buildings in decay. \nThe federal government has been bringing refugees to Twin Falls since 1980. The resettlement program, based out of the College of Southern Idaho, is run by Zeze Rwasama, who is himself a refugee, having been displaced from what is now the Democratic Republic of the Congo in the chaos that followed the Rwandan genocide. When he arrived in Idaho in 2014, Rwasama said, the refugee center was operating quietly, with little to no controversy, as it had for three decades. Unusually low unemployment and comparatively high demand for agricultural labor made the Magic Valley region better equipped than most, he said, to accommodate a steady influx of refugees. The Snake River Canyon in Twin Falls, ID photographed on August 5th, 2016. Joe Jaszewski for BuzzFeed News ID: 9694892 \nWhen I met him in his undecorated office in Twin Falls, Rwasama was wearing elaborate, pointy cowboy boots under jeans. Even though his department was a prime target of the anti-refugee movement, he had been watching the uproar with a sort of quiet bemusement. “You know, even when I was in Africa, I worked with refugees,” he said. “And this issue of anti-refugee… it happens everywhere. It comes with being a stranger in a new country — people feel like, why are we helping them? Why aren’t we helping our own people that are suffering?” \nRecently, though, Rwasama has begun to worry that the growing tension might do lasting damage to the community. I had arrived in Twin Falls expecting to hear about friction between locals and refugees, particularly Muslims, and I assumed this is what Rwasama was talking about. But he corrected me: Although there had been instances of public hostility toward refugees, the newcomers, by and large, were too busy coping with their transition into American life to register much of a day-to-day difference. “It’s not between the refugees and the local community,” Rwasama said. “It’s between them — the local people that are for and against.” \n“It’s not between the refugees and the local community,” Rwasama said. “It’s between them — the local people that are for and against.” ID: 9692590 \nIt wasn’t refugees, then, who were most caught off-balance by the acrimony surrounding the Fawnbrook case. It was the institutions — law enforcement, the City Council, the local press — that had grown used to operating in a political atmosphere that was civil and trusting. I met with Suzanne Hawkins, a City Council member who is now the city’s vice mayor, in a soda shop with framed covers of the Saturday Evening Post on the walls. With a vaguely shell-shocked air, she told me how the events of the previous two months had rattled her otherwise uneventful career in public service. Like other local officials, Hawkins received many vivid threats after the Fawnbrook case hit the national right-wing press. \nHawkins stressed that she is devoutly Christian, and that the average American would recognize her as a committed conservative in a deep red state. In fact, she sympathizes strongly with the unease many people feel over the arrival of Syrian refugees. “As an American, I understand being afraid,” she said. \nSo it was especially distressful when anti-refugee activists started showing up at council meetings claiming that Hawkins and her colleagues were covering up the rape of a small child to protect Muslim refugees. Even the less damning accusations were so off base as to be exasperating, like the claim that the city had secretly expedited a building permit for the local mosque. \nWorse, some of the accusers were people Hawkins knew personally, including Julie Ruf. A few years back, when a group of homeschool students that included Ruf’s son got their high school diplomas, the parents asked Hawkins to speak at the graduation. “They had that much faith in my beliefs, right?” Hawkins said. “So, to go from there to a point where she’s accusing me of things that anybody who knows me has to know aren’t possible — what happened?” View this image › Twin Falls vice mayor Suzanne Hawkins attends a luncheon and information session at the College of Southern Idaho put on by the city’s chamber of commerce for government officials in Twin Falls, ID on Sept. 20th, 2016. Joe Jaszewski for BuzzFeed News ID: 9692221 \nThe coalition that invited Brigitte Gabriel to Twin Falls, which calls itself We the People Magic Valley, includes the local chapter of the John Birch Society. The Birchers, as they were dubbed, emerged from the anti-communist hysteria of the late 1950s. It was partly their rise in the Goldwater 1960s that prompted historian Richard Hofstadter to write “ The Paranoid Style in American Politics ” for Harper’s , in 1964. One of Hofstadter’s insights was that paranoid groups did not usually create their conspiracy theories out of whole cloth; more often than not, they built them on a series of carefully selected facts. \nAbout halfway through her appearance in Twin Falls, Gabriel unveiled one of the most crowd-pleasing elements of her typical speech. Holding up a stack of papers, she read the title quickly in her native Arabic, then asked, to laughter, “You all got that?” The document, she explained, was the Muslim Brotherhood’s secret “plan for the destruction of the United States.” In great detail, it outlines how the Brotherhood would perform “civilization jihad” in America, infiltrating its political and civic institutions to set the stage for a final coup —“destroying the Western civilization from within and sabotaging its miserable house by their hands,” Gabriel read. \nThe document Gabriel was holding is real. It was uncovered during the 2007 trial of the Holy Land Foundation, an American pro-Palestine group convicted of financing terrorism. The “Explanatory Memorandum on the General Strategic Goal for the Group in North America,” as it is officially titled, was written in 1991 by a man named Mohamed Akram, who presented it to the Muslim Brotherhood council. It is, in essence, an aspirational document , in which Akram beseeches the Brotherhood to consider what he called his “hopes, ambitions and challenges.” \nThere is no evidence that the Brotherhood paid attention to Akram’s entreaties. In other words, the fact that a functionary in a sprawling organization envisioned an elaborate plan 25 years ago does not mean that the plan has been put into place, much less successfully. And yet, for the anti-Islam lobby, these 15 pages are a smoking gun, cited constantly as proof that America is falling victim to a meticulously orchestrated plot. \nThe paranoid style has characterized Gabriel’s work since her first years of activity in the United States. In the years after 9/11, she began making a name for herself as a national security speaker and pundit, drawing on her experience of the Lebanese civil war and her work as a journalist in the Middle East. Her first two books, Because They Hate , published in 2006, and They Must Be Stopped , in 2008, describe an epic clash between Islam and the West in which no less than the survival of our civilization is at stake. The books made Gabriel a star attraction on the Evangelical and Zionist speaking circuits. By then, she had already founded an educational nonprofit, the American Congress for Truth. But, as Gabriel often says, she had grown tired of talking and decided to start acting. \nACT for America originated as the lobbying arm of Gabriel’s existing nonprofit. Its first executive director was Guy Rodgers, who, at 52, was an unsung hero of the religious right. From 1991 to 1994, Rodgers worked as the national field director for the Christian Coalition, the grassroots organization started by Pat Robertson (the televangelist who owned the station where Gabriel worked in the Middle East). The Christian Coalition played a defining role in American politics in the 1990s and beyond, helping Newt Gingrich launch his historic takeover of the House of Representatives in 1994 and turning socially conservative Evangelicals into the critical Republican voting bloc they are today. \nWith ACT for America, Rodgers applied the Christian Coalition’s fieldwork model to Gabriel’s project. That was Gabriel’s innovation: teaching ordinary people across America that the threat of global jihad is not just the possibility of an occasional terrorist attack — it’s what’s happening right now, down the street. ACT’s internal manual for chapter founders instructs members to begin their work by “mapping” their local communities, paying special attention to mosques and madrassas . It also suggests that members sign up for courses at their local universities in political science and Middle East studies, as “[t]hese two departments have a real likelihood of being funded by the Saudis.” \nWith Rodgers at the helm, ACT for America’s membership grew from 50,000 in 2008 to 240,000 in 2012, according to tax records. As its influence expanded, the group began to perform a critical function for the anti-Islam lobby. In its early years, ACT for America’s chief project was helping to enact legislation supposedly designed to keep so-called Sharia law out of American courts. The notion of “creeping Sharia”— which holds that Muslims are subverting the legal system to supplant it with Islamic law — was largely the brainchild of Frank Gaffney, of the Center for Security Policy, and David Yerushalmi, a lawyer in the anti-Islam lobby’s inner circle. While Gaffney and Yerushalmi supplied the conspiracy theories and legal language for anti-Sharia bills, ACT supplied the ground troops necessary to pressure state legislators into passing them. \nTo meet constitutional standards, most of these bills couldn’t explicitly refer to Sharia; instead, they sought to prohibit “foreign law” generally. By 2015, 10 states had passed such bills, effectively legitimizing what had until then been a generally derided, fringe cause. Today, creeping Sharia turns up regularly in mainstream political contexts, including Donald Trump’s proposed plan for “extreme vetting” of Muslim immigrants, which would bar those who “believe Sharia law should supplant American law.” People line up outside of the Twin Falls High School auditorium to hear Brigitte Gabriel speak on August 4th, 2016. Joe Jaszewski for BuzzFeed News ID: 9692107 \nThere is some disagreement among Gabriel’s critics and observers over whether her passions are sincere or whether she is simply cashing in on public fears. Yvonne Haddad, the history professor at Georgetown, classifies Gabriel as part of a group she calls “the native informants”: former Muslims or people from the Middle East, Haddad said, “who have made millions of dollars by saying, ‘I know them because I’m one of them. I know what they’re scheming for you. Give me money and I’ll tell you some more.’” \nRegardless of her motivations, Gabriel’s work has proved lucrative. In the years leading up to 2012, as ACT for America grew its membership under Guy Rodgers, Gabriel gradually increased her salary from both of her nonprofits, according to tax filings. Between 2010 and 2011, her salary from ACT for America went from $87,300 to $156,473 — an increase of more than 79%. In 2011 and 2012, tax records show, ACT for America made additional payments to Gabriel as the owner of a consulting firm, and to Gabriel and her husband as co-owners of a video production company; in 2011, these payments were in excess of $300,000. \nIn the written statement she provided for this story, Gabriel said the salary jump between 2010 and 2011 was an emergency measure to pay for her and her family’s relocation, after the Tennessean published her real name. “As a result, my family received information from the authorities that my address, and the names of my husband and children were posted 160,000 times on Islamic websites,” she wrote. (Gabriel’s real name is listed on publicly available tax documents for her nonprofits.) \nGabriel’s salary from ACT for America dropped in 2012, but still remained about 50% higher than it had been before it jumped. All told, Gabriel made $223,809 that year from her nonprofits, plus an additional $237,804 in payments to firms she controlled. Around this time, the Council on American-Islamic Relations released a report on what it called the “Islamophobia network,” which included information about executive compensation in key organizations and highlighted Gabriel’s raises. The report caused a small stir inside the anti-Islam lobby. David Gaubatz, who had become a darling of the group when he wrote Muslim Mafia , a book about CAIR, announced his retirement in an email to his supporters that denounced unnamed nonprofits as “business corporations fighting for the big bucks.” \nIn the next tax return that ACT for America filed after the publication of CAIR’s report, Gabriel’s salary dropped to $0. According to the returns, ACT for America continued making payments to Gabriel as a consultant, as well as to the video production company she owned with her husband. The same year, according to public records, Gabriel formed a company, incorporated in Nevada, called Bahia, Inc. (There is no public indication of the company’s purpose.) Throughout this time, ACT’s fundraising remained steady — in 2013, the latest year for which there is an available tax return, their total revenue was $1.17 million, about the same as the prior four years. \nAlong with money has come political influence. Early in September, ACT for America held its sixth annual conference in Washington, D.C. The conference drew 10 members of Congress, including Ted Cruz. (Six others canceled appearances under pressure from activists.) Materials distributed during the conference included a detailed guide on how to lobby on Capitol Hill and a list of 20 congressional bills that ACT is involved in promoting. \nNathan Lean, author of The Islamophobia Industry , said the documents showed how much ACT for America has progressed. In its early years, ACT’s efforts were directed almost entirely at the states, and the group’s presence on Capitol Hill was small; now it appears to be shifting more of its attention to the national level, and is doing so more clearly as a part of the larger, coordinated political project of the religious right. \n“Nobody has a base like they do.” ID: 9693311 \nThe presidential campaign has been a factor. On February 28, ACT for America posted a photo to Facebook and Twitter of Gabriel and Trump together in Mar-a-Lago, the candidate’s estate in Florida. Three weeks later, Walid Phares, who previously sat on ACT’s board of directors, joined the Trump campaign as a national security adviser. Like Gabriel, Phares is a Maronite Christian from Lebanon. \nThen, in March, Trump picked Michael Flynn, the retired army general and sitting member of ACT’s board, as his top military adviser. In high-profile public appearances, Flynn generally limits his comments about Islam (as opposed to, say, terrorism or national security), but he nevertheless toes the ACT line. Last month, he addressed an ACT chapter meeting in Dallas, where, as the Morning News reported , he likened Islam to “a cancer.” He also warned of the dangers of creeping Sharia in Texas and said Islam is “a political ideology” that “hides behind being a religion.” \nKalia Abiade, of the Center for New Community, recalled watching with amazement as Flynn gave a speech at the Republican National Convention in July. From the beginning, Abiade said, her group has considered ACT for America to be in a special category compared with other players in the anti-Islam lobby. “Nobody has a base like they do,” she said. But this — a sitting board member for an organization that the center considers a hate group, onstage at the nomination of a Republican presidential candidate — was new. “This is all sort of surreal to us,” she said. \nNearing the end of her speech in Twin Falls, Gabriel delivered one of her biggest applause lines: “We are hoping that by the time we have a president next year, that he ”— loud cheers —“will be so strong that he will put a complete stop to this baloney and make America great again!” After the speech, I overheard a Breitbart reporter tell Ruf, the ACT chapter leader, to please deliver a message to Gabriel: “Tell her that Steve Bannon says hello.” Less than two weeks later, Bannon, Breitbart’s CEO, was named chairman of the Trump campaign. Imad Eujayl chats with fellow worshipers after delivering the sermon during an afternoon prayer service at the Twin Falls Islamic Center in Twin Falls, ID., August 5, 2016. Joe Jaszewski for BuzzFeed News ID: 9692117 \nIn the days after the Fawnbrook case hit the news, Imad Eujayl realized that he knew the Eritrean family whose two boys were allegedly involved. Eujayl is one of the rare African immigrants in the Magic Valley who did not arrive first as a refugee; originally from Sudan, he works as a molecular biologist for the US Department of Agriculture and acts as a spokesperson for the local Islamic Center. Eujayl went to the Fawnbrook Apartments to see the Eritrean family and found them sitting on their living room floor. \nThe two boys had been arrested and were still in custody. “Back in their culture, when someone dies, you don’t sit on the chairs and the beds and be comfortable,” he said. “You show your sadness by sitting on the floor. And this was a tragic thing.” The two boys had grown up in refugee camps in Sudan, where the family lived for many years before they were resettled in Idaho. The parents berated themselves for not keeping them under constant supervision in their new home. “They had this feeling of, ‘Oh, my gosh. We made a big mistake coming here. We were not prepared,’” Eujayl said. \nDespite their remorse, Eujayl was unsparing. “They are responsible for their children,” he said. “They need to face the reality. No pity here.” \nIn general, Eujayl rejects any suggestion that the Muslim community in Twin Falls should feel victimized. Over the last four years, he told me, the Islamic Center has been vandalized about once a year. As the mosque’s spokesperson, Eujayl insisted on keeping a low profile about the incidents — why make them more significant than they needed to be? “They vandalize the Mormon church, too,” he said. \nNevertheless, Eujayl suspected that Twin Falls would one day come to see the Fawnbrook incident — the reported assault and the opportunistic displays of xenophobia that followed — as a dark and memorable episode. I met Eujayl a few days before Brigitte Gabriel was set to arrive in town, and he told me he was planning on attending her speech with his wife and son. It would no doubt be uncomfortable for them — a black, immigrant Muslim family. But he saw it as an obligation. “I just want to be there,” he said. “It’s important. It’s history.” ID: 9692288 \nFor Gabriel’s visit to Twin Falls, We the People Magic Valley arranged for the Three Percenters Club, a so-called patriot militia, to provide security. Two men in civilian clothing flanked the podium as she spoke, half-hidden behind stage curtains with their hands clasped in front of them. Gabriel repeatedly exhorted the audience to look across the Atlantic for a vision of what was coming to America: “Europe has morphed to Eurabia. Europe is no longer the Europe that you used to go visit. It has been transformed.” Refugee camps there, she said, were “filled with Muslims, not Christians,” because the latter are “working hard and fending for themselves, not sitting in a refugee camp.” \nNext to me, in the aisle on a folding chair to accommodate the tank feeding oxygen into his nostrils, sat a large man with a white beard. His name was Mike Mitchell. Wearing bib overalls with a crescent wrench sticking out of the front pocket, Mitchell would sometimes respond physically to the things Gabriel said. As he listened to her describe a Europe overrun by savages, he jabbed his index finger downward to point at the floor between his sneakers: Here. \n“We are importing people with a completely different value system.” ID: 9693299 \nSoon after, Gabriel arrived at the apex of her speech. “We are importing people with a completely different value system that has no respect for women, that has no respect for daughters,” she said. She enumerated a long series of sexual assaults and femicides allegedly committed by refugees across the United States, ending with the Fawnbrook case. \n“Today, it’s somebody you do not know,” Gabriel said. “Next, it will be your wife, your daughter, your girlfriend, your mother.” \nThe following afternoon, in an immaculately well-maintained city park, We the People Magic Valley held a press conference about the Fawnbrook case. Julie Ruf took the lead, describing a city undergoing baleful changes. “Refugees have been flooding into Twin Falls as cheap laborers. They live in squalor after their first six months,” she said. “Many of them are my personal friends.” \nAs she spoke, a young, goateed man named Dino Omerefendic wandered into the park while playing Pokémon Go. He stopped to listen, and after Ruf took a few questions from reporters, hesitantly chimed in: “It seems like you guys are painting every single refugee with the same brush,” he said to Ruf. Omerefendic’s family fled the Bosnian War of the 1990s when he was a child; he recalls spending a month in a bomb shelter eating stale rice cakes. Although he was born into Islam, Omerefendic has been irreligious as long as he can remember. \nOmerefendic asked why the activists weren’t expressing similar outrage over other child victims of sexual assault. Ruf responded that she was just as concerned about every other case: “It doesn’t matter to me who was raped, and it doesn’t matter to me who was the rapist.” \nI asked Ruf what, then, Islam had to do with the Fawnbrook case. “Are you familiar with the ideology of Islam?” she asked, before likening the religion to a fanatical cult that engages in incestuous sex with children. “I’m against that.” Friday afternoon prayer service at the Twin Falls Islamic Center in Twin Falls, ID photographed on August 5th, 2016. Joe Jaszewski for BuzzFeed News ID: 9692138 \nEarlier that day, Imad Eujayl, the Islamic Center’s spokesperson, arrived at the mosque to deliver the sermon for Friday prayers. For years, Twin Falls’ Muslims have congregated in a small house in a residential neighborhood, which they long ago outgrew; that Friday, men sat in tight rows on the floor of the house’s main room and spilled out into the hallways. \nNext door, on the same property, a half-built mosque had begun to take shape. Standing outside its pointed archway, Eujayl said that he had made good on his promise to take his family to see Gabriel speak. “It was tough,” he said. \nEujayl’s sermon that day focused on virtue as a communal practice, rather than an individual trait. “Allah wants us to be part of a community,” Eujayl said. “To use our Islam to enjoy the community around us, to enjoy the peace and the love which we give to our neighbors.” \nWhen the service was over, the congregants walked outside to find that someone had left booklets on their parked cars: selections from the Bible, translated into Arabic. ● David Noriega is a national reporter for BuzzFeed News and is based in Los Angeles. Contact David Noriega at .", "external_links": [], "published": "2016-09-29T12:06:00.000+03:00", "crawled": "2016-09-29T07:22:50.913+03:00", "highlightTitle": ""}