{"organizations": [], "uuid": "5acb10670af756b7296dcc5e2ea69b59556d9afd", "thread": {"social": {"gplus": {"shares": 2}, "pinterest": {"shares": 2}, "vk": {"shares": 0}, "linkedin": {"shares": 3}, "facebook": {"likes": 847, "shares": 847, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/media2.foxnews.com/BrightCove/694940094001/2016/09/11/0/0/694940094001_5120577698001_091116-anhq-bolton-1280.jpg?ve=1", "site_section": "http://feeds.foxnews.com/foxnews/opinion", "section_title": "FOX News", "url": "http://www.foxnews.com/opinion/2016/09/12/greg-gutfeld-next-911.html", "country": "CH", "domain_rank": 185, "title": "Greg Gutfeld: The next 9/11", "performance_score": 8, "site": "foxnews.com", "participants_count": 8, "title_full": "Greg Gutfeld: The next 9/11 | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2016-09-12T03:00:00.000+03:00", "replies_count": 7, "uuid": "5acb10670af756b7296dcc5e2ea69b59556d9afd"}, "author": "FoxNews.com", "url": "http://www.foxnews.com/opinion/2016/09/12/greg-gutfeld-next-911.html", "ord_in_thread": 0, "title": "Greg Gutfeld: The next 9/11", "locations": [], "entities": {"persons": [{"name": "greg gutfeld", "sentiment": "negative"}, {"name": "greg gutfeld show", "sentiment": "none"}], "locations": [{"name": "america", "sentiment": "none"}, {"name": "liberia", "sentiment": "none"}, {"name": "san mateo", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}, {"name": "san juan", "sentiment": "none"}, {"name": "san clemente", "sentiment": "none"}, {"name": "aleppo", "sentiment": "none"}, {"name": "zimbabwe", "sentiment": "none"}], "organizations": [{"name": "radical islam", "sentiment": "none"}, {"name": "isis", "sentiment": "none"}, {"name": "fnc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Greg Gutfeld \nPublished September 12, 2016 FoxNews.com     \nFifteen years ago and a day, America grew up.  We were splashed with the cold water realization that an ideology exists that threatens our existence.\nIslamists weren't \"over there\" any more. Yes, they were over there -- but now, they are over here, and, all around. Sure, we knew they existed before 9/11, but we hardly paid attention, even when they hit the WTC the first time. \nWhen people ask me what my politics are, I often say conservative libertarian -- but I'm really a \"survivatarian\".  My belief system is predicated on the goal of preserving our country. I don't want to see this place go down the tubes. And I don't want a bunch of lonely losers blowing us up in the name of some god.\nBut I also call myself a \"luckatarian\" -- in that I'm aware that I am lucky to live in this country. I realize that America is not the rule, but the exception, on this brutal planet. There are so many parts of the world that are steeped in misery.  So I am lucky I was born here, and I wish others to share in that luck - long after I'm dead. This is why so many people are dying to come here  -- this is the land of the lucky. \nWhen people ask me what my politics are, I often say conservative libertarian -- but I'm really a \"survivatarian\". My belief system is predicated on the goal of preserving our country. I don't want to see this place go down the tubes. And I don't want a bunch of lonely losers blowing us up in the name of some god.\nBeing a survivatarian/luckaterian  informs my views on immigration in two ways.\n1. Being a luckatererian means I have no right to deny a decent person a wish to come and live here. It is not my right to give. If you were born here, you didn't join a club with special privileges. You were simply, lucky. You could have been born in Zimbabwe, Aleppo, or Liberia. But nope - you're here. And if i were born there, I'd do everything possible to get here. Stat.\nThere is absolutely no explanation for you being where you are born, other than your good, or bad, luck.  In those months preceding your conception, there was no location machine that allowed you  to choose San Mateo, San Clemente or San Juan as your destination of birth. You didn't choose your parents either. So if you got two of them, and they turned out well -- you're especially lucky. It's no achievement on your or my part, however. It's all a gift.\nTherefore, this means I am not a bouncer for America - I can't tell people who are not as lucky as me \"sorry, dude, that's the breaks -- go back to your hellhole and watch your children die.\"  That's akin to a lottery winner announcing that only lottery winners get to play the lottery. Only worse.\n2. So everything above is entirely correct, if -- and only if -- radical Islam did not exist.  Radical Islam is the deadly skunk at the garden party - ruining any potential for an open border. An open border is akin to leaving our door wide open in a forest of  hungry tigers. So as the lucky man, I can't just say, \"come on in,\" knowing all of our luck will run out if you happen to be an Islamist who wants to end this world.\nWhat America was supposed to be -- a beacon of freedom for the tired and weary -- is challenged, as long as there are jihadists trying to get in. They ruined that ideal. As a survivatarian, I know that as much as I want the tired and weary to come here, there's a predator hiding among them.  We need to sift.\n\"Tired and weary\" -- we understand that phrase. The world is nothing but billions of the \"tired and weary.\"  But what if people who come here under the guise of being \"tired and weary\" bring values and beliefs that serve to create only more exhaustion and pain? And, ultimately, our destruction?  Yes, bring us your tired and weary, but embrace our values.\nRadical Islam is a predator whose goal is to disable the host, dismantle its culture (or what's left of it), and not simply punish the nonbelievers, but also fellow Muslims through enforcement of an archaic brutal system.\nIt's a mistake to cast immigration issue as a Mexico thing. There is no Mexican ISIS.  No: it's about the spread of jihadism. Even if ISIS dies, a new strain of hate will replace it. And it will be Islamist, and it will be more refined, and more adept at targeting us. The next big attack will exceed the casualties of 9/11 by a factor of ten. Technological progress affects all arenas -- including the purveyors of death. Drones, plus anthrax, over a stadium, equals unimaginable horror. \nWho would do such a thing? The same people who pulled off 9/11. Now they just have better tools.\nSo while I'm aware of how lucky I am to be here, I'm also aware of how this luck is now on shaky ground. \nThe environment that we consider lucky to be living in, must be preserved -- or ultimately whatever brings such luck will be destroyed.\n\nGreg Gutfeld currently serves as host of FOX News Channel's (FNC) The Greg Gutfeld Show (Saturdays 10-11PM/ET) and co-host of The Five (weekdays 5-6PM/ET) . He joined the network in 2007 as a contributor. Click here for more information on Greg Gutfeld .", "external_links": [], "published": "2016-09-12T03:00:00.000+03:00", "crawled": "2016-09-13T18:12:53.435+03:00", "highlightTitle": ""}