{"organizations": [], "uuid": "6bd418cb24efb498214c3cb98022a8e1c9c22a71", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 3, "shares": 3, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/images.foxnews.com/content/fox-news/world/2016/09/29/look-at-hungary-referendum-on-eu-refugee-quotas/_jcr_content/par/featured-media/media-0.img.jpg/0/0/1475146113829.jpg?ve=1", "site_section": "http://feeds.foxnews.com/foxnews/world", "section_title": "FOX News", "url": "http://www.foxnews.com/world/2016/09/29/look-at-hungary-referendum-on-eu-refugee-quotas.html", "country": "IT", "domain_rank": 185, "title": "A look at Hungary's referendum on EU refugee quotas", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "A look at Hungary's referendum on EU refugee quotas | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2016-09-29T03:00:00.000+03:00", "replies_count": 0, "uuid": "6bd418cb24efb498214c3cb98022a8e1c9c22a71"}, "author": "Associated Press", "url": "http://www.foxnews.com/world/2016/09/29/look-at-hungary-referendum-on-eu-refugee-quotas.html", "ord_in_thread": 0, "title": "A look at Hungary's referendum on EU refugee quotas", "locations": [], "entities": {"persons": [{"name": "viktor orban", "sentiment": "negative"}, {"name": "jobbik", "sentiment": "none"}, {"name": "marta pardavi", "sentiment": "none"}, {"name": "gabor vona", "sentiment": "none"}, {"name": "ferenc gyurcsany", "sentiment": "none"}, {"name": "zoltan kovacs", "sentiment": "none"}, {"name": "pablo gorondi", "sentiment": "none"}, {"name": "attila tibor nagy", "sentiment": "none"}, {"name": "orban", "sentiment": "none"}, {"name": "orban", "sentiment": "none"}, {"name": "kovacs", "sentiment": "none"}, {"name": "csaba toth", "sentiment": "none"}], "locations": [{"name": "hungary", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "serbia", "sentiment": "none"}, {"name": "szilard koszticsak", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "western europe", "sentiment": "none"}, {"name": "budapest", "sentiment": "none"}, {"name": "croatia", "sentiment": "none"}, {"name": "libya", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "budapest", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "dog party", "sentiment": "none"}, {"name": "hungarian two-tailed dog party", "sentiment": "none"}, {"name": "federation of ufo research", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "associated press", "sentiment": "none"}, {"name": "republikon institute", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "roma", "sentiment": "none"}, {"name": "ap", "sentiment": "none"}, {"name": "mti", "sentiment": "none"}, {"name": "hungarian helsinki committee", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "  FILE - In this Feb. 24, 2016 file photo Hungarian Prime Minister Viktor Orban speaks during a press conference in Budapest, Hungary. Hungarians will vote Sunday, Oct. 2, 2016, in a referendum called by Orban’s government, seeking political support against any future plans by the European Union to resettle refugees or asylum seekers among members of the bloc. (Szilard Koszticsak/ MTI via AP, file)  (The Associated Press) \nFILE - In this Aug. 13, 2016 file picture a person on motorbike passes a government poster promoting the Oct. 2 referendum against any EU quotas to resettle migrants. reading \"Did you know?\" Hungarians will vote Sunday in a referendum called by Prime Minister Viktor Orban’s government, seeking political support against any future plans by the European Union to resettle refugees or asylum seekers among members of the bloc. (AP Photo/ Pablo Gorondi, file)  (The Associated Press) \nPrevious Next BUDAPEST, Hungary –   Hungarians will vote Sunday in a referendum which Prime Minister Viktor Orban hopes will give his government the popular support it seeks to oppose any future plans by the European Union to resettle asylum seekers among its member states. Here's a look at what's at stake:\nWHAT ORBAN WANTS\nOrban wants to stop the influx of large numbers of Muslim migrants into Europe, arguing they threaten Hungary and Europe's Christian identity and culture. Midway through his third term as prime minister, he suggested last week that the EU should build a \"gigantic refugee city\" in Libya, to where migrants would be deported from Europe to file their asylum claims.\nOrban says the EU needs to strengthen its borders to keep out migrants, like Hungary did last year by building fences on its southern borders with Serbia and Croatia.\nThe referendum's question is \"Do you want the European Union to be able to prescribe the mandatory settlement of non-Hungarian citizens in Hungary even without the consent of Parliament?\"\nOrban says \"no\" votes favor Hungary's sovereignty and independence. He also hopes popular pressure will encourage other EU countries to take similar steps. Critics say poll results showing rising xenophobia and anti-migrant feelings among Hungarians are linked to the government's referendum campaign.\n___\nVOTER TURNOUT\nAt least 50 percent plus one of Hungary's 8.27 million voters need to cast valid ballots for the referendum to be valid.\nDespite an unprecedented barrage of government billboards, advertisements and personal appearances by ministers and lawmakers nationwide urging people to vote, polls show validity is by no means assured, even though \"no\" votes are expected to be in the large majority.\nThe far-right Jobbik party supports the government's anti-migrant position, while most of the other opposition parties and many civic groups are asking voters to either stay home on Sunday or cast invalid ballots.\n\"It's important to show as a citizen that you want to take part,\" says Marta Pardavi, co-chair of the Hungarian Helsinki Committee advocacy group. \"However, given the vile nature of this referendum question, we are calling for people to cast an invalid vote.\"\n___\nMIGRANTS? UFOs?\nNearly 400,000 migrants passed through Hungary last year, making their way toward Western Europe. Yet, the criticized razor-wire fences and new expulsion policies have proven effective. During the first four weeks of September, police reported either zero or just one migrant breaching the border area on 12 different days. Last year, Hungary granted asylum to only 508 refugees and a similar number is expected this year.\nThe satirical Hungarian Two-Tailed Dog Party is putting up posters and distributing leaflets mocking the referendum. One of their slogans is that the average Hungarian sees more UFOs in his or her lifetime than migrants.\nFor the record, Hungary's Federation of UFO Research says it receives about two dozen reports a year of UFO sightings across the country.\n___\nTHE FEAR FACTOR\nThe disadvantaged Roma minority, struggling pensioners, young families with children and people living in municipal housing are among those being warned repeatedly of what could happen if Hungary is required to take in refugees.\nAccording to government officials, they may face subsidy or pension cuts, become victims of terrorism and violent acts or be forced to give up their homes if that happens.\nThe government, assisted by state television, is constantly rehashing often months' old stories about migrant attacks.\n\"The image of large migrant groups nearly 'darkening the sky' last year is still present in many people, no doubt reinforced by the government propaganda,\" says Attila Tibor Nagy of the Center for Fair Political Analysis. \"The government is also assisted by the attacks in Germany and France, which it very much likes to invoke to show that migrants are dangerous.\"\n___\nHOW MUCH?\nThe referendum's technical costs, including printing the ballots and manufacturing ballot boxes, total 4.9 billion forints ($17.8 million). The government says it will reveal how much it spent on the billboard and media campaign after the vote, but partial data shows expenditures of at least 13 billion forints ($47.3 million).\nIn contrast, the Two-Tailed Dog Party and a few other opposition groups are working with campaign budgets of around $100,000, gathered from small donations.\n___\nWHAT'S NEXT?\nThe government has not said what consequences a valid referendum supporting its position will have. It has mentioned possible amendments to the constitution but is shying away from specifics. Government spokesman Zoltan Kovacs brushed off suggestions that an invalid referendum would hurt Orban, saying a large number of \"no\" votes would be enough to bolster the official position against the refugee quotas even with a low turnout.\n\"The referendum can never become a failure,\" Kovacs says. \"Full stop.\"\nBut Jobbik president Gabor Vona says Orban should resign in case of an invalid ballot and former Socialist Prime Minister Ferenc Gyurcsany says it would weaken Orban's \"infallibility.\"\n\"Brussels has already priced in the referendum and knows well that Hungarian public opinion does not like the migrants,\" said Csaba Toth, strategic director of the Republikon Institute think tank. \"Domestically, nonetheless, a low turnout would be a serious defeat for the prime minister, especially after such a huge campaign.\"", "external_links": [], "published": "2016-09-29T03:00:00.000+03:00", "crawled": "2016-09-29T14:02:22.238+03:00", "highlightTitle": ""}