{"organizations": [], "uuid": "467bce141c3ff36e6b51cdbc1993b9265b91f051", "thread": {"social": {"gplus": {"shares": 3}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 10, "shares": 10, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/0/0/Mexico%20Peso%20Trump.jpg", "site_section": "http://feeds.latino.foxnews.com/home/feed", "section_title": "FOX News", "url": "http://latino.foxnews.com/latino/money/2016/09/27/who-won-presidential-debate-mexican-peso-suggests-it-was-hillary-clinton/", "country": "US", "domain_rank": 185, "title": "Who won presidential debate? Mexican peso suggests it was Hillary Clinton | Fox News Latino", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "Who won presidential debate? Mexican peso suggests it was Hillary Clinton | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2016-09-27T03:00:00.000+03:00", "replies_count": 0, "uuid": "467bce141c3ff36e6b51cdbc1993b9265b91f051"}, "author": "Fox News Latino", "url": "http://latino.foxnews.com/latino/money/2016/09/27/who-won-presidential-debate-mexican-peso-suggests-it-was-hillary-clinton/", "ord_in_thread": 0, "title": "Who won presidential debate? Mexican peso suggests it was Hillary Clinton | Fox News Latino", "locations": [], "entities": {"persons": [{"name": "hillary clinton", "sentiment": "negative"}, {"name": "clinton", "sentiment": "none"}, {"name": "jesper bargmann", "sentiment": "none"}, {"name": "esther reichelt", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "paul donovan", "sentiment": "none"}, {"name": "cameron brandt", "sentiment": "none"}], "locations": [{"name": "united states", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}, {"name": "singapore", "sentiment": "none"}], "organizations": [{"name": "fox news latino", "sentiment": "negative"}, {"name": "wall street journal", "sentiment": "none"}, {"name": "epfr global", "sentiment": "none"}, {"name": "ubs wealth management", "sentiment": "none"}, {"name": "commerzbank", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "gop", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "nordea bank", "sentiment": "none"}, {"name": "nafta", "sentiment": "none"}, {"name": "facebook  follow us on twitter & instagram", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Published September 27, 2016 Fox News Latino (AP Photo) \nOver the last few months the rise and fall of the Mexican peso against the dollar has become an unlikely market proxy for Republican nominee Donald Trump’s chances of winning the presidential election in November.\nAnd if early trading on the Asian market on Tuesday is any indication, the boisterous billionaire had a rough time on the debate stage against Democratic candidate Hillary Clinton.\nThe Mexican peso soared about 2 percent to 19.488 to the dollar following the presidential debate, putting it on track for its best daily performance since February and lending credence to speculation that Trump’s fortunes on the campaign trail juxtapose the fate of Mexico’s currency.\n“Anyone who had wondered what had caused [peso] weakness over the past few weeks received a clear answer last night,” Esther Reichelt, analyst at German lender Commerzbank, told the Wall Street Journal .\nMexico’s peso has been on a rollercoaster ride ever since Trump declared his bid for president last summer by promising to clamp down on immigration, force Mexico to pay for a border wall and threatened to cut off trade deals like NAFTA.\nIn recent weeks, as the GOP candidate’s poll numbers improved against Clinton, the peso hit record lows following concerns that a Trump victory would threaten Mexico’s exports to the United States. The United States is the Latin American nation’s largest trade partner and receives 80 percent of Mexico’s exports.\nSince the start of the month, the peso has lost 4 percent of its value against the dollar even as currencies in other emerging-market have powered forward. The decline has been particularly stinging as Mexico’s central bank has raised rates several times this year and is expected to do so again when officials meet Thursday\nCameron Brandt, director of research at EPFR Global, a Massachusetts-based advisory firm that specializes in tracking investment fund flows, told FNL , “There does seem to be a rough correlation between Trump's popularity and fund flows. When Trump was losing ground, we saw some money coming back to Mexican equity funds.”\n“Mexican equity funds began to rebound as Trump's poll numbers got worse,” he added. “In the last two weeks … it has gone back to outflows.”\nBankers say another way to look at the surge in Mexico’s currency is that Clinton did better on the debate stage than initially expected and that may have buoyed the strength of the peso.\n“It may be that Clinton did a little bit better than was the initial expectation or you could say that Trump didn’t surprise in any way. Maybe the market was afraid that he was going to have something up his sleeve to surprise and make him look good,” Jesper Bargmann, head of trading for Nordea Bank in Singapore, told Reuters .\nThere are other factors besides Trump’s candidacy that play a part in the up-and-down nature of Mexico’s currency and market analysts warn against predicting the outcome of the U.S. election based on the peso.\nThis year, Mexico has seen declines in foreign loans to the country’s private sector, a drop in oil and mining production, as well a dip as automobile exports to the U.S., an unfortunate confluence of trends that has put downward pressure on Mexican GDP growth and also exacerbated the decline in the peso’s value.\n“It would not be wise to suggest that is an indicator of election probabilities,” said Paul Donovan, an economist at UBS Wealth Management. “The typical demographic of the foreign-exchange dealing community may not coincide with the typical demographic of a prospective voter.”\nLike us on Facebook \nFollow us on Twitter & Instagram", "external_links": [], "published": "2016-09-27T03:00:00.000+03:00", "crawled": "2016-09-27T18:18:34.681+03:00", "highlightTitle": ""}