{"organizations": [], "uuid": "16c285894d9dda42738d096a482536bb3e304bc0", "thread": {"social": {"gplus": {"shares": 1}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 688, "shares": 688, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/images.foxnews.com/content/fox-news/opinion/2016/09/26/charlotte-is-stabilizing-because-finally-church-is-engaged/_jcr_content/par/featured-media/media-0.img.jpg/0/0/1474903045599.jpg?ve=1", "site_section": "http://www.foxnews.com/", "section_title": "Fox News - Breaking News Updates | Latest News Headlines | Photos &amp; News Videos", "url": "http://www.foxnews.com/opinion/2016/09/26/charlotte-is-stabilizing-because-finally-church-is-engaged.html", "country": "IT", "domain_rank": 185, "title": "Charlotte is stabilizing because, finally, the church is engaged", "performance_score": 6, "site": "foxnews.com", "participants_count": 1, "title_full": "Charlotte is stabilizing because, finally, the church is engaged | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2016-09-26T03:00:00.000+03:00", "replies_count": 0, "uuid": "16c285894d9dda42738d096a482536bb3e304bc0"}, "author": "FoxNews.com", "url": "http://www.foxnews.com/opinion/2016/09/26/charlotte-is-stabilizing-because-finally-church-is-engaged.html", "ord_in_thread": 0, "title": "Charlotte is stabilizing because, finally, the church is engaged", "locations": [], "entities": {"persons": [{"name": "dimas salaberrios", "sentiment": "negative"}, {"name": "christ", "sentiment": "none"}, {"name": "tim keller", "sentiment": "none"}, {"name": "dimas", "sentiment": "none"}, {"name": "charles kinsey", "sentiment": "none"}, {"name": "onfaith", "sentiment": "none"}, {"name": "eric garner", "sentiment": "none"}, {"name": "terence crutcher", "sentiment": "none"}, {"name": "jesus christ", "sentiment": "none"}, {"name": "walter scott", "sentiment": "none"}, {"name": "keith lamont scott", "sentiment": "none"}, {"name": "tiffany", "sentiment": "none"}], "locations": [{"name": "charlotte", "sentiment": "none"}, {"name": "bronx", "sentiment": "none"}, {"name": "chicago", "sentiment": "none"}, {"name": "south bronx", "sentiment": "none"}, {"name": "amsterdam", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "haiti", "sentiment": "none"}, {"name": "new york city", "sentiment": "none"}, {"name": "tulsa", "sentiment": "none"}, {"name": "baltimore", "sentiment": "none"}, {"name": "bronx river housing", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "kenya", "sentiment": "none"}, {"name": "antarctica", "sentiment": "none"}, {"name": "charleston", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}, {"name": "venezuela", "sentiment": "none"}, {"name": "redeemer city", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "new zealand", "sentiment": "none"}, {"name": "los angeles", "sentiment": "none"}], "organizations": [{"name": "christianity today", "sentiment": "none"}, {"name": "fox news", "sentiment": "none"}, {"name": "infinity bible church", "sentiment": "none"}, {"name": "abc world news tonight", "sentiment": "none"}, {"name": "salem radio network", "sentiment": "none"}, {"name": "tbn", "sentiment": "none"}, {"name": "cnn", "sentiment": "none"}, {"name": "new york times", "sentiment": "none"}, {"name": "word network", "sentiment": "none"}, {"name": "nbc news", "sentiment": "none"}, {"name": "emanuel", "sentiment": "none"}, {"name": "infinity", "sentiment": "none"}, {"name": "fox & friends", "sentiment": "none"}, {"name": "charlotte police department", "sentiment": "none"}, {"name": "washington post", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Pastor Dimas Salaberrios\n FoxNews.com Email Print (Courtesy of the author)\nTen men walked in front of flowing traffic and formed a wall. Bewildered, an officer turned to me and said, \"Reverend, I don't know what they are doing.\"\nMy concern grew more for the men blocking traffic. They were perilously close to turning cars that could easily hit them. Sensing the mood of the gathered protestors, I began to lead them in prayer, speaking loudly into my speaker system saying, \"The only one who never gets it wrong, and is the Judge of judges, is God. Looting and going to jail is not the way. We want justice, but we also must conduct ourselves respectfully. Trust me, no one gets away with murder, even if they win a case. Life will never be the same for them.\"\nMoments later, our prayers were quickly answered. It seemed that our words had penetrated those blocking traffic as they willingly dispersed without further provocation. The crowd applauded.\nThis certainly isn't New York City, Chicago or Los Angeles. This is Charlotte. On a humid Saturday night when the Charlotte Police Department finally released two disturbing videos chronicling the last moments of Keith Lamont Scott, a night when no one could predict with certainty just what embers those videos might inflame among frustrated protesters, it was The Church in Charlotte which dominated the night and made the peace that was so very needed.\nRelated Image Expand / Contract\nOn a rough night when body cams called into question the police officer’s account that Keith Lamont Scott had pointed his gun at them, and after days of raucous looting and volatile protests, it was the Church that finally dominated the narrative of Charlotte. The people of God were so integrated in the crowd that the pervasive mood was like a Sunday worship service.\nChaplains, ministers, pastors, and youth workers all united. One Muslim imam was so overwhelmed by the show of faith that he asked if I could share about the sixth Commandment of Moses: Thou shall not kill.\nI was in awe of what was happening. The Church in Charlotte kept the focus on our belief that the truth would indeed prevail, be it in a local court or in the Highest Court of heaven.\nI am a pastor in the Bronx who regularly works with law enforcement in my community. I find it difficult to share this, but the truth is many African Americans don't feel protected by the police anymore. They have seen men shot while cooperating (Charles Kinsey), walking away (Terence Crutcher), running away (Walter Scott), choked to death (Eric Garner), shot while backing up with their hands down (Keith Lamont Scott), and the list goes on.\nMy nine-year old daughter has expressed that she is scared of the police. When I was 9, I loved the police and saw them as heroes.\nToday, sadly, some police officers routinely behave like police work is set in a video game with African Americans as its main targets.\nWe are in need of serious reform, and new equality and real ‘threat assessment’ police training. Though one percent of the African-American population could accurately be identified as gang-bangers, the other 99% are not threats to society. I am praying that the small batch of trigger-happy officers infecting police forces throughout this country will be proactively removed from the ranks.\nPeace is returning to the streets of Charlotte. Sadness still permeates the city, but Charlotte is on the right track.\nThe city is stabilizing because the Church is engaged.\nMay we remember in prayer those families now planning funerals: in Charlotte, in Tulsa, and in all places of unrest.\nDimas Salaberrios has served as senior pastor of Infinity Bible Church, which he founded in partnership with Dr. Tim Keller and Redeemer City to City since 2003. A former New York City police commissioner credited Pastor Dimas and Infinity’s powerful impact in the Bronx River Housing projects as being the startling reason homicides have been eliminated and drug dealing reduced to an all-time low in that community for over a decade. Pastor Dimas is a gifted storyteller and Bible teacher. As president of Concerts of Prayer Greater New York, he spearheads the largest, most diverse force of pastors in the tri-state area comprised of over 5,000 churches mobilized across various denominational, ethnic and economic lines. A true servant-leader at heart, Pastor Dimas is often described as one unafraid of running into the fire. With real “boots on the ground”, Pastor Dimas is often advancing the cause of Christ during the nation’s most pressing issues, as well as boldly proclaiming the gospel on every continent (with the exception of Antarctica). Perhaps that explains his undeniable effectiveness and relevance—be it quelling the riots that recently raged in Baltimore, bringing hope and healing directly to those devastated by the vicious slaughter of the Emanuel 9 in Charleston, or most recently, shining the gospel of Jesus Christ brightly during Paris’ darkest hour and national days of mourning following heinous terrorist attacks. Some of Pastor Dimas’s global ministry exploits include igniting a three-month revival in New Zealand; smuggling Bibles to the persecuted church in China; pastoral leadership training and humanitarian aid throughout Kenya; being a first-responder and lifeline to three refugee camps after Haiti’s devastating earthquake; guerrilla evangelism in Amsterdam’s notorious red-light district, on the tubes of London, in the alps of Switzerland, in the hills of Venezuela and with the gangs in the South Bronx. A passionate and exciting speaker, Pastor Dimas’s humor and inspiring style has opened doors for him to be a frequent guest on Fox & Friends, TBN, the Word Network, the 700 Club, CNN, Fox News, ABC World News Tonight, and NBC News as well as being featured in the New York Times, The Washington Post, Christianity Today, Charisma magazine, Outreach, OnFaith and other publications. His weekday radio show The Dynamic Life with Pastor Dimas is broadcast over the Salem Radio Network. Dimas is also the bestselling author of his memoir Street God: The Explosive True Story of a Former Drug Boss on the Run from the Hood--and the Courageous Mission that Drove Him Back. Pastor Dimas holds a Master of Divinity degree from Alliance Theological Seminary and lives in the Bronx with his wife, Tiffany, and their two daughters.", "external_links": [], "published": "2016-09-26T03:00:00.000+03:00", "crawled": "2016-09-26T23:12:20.655+03:00", "highlightTitle": ""}