{"organizations": [], "uuid": "bba5886d387b1888d3f7aea58204c4ae1b59cfe3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/694940094001_5101595020001_082716-jer-clintonstate-1280.jpg", "site_section": "http://www.foxnews.com/journal/", "section_title": "Journal Editorial Report | Fox News", "url": "http://www.foxnews.com/transcript/2016/08/27/state-department-and-clinton-foundation-one-in-same/", "country": "IT", "domain_rank": 185, "title": "State Department and Clinton Foundation one in the same?", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "State Department and Clinton Foundation one in the same? | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2016-08-27T03:00:00.000+03:00", "replies_count": 0, "uuid": "bba5886d387b1888d3f7aea58204c4ae1b59cfe3"}, "author": "FoxNews.com", "url": "http://www.foxnews.com/transcript/2016/08/27/state-department-and-clinton-foundation-one-in-same/", "ord_in_thread": 0, "title": "State Department and Clinton Foundation one in the same?", "locations": [], "entities": {"persons": [{"name": "paul gigot", "sentiment": "negative"}, {"name": "clinton", "sentiment": "neutral"}, {"name": "jim crow", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "redditt", "sentiment": "none"}, {"name": "freeman", "sentiment": "none"}, {"name": "bill clinton", "sentiment": "none"}, {"name": "george w. bush", "sentiment": "none"}, {"name": "joe rago", "sentiment": "none"}, {"name": "shavar jeffries", "sentiment": "none"}, {"name": "james freeman", "sentiment": "none"}, {"name": "ronald reagan", "sentiment": "none"}, {"name": "clintons", "sentiment": "none"}, {"name": "kim", "sentiment": "none"}, {"name": "jonathan perry", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "paul", "sentiment": "none"}, {"name": "joe rago", "sentiment": "none"}, {"name": "rago", "sentiment": "none"}, {"name": "joe biden", "sentiment": "none"}, {"name": "james", "sentiment": "none"}, {"name": "jeffries", "sentiment": "none"}, {"name": "dorothy rabinowitz", "sentiment": "none"}, {"name": "sean hannity", "sentiment": "none"}, {"name": "obama", "sentiment": "none"}, {"name": "john mccain", "sentiment": "none"}, {"name": "dorothy", "sentiment": "none"}, {"name": "hillary", "sentiment": "none"}, {"name": "pat buchanan", "sentiment": "none"}, {"name": "gigot", "sentiment": "none"}, {"name": "william", "sentiment": "none"}, {"name": "mcgurn", "sentiment": "none"}, {"name": "kim strassel", "sentiment": "none"}, {"name": "barack obama", "sentiment": "none"}, {"name": "rabinowitz", "sentiment": "none"}, {"name": "joe", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "reed", "sentiment": "none"}, {"name": "george h.w. bush", "sentiment": "none"}, {"name": "kim strassel", "sentiment": "none"}, {"name": "joel cockburn", "sentiment": "none"}, {"name": "bill mcgurn", "sentiment": "none"}, {"name": "ralph reed", "sentiment": "none"}, {"name": "doug band", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "mohammad yunis", "sentiment": "none"}, {"name": "ralph", "sentiment": "none"}, {"name": "mitt romney", "sentiment": "none"}, {"name": "romney", "sentiment": "none"}, {"name": "rabin", "sentiment": "none"}, {"name": "dorothy rabinowitz", "sentiment": "none"}, {"name": "bill mcgurn", "sentiment": "none"}, {"name": "bill", "sentiment": "none"}, {"name": "huma abedin", "sentiment": "none"}, {"name": "laurence tribe", "sentiment": "none"}, {"name": "bill clinton", "sentiment": "none"}, {"name": "james freeman", "sentiment": "none"}], "locations": [{"name": "united states", "sentiment": "none"}, {"name": "iran", "sentiment": "none"}, {"name": "harlem", "sentiment": "none"}, {"name": "missouri", "sentiment": "none"}, {"name": "israel", "sentiment": "none"}, {"name": "d.c.", "sentiment": "none"}, {"name": "clinton foundation", "sentiment": "none"}, {"name": "jackson", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "cincinnati", "sentiment": "none"}, {"name": "bahrain", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "louisiana", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "mississippi", "sentiment": "none"}, {"name": "atlanta", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "reno", "sentiment": "none"}, {"name": "africa", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}, {"name": "georgia", "sentiment": "none"}, {"name": "utah", "sentiment": "none"}, {"name": "pennsylvania", "sentiment": "none"}, {"name": "shavar jeffries", "sentiment": "none"}, {"name": "arkansas", "sentiment": "none"}], "organizations": [{"name": "state department", "sentiment": "neutral"}, {"name": "pew research center", "sentiment": "none"}, {"name": "mylan", "sentiment": "none"}, {"name": "stanford", "sentiment": "none"}, {"name": "republican party", "sentiment": "none"}, {"name": "cleveland", "sentiment": "none"}, {"name": "cnn", "sentiment": "none"}, {"name": "democrats for education reform", "sentiment": "none"}, {"name": "harvard university", "sentiment": "none"}, {"name": "supreme court", "sentiment": "none"}, {"name": "clinton foundation", "sentiment": "none"}, {"name": "cajun navy", "sentiment": "none"}, {"name": "faith and freedom coalition", "sentiment": "none"}, {"name": "gop", "sentiment": "none"}, {"name": "food and drug administration", "sentiment": "none"}, {"name": "naacp", "sentiment": "none"}, {"name": "titan foods", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "irs", "sentiment": "none"}, {"name": "congress", "sentiment": "none"}, {"name": "children's defense fund", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "wall street journal", "sentiment": "none"}, {"name": "associated press", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "fda", "sentiment": "none"}, {"name": "university of chicago", "sentiment": "none"}, {"name": "democratic party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Published August 27, : Editorial Report,\" August 27,\nPAUL GIGOT, FOX HOST: Welcome to the \"Journal: Editorial Report.\" I'm Paul Gigot.\nHillary Clinton's campaign is on the defense again as a new batch of e- mails released this week raises fresh questions about whether Clinton Foundation donors got preferential treatment from the State Department during her tenure there. This comes as an analysis by the Associated Press from 85 of the 154 people from private interests who met with Clinton in her first two years as secretary donated to the foundation contributing $156 million to the charity.\nHillary Clinton called the A.P. report, Quote: , \"A lot of smoke and no fire,\" claiming they excluded nearly 2,000 meetings she had with world leaders.\nAnd former President Bill Clinton chocked the latest controversy up to election year politics.\n(BEGIN VIDEO CLIP)\nBILL CLINTON, FORMER PRESIDENT OF THE UNITED STATES: We're trying to do good things. There's nothing wrong with creating jobs and saving lives. I know what it is. And now they are talking about people meeting with Hillary and Bill, meeting with Mohammad Yunis, the Nobel Prize winner, who would have gotten meetings with any foreign secretary in any country in the world. So I think it's election season.\n(END VIDEO CLIP)\nGIGOT: Joining the panel this week, Wall Street Journal \"Potomac Watch\" columnist, Kim Strassel; associated editorial page editor, James Freeman; editorial board member, Dorothy Rabinowitz; and \"Main Street\" columnist, Bill McGurn.\nKim, what was the most important thing we learned this week, in your view, about the Clinton Foundation and the State Department and the relationship when she was secretary?\nKIM STRASSEL, \"POTOMAC WATCH\" COLUMNIST: I think the most important thing we learned is that they were essentially one in the same. That's the importance of these e-mails that we got, from Huma Abedin, a Clinton aide. A bunch of her records were released this week, and it show as constant back and forth discussion that she had with Doug Band, one of the executives at the Clinton Foundation, where they were, in essence, keeping track of schedules together and talking about the secretary's events, and he was, in many cases, asking for special audiences in front of her with prominent Clinton Foundation donors. So despite her promise that she was distancing herself from the foundation, all of this was continuing while she was secretary of state.\nGIGOT: What about this defense that some of her folks are offering, which is that she had -- the A.P. report is wrong because it focuses on too narrow of a group of people who met with her and, in fact, she was meeting with thousands of more people. Does that wash?\nSTRASSEL: It doesn't wash. Here's the thing. Hillary Clinton was obliged as secretary of state to meet with foreign dignitaries and U.S. officials and those are the meetings she was talking about. She wasn't obliged to meet with anybody outside of the State Department. That's the 154 people that the A.P. report is talking about. And it's notable, of the very few people she met from outside the State Department, the majority were Clinton Foundation donors.\nGIGOT: So, Dorothy, do you see it this way?\nDOROTHY RABINOWITZ, EDITORIAL BOARD MEMBER: Well, I think that the short answer is no. I don't see it that way. The number of meetings she held was something like 1700 meetings.\nGIGOT: But most of them were with diplomats. That's different than private interests, is it not?\nRABINOWITZ: I don't think that's the case. Here's the bottom line. With all of the talk, all of the revelations, there's one truth that stands out, you cannot find a single case of proof that any tangible anything was given, any gifts were given, anything to the detriment of the United States.\nGIGOT: There was no quo pro for the quid.\nRABINOWITZ: There is no pro. And all of the continuing smoke with no fire is only adding to itself. If you take that A.P. report, it starts off by saying, more than half of the meetings that she held -- well, that's quite an eye catcher. More than half of the meetings, when you have 150 people that you met, 75 out of them.\nGIGOT: But if you're a regular American and -- you know, I'd love to go talk to the secretary of state about my ideas, but I haven't given $100 million to the Clinton Foundation. Are you getting that meeting? I don't think you're getting that meeting, James?\nJAMES FREEMAN, ASSOCIATE EDITORIAL PAGE EDITOR: Well, I think it's a thing of value. Certainly there are companies, people every day in Washington paying a lot of money to arrange meetings with the cabinet secretaries. So I think the meeting itself is --\nGIGOT: Is of some value.\nFREEMAN: -- is of value. One of our readers wrote in, out of Pennsylvania, saying, why don't these donations to the Clinton Foundation violate the Constitution, where people like Hillary Clinton, the State Department, are not supposed to be taking gifts from foreign powers.\n(CROSSTALK)\nGIGOT: What about Dorothy's point, though, that there really is no evidence so far that there was anything beyond meetings that they got in return, no policy shift -- and certainly, with the crown prince of Bahrain, for example, who got a meeting after Doug Band intervened, but we don't know that anything was done on his behalf.\nFREEMAN: I think arranging a meeting is a gift. But this is false, this claim that it was only meetings. We know, for example, one particular case where heavy Clinton Foundation donors ended up getting a favorable decision on the sale of large uranium supplies to Russia -- to a Russian firm, I should say. Now, the claim by the Clintons is that the State Department under Hillary Clinton, Mrs. Clinton signed off on it, but she wasn't very involved. That's been coming in to question lately as more e-mails have come out.\n(CROSSTALK)\nBILL MCGURN, \"MAIN STREET\" COLUMNIST: There are quids and quos lying all over the floor here and we don't know what they got in return. We don't know what it's based on. We don't know what the private conversation was. We know after the crowned prince, there was an arms deal for Bahrain. We don't know -- this goes back to the cattle futures when Titan Foods, the lawyer there, was advising Mrs. Clinton --\nGIGOT: When she was the first lady?\nMCGURN: When she was the first lady of Arkansas. And Titan Food got tax breaks. We don't know whether that was in exchange but it looks messy.\nSecond, we know that the State Department, that agreement promised not just no quid pro quos but we're going to separate this foundation, and now the State Department line is, oh, we meant Mrs. Clinton, not her aides. We're always parsing the word \"is\" or what it means by this with the Clintons.\nGIGOT: You can see it doesn't look good, Dorothy?\nRABINOWITZ: Yes. I was about to say, yes, let's use the phrase, the optics don't look good. Let's use another term. Let's think about the charity itself which keeps getting buried in this discussion. That enterprise does enormous good, and no one disputes it, and it saves millions of lives of AIDS. This is a genuine charity.\nGIGOT: James.\nFREEMAN: What the Clintons did was insert themselves as a middle man on a lot of charity going to the third world. The idea that large foreign governments cannot get money to Africa without routing it through the Clinton Foundation in New York is just absurd.\nGIGOT: OK. All right. Thank you very much. Fun discussion.\nStill ahead, the Trump transformation continues. Is the GOP nominee backing off his call to deport 11 million illegal immigrants, and will the move expand his appeal or anger his core supporters?\n(COMMERCIAL BREAK)\nGIGOT: Donald Trump's transformation continued this week with what the candidate himself suggested could be a softening on his signature issue, illegal immigration. Trump, who once called for a deportation force to remove 11 million undocumented immigrants, now says he's willing to work with those who are law abiding.\n PRESIDENTIAL CANDIDATE: They have to pay taxes. There's no amnesty.\n(CHEERING)\nTRUMP: There's no amnesty.\nSEAN HANNITY, FOX HOST, \"HANNITY\": Right.\nTRUMP: But we work with them.\nEverybody agrees, we get the bad ones out. But when I go through and meet thousands and thousands of people on this subject. And I've had very strong people come up to me, really great, great people come up to me and say Mr. Trump, I love you, but to take a person that's been here for 15 or\n20 years and throw them and the family out, it's so tough, Mr. Trump. I mean, I have it all the time.\n(SHOUTING)\nTRUMP: It's a very, very hard thing.\n(END VIDEO CLIP)\nGIGOT: Trump later told CNN that there would be no path to legalization unless they first left the country.\nSo, Bill, where is he finally coming out here, do we know?\nMCGURN: He's coming very close to the old immigration reform that my former boss, George W. Bush --\n(LAUGHTER)\n-- pushed in Congress.And --\nGIGOT: Which is what? How would you do it?\nMCGURN: I would say to try and correct the system and have a legal path for immigration and have some penalties for people that were here, that came here --\n(CROSSTALK)\nMCGURN: -- but not deporting.\nGIGOT: With enhanced border security.\nMCGURN: And allow them to come here without citizenship. And the problem with this is Donald Trump is facing the reality. You can deport all these people, right? And some of them are law abiding. So he's coming around to reality. The problem is, anyone else who did this before, the shouts were \"RINO, RINO, RINO.\" And anything short --\n(CROSSTALK)\nGIGOT: \"Amnesty, amnesty, amnesty.\"\nMCGURN: That's right. Anything short of deporting all of these people was called amnesty. Maybe now we'll get a national conversation.\n(LAUGHTER)\nGIGOT: Dorothy?\nRABINOWITZ: The problem with that is Donald Trump is not in the normal position of somebody finally discovering the truth. He's in the position of saying, I have that base out there, I cannot do this. So he keeps wavering in this incredible way he's done in the last 24 hours, because they are out there yelling, build the wall. He says, I'm going to build the way and they are going to be paying for the wall in Mexico. So how can he conceivably go forward with even this admission of reality? So he has to do these two things.\nGIGOT: Kim, the economic realities are such that if he really did try to deport 11 million people in a couple of years, you probably couldn't do it. It would cost a huge amount of money to hire the judges and the police to do it. And then you would also take all those workers out of the economy. That's one reality. The other is politics. Do you think Donald Trump's new advisers are telling him, you know what, if you don't move off your deportation position, you're not going to win?\nSTRASSEL: Yeah. Look, the reality is that there are some core Trump supporters for whom their number-one voting priority is deportation. No amnesty, deportation. But you've got to look at that. Even when you see polls that gauge Republican voters, the vast majority of Republican voters, that's not necessarily their position on immigration. They want enhanced border security, as you said. They want some sort of situation in which maybe there's a penalty, people pay a price for coming here illegally. But it's not their top priority. That has to be balanced. Those you might lose, that very small sliver of core Trump supporters, against the need for Mr. Trump to make progress with more educated white voters, suburbanites and minorities, which is the coalition he's going to have to do better among all of us, if he wants to have a chance of winning this election.\nGIGOT: James, do you think that Trump is kind of moving to where it is a better position for him politically going into the election?\nFREEMAN: Yeah, absolutely. I know it looks a little messy as he makes the evolution but basically what he's getting to is, I think, where most people are, certainly most Republicans, if he wants to tie up that suburban vote, which is we don't want political correctness allowing terrorists in the country, we want a screening for that. We want a culture of law. We don't want criminals to be allowed to be here. But we recognize hardworking people, who are making a contribution, should stay, and we want them here, and their values. It kind of gets lost, all of this negative stuff about immigration. Half of the billion dollar startups in the country were founded by immigrants. We need immigrants.\n(CROSSTALK)\nGIGOT: Go ahead, Dorothy.\nRABINOWITZ: All of this sounds very rational in a rational world of political figures, of which Donald Trump is no member. I mean, here is somebody who cannot be with one position for more than two days. And he has behind him the element of this group, to whom he is completely beholden. He does not want to lose them. You cannot say these are normal strategies. Here's someone that came to power because I'm not your normal politician.\n(CROSSTALK)\nFREEMAN: Where are they going to go? They are not going to Hillary Clinton. And I think now he makes it very tough for Never Trumpers in the Republican Party to have a case, because you go issue after issue, he's now better than Hillary Clinton.\nMCGURN: I also think, look, the guy is moving closer to our position on this. And I think he should be applauded when he moves in the right direction. I mean, would we rather that he stuck with this position that was untenable and really hurt the Republican future?\nGIGOT: Kim, what's fascinating to me is to watch the reaction of the Clinton campaign. They, I think -- as soon as he jumped back on the CNN position to say, look, they may have to be deported after all, they said, see, there he is again, this is the real Trump. I think they want him to stay with the most extreme immigration position because they think that's better politics for them. They are afraid if he moves to the middle on immigration, somehow, they won't be able to define him as extreme.\nSTRASSEL: They need him to be there. The reality is, in most big policy areas, whether it's economics or this or anything, energy, Donald Trump has a better position than they do, so they don't want to talk about positions.\nGIGOT: Thanks, Kim.\nWhen we come back, Donald Trump running strong with evangelical voters? But is their support for the Republican or a vote against Hillary Clinton? Will they turn out in November? We'll ask Ralph Reed, next.\n(COMMERCIAL BREAK)\n(BEGIN VIDEO CLIP)\nTRUMP: I would like to thank the evangelical and religious community --\n(CHEERING)\nTRUMP: -- because, I'll tell you what, the support that they've given me -- and I'm not sure I totally deserve it --\n(SHOUTING)\nTRUMP: -- has been so amazing.\n(END VIDEO CLIP)\nGIGOT: That was Donald Trump last month accepting the Republican nomination for president and thanking evangelical voters for their support. A poll taken earlier this summer by the Pew Research Center found more than three-quarters of white evangelicals plan to vote for Trump, but the results also suggest that they may be motivated more by their dislike for Hillary Clinton than their enthusiasm for the Republican nominee.\nRalph Reed is the chairman of the Faith and Freedom Coalition. He is joining me from Atlanta.\nWelcome, Ralph. Good to have you here.\nRALPH REED, CHAIRMAN, FAITH AND FREEDOM COALITION: Thanks, Paul. Good to be with you.\nGIGOT: So you know that since Ronald Reagan, evangelical voters have been a core part of the Republican coalition. How is Donald Trump doing with those voters compared to previous Republican nominees?\nREED: I think he's hitting at the industry standard if not heading to really the highest we've ever seen. If you look at the average of the four polls that we've had -- you mentioned the Pew poll. There have been three others since then that we consider to have reliable evangelical data. If you take the average of those, it's about 73 percent right now for Donald Trump and about 18 percent for Hillary Clinton.\nThis is critical, Paul, because it's the largest single constituency in the electorate. It's between 24 and 27 percent of the electorate. If you add frequently mass attending Catholics, it's another 9 or 10 percent. It's bigger than the Hispanic vote, bigger the African-American vote, and bigger than the feminist and gay vote combined.\nGIGOT: Right.\nREED: The highest ever recorded for a presidential nominee was George H.W. Bush's 82 percent in 1988. 78 percent was recorded by George W. Bush in 2004, and matched by Mitt Romney.\nGIGOT: All right. So Donald Trump, not a socially conservative lifestyle, I think it's fair to say, traditionally. So what is resonating with those voters? What issue is he hitting that really counts in this election?\nREED: I think one thing that he's done, Paul, that is important, and it's sort of obvious but it gets missed a lot, is he has actually shown up to their audiences and asked for the vote. So that matters. You know, the presence, the physical presence of the candidate, a rhetorical appeal, an argument rhetorically that I share your values, and I desire to see your role in society enhanced. And I would say, beyond that, his fealty to their positions on the sanctity of life, on traditional marriage, on support for the state of Israel, on religious freedom, particularly, that progeny of cases before the Supreme Court, like Hobby Lobby and Little Sisters of the Poor and, finally, his full-throated opposition to the Iran nuclear deal, which I think resonates powerfully in this community because they consider Iran to be an existential threat to the survival of the state of Israel.\nGIGOT: It's interesting, Ralph, when I listen to Donald Trump, two of the main issues he's stressing are immigration and trade. He doesn't really stress the social issues. That's true, speaking to some of the audiences that you're talking about, he does mention those. But on a day-to-day basis, it's trade and immigration that he really hits hard. Are those issues that resonate with evangelicals, or is it something that they take for granted and go back to their core issues?\nREED: I think among some, it does. To the extent that it fits in to a broader tapestry of him saying that he's going to put America first, he's going to defend American interests, I think that resonates, but I think if you look at the polling, Paul, not just among voters of faith, but among all voters, those two issues, trade and immigration, actually rank pretty low --\nGIGOT: Right.\nREED: -- on the hierarchy of voter concern.\nGIGOT: That's my point.\nREED: What's driving -- yeah, what's driving this election predominantly, even among voters of faith, is the economy, this jobless anemic recovery, a forward-leaning national security posture that helps us combat and defeat Islamic terrorism, and then you start to get in to health care and some others. But that's the cluster of issues that people are voting on.\nGIGOT: So I look at the polls in the battleground states and some of the states that were won comfortably by Republicans in the past, Georgia, for example, Missouri, where evangelical voters are a strong part of the population. And yet, the election --\nREED: Right.\nGIGOT: -- the election right now is a lot closer than you would expect with Hillary Clinton actually competitive. Why?\nREED: I think in the -- I can speak most intelligently about Georgia, but I think this applies to a lot of states. Georgia has a large African- American vote. It's going to be, I think, 30 percent of the vote.\nGIGOT: Right.\nREED: And I think you take that and the Democrat's share of the white vote, and it's going to be competitive. And this is not news. I mean, John McCain barely beat Obama here because of that surge of African- American votes.\nBut, look, the bottom line is, and this is not exactly a news flash, Donald Trump has had a rough few weeks.\nGIGOT: Right.\nREED: And a sinking tide has lowered all boats. So it's made the ballot test a lot closer in places like Texas and Utah and Missouri and Georgia that it shouldn't be. My sense is that they have turned that corner. And I think the polling is going to be a lot better for him, not only in those red states, but nationally and in the battleground states.\nGIGOT: The last time you came up to see us, you said this was a pick-em race, 50/50. Do you still stand by that, despite the polling?\nREED: I think if Donald Trump stays on message and fixes some of the candidate performance issues that he needed to deal with coming out of Cleveland, I think this is an extremely competitive race.\nAnd I will say this, Paul, but I'm not in the prediction business, but based on what we're seeing anecdotally, these voters of faith are going to turn out, and they are going to turn out in huge numbers, and I think he's going to get north of 75 percent of that vote, and if that is baked into the cake --\nGIGOT: Right.\nREED: -- there is no way that she runs away with this election. I think it will be competitive.\nGIGOT: All right. Thanks, Ralph Reed. Good to see you. Thanks for coming in.\nREED: Good to see you, Paul.\nGIGOT: Still ahead, charges of racism from both campaigns this week as Donald Trump continues his outreach to minority voters. A look at Trump's attack and Clinton's response when we come back.\n(COMMERCIAL BREAK)\n(BEGIN VIDEO CLIP)\nTRUMP: Hillary Clinton is a bigot who sees people of color --\n(SHOUTING)\nTRUMP: -- only as votes, not as human beings worthy of a better future.\n(END VIDEO CLIP)\nPAUL GIGOT, FOX HOST: Donald Trump, in Jackson, Mississippi, this week, ratcheting up his criticism of Hillary Clinton as he continues to court minority voters.\nClinton responded to Trump's attacks in a speech in Reno Thursday, linking the Republican nominee to the so-called Alt-Right movement and accusing him of taking hate mainstream.\n(BEGIN VIDEO CLIP)\nHILLARY CLINTON, D-PRESIDENTIAL CANDIDATE: Donald Trump has built his campaign on prejudice and paranoia. He is taking hate groups mainstream and helping a radical fringe take over the Republican Party. His disregard for the values that make our country great is profoundly dangerous.\n(END VIDEO CLIP)\nGIGOT: We're back with Kim Strassel, Bill McGurn and Dorothy Rabinowitz. And Wall Street Journal editorial board member, Joe Rago, also joins the panel.\nKim, what do you think of the strategy here by Trump, both to go after minority voters in an overt, explicit way and then the way he's doing it?\nKIM STRASSEL, WASHINGTON COLUMNIST: He does need to do this. One thing that is noticeable is he kept that up over a week. He didn't just give one speech and be done with it, which is a problem that some Republican candidates do at times.\nThe way he's doing it is, look, he's taking about policies that he wants to offer that he thinks will help minorities in the country.\nGIGOT: Right.\nSTRASSEL: His criticism of Hillary Clinton is something that reminds me of George W. Bush, the soft bigotry of low expectations, which he used in an education context. But the argument that the Democrat party is very low on solutions for things that are the biggest problems in a lot of inner city and minority communities. So I mean, I think it's a strong way of going about it if he can stay on message.\nGIGOT: Dorothy, Mitt Romney only got 6 percent of the African-American vote. It's hard to do worse than that. Barack Obama isn't at the top of the Democratic ticket. It makes sense to me to try to appeal to those voters.\nDOROTHY RABINOWITZ, EDITORIAL BOARD MEMBER: It will do worse than that. Yes, it makes sense if Donald Trump were another kind of candidate who could actually reach out. He does not go before black audiences. He says to them, you live in hell.\nGIGOT: You mean he's been making this pitch in front of --\nRABIN: He's been a pitch --\nGIGOT: -- largely white audiences in suburbs and --\nRABIN: That's right. And the portrait of black American is the same portrait that lives in the hearts of many of his white supremacist followers, which believe he doesn't characterize all of Mr. Trump's followers, by any means. The point is, they are low down, they live in hell. Where is the black middle class that lives --\n(CROSSTALK)\nGIGOT: You mean he should be addressing them?\nRABIN: Yes. But it's more than that. It's a false portrait of black America and the condescension, unfortunately, in his address to them is powerful.\nJOE RAGO, EDITORIAL BOARD MEMBER: That argument, I think, is holding Trump to a double standard. We've heard the Black Lives Matter movement for more than a year that things are going terribly in black America. Trump, I agree, is clumsy, but you could hardly say, well, if he criticizes the conditions in minority communities that that's any different than anything else.\nGIGOT: Yeah, the people on the left have been telling us that we have to throw money at inner cities because, somehow, their lives are desperate, and now when Trump says, look, I have alternative solutions, we say, oh, boy, that's not fair?\nBILL MCGURN, \"MAIN STREET\" COLUMNIST: Yeah. Look, I think Trump has a good message and I think, \"so what have you got to lose\" is a great message for Republicans. They should have been making it earlier. He should show some guts, go to a charter school. But it's a good argument.\nLook, Joel Cockburn (ph) had a study of the African-American middle class and the cities where they did better. They were all in the red states and former Confederacies.\nGIGOT: Where I think I agree with you, Dorothy, is when Trump uses that word bigot against Hillary Clinton. I don't think that that -- that anybody believes that. It personalizes things in a way. That if he -- his argument would resonate more if he kept on the issues, like educational opportunity, jobs and so on.\nRABIN: But he doesn't raise those issues. He says, Quote: , \"Hillary's program are detrimental to blacks.\" What programs is he talking about?\nThere are no specifics. It's simply an amount of name calling.\nGIGOT: All right. Thank you.\nLet's talk about this Alt-Right argument that Hillary Clinton is making, Trump is bringing this group of voters into the mainstream.\nFirst of all, what is the Alt-Right, Joe?\nRAGO: It's a term of grievance politics and identity politics as opposed to multiculturalism, pluralism, globalism, and it has always been --\nGIGOT: From the right?\nRAGO: From the right. It's always been a tendency within --\nGIGOT: The right. The right.\nRAGO: -- conservatism and very broadly defined. I mean, going back to the paleo-conservatives, Pat Buchanan. The difference of the Alt-Right now is that they've gone digital. They've moved to \"Fortune\" and Redditt and so forth. It's a form of seeking out --\n(CROSSTALK)\nGIGOT: But how strong is it?\nRAGO: It's not strong at all. Hillary Clinton called it a fringe movement in her speech this weekend. And saying Trump is taking it mainstream, I think, gives it too much credit.\nMCGURN: Look, to the Democratic Party, the Republican Party is one big hate group. And it didn't start with Donald Trump. We have Joe Biden the last time around saying that Romney is going to put you all in chains to a group of African-Americans, a largely African-American audience. They always treat this. It's smart for Hillary politically for two reasons. One, it gets us off the subject of these e-mails and, two, it plays to the concerns that people have about Donald Trump.\nGIGOT: All right. Thank you all.\nStill ahead, the NAACP votes for a moratorium on charter schools despite growing support in many black communities for education alternatives. So what's behind the split?\n(COMMERCIAL BREAK)\nGIGOT: At its annual convention in Cincinnati, members of the NAACP voted to approve a resolution calling for a moratorium on the expansion of charter schools, despite recent polling that shows black Americans support alternatives to traditional public schools, and charters in particular.\nShavar Jeffries is a civil rights attorney and president of Democrats for Education Reform.\nWelcome.\nSHAVAR JEFFRIES, CIVIL RIGHTS ATTORNEY & PRESIDENT, DEMOCRATS FOR EDUCATION REFORM: Thank you. Thanks for having me.\nGIGOT: Explain why to me the NAACP would take this position. It's supposed to be for advancement of minorities, all right?\nJEFFRIES: That's right.\nGIGOT: And charter schools are, a lot of the evidence shows, helping the advancement of --\nJEFFRIES: Absolutely.\nGIGOT: -- of Americans.\nJEFFRIES: The evidence shows strongly that the best-performing public charter schools in our country have changed the lives of young people, particularly young people of color. We're very disappointed with the NAACP's take there. The NAACP has an historic legacy of helping people of color --\nGIGOT: Sure.\nJEFFRIES: -- and we just think was a departure from that and --\n(CROSSTALK)\nGIGOT: How do you explain it?\nJEFFRIES: Well, when you look at the history of the NAACP, they were really birthed during the Jim Crow desegregation era. And post-Brown, there were efforts to circumvent desegregation, decrease through choice mechanisms. Some states even closed their public schools and created vouchers for families to get around these decrees. So NAACP kind of comes from that history. And charters are birthed in a very different of history. And it's also the case that the NAACP is larger middle-class organization, a large number of folks who work in the public-sector unions, and so I think there is a kind of intellectual resistance to public charter schools from that standpoint. So we do a lot of work giving them data showing that these schools are really doing great things for you people of color and we need their support.\nGIGOT: So you think it's ideological, to some extent, saying these are alternatives to traditional public schools and, therefore, we can't support them because -- or maybe is it because the unions are providing financial support to the NAACP?\nJEFFRIES: I think there's a piece of it that's union support. But I also think it's more intellectual and policy based. I wouldn't want to disrespect the NAACP and say it's transactional. But a large number of the members -- the economics of many black communities are rooted in public- sector opportunities and so some perceive the public charters as disrupting that in a way that makes it difficult for black and brown folks to succeed economically. So I think all of that is in the mix.\nGIGOT: You and I live in New York.\nJEFFRIES: Yes, sir.\nGIGOT: And we know that you go to Success Academy --\nJEFFRIES: That's right.\nGIGOT: -- you go up to Harlem and to the charter schools around the city that are predominantly minority --\nJEFFRIES: Absolutely.\nGIGOT: -- Hispanic and African-American, and they are doing phenomenally well.\nJEFFRIES: Yes.\nGIGOT: Not in every case but, by and large, the evidence and the Credo study that Stanford did --\nJEFFRIES: Absolutely.\nGIGOT: -- shows that it's getting great results, generally speaking, for charter kids. Why is it so hard to sell that message of the results?\nJEFFRIES: Well, we need more leaders who are respected by black and brown folks to propagate this. The families support this. I think it's very important to be clear. So while there are a handful of organizations that express opposition to public charter schools, hundreds of thousands of black and brown families are choosing charter schools and are fighting to protect them. So we still have more work to do at the leadership level but we're going to win this fight over history because this is right.\nGIGOT: Well, you know about the demonstrations here.\nJEFFRIES: Sure.\nGIGOT: On behalf are charters. It's full of -- I mean, thousands of African-American parents out there saying give our kids the same choice that the affluent Americans have --\nJEFFRIES: That's right. That's right.\nGIGOT: -- and the president of the United States, for example, had.\nJEFFRIES: Absolutely. True.\nGIGOT: It's fascinating to me that you've seen a regression, despite all of that, among some Democratic Party leaders. Barack Obama is for charters.\nJEFFRIES: Yes, he is.\nGIGOT: Bill Clinton has been for charters.\nJEFFRIES: Absolutely.\nGIGOT: Yet, if you look at this election campaign, Secretary Clinton has backtracked from what her husband's position was. She's now expressing some wariness towards charters.\nJEFFRIES: Well, and she's also -- on multiple occasions, including before some of the teacher unions, expressed support for public charters as well.\nGIGOT: Right.\nJEFFRIES: She catalyzed public charters as first lady of Arkansas, first lady of the United States. She's been for education reform for 40 years, working on the Children's Defense Fund, jumpstarting the CHPS health insurance program. Now beyond Secretary Clinton, who has expressed support for charters, there's no question that there was substantial influence. And fighting for workers is something that we support but we have to fight for children and we have to support the things that work for babies, and the things that don't work, we have to be able to change. So charters throughout this country are changing the lives of young people of color, particularly black and brown families. And I'm very confident, as we continue to press that case, over time, the Democratic Party is true to its values and fight for kids.\nGIGOT: There was a case this week in California, the Regara (ph) decision, where they wanted to lower state-level for minority plaintiffs. It said you are denying the right to equal education because of the poor performance of traditional schools, and yet the state Democratic establishment supported the unions against their case. And, of course, now they have lost in state court.\nJEFFRIES: Yes.\nGIGOT: How do you -- why so much opposition?\nJEFFRIES: Again, the teachers unions are a political force. They fought for workers, for educators. And we love our educators. We've fought for them for 40 years. They have significant political power within the Democrat party. We've found opportunities to work with them in a whole variety -- particularly, teacher prep. Because while they're focused on underperforming teachers, and we have to work with that, we also have to create better incentives to get different people into the class in the first place. But what's going to happen over the next generation, we have to build on President Obama's legacy within the party of fighting for change for kids, and we have to organize and mobilize parents and fans and communities to sustain the policies that work for kids.\nGIGOT: Shavar Jeffries, thank you so much for coming in.\nJEFFRIES: Thank you.\nGIGOT: A very important debate inside the Democratic Party. Thank you.\nJEFFRIES: Thank you.\nGIGOT: When we come back, the EpiPen outrage. Hillary Clinton joins the chorus of politicians demanding action over the skyrocketing cost of the life-saving device. But what is really behind the price spike? Find out after the break.\n(COMMERCIAL BREAK)\nGIGOT: A growing controversy over a life-saving treatment for millions of Americans with severe allergies. The drug maker Mylan is under fire for the skyrocketing price of the EpiPen, which now costs families more than $500 for a pack of two, up from about $100 from 2008. Members of Congress are promising an investigation. And Hillary Clinton on Wednesday demanded that Mylan reduce the price of the pens, calling the increase outrageous and the latest troubling example of a company taking advantage of its consumers.\nWe're back with Joe Rago, James Freeman and Bill McGurn.\nJoe, usually when you get big price hikes in drugs or expensive drugs, it's because there's an innovation, something new, some unpatented. The EpiPen has been off patent for years. What's going on?\nRAGO: Well, Mylan is pursing a strategy of increasing the price by 10 or 15 percent every quarter. They've done this since 2008. The reason they are able to do so is because they have a monopoly. Nobody else can get into the market. You've had a string of competitors over the years trying to create a generic EpiPen and they've been blocked by the FDA, by the Food and Drug Administration.\nGIGOT: Why? This is not a super-complicated technology.\nRAGO: No. It's a basic engineering challenge. What the FDA has -- they essentially have regulatory anxiety about allowing new products on to the market. Companies have to prove that their competitor is the same as the EpiPen. It's hard to do with these kinds of --\n(CROSSTALK)\nGIGOT: The same? Even if it does 85 percent of the job or 95 percent of the job?\nRAGO: Right. And the truth is the EpiPen fails all the time. It's not the gold standard of delivering doses of adrenaline. So this is completely a regulatory artifact and not what would be happening in a competitive market.\nGIGOT: How many competitors have been blocked by the FDA?\nRAGO: You had one competitor who introduced a competitor EpiPen. They had to withdraw it after 26 misdiagnoses. That was probably due to the FDA. And then you've got two companies right now trying to get their product onto the market and the FDA is demanding more tests and data.\nGIGOT: I guess the argument would be, Bill, that you -- never mind that --\n(CROSSTALK)\nMCGURN: True.\nGIGOT: And I think that's irrefutable what Joe said. Still, it's immoral for the company to increase the price.\nMCGURN: They can do it without competition. We have to get back to the essential truth. The opposite of competition is not cooperation, like the FDA -- it's collusion. That's what we're seeing. Congress doesn't lower prices. Competition does.\nAnd what Joe is saying, what the FDA does is it kind of takes this model of the EpiPen and -- it struggles when people go outside the box of the model. I'll put it like the taxi and limousine service that can't quite process and maneuver. And the costs of coming in are so high that it discourages people that might have a different idea.\nGIGOT: But the question, the Democrats are saying unconscionable that you would raise prices. Even though you have a government-protected monopoly, it's still unconscionable.\nLet's face it, do we really need to charge 500 bucks for these things, James?\nFREEMAN: We were talking about regulatory anxiety. There's a treatment for this. It's free markets. We don't have to rely on the CEO to be a very nice person or not.\n(LAUGHTER)\nCompetition is the discipline.\nPeople talk -- people like Hillary Clinton, talk about how he's a policy wonk. She gets to the back of every briefing book. This shows she has not studies this issue at all. We've been through this. Valiant pharmaceuticals touring. This is just the latest. Price goes up on an old drug off patent, politicians scream, and then we learn that the FDA has been keeping the competitors out of the market.\nSo she needs to study this industry. She's also, by the way, learned nothing from the failure of her '93 health care plan, the same ideological approach, instead of looking at the facts.\nGIGOT: Why is it unconscionable for government? The answer is this is a government-created problem, and we'll end in more government for it. Why is it never the government that is unconscionable by restricting this market?\nRAGO: The problem is that companies like Mylan are violating kind of the bargain that consumers are willing to finance innovation. I think the dangers of the drug companies are going to get Hillary Clinton's drug price controls.\nGIGOT: All right, Joe.\nThank you all.\nWe'll have to take one more break. When we come back, \"Hits and Misses\" of the week.\n(COMMERCIAL BREAK)\nGIGOT: Time now for our \"Hits and Misses\" of the weekend.\nKim, start us off.\nSTRASSEL: Paul, this is a hit to France's top administrative court for overturning burkini bans that were popping up in French coastal towns. You know, it isn't just that these bans violated constitutional rights and targeted people solely for their religious convictions. I mean, you could go to the beach in a full, wet, body suit to go surfing, and that was fine, but not if you were there for religious convictions. But it's also good because it essentially holds up France's right to not tell women what they are supposed to wear.\nGIGOT: All right, thanks, Kim.\nWilliam?\nMCGURN: Paul, this is to Jonathan Perry, a Republican state Senator in Louisiana, who is proposing to regulate the Cajun Navy. The Cajun Navy is the unofficial nickname --\n(LAUGHTER)\n-- for the citizens that just take their flat-bottomed boats and go out to rescue other people. The Cajun Navy is very sophisticated. They are using Facebook and phone apps to pinpoint people and help to deliver it. These are people that are taking the initiative. The last thing they need is regulation.\nGIGOT: All right.\nJoe?\nRAGO: A hit for one to the rare college willing to stand up for free inquiry. That's the University of Chicago. In a letter this week, the dean of students told the incoming freshmen to prepare to be challenged and even discomforted by their education. He wrote, \"Our commitment to academic freedom means we do not support so-called trigger warnings. We do not condone the creation of intellectual safe spaces where individuals can retreat from perspectives that are different from their own.\" Congratulations for treating students like the adults they are.\nGIGOT: James?\nFREEMAN: Paul, more good news from campus, believe it or not. There's been a sighting of an honest liberal. At Harvard University, law professor, Laurence Tribe, studied the D.C. circuit opinion and said, yes, the IRS did target conservatives.\nBy the way, there's a great book on this called \"The Intimidation Game\" that you might want to check out.\n(CROSSTALK)\nGIGOT: Who's the author of that, James?\nFREEMAN: Uh, uh.\nGIGOT: Kim Strassel.\nSTRASSEL: Thank you, James.\n(LAUGHTER)\nGIGOT: All right, thank you all.\nAnd it is a good book.\n Thanks to my panel and to all of you for watching. I'll Paul Gigot. We hope to\nEND\n ", "external_links": [], "published": "2016-08-27T03:00:00.000+03:00", "crawled": "2016-09-01T09:51:42.736+03:00", "highlightTitle": ""}