{"organizations": [], "uuid": "750596fb0168c9d1fe03489c94f30ea7ccd21718", "thread": {"social": {"gplus": {"shares": 1}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 16}, "facebook": {"likes": 363, "shares": 363, "comments": 5}, "stumbledupon": {"shares": 0}}, "site_full": "www.buzzfeed.com", "main_image": "https://img.buzzfeed.com/buzzfeed-static/static/2016-09/12/18/campaign_images/buzzfeed-prod-fastlane03/the-rise-and-fall-of-trumps-hispanic-advisory-cou-2-26213-1473719260-4_dblbig.jpg", "site_section": "http://www.buzzfeed.com/politics.xml", "section_title": "BuzzFeed - Politics", "url": "https://www.buzzfeed.com/adriancarrasquillo/the-rise-and-fall-of-trumps-hispanic-advisory-council", "country": "US", "domain_rank": 137, "title": "The Rise And Fall Of Trump's Hispanic Advisory Council", "performance_score": 3, "site": "buzzfeed.com", "participants_count": 1, "title_full": "The Rise And Fall Of Trump's Hispanic Advisory Council", "spam_score": 0.0, "site_type": "news", "published": "2016-09-13T01:59:00.000+03:00", "replies_count": 0, "uuid": "750596fb0168c9d1fe03489c94f30ea7ccd21718"}, "author": "Adrian Carrasquillo", "url": "https://www.buzzfeed.com/adriancarrasquillo/the-rise-and-fall-of-trumps-hispanic-advisory-council", "ord_in_thread": 0, "title": "The Rise And Fall Of Trump's Hispanic Advisory Council", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "negative"}, {"name": "kellyanne conway", "sentiment": "none"}, {"name": "eddie aldrete", "sentiment": "none"}, {"name": "jeb bush", "sentiment": "none"}, {"name": "jacob monty", "sentiment": "none"}, {"name": "nixon", "sentiment": "none"}, {"name": "mark gonzales", "sentiment": "none"}, {"name": "artemio muniz", "sentiment": "none"}, {"name": "helen aguirre-ferre", "sentiment": "none"}, {"name": "ileana garcia", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "omarosa manigault", "sentiment": "none"}, {"name": "rodriguez", "sentiment": "none"}, {"name": "palomarez", "sentiment": "none"}, {"name": "aguirre-ferre", "sentiment": "none"}, {"name": "massey", "sentiment": "none"}, {"name": "leslie sanchez", "sentiment": "none"}, {"name": "luis alvarado", "sentiment": "none"}, {"name": "alfonso aguilar", "sentiment": "none"}, {"name": "alan cobb", "sentiment": "none"}, {"name": "monty", "sentiment": "none"}, {"name": "mario rodriguez", "sentiment": "none"}, {"name": "henry bonilla", "sentiment": "none"}, {"name": "massey villarreal", "sentiment": "none"}, {"name": "alvarado", "sentiment": "none"}, {"name": "ramiro peña", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "ted kennedy", "sentiment": "none"}, {"name": "jesus marquez", "sentiment": "none"}, {"name": "villarreal", "sentiment": "none"}, {"name": "mitt romney", "sentiment": "none"}, {"name": "jenny korn", "sentiment": "none"}, {"name": "stephen miller", "sentiment": "none"}, {"name": "john mccain", "sentiment": "none"}, {"name": "muniz", "sentiment": "none"}, {"name": "ann coulters", "sentiment": "none"}, {"name": "donald", "sentiment": "none"}, {"name": "javier palomarez", "sentiment": "none"}, {"name": "aguilar", "sentiment": "none"}, {"name": "cobb", "sentiment": "none"}, {"name": "michele bachmann", "sentiment": "none"}, {"name": "adrian carrasquillo", "sentiment": "none"}, {"name": "dennis nixon", "sentiment": "none"}, {"name": "rick figueroa", "sentiment": "none"}, {"name": "miller", "sentiment": "none"}, {"name": "jeff sessions", "sentiment": "none"}], "locations": [{"name": "california", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "trump tower", "sentiment": "none"}, {"name": "arizona", "sentiment": "none"}, {"name": "omarosa", "sentiment": "none"}, {"name": "great america", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}, {"name": "phoenix", "sentiment": "none"}, {"name": "nevada", "sentiment": "none"}], "organizations": [{"name": "buzzfeed news", "sentiment": "negative"}, {"name": "ap", "sentiment": "negative"}, {"name": "trump's hispanic advisory council photo", "sentiment": "neutral"}, {"name": "trump", "sentiment": "none"}, {"name": "houston chronicle", "sentiment": "none"}, {"name": "los republicanos", "sentiment": "none"}, {"name": "texas federation of hispanic republicans", "sentiment": "none"}, {"name": "republican national committee", "sentiment": "none"}, {"name": "times", "sentiment": "none"}, {"name": "ibc", "sentiment": "none"}, {"name": "new york times", "sentiment": "none"}, {"name": "msnbc", "sentiment": "none"}, {"name": "rnc", "sentiment": "none"}, {"name": "ibc bank", "sentiment": "none"}, {"name": "politico", "sentiment": "none"}, {"name": "national advisory council for trump", "sentiment": "none"}, {"name": "u.s. hispanic chamber of commerce", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Photo illustration by BuzzFeed News; AP Images ID: 9596499 \nWhile Donald Trump sent supporters home happy after his illegal immigration speech in Phoenix on the final day of August, the Republican National Committee was scrambling to put out fires with members of his Hispanic advisory council jumping ship or threatening to quit, appalled and feeling misled about where Trump would end up on immigration. \nMassey Villarreal, a member of the U.S. Hispanic Chamber of Commerce, sent an angry email to other members of the advisory council and members of the RNC, calling the speech disgusting and saying he was quitting, according to sources who received the missive. Pastor Ramiro Peña told Politico he would have to reconsider being part of a “scam.” \nAnd others, like leading Hispanic conservatives Alfonso Aguilar and Pastor Mark Gonzales — who counts thousands of Latino evangelical churches as part of his groups — made a clean break, informing the RNC that they would not be publicly endorsing Trump or helping the council. \nRNC officials have disputed how many members left the council in conversations with Hispanic Republicans, and told BuzzFeed news only two official members left. Some, like Aguilar, were never officially part of the group, though he like the rest submitted ideas to the campaign on the ways undocumented immigrants could remain in the country, an idea Trump seemed intrigued by at the Aug. 20 council meeting. \nThe RNC has also admonished those who left over immigration, with the message that Trump never promised them anything. Latino conservatives say RNC officials have worked in the last week to replenish the council with new members, which the RNC confirmed, though other departures may still occur. \nThe RNC told BuzzFeed News that despite departures it has received “considerable” support from other Hispanic leaders nationwide who wish to participate on the council and in other state initiatives. “As a result, we are welcoming new members to the National Advisory Council for Trump,” RNC Hispanic media director Helen Aguirre-Ferre said in a statement. “In addition, we have the commitment from many others who wish to participate in various initiatives, particularly in battleground states.” \nBut those close to the council, former members, and former RNC staffers say that one thing is for sure: The days of the group having any measure of influence with the campaign are done. \n“Oh, gosh, no, they won’t meet again,” said Leslie Sanchez, a veteran Republican strategist close to some of the council members, asked if she anticipated the group sitting with Trump and campaign officials again before the election, but stressed it was just her opinion. \n“After that speech, how real is that council?” Aguilar said. “Even if they meet what are they going to say, what are they going to talk about? It has no power or influence, at least to the campaign.” \nArtemio Muniz, a Texas Republican leader close to many on the council was succinct: “It’s never going to meet again, these are people with no influence.” \nLatino Republicans say the group was intended to be like similar ones for Mitt Romney in 2012 and John McCain in 2008, with the RNC playing a major role. In the past, those lists have featured 200 people; Trump’s version began with only 23 members, and half were relatively new to an advisory role or have less influence nationally. By comparison, Jeb Bush unveiled a 228-member Hispanic leadership committee during the primary. \nSome like Jacob Monty, who has since left Trump’s council, connected with the campaign after he stuck his neck out with a June op-ed in the Houston Chronicle titled “A Latino’s Case For Donald Trump.” Others were in touch with the RNC as preparations for the convention ramped up. Aguilar said the genesis, though, was at the convention. He said that Aguirre-Ferre viewed the council as a vehicle to start Trump’s Latino outreach in earnest. \nThe group met first on Aug. 19, a day before their ill-fated session with Trump turned into a weekend of confusing coverage . The RNC’s Jenny Korn attended the Aug. 19 meeting, along with the campaign’s coalitions director Alan Cobb. At the meeting, the Hispanic advisers were honest about their concerns with Trump. A day later, though, the RNC sent out a memo with the names of the council members, which suggested the group was working on behalf of the campaign. \nDuring the Aug. 20 meeting, council members perceived Trump as willing to shift his position on mass deportations of undocumented immigrants, an opinion multiple members related to reporters. After the ensuing firestorm — Trump has staked his candidacy on tough immigration policies — the campaign criticized the RNC. In a story about tensions between the campaign and the committee, the New York Times reported that Trump senior adviser Stephen Miller wrote in an email, “The RNC needs to take control of this situation and quickly.” \nBut Trump leaning on the RNC for Hispanic outreach was deliberate, Aguilar said, recalling that the Trump campaign’s Cobb told him, “I have so much to do I’m going to have to defer to the RNC” on Latino engagement. \nOr as a former RNC staffer put it, the campaign didn’t even have the skeleton operation for Hispanic issues that it had for black outreach led by Omarosa Manigault. \n“Trump has no organization for Hispanic stuff,” the operative said, before adding dismissively, “They don’t have an Omarosa — none of the famous Hispanics that were on The Apprentice have stepped up to serve.” \nAs has been reported, Trump’s Hispanic supporters said they were misled, and even those who did not resign felt that the candidate was pivoting to become the softer edge, deal-making businessman they saw during his trip to Mexico. \nBut when the Times reported that Miller had also called those who resigned “professional amnesty lobbyists,” he did more than anger those who had stopped supporting Trump. \nMonty, a Houston-based immigration lawyer, was livid about Miller’s comment. \n“I’m going to challenge that little punk to see who has donated more to Republican candidates me or him,” Monty said. “I didn’t wake up and decide I was a Republican, I’ve been doing this since 1997. Raising money, this is my life. I’m more of a Republican than him or (Sen. Jeff Sessions).” Miller formerly worked for Sessions and former Rep. Michele Bachmann. \nMonty added that he is telling Texas Republican friends of his not to waste their money on the top of the ticket and instead create a down ballot speed bump for Hillary Clinton, who he does not support, in case she wins. \nMiller’s words contributed to a feeling from some council members that the campaign doesn’t want them, putting them in a more difficult position because many are already feeling immense pressure for supporting Trump in the first place. \nEddie Aldrete, a council member, has told friends he is considering leaving the group, but finds himself in a tough position because he works for the Latino-owned IBC Bank, whose CEO, Dennis Nixon, is the Texas state finance chair for Trump. \nNixon’s IBC bank, which does lots of business with the Hispanic community on both sides of the border, features a logo with a map of the U.S. and Mexico. The bank drew the ire of the Congressional Hispanic Caucus’ Bold PAC, which voted to spend $50,000 to inform Hispanics of Nixon’s Trump support. The bank is also feeling pressure from Mexican clients angry over its leadership supporting Trump, a source said. \nIBC Bank did not respond to a request for comment by time of publication. \nMario Rodriguez — an influential council member and chairman of the Hispanic 100, a PAC working to get more Hispanics to vote for Republicans — has told friends he was throwing up listening to Trump’s immigration speech, and had to put out a fire with a major client over his Trump support. \nBut Rodriguez, like others who doesn’t love Trump, has privately said he isn’t convinced Trump will lose and doesn’t want to leave the council because he would rather have a seat at the table than not. \nU.S. Hispanic Chamber of Commerce members also criticized Massey Villarreal, a Texas-based member of the council, before he resigned. The group’s president, Javier Palomarez, who last week called Trump a “clown” on MSNBC for his immigration speech, confirmed that he fielded those complaints, but like Villarreal, he too privately met with Trump last Fall and felt betrayed by what he saw as the contrast between the public Trump and the private Trump. \n“I met with Donald and in a private setting he was quiet, respectful, mannerly and inquisitive, Palomarez said. “Like I had been shocked by his double down on immigration, Massey went through what I went through.” \nAnother advisory council member from Texas, Henry Bonilla, is considering leaving the council as well, a source said. \nThe remaining members are said to be trying to exert some measure of influence with Trump campaign manager Kellyanne Conway by reaching out to her directly, unsure whether the council will retain influence with the campaign. But Trump-world feels the Hispanic advisers overplayed their hands and overreacted in the heat of the moment during the August meeting, with many of them not being seen as true believers in Trump. \n“That was really the RNC’s fault,” a Trump staffer said. \nMoving forward, the “answer is to look closely at who is on the list,” the staffer continued. “It shouldn’t be controversial, you should be 1000% behind Trump. If you have a different position on immigration that’s fine, but you shouldn’t be advising him.” \nLeslie Sanchez, the longtime operative who wrote the book Los Republicanos, Why Hispanics and Republicans Need Each Other, said she has seen the problems that doomed the Hispanic advisory council from the start. \nShe recalled speaking at a conference when John McCain and Ted Kennedy were in the middle of trying to pass immigration legislation, when Republicans told her they couldn’t attend because they didn’t want to be seen supporting “amnesty.” They didn’t understand that she wasn’t there to talk about immigration, she said. \nMoving forward, she argued, Republicans have to question the impact of ethnic advisory groups that should instead focus on policy. \n“We’ve got to grow up,” she said. “We need policy collaboratives, not ethnic collaboratives, which tend to marginalize more people. Why are we still on this special Hispanic bus?” \nThe Trump effort was a “sad, anemic clone of yesteryear and what authentic, inclusive Hispanic outreach operations should look like,” she said. \nCalifornia Republican strategist Luis Alvarado, said the advisory council has just been smoke and mirrors to attain earned media to sustain the campaign’s message that it was dipping its toe into Hispanic outreach. \n“They could barely muster sufficient bodies for a photo opp at Trump Tower,” he said. \nAlvarado will be joining Muniz, chair of the Texas Federation of Hispanic Republicans, who is putting together a group of Hispanic conservatives who will meet along with others, like Jacob Monty, the day of the scheduled third debate Oct. 19, to plot a way forward for Republicans on Latino issues. \nStill, some Hispanic Trump supporters say while his immigration speech wasn’t ideal, they are still on board and the council still has important work to do. \n“I wouldn’t have said some of the things he said in Arizona but he’s unorthodox,” said Rick Figueroa, one of the few Texas council members left, adding that it is important to have their voices at the table. “I think we’re going to meet with the campaign and Mr. Trump again.” \n“I didn’t agree with everything he said in the speech but we can focus on the things we agree on,” said Jesus Marquez, a Nevada radio host, who stressed he believes the council will continue to have influence. “This is not over.” \nAs has often been the case, even when Trump doubles down on hardline rhetoric, some of his supporters believe he will still soften his tone and policies at a vaguely later date. \nIleana Garcia, who started Latinas for Trump, before speaking to the campaign and eventually joining Great America PAC, predicted that Trump will pivot for good — soon. \n“He’s gotta cater to the hardcore, to the Ann Coulters, but at the same time he has to cater to his Hispanic and his African American employees,” she said. “Es una buena persona (he’s a good person). When the polls get tighter what do you want to bet they will revisit it again, in the next 30 days, and revise on immigration?” Adrian Carrasquillo is a political reporter for BuzzFeed News and is based in New York. Contact Adrian Carrasquillo at .", "external_links": [], "published": "2016-09-13T01:59:00.000+03:00", "crawled": "2016-09-13T02:14:03.805+03:00", "highlightTitle": ""}