{"organizations": [], "uuid": "6b7e504bd8b1984cc1c8f2c46dbe30f61ac33768", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 15, "shares": 15, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/news/0/0/young%20immigrant%20voters%20more%20libera.jpg", "site_section": "http://feeds.latino.foxnews.com/home/feed", "section_title": "FOX News", "url": "http://latino.foxnews.com/latino/news/2016/09/10/poll-suggests-young-immigrant-latinos-hold-more-liberal-political-views/", "country": "US", "domain_rank": 185, "title": "Poll suggests young immigrant Latinos hold more liberal political views", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "Poll suggests young immigrant Latinos hold more liberal political views | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2016-09-10T03:00:00.000+03:00", "replies_count": 0, "uuid": "6b7e504bd8b1984cc1c8f2c46dbe30f61ac33768"}, "author": "Fox News Latino", "url": "http://latino.foxnews.com/latino/news/2016/09/10/poll-suggests-young-immigrant-latinos-hold-more-liberal-political-views/", "ord_in_thread": 0, "title": "Poll suggests young immigrant Latinos hold more liberal political views", "locations": [], "entities": {"persons": [{"name": "jones", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "barack obama", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "zoraida ramirez", "sentiment": "none"}, {"name": "clinton", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "tavares", "sentiment": "none"}, {"name": "marco rubio", "sentiment": "none"}, {"name": "martin", "sentiment": "none"}, {"name": "davis", "sentiment": "none"}, {"name": "brad jones", "sentiment": "none"}, {"name": "ramirez", "sentiment": "none"}, {"name": "juan tavares", "sentiment": "none"}], "locations": [{"name": "california", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}, {"name": "connecticut", "sentiment": "none"}], "organizations": [{"name": "university of california", "sentiment": "none"}, {"name": "republican party", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "associated press-norc center for public affairs research", "sentiment": "none"}, {"name": "associated press", "sentiment": "none"}, {"name": "genforward", "sentiment": "none"}, {"name": "black youth project", "sentiment": "none"}, {"name": "catherine t. macarthur foundation", "sentiment": "none"}, {"name": "ford foundation", "sentiment": "none"}, {"name": "university of chicago", "sentiment": "none"}, {"name": "ap", "sentiment": "none"}, {"name": "facebook  follow us on twitter & instagram", "sentiment": "none"}, {"name": "democratic party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "  Fox News Latino FILE - In this June 15, 2012 file photo, young demonstrators participate in a rally in support of President Barack Obama after the president announced that the U.S. government will stop deporting and begin granting work permits to younger illegal immigrants who came to the U.S. as children and have since led law-abiding lives. Young Hispanic and Asian-Americans who are immigrants themselves or have a parent who is are more likely to be liberal in their views on politics and immigration than those with families who have been in United States longer, a new GenForward poll shows. (AP Photo/Jacquelyn Martin, File) Copyright 2016 The Associated Press. All rights reserved. \nWASHINGTON (AP) –   Young Hispanic and Asian-Americans who are immigrants or have an immigrant parent are more likely to be liberal in their views on politics and immigration than those with families who have been in United States longer, a new GenForward poll shows.\nEighty-seven percent of those age 18 to 30 who are immigrants or who have parents who are immigrants support allowing those who were brought to the United States illegally as children to stay legally, while 72 percent of those whose families have been in the U.S. longer agree. Eighty-five percent of first and second generation Latino and Asian immigrants and 74 percent of those who are third generation or greater oppose building a border wall.\n\"Having some sort of program that allows the illegal citizens to become legal citizens, I think it gives the viewpoint that the U.S. cares,\" said Juan Tavares, a 24-year-old from California whose parents were born in Mexico. \"You're going to have people who are illegal who will prove that they're loyal or they care about what this country has given to them and they would like a chance to give back.\"\nStill, Tavares, a U.S. citizen, says the United States could do more to secure its border with Mexico, including by building a wall in parts of California and Texas.\n\"Just because I'm Mexican, it doesn't mean I believe in an open border,\" he said.\nGenForward is a survey of adults age 18 to 30 by the Black Youth Project at the University of Chicago with the Associated Press-NORC Center for Public Affairs Research. The first-of-its-kind poll pays special attention to the voices of young adults of color, highlighting how race and ethnicity shape the opinions of a new generation.\nOnly a minority of young Hispanics and Asian-Americans in the poll — 27 percent and 9 percent, respectively — say both of their parents were born in the United States.\nBrad Jones, a professor at the University of California, Davis, who focuses on race, ethnicity and immigration, said the results reflect that Latino immigrants are more directly affected by the increase in deportations under President Barack Obama's administration and shifts in immigration enforcement policy. Jones also noted that while much attention is focused on Trump's stance on illegal immigration, Asian-Americans have also been \"widely tethered\" to negative rhetoric on immigration throughout the campaign.\n\"It's not a surprise that young people who are closely connected either to parents who are immigrants or who are immigrants themselves are going to be just more attuned to the negative externalities of these policies,\" Jones said.\nZoraida Ramirez, a 20-year-old Hispanic woman whose great-grandparents moved to the United States, opposes building a border wall or deporting the millions of people who live in the United States illegally, though she only somewhat supports creating a path to citizenship for them. She somewhat opposes allowing people to become U.S. citizens if they graduate from college.\n\"There are people that have worked to do it the right way and worked to do it the legal way,\" Ramirez, who lives in Connecticut, said.\nThe difference extends to politics, too. Seventy-one percent of first and second generation Asian-Americans and Latinos, but just 49 percent of those whose families have been in the United States longer, identify with or lean toward the Democratic Party. And 27 percent of third generation or later Hispanics and Asian-Americans, but just 14 percent of more recent immigrants, identify with or lean toward the Republican Party.\nFifty-nine percent of immigrants and children of immigrants, but just 34 percent of those who don't have at least one immigrant parent, have a favorable view of Democratic presidential nominee Hillary Clinton. Seventy-one percent of first and second generation Hispanics and Asian-Americans, but just 50 percent of those who aren't immigrants or children of immigrants, say she is qualified to be president. There's no such gap on views of Republican Donald Trump, with less than 2 in 10 among either group saying he is qualified to be president.\nRamirez, who didn't vote in the primary but said she preferred Florida Sen. Marco Rubio, said she's leaning toward Clinton even though she views her somewhat unfavorably.\n\"With Trump, he's kind of a little bit too extreme for my taste, his views are so right wing,\" she said. \"He goes back on his word a lot.\"\n___\nThe poll of 1,958 adults age 18-30 was conducted August 1-14 using a sample drawn from the probability-based GenForward panel, which is designed to be representative of the U.S. young adult population. The margin of sampling error for all respondents is plus or minus 3.9 percentage points.\nThe survey was paid for by the Black Youth Project at the University of Chicago, using grants from the John D. and Catherine T. MacArthur Foundation and the Ford Foundation.\nRespondents were first selected randomly using address-based sampling methods, and later interviewed online or by phone.\nLike us on Facebook \nFollow us on Twitter & Instagram", "external_links": [], "published": "2016-09-10T03:00:00.000+03:00", "crawled": "2016-09-10T18:20:59.868+03:00", "highlightTitle": ""}