{"organizations": [], "uuid": "83833ea7008e74c685e31080acc3dbf40b828e0d", "thread": {"social": {"gplus": {"shares": 2}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 161, "shares": 161, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/politics/0/0/Wisconsin%20senate%20immigration.jpg", "site_section": "http://feeds.latino.foxnews.com/home/feed", "section_title": "FOX News", "url": "http://latino.foxnews.com/latino/politics/2016/09/18/wisconsin-senate-race-candidates-clash-over-immigration-policy-keep-to-party/", "country": "US", "domain_rank": 185, "title": "Wisconsin Senate race candidates clash over immigration policy, keep to party line", "performance_score": 1, "site": "foxnews.com", "participants_count": 1, "title_full": "Wisconsin Senate race candidates clash over immigration policy, keep to party line | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2016-09-18T03:00:00.000+03:00", "replies_count": 0, "uuid": "83833ea7008e74c685e31080acc3dbf40b828e0d"}, "author": "Fox News Latino", "url": "http://latino.foxnews.com/latino/politics/2016/09/18/wisconsin-senate-race-candidates-clash-over-immigration-policy-keep-to-party/", "ord_in_thread": 0, "title": "Wisconsin Senate race candidates clash over immigration policy, keep to party line", "locations": [], "entities": {"persons": [{"name": "ron johnson", "sentiment": "negative"}, {"name": "russ feingold", "sentiment": "negative"}, {"name": "clinton", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "christine neumann-ortiz", "sentiment": "none"}, {"name": "johnson", "sentiment": "none"}, {"name": "barack obama", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "feingold", "sentiment": "none"}, {"name": "david canon", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "wis.", "sentiment": "none"}, {"name": "madison", "sentiment": "none"}, {"name": "wisconsin", "sentiment": "none"}], "organizations": [{"name": "wisconsin senate", "sentiment": "negative"}, {"name": "democratic senate", "sentiment": "negative"}, {"name": "university of wisconsin-madison", "sentiment": "none"}, {"name": "voces de la frontera action", "sentiment": "none"}, {"name": "canon", "sentiment": "none"}, {"name": "senate", "sentiment": "none"}, {"name": "ap photos", "sentiment": "none"}, {"name": "voces de la frontera", "sentiment": "none"}, {"name": "oshkosh republican", "sentiment": "none"}, {"name": "u.s. senate", "sentiment": "none"}, {"name": "u.s. supreme court", "sentiment": "none"}, {"name": "ap", "sentiment": "none"}, {"name": "senate homeland security committee", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "  Democratic Senate candidate Russ Feingold (left) and U.S. Sen. Ron Johnson, R-Wis. (right) class over immigration policy. (AP Photos) \nMADISON, Wis. (AP) –   Ron Johnson wants to take immigration reform one step at a time. Russ Feingold wants to go all in.\nWisconsin's U.S. Senate candidates' immigration stances couldn't be more diametrically opposed, with each aligning closely to his party's stances. Johnson has become a loud advocate for securing the border first and worrying about those already here later. Feingold, by contast, wants sweeping reforms that include creating ways for people already here illegally to become American citizens.\nJohnson, the incumbent Oshkosh Republican, has been pushing for securing the border since he became chairman of the Senate Homeland Security Committee last year, echoing what has become a key Republican talking point as the campaign season rolls on.\nIn a report last year, he called the nation's legal immigration system \"horribly broken.\" Comprehensive immigration reform can't happen until the country solves the drivers of illegal immigration -- better wages, the president's unwillingness to turn people away at the border and the U.S. demand for drugs.\nThe federal government instead should tackle the issue in steps, first by securing the border, Johnson said. That's a tough task, since no country's border is 100 percent secure. But Johnson wants to start by gathering better data on illegal border crossings; launching a public relations campaign to keep people off drugs; moving federal agents to crossing hotspots; including shrinking the wage gap between the U.S. and its southern neighbors; and returning unaccompanied minors to their home countries. He's also called for erecting fencing along high-traffic border areas.\nOnce that's done, the nation should turn its attention to people who are already here illegally, Johnson has said.\nThe senator has called for cutting off federal funding for so-called sanctuary cities that don't turn people in the country illegally over to federal authorities. In a 2013 news release, he said he voted against a comprehensive reform bill because it wouldn't do enough to solve illegal immigration, although he has said he supports a path to citizenship and deporting millions of people wouldn't be practical.\nJohnson also has said Republican presidential nominee Donald Trump's plan to remove people living in the country illegally if they've committed crimes beyond their immigration offenses is in the country's best interests. He has stopped short of supporting Trump's plan to build a wall along the southern border, though, saying strategic fencing is a better option.\nFeingold, a Democrat looking to reclaim the Senate seat he lost to Johnson in 2010, supports comprehensive reform, including improving border security and providing a path to citizenship for people already in the country. Democratic presidential nominee Hillary Clinton has promised to propose a route to citizenship within her first 100 days in office. During his tenure in the Senate, Feingold voted twice for the Dream Act, a bill that would provide a path to citizenship for people in the U.S. illegally because they were brought to the country as children.\nFeingold also supports President Barack Obama's executive orders that shielded up to 4 million children and parents in the country illegally from deportation. The U.S. Supreme Court blocked the order in June, though Clinton believes such actions are within the president's authority.\nIt's unclear how much immigration policy will resonate with Wisconsin voters. Johnson has been pounding away at border security, bringing it up at multiple forums over the last year, but Feingold has focused largely on other issues such as college affordability and opposing multi-national trade agreements.\nImmigration is a much larger issue in southwestern states than in Wisconsin, said David Canon, chairman of the University of Wisconsin-Madison political science department. But Johnson appears to be spotlighting it in an effort to motivate conservative voters, particularly Trump supporters, and get them to the polls, Canon said.\nJohnson's philosophies have pushed Voces De La Frontera Action, the political arm of the immigrant advocacy group Voces De La Frontera, to endorse Feingold.\n\"(Hispanics) are a growing constituency in Wisconsin and Johnson is motivating them to turn out against him,\" Christine Neumann-Ortiz, executive director of Voces De La Frontera Action, said in a statement.\n ", "external_links": [], "published": "2016-09-18T03:00:00.000+03:00", "crawled": "2016-09-18T20:55:16.777+03:00", "highlightTitle": ""}