{"organizations": [], "uuid": "23a2fb7c212e63a84b37e5b7483295ba54b31464", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "warwickonline.com", "main_image": "http://warwickonline.com/uploads/original/1473771917_efbd.jpg", "site_section": "", "section_title": "", "url": "http://warwickonline.com/stories/inequality-and-the-american-dream-topic-of-uri-colloquium,116138", "country": "US", "title": "'Inequality and the American Dream' topic of URI colloquium | Warwick Beacon", "performance_score": 0, "site": "warwickonline.com", "participants_count": 0, "title_full": "'Inequality and the American Dream' topic of URI colloquium | Warwick Beacon", "spam_score": 0.0, "site_type": "news", "published": "2016-09-13T20:58:00.000+03:00", "replies_count": 0, "uuid": "23a2fb7c212e63a84b37e5b7483295ba54b31464"}, "author": "Head Shots", "url": "http://warwickonline.com/stories/inequality-and-the-american-dream-topic-of-uri-colloquium,116138", "ord_in_thread": 0, "title": "'Inequality and the American Dream' topic of URI colloquium | Warwick Beacon", "locations": [], "entities": {"persons": [{"name": "liam malloy", "sentiment": "none"}, {"name": "bill maher", "sentiment": "none"}, {"name": "bernie sanders", "sentiment": "none"}, {"name": "johnson", "sentiment": "none"}, {"name": "jill doerner", "sentiment": "none"}, {"name": "malloy", "sentiment": "none"}, {"name": "defrancesco soto", "sentiment": "none"}, {"name": "kristin johnson", "sentiment": "none"}, {"name": "erik loomis", "sentiment": "none"}, {"name": "victoria m. defrancesco soto", "sentiment": "none"}, {"name": "kimberlé crenshaw", "sentiment": "none"}, {"name": "lynne derbyshire", "sentiment": "none"}, {"name": "fox", "sentiment": "none"}, {"name": "uri", "sentiment": "none"}], "locations": [{"name": "united states", "sentiment": "none"}, {"name": "edwards hall", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "kingston campus", "sentiment": "none"}, {"name": "brazil", "sentiment": "none"}, {"name": "upper college road", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "india", "sentiment": "none"}], "organizations": [{"name": "warwick beacon", "sentiment": "none"}, {"name": "uri", "sentiment": "none"}, {"name": "ucla", "sentiment": "none"}, {"name": "hbo", "sentiment": "none"}, {"name": "university of texas at austin", "sentiment": "none"}, {"name": "columbia school of law", "sentiment": "none"}, {"name": "columbia university", "sentiment": "none"}, {"name": "cnn", "sentiment": "none"}, {"name": "labor", "sentiment": "none"}, {"name": "honors program", "sentiment": "none"}, {"name": "pbs", "sentiment": "none"}, {"name": "msnbc", "sentiment": "none"}, {"name": "npr", "sentiment": "none"}, {"name": "university of california los angeles", "sentiment": "none"}, {"name": "telemundo", "sentiment": "none"}, {"name": "university of rhode island", "sentiment": "none"}, {"name": "diversity and education", "sentiment": "none"}, {"name": "uri honors program committee", "sentiment": "none"}, {"name": "univision", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "'Inequality and the American Dream' topic of URI colloquium CRENSHAW Tuesday, September 13, 2016 12:58 pm 2 head shots \nUniversity of Rhode Island Assistant Professor of Economics Liam Malloy puts it simply: Income inequality today is where it stood in the 1920s right before the Great Depression. \nHis colleague, URI Associate Professor of Political Science Kristin Johnson, has been at URI for nine years and when she asked her students in the early part of her career what they had hoped to earn after graduation, they said around $80,000. \"Now they are saying $30,000, and 'I just want to survive. I just want a job,;\" Johnson said. \nAnd most Americans know the squeezing of the American middle class, those living in poverty and immigration have been among the hottest topics in the presidential campaign. In fact, on Labor Day, 2016, former presidential candidate Bernie Sanders offered this tweet: \"This is truly unbelievable. The U.S. middle class has a lower share of wealth than China, India and Brazil.\" \nThe university's 2016 Honors Colloquium will address the many interrelated issues of economic, political and social inequality this fall as it presents \"Inequality and the American Dream.\" URI's premier free, public lecture series meets Tuesdays from Sept. 20 to Nov. 29 at 7 p.m. in Edwards Hall, 64 Upper College Road on the Kingston Campus. The topics of the nine lectures are: Immigration; Race, Diversity and Education; Historical Perspectives; Poverty and Homelessness; Gender; Workplace; \nPolitics; Labor; and What is to be Done About Inequality? The speakers include political scientists, media pundits, historians, constitutional experts, nationally known journalists and union experts. \nThis year's colloquium is the work of coordinators Jill Doerner, associate professor of sociology; Erik Loomis, assistant professor of history, Johnson and Malloy. \nIn their proposal to Lynne Derbyshire, director of the Honors Program and the URI Honors Program Committee, the four professors raise the question, \"Is the American economic engine broken? For a majority of families and the current generation of college students, the answer may be, yes. Worker productivity has more than doubled since the late 1970s, but compensation has hardly risen at all for the median worker. In the United States, the share of income going to the top 1 percent has more than doubled, while the share going to the top .01 percent, about 15,000 households, has increased eightfold.\" \nMalloy said that increasing inequality has affected much of American life, including the political arena, in which millionaires and billionaires are free to spend as much as they want, narrowing of agendas and crowding out competing political voices. \n\"A very real consequence is social and economic policy geared toward their interests,\" Malloy said. \n\"For much of our history, the concept of the American Dream told us that if you worked hard, you could get a good job, buy a home and have a solid economic future,\" Johnson said. \"We are now less confident about that.\" \nThe series starts Tuesday, Sept. 20 with a talk on Immigration by Victoria M. DeFrancesco Soto, a political analyst and professor at the University of Texas at Austin. She provides political analysis on U.S. politics and its implications for countries abroad. DeFrancesco Soto is a contributor to MSNBC and NBCNews.com, as well as a regular political analyst for Telemundo. She has previously provided on-air analysis for CNN, Fox, PBS, Univision, NPR and has appeared on HBO's Real Time with Bill Maher . \nThe second lecture on Sept. 27 features the Diversity Week Keynote Speaker, Kimberlé Crenshaw, professor of law at the University of California Los Angeles and Columbia University. Her topic is \"Race, Diversity and Education.\" Her primary scholarly interests center around race and the law, and she was a founder and has been a leader in the intellectual movement called Critical Race Theory. She was elected Professor of the Year by the 1991 and 1994 graduating classes at UCLA. She now splits her time each year between UCLA and the Columbia School of Law. ", "external_links": [], "published": "2016-09-13T20:58:00.000+03:00", "crawled": "2016-09-14T01:55:27.794+03:00", "highlightTitle": ""}