{"organizations": [], "uuid": "21d3a2a0a0b2071330c7d320a1879df7cdc0fb58", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/lifestyle/0/0/Dreamer%20App%20creator.jpg", "site_section": "", "section_title": "", "url": "http://latino.foxnews.com/latino/lifestyle/2016/09/29/after-struggling-to-go-college-while-undocumented-dreamer-creates-app-to-help/", "country": "US", "domain_rank": 185, "title": "After struggling to go to college while undocumented, Dreamer creates app to help peers | Fox News Latino", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "After struggling to go to college while undocumented, Dreamer creates app to help peers | Fox News Latino", "spam_score": 0.019, "site_type": "news", "published": "2016-10-01T02:15:00.000+03:00", "replies_count": 0, "uuid": "21d3a2a0a0b2071330c7d320a1879df7cdc0fb58"}, "author": "Rebekah Sager", "url": "http://latino.foxnews.com/latino/lifestyle/2016/09/29/after-struggling-to-go-college-while-undocumented-dreamer-creates-app-to-help/", "ord_in_thread": 0, "title": "After struggling to go to college while undocumented, Dreamer creates app to help peers | Fox News Latino", "locations": [], "entities": {"persons": [{"name": "sarahi espinoza", "sentiment": "negative"}, {"name": "dreamer", "sentiment": "negative"}, {"name": "rebekah sager", "sentiment": "none"}, {"name": "zuckerberg", "sentiment": "none"}, {"name": "mark zuckerberg", "sentiment": "none"}], "locations": [{"name": "salamanca", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "silicon valley", "sentiment": "none"}, {"name": "washington d.c.", "sentiment": "none"}], "organizations": [{"name": "fox news latino", "sentiment": "none"}, {"name": "stanford", "sentiment": "none"}, {"name": "harvard", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "forbes", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "\nBeing undocumented was something Sarahi Espinoza Salamanca hardly ever talked or thought about growing up in California. \n“Everyone in our family worked. We seemed like every other American,” Salamanca told Fox News Latino. \nIt wasn’t until Salamanca was a senior in high school and started looking into college scholarship money that she realized she couldn’t apply for financial assistance because she didn’t have a social security number. \nFast-forward to 2016. Salamanca, 26, has not only helped ease the burden of many undocumented students hoping to go to college, but she’s proud to say she regularly emails with non-other than Mark Zuckerberg. \nIt all started when she decided to enter a competition called the Voto Latino Innovators Challenge in 2014. The prize was $100K and, if she won, she’d be able to try out her idea to help kids who were brought to the U.S. illegally – the so-called Dreamers – go to college. \n“If I could help just one person not experience what I went through, that’s a success,” Salamanca said. \nAfter a tough competition that included several Ivy-Leaguers, Salamanca won the top prize for her DREAMer’s Roadmap app , which she created with undocumented high school seniors in mind. \nIt provides an extensive up-to-date list of organizations offering scholarships of as little as $100 and as much as $10,000. Additionally, it has an interactive map listing all the U.S. states that offer in-state tuition and/or financial assistance to undocumented students. \nSalamanca, an A-student at the head of her class, said she set up the app to help people with her similar background because when she was looking for financial help to go to college it was nearly impossible to find. \nShe said when she finally gathered the courage to come clean with her teachers and administrators about her citizenship status and ask them for help in her quest, they were of no help. \nThey just didn’t know where to direct her, she said. \nSalamanca was able to attend a local community college with money from a non-profit she found through someone at her church, but had to leave after a year when her father became ill. \nBy 2013 she had become a prolific blogger with “SarahiTV,” where she first explored guiding undocumented students through the process of finding funding. \nAdmittedly not a coder, that year she was happily surprised when she was chosen as one of 20 Dreamers for Mark Zuckerberg’s first “Hackathon ,\" a yearly event that brings together undocumented tech innovators to discuss immigration reform. \n“My story was stronger than my coding,” Salamanca said. \nShe has stayed in contact with Zuckerberg since then, and considers him a mentor. \nIt was the next year, in 2014, when Salamanca decided to go mobile and entered Voto Latino Innovators Challenge with her winning app. \n“Like me, these kids are on their phones all the time, especially if they’re using public transportation. I took the bus to work and it could take me about an hour, so now they could use the time to do something productive,” Salamanca explained. \nShe started in a group of 50 competitors in the Voto Latino challenge. The group whittled down to nine and eventually made it to Washington D.C. for the final competition. \n\"I asked God to help me to be able to communicate my project to the judges. I felt confident despite competing with people from Harvard or Stanford,” she recalled. “I didn’t feel I wasn’t capable or worthy enough to be there,\" she said. \nIn the five months since April’s launch, Salamanca’s app has been downloaded 5,000 times -- her goal had been 10,000 in a year. \nHeadquartered in the center of Silicon Valley, in 2015 she received a House of Representatives Award and recently she was included in the list Forbes 30 under 30 . \nSalamanca and her team are now looking to the future. \nShe is considering offering the DREAMer’s Roadmap to all students looking for scholarship money, not just the immigrant community, and perhaps adding legal and health care resources. \nRebekah Sager is a writer/editor for Fox News Latino. She can be reached at rebekah.sager@foxnewslatino.com. Follow her on Twitter @rebekah_sager \nLike us on Facebook ", "external_links": [], "published": "2016-10-01T02:15:00.000+03:00", "crawled": "2016-09-30T22:13:01.685+03:00", "highlightTitle": ""}