{"organizations": [], "uuid": "843544852cfb571a683003283b8bc8dac96ea0ba", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 28, "shares": 28, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbsnews.com", "main_image": "http://cbsnews1.cbsistatic.com/hub/i/2016/09/08/8000b3e0-3da2-4f65-8bc7-d83db3834ab5/ap740908077-ap7408090400.jpg", "site_section": "http://feeds.cbsnews.com/CBSNewsNational", "section_title": "U.S. - CBSNews.com", "url": "http://www.cbsnews.com/pictures/today-in-history-throwback-thursday-september-8/", "country": "US", "domain_rank": 584, "title": "The way it was: Today in history", "performance_score": 0, "site": "cbsnews.com", "participants_count": 0, "title_full": "The way it was: Today in history", "spam_score": 0.0, "site_type": "news", "published": "2016-09-09T02:18:00.000+03:00", "replies_count": 0, "uuid": "843544852cfb571a683003283b8bc8dac96ea0ba"}, "author": "", "url": "http://www.cbsnews.com/pictures/today-in-history-throwback-thursday-september-8/", "ord_in_thread": 0, "title": "The way it was: Today in history", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Ford pardons Nixon - 1974 \nThrowback Thursday: A look back at events in history on September 8. \nPresident Gerald Ford signs a document granting former President Richard M. Nixon “a full, free and absolute pardon” for all “offenses against the United States” during the period of his presidency. Ford signed the document Sunday morning, Sept. 8, 1974 in his White House office. \nNixon resigned the presidency August 9, 2974. Ford’s announcement of the pardon, one month after taking office, came as a surprise to Congress and the country. His decision, aimed at putting the Watergate scandal in the past, created a huge uproar. \nBy CBSNews.com Senior Photo Editor Radhika Chalasani Credit: AP Warren G. Harding funeral - 1923 \nThe remains of President Warren G. Harding leave the White House in Washington, D.C. as the nation pays its respects to the twenty-ninth president, August 8, 1923. Credit: AP Aviation history - 1931 \nMr. Mignet, the inventor of the “Pou du Ciel,” is shown with his midget plane in an unknown location on August 8, 1931 Credit: AP Mont St. Michel - 1944 \nAn American soldier and a French civilian chat on the causeway leading from the mainland of Brittany to the famous tourist resort of Mont St. Michel in Normandy on August 8, 1944. American forces in their advance across the peninsula seized the resort which was undamaged. Credit: H/AP Hiroshima aftermath - 1945 \nAn allied correspondent stands in a sea of rubble before the shell of a building that once was a movie theater in Hiroshima September. 8, 1945. On Aug. 6, 1945, an atomic bomb instantly destroyed almost all of the houses and buildings in Hiroshima. Credit: AP Gandhi - 1942 \nPandit Jawaharlal Nehru and Mohandas K. Gandhi converse at the All India Congress session in Bombay, where Gandhi demanded an end to British rule in his “Quit India” speech on August 8, 1942. Nehru is a Congress leader and Gandhi, right, is the long-standing head of India’s political movement. \nThe British arrested the two along, with other independence leaders, and imprisoned them without trial the following day under the Defense of India Rules. The movement was crushed and the British refused to grant independence as World War II raged. Gandhi and Nehru were finally released May 6, 1944. Credit: Preston Grove/AP Althea Gibson wins US Open - 1957 \nAlthea Gibson smiles as she holds trophies she won by capturing the National Women’s Singles Tennis Championship at the West Side Tennis Club in Forest Hills, New York, Sept. 8, 1957. Credit: Harry Harris/AP Marilyn Monroe's funeral - 1962 \nFormer major league baseball star Joe DiMaggio, left, and his son, Joe Jr., walk from the chapel of the palms in the background to the nearby crypt in Hollywood, August 8, 1962 during funeral services for movie star Marilyn Monroe. The elder DiMaggio was Miss Monroe’s second husband. Credit: AP Star Trek airs - 1966 \nFirst original Star Trek episode “The Man Trap” was broadcast in the U.S. on September 8, 1966 on NBC. The show, created by Gene Roddenberry, set in the 23rd century featured Captain James T. Kirk and his crew aboard the Starfleet’s USS Enterprise. The season one first episode chronicled the crew being attacked by a shapeshifting alien trying to take salt from their bodies. Credit: Paramount/CBS Aftermath of Olympic terror attack - 1972 \nAnkie Spitzer, widow of the Israeli fencing coach, Andre Spitzer, who was slain by Arab terrorists September 5, surveys the room where the incident occurred at Munich’s Olympic Village in West Germany on September 8, 1972. The chalk circles on the wall were made by West German police to trace the impact of the bullets. Credit: AP Evel Knievel - 1974 \nEvel Knievel sits in the steam powered rocket motorcycle that will hopefully take him across Snake River Canyon on September 8, 1974. The Sky-Cycle X-2 will be at 56 degree angle during takeoff. \nThe jump failed when the parachute on his rocket malfunctioned, opening prematurely. Knievel was uninjured. Credit: AP Tutankhamun on tour - 1976 \nProtective plastic wrapping is removed from the gold mask of Tutankhamun, boy-king of Egypt (1334-1325 BC), by two workers at the National Gallery of Art in Washington, D.C., Sept. 8, 1976. \nThe mask, along with 55 treasures from Tutankhamun’s tomb are in the U.S. for a six city tour. Tutankhamun’s mask is inlaid with carnelian, lapis lazuli, colored glass and quartz. Credit: Charles Bennett/AP Christa McAuliffe - 1985 \nHigh school teacher Christa McAuliffe folds her training uniform as she packs for Houston in Concord, September 8, 1985. McAuliffe will leave on Sunday for NASA training for her January flight aboard the space shuttle Challenger as the first private citizen to ride in space. \nThe ill-fated Challenger broke apart 73 seconds into flight on January 28, 2986, killing all seven crew members, including McAuliffe. Credit: Jim Cole/AP First test-tube baby on tv - 1979 \nLouise Brown, the one-year-old test-tube baby born in England July 25, 1978, responds to a studio audience during taping of the Phil Donahue show in Chicago, on Friday, September 8, 1979. Louise’s mother and father appeared with her, and said they would like to have a second child with the test-tube method. It was Louise’s first U.S. television appearance. \nThe doctors responsible for Louise’s birth, Robert Edwards and Patrick Steptoe, are considered the pioneers of IVF and received the 2010 Nobel Prize in Physiology or Medicine. Credit: FHJ/AP Augusto Pinochet - 2000 \nChile’s Army Commander in Chief Ricardo Izurieta addresses the media outside the house of former ditator Gen. Augusto Pinochet in Santiago, Chile, Tuesday August 8, 2000. \nChile’s Supreme Court stripped Pinochet’s immunity, clearing the way for the former dictator to be tried on human rights charges. Credit: Santiago Llanquin/AP", "external_links": [], "published": "2016-09-09T02:18:00.000+03:00", "crawled": "2016-09-08T17:27:13.994+03:00", "highlightTitle": ""}