{"organizations": [], "uuid": "e29ed8048d10c6b5168b3ceaf8899714f0b2a3e9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "myinforms.com", "main_image": "http://i1.myinforms.com/470x300/2016/08/31/2/president-obama-cuts-short-the-sentences-of-111-federal-inmates-wvideo.jpg", "site_section": "", "section_title": "", "url": "http://myinforms.com/en/a/40335084-president-obama-cuts-short-the-sentences-of-111-federal-inmates-wvideo/", "country": "DE", "domain_rank": 23997, "title": "President Obama cuts short the sentences of 111 federal inmates (w/video) | Myinforms", "performance_score": 0, "site": "myinforms.com", "participants_count": 0, "title_full": "President Obama cuts short the sentences of 111 federal inmates (w/video) | Myinforms", "spam_score": 0.137, "site_type": "news", "published": "2016-08-31T08:00:00.000+03:00", "replies_count": 0, "uuid": "e29ed8048d10c6b5168b3ceaf8899714f0b2a3e9"}, "author": "", "url": "http://myinforms.com/en/a/40335084-president-obama-cuts-short-the-sentences-of-111-federal-inmates-wvideo/", "ord_in_thread": 0, "title": "President Obama cuts short the sentences of 111 federal inmates (w/video) | Myinforms", "locations": [], "entities": {"persons": [{"name": "obama", "sentiment": "negative"}, {"name": "barack obama", "sentiment": "none"}, {"name": "eggleston", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "franklin", "sentiment": "none"}, {"name": "larry kurtz", "sentiment": "none"}, {"name": "tiffany williams", "sentiment": "none"}, {"name": "mike trout", "sentiment": "none"}, {"name": "abu mohammed al-adnani", "sentiment": "none"}, {"name": "ronald reagan", "sentiment": "none"}, {"name": "fran townsend", "sentiment": "none"}, {"name": "peña nieto", "sentiment": "none"}, {"name": "neil eggleston", "sentiment": "none"}, {"name": "enrique peña nieto", "sentiment": "none"}, {"name": "deshawn franklin", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "woodland", "sentiment": "none"}, {"name": "gulf coast", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "virginia", "sentiment": "none"}, {"name": "south carolina", "sentiment": "none"}, {"name": "yolo county", "sentiment": "none"}, {"name": "south bend", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}, {"name": "d.c.", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}, {"name": "charleston", "sentiment": "none"}, {"name": "indiana", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}, {"name": "georgia", "sentiment": "none"}, {"name": "fort mill", "sentiment": "none"}, {"name": "u.s.  washington", "sentiment": "none"}, {"name": "new zealand", "sentiment": "none"}, {"name": "los angeles", "sentiment": "none"}], "organizations": [{"name": "isis", "sentiment": "none"}, {"name": "nj transit", "sentiment": "none"}, {"name": "woodland senior center computer club, inc.", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "orange county fire authority", "sentiment": "none"}, {"name": "youtube", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "President Obama cuts short the sentences of 111 federal inmates (w/video) Main U.S. President Obama cuts short the sentences of 111 federal inmates (w/video) WASHINGTON — President Barack Obama cut short on Tuesday the sentences of 111 federal inmates in another round of commutations for those convicted of nonviolent drug… U.S. \nWASHINGTON — President Barack Obama cut short on Tuesday the sentences of 111 federal inmates in another round of commutations for those convicted of nonviolent drug offenses. \nObama has long called for phasing out strict sentences for drug offenses, arguing they lead to excessive punishment and incarceration rates unseen in other developed countries. \nWhite House counsel Neil Eggleston said the commutations underscored the president's commitment to using his clemency authority to give deserving individuals a second chance. He said that Obama has granted a total of 673 commutations, more than the previous 10 presidents combined. More than a third of the recipients were serving life sentences. \n\"We must remember that these are individuals — sons, daughters, parents and, in many cases, grandparents — who have taken steps toward rehabilitation and who have earned their second chance,\" Eggleston said. \"They are individuals who received unduly harsh sentences under outdated laws for committing largely nonviolent drug crimes.\" \nEggleston noted that Obama also … 09.01 / 14:57 keyt.com Pokemon Go enthusiasts in New Zealand caught a thief who tried to break into a car, Reuters… 09.01 / 14:55 dailydemocrat.com Friday, Sept. 2: Noon. The Woodland Senior Center Computer Club, Inc., will hold an open lab for any Yolo County resident 18 or older until 3 p.m. at the Woodland Community & Senior Center, 2001 East St. The cost is $1 per session to use the Windows 7 computers and printer; five cents per printed… 09.01 / 14:55 dailydemocrat.com SANTA ANA -- Los Angeles Angels star outfielder Mike Trout was in a freeway crash Wednesday night but was not injured. The Orange County Fire Authority responded to a pair of related crashes each involving two vehicles at 8:50 p.m. in the southbound lane of Highway 55, Capt. Larry Kurtz… 09.01 / 14:53 federalnewsradio.com Georgia's governor has declared a state of emergency for 56 counties as Tropical Storm Hermine heads toward Florida's Gulf Coast The post The Latest: Georgia issues emergency order ahead of storm appeared first on… 09.01 / 14:52 csmonitor.com Voter ID restrictions across the country have prompted debates about whether these laws are discriminatory or just common sense – or if they even make a difference in p… 09.01 / 14:49 mediaite.com YouTube on Wednesday began pulling ad revenue from videos that were not \"advertiser-friendly,\" sparking outrage from professional YouTubers who began to see their main source of income cut off for covering \"controversial to… 09.01 / 14:48 cbsnews.com Washington, D.C., university announces efforts to honor the enslaved people whose sale in 1838 helped pay off school’s d… 09.01 / 14:48 abcnews.go.com Charleston is making preparations for more flooding less than a year after historic rains caused closure of the South Carolina city's… 09.01 / 14:48 cbsnews.com National security analyst Fran Townsend disputes Russia's claim of responsibility for the death of Abu Mohammed al-Adnani, and explains why the ISIS leader's death is a \"temporary… 09.01 / 14:45 nj.com Uber users who have been clamoring for the ability to schedule rides well in advance of when they need them are in… 09.01 / 14:45 nj.com A stalled NJ Transit train delays commuters 30-minutes, but passengers on the train sat in heat for an… 09.01 / 14:43 abc40.com The man who attempted to assassinate President Ronald Reagan 35 years ago will leave a Washington psychiatric hospital to live full-time in Virginia on Sept. 10, his lawyer said… 09.01 / 14:43 abc.go.com With Labor Day just around the corner, retailers are taking advantage of the holiday weekend to roll out some serious… 09.01 / 14:38 theweek.com 18-year-old DeShawn Franklin of South Bend, Indiana, awoke at 2:30 a.m. when police officers burst into his room and began beating the high school student in his bed. They tased him and dragged him out of his house and down to the cruiser, where Franklin was cuffed and arrested. Then they realized he was innocent. Franklin's traumatizing encounter with the cops, who were looking for a suspect with a similar description, happened in 2012 and was addressed in a civil rights suit this… 09.01 / 14:38 theweek.com On Wednesday afternoon, Donald Trump traveled to Mexico to meet with President Enrique Peña Nieto and discuss his proposals for reforming the U.S. immigration system. After a campaign spent spouting forceful rhetoric against immigrants — and those from Mexico in particular — Trump appeared subdued next to Peña Nieto, and at a joint press conference he said that he felt a \"tremendous feeling\" toward Mexican-Americans. While both men \"recognize the right of either country to build a physi… 09.01 / 14:36 star-telegram.com When you’re a television broadcaster, you have to not only deliver news to your viewers, but do it in a way that is interesting and entertaining. That’s a particular challenge … Click to Continue »… 09.01 / 14:36 star-telegram.com Tiffany Williams, a mother of three and a prostitute, lay on the floor of her boyfriend’s Fort Mill condominium just before midnight on Dec. 4, bleeding and broken, trying to … Click to Continue »… Advanced search ", "external_links": [], "published": "2016-08-31T08:00:00.000+03:00", "crawled": "2016-09-01T18:02:18.344+03:00", "highlightTitle": ""}