{"organizations": [], "uuid": "d48205ccb6c112490a8fae5f4eedc85525883a65", "thread": {"social": {"gplus": {"shares": 1}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 14}, "facebook": {"likes": 223, "shares": 223, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/politics/0/0/Trump%20immigration%20speech%20new.jpg", "site_section": "http://feeds.latino.foxnews.com/home/feed", "section_title": "FOX News", "url": "http://latino.foxnews.com/latino/politics/2016/09/01/after-appearing-to-soften-tone-trump-goes-full-throttle-on-immigration/", "country": "US", "domain_rank": 185, "title": "After appearing to soften tone, Trump goes full-throttle on immigration", "performance_score": 2, "site": "foxnews.com", "participants_count": 1, "title_full": "After appearing to soften tone, Trump goes full-throttle on immigration | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2016-09-01T03:00:00.000+03:00", "replies_count": 0, "uuid": "d48205ccb6c112490a8fae5f4eedc85525883a65"}, "author": "Elizabeth Llorente", "url": "http://latino.foxnews.com/latino/politics/2016/09/01/after-appearing-to-soften-tone-trump-goes-full-throttle-on-immigration/", "ord_in_thread": 0, "title": "After appearing to soften tone, Trump goes full-throttle on immigration", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "negative"}, {"name": "elizabeth llorente", "sentiment": "negative"}, {"name": "trump", "sentiment": "negative"}, {"name": "clinton", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "sean hannity", "sentiment": "none"}, {"name": "barack obama", "sentiment": "none"}, {"name": "dan stein", "sentiment": "none"}, {"name": "helen aguirre ferré", "sentiment": "none"}, {"name": "hillary", "sentiment": "none"}, {"name": "alfonso aguilar", "sentiment": "none"}, {"name": "césar j. blanco", "sentiment": "none"}], "locations": [{"name": "united states", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "u.s", "sentiment": "none"}, {"name": "boston", "sentiment": "none"}, {"name": "phoenix", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}, {"name": "arizona", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}, {"name": "san bernardino", "sentiment": "none"}, {"name": "phoenix convention center", "sentiment": "none"}], "organizations": [{"name": "fox news latino", "sentiment": "none"}, {"name": "fox news", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "associated press", "sentiment": "none"}, {"name": "rnc", "sentiment": "none"}, {"name": "federation for american immigration reform", "sentiment": "none"}, {"name": "gop", "sentiment": "none"}, {"name": "politico", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "republican national committee", "sentiment": "none"}, {"name": "democratic", "sentiment": "none"}, {"name": "ap", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Elizabeth Llorente \n  Republican presidential candidate Donald Trump delivers an immigration policy speech during a campaign rally at the Phoenix Convention Center, Wednesday, Aug. 31, 2016, in Phoenix. (AP Photo/Evan Vucci) Copyright 2016 The Associated Press. All rights reserved. \nFrom the border state of Arizona, in a highly-awaited speech on immigration, Republican presidential nominee Donald Trump reinforced the hold-no-prisoners approach to controlling the U.S. border and cracking down on those already inside without permission that helped propel him to victory during the GOP primaries.\nTrump said in no uncertain terms that he would come down hard on people who are here illegally, giving the highest priority to those who have committed crimes, but also targeting anyone here without authorization.\nAfter about two weeks of appearing to soften his stance on illegal immigration, punctuated by remarks about the damage that it does to the United States, Trump returned full-throttle to pledging to build a huge wall, to bringing back some of the most stringent federal enforcement programs, and putting 5 million people back into deportation proceedings who got a reprieve from executive orders issued by President Barack Obama.\n“Under a Trump administration, it’s called America First, remember that,” he said to frequent cheers from the crowd in Phoenix.\nHe said that the U.S. immigration system “serves the needs of wealthy donors, political activists and powerful politicians, it does not serve you, the American people.”\nIn apparent response to advocates -- and even some who support tightening the border – who want less deportation and a chance for undocumented immigrants to legalize while remaining in the country, Trump said:\n“The central issue is not the needs of the 11 million illegal immigrants,” Trump said. “Anyone who tells you that the core issue is the needs of those living here illegally has simply spent too much time in Washington.”\nWith force, Trump backed into his controversial austere position on illegal immigration, after suggesting in the last two weeks that he was open to allowing people who have not run into trouble with the police and who are not national security risks to have a chance to legalize their status without leaving the U.S.\nHe ensconced himself in familiar themes – the undocumented immigrants as a terrorist threat, a killer walking American neighborhoods, a taker of jobs that should go to Americans, a usurper of public benefits.\nIt echoed the speech he delivered when he launched his campaign, promising a war on illegal immigration and saying that Mexico sends rapists and drug dealers to the U.S. Immigration also took center stage on the first day of the Republican National Convention, when it opened with speeches about immigrants who have killed Americans, and featured relatives of the victims on stage.\nLatino groups and immigration advocacy groups blasted the speech as fear-mongering and provocative.\nCésar J. Blanco, interim director of Latino Victory Fund, said in a statement: “We have seen Donald Trump’s true colors, heard his opinions of our community, and we understand his intentions to attack, demean, and hurt Latinos throughout the country.”\n“But we won’t be bullied into silence. We will continue working tirelessly to ensure that on Election Day our community delivers a clear message to Donald Trump and his supporters: Latinos in the United States deserve respect and our country deserves a leader who represents the good of our nation, not its worst impulses. Together, we will make sure Donald Trump gets nowhere close to the White House.”\nSome Hispanics who recently backed Trump said that after his speech they were considering pulling their support.\n“It’s so disappointing because we feel we took a chance, a very risky chance,” Alfonso Aguilar, the president of the Latino Partnership for Conservative Principles, told Politico . “We decided to make a big U-turn to see if we could make him change. We thought we were moving in the right direction … we’re disappointed. We feel misled.”\nOn Wednesday, Trump clearly addressed his base, putting to rest speculation in recent days that his occasional softer tones signaled a desire to court white moderate voters and minorities who have been alienated by his rhetoric.\nTough talk about immigration has struck a chord in a nation rattled by terrorist attacks not only in places like Paris that, in the minds of Americans, had seemed relatively safe, but also right here at home -- in San Bernardino, California and Boston during the marathon, among others.\nTrump dispensed with grays in his rhetoric, going right for stark boldness. He spoke frequently about building a huge wall along the U.S.-Mexico border, and spoke about dealing with undocumented immigrants already here by tracking down and expelling all of them – something that even the most hardline candidates of elections past were reluctant to do, describing it as undoable.\nHis core followers have relished such talk.\n“This evening, Donald Trump laid out a coherent and workable strategy for addressing the decades-long problem of mass illegal immigration, and for reforming our dysfunctional legal immigration policies,\" said Dan Stein, president of the Federation for American Immigration Reform (FAIR). \"But even more important than the details of the plan itself, Trump laid out the most fundamental principle for true immigration reform: The policy exists to protect and serve ‘the wellbeing of the American people,’ and ‘protect all aspects of American life.’\nBut Trump's tough stances have made many in the GOP nervous, and groups such as Latinos say they are furious and nervous about the possibility of a President Trump and a nation where many families in their communities would live in fear.\nHillary for America, the Democratic presidential candidate's political action committee, released a statement suggesting a President Trump would divide America. \n\"Donald Trump once again showed us that he will continue his decades-long record of divisiveness and campaign of hate by pledging to forcibly remove every single undocumented immigrant from our country, the statement said. \"He showed us, very clearly, what's at stake in this election by painting a picture of his idea of America: one in which immigrants are not welcomed and one in which innocent families are torn apart.\"\nHis poll numbers suffered among Latinos, showing an unfavorability rate that at times surpassed 80 percent, a concern in the eyes of many of Trump’s supporters, given that many political experts say that a Republican presidential nominee would need at least 40 percent of the Latino vote to win.\nIn recent weeks, national polls have showed Trump and Democratic challenger Hillary Clinton in a relatively tight race, but trailing the former secretary of state in key battleground places such as Florida.\nIn a town hall with Fox News host Sean Hannity last week, Trump appeared willing to be more moderate on immigration, even saying that he would consider allowing undocumented immigrants who have not committed crimes in the U.S. to pay taxes, fines and try to legalize their status without leaving the country.\nAhead of Trump’s speech, the Republican National Committee released a video saying that Clinton is the one who has flip-flopped on immigration and pandered on the issue.\n“Clinton only prioritizes what is politically convenient for her,\" said RNC Director of Hispanic Communications Helen Aguirre Ferré. “Clinton panders for political gain–it’s hypocrisy at its worst. You just can’t trust her.”\n\nElizabeth Llorente is the Politics Editor/Senior Reporter for Fox News Latino, and can be reached at Elizabeth.Llorente@Foxnewslatino.com. Follow her on https://twitter.com/Liz_Llorente \n ", "external_links": [], "published": "2016-09-01T03:00:00.000+03:00", "crawled": "2016-09-01T15:34:47.696+03:00", "highlightTitle": ""}