{"organizations": [], "uuid": "d437728af2ab90622882b084a6310de4fd1abee7", "thread": {"social": {"gplus": {"shares": 1}, "pinterest": {"shares": 1}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 13, "shares": 13, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.foxnews.com", "main_image": "http://www.foxnews.com/content/dam/fox-news/logo/og-fn-foxnews.jpg", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/politics/2016/09/19/who-will-pass-terror-test.html", "country": "EU", "domain_rank": 185, "title": "Who will pass the terror test? | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Who will pass the terror test? | Fox News", "spam_score": 0.061, "site_type": "news", "published": "2016-09-19T21:35:00.000+03:00", "replies_count": 0, "uuid": "d437728af2ab90622882b084a6310de4fd1abee7"}, "author": "Chris Stirewalt", "url": "http://www.foxnews.com/politics/2016/09/19/who-will-pass-terror-test.html", "ord_in_thread": 0, "title": "Who will pass the terror test? | Fox News", "locations": [], "entities": {"persons": [{"name": "jeb bush", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "barack obama", "sentiment": "none"}, {"name": "larry sabato", "sentiment": "none"}, {"name": "bill clinton", "sentiment": "none"}, {"name": "amy williams", "sentiment": "none"}, {"name": "walker", "sentiment": "none"}, {"name": "rostov", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "ed adams", "sentiment": "none"}, {"name": "josh kraushaar", "sentiment": "none"}, {"name": "bret baier", "sentiment": "none"}, {"name": "jane goodall", "sentiment": "none"}, {"name": "christie", "sentiment": "none"}, {"name": "leo rostov", "sentiment": "none"}, {"name": "joe biden", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "ed", "sentiment": "none"}, {"name": "billy joel", "sentiment": "none"}, {"name": "chris stirewalt", "sentiment": "none"}, {"name": "tim alberta", "sentiment": "none"}, {"name": "lauren stewart", "sentiment": "none"}, {"name": "sally persons", "sentiment": "none"}, {"name": "stewart", "sentiment": "none"}, {"name": "chris wallace", "sentiment": "none"}, {"name": "gary johnson", "sentiment": "none"}, {"name": "obama", "sentiment": "none"}, {"name": "chris", "sentiment": "none"}, {"name": "stirewalt", "sentiment": "none"}, {"name": "clinton", "sentiment": "none"}, {"name": "vincent", "sentiment": "none"}, {"name": "scott walker", "sentiment": "none"}], "locations": [{"name": "minn", "sentiment": "none"}, {"name": "cuba", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "n.y.", "sentiment": "none"}, {"name": "philadelphia", "sentiment": "none"}, {"name": "minneapolis", "sentiment": "none"}, {"name": "d.c.", "sentiment": "none"}, {"name": "toronto", "sentiment": "none"}, {"name": "inola", "sentiment": "none"}, {"name": "fla.", "sentiment": "none"}, {"name": "oklahoma", "sentiment": "none"}, {"name": "washex trump", "sentiment": "none"}, {"name": "vancouver", "sentiment": "none"}, {"name": "uva", "sentiment": "none"}, {"name": "pennsylvania", "sentiment": "none"}, {"name": "wisconsin", "sentiment": "none"}, {"name": "okla", "sentiment": "none"}, {"name": "ohio", "sentiment": "none"}, {"name": "west virginia", "sentiment": "none"}], "organizations": [{"name": "wapo/abc news", "sentiment": "negative"}, {"name": "fox news", "sentiment": "negative"}, {"name": "quinnipiac university", "sentiment": "negative"}, {"name": "cnn", "sentiment": "negative"}, {"name": "kramarczuk", "sentiment": "none"}, {"name": "un", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "fox news channel", "sentiment": "none"}, {"name": "fnc", "sentiment": "none"}, {"name": "westjet", "sentiment": "none"}, {"name": "center for politics buuuuttt…national review", "sentiment": "none"}, {"name": "fox news  bridgegate", "sentiment": "none"}, {"name": "national journal", "sentiment": "none"}, {"name": "upshot/siena college", "sentiment": "none"}, {"name": "wsj", "sentiment": "none"}, {"name": "allentown morning call/muhlenberg college", "sentiment": "none"}, {"name": "keystone state", "sentiment": "none"}, {"name": "temple university", "sentiment": "none"}, {"name": "libertarian party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "\n[ Polls included: Fox News , NYT/CBS News , Quinnipiac University , WaPo/ABC News , and CNN ] \nHILLARY TRIES TO STOP MILLENNIAL MELTDOWN Admitting a serious deficit with millennial voters, Hillary Clinton and her campaign are starting an intense push to win back the bloc that proves so crucial to Barack Obama’s two presidential victories. \nClinton starts today with a speech at Temple University in Philadelphia, where she will talk about free community college and debt-free public universities. But will it be enough? \nPolls show Clinton doing only about half as well with Millennial voters as Obama did. And with 50 days to go until Election Day, it may be time to start getting panicky. \nClinton’s team has already ramped up spending and voter outreach to this group via social media. PACs supporting Clinton have pledged $20 million to reach out to Millennial females while an anti-global warming group is spending $6 million to get Millennials in Pennsylvania to the polls. \nBut, Clinton can’t seem to score above the 50 percent mark with this group. And it’s not because they’re flocking to Trump. National Journal’s Josh Kraushaar notes that many of these voters are flocking to third-party candidates in high numbers. \nIn the GW Battleground poll , 73 percent of Millennials had an unfavorable view of Trump. Yet, in the four-way race Clinton drew just 46 percent of their support meaning that although they highly dislike Trump they’re not drawn to Clinton either. \nMillennials made their mark on politics as part of the Obama coalition in 2008 giving him 66 percent of those under 30-years-old voting for him. Obama did nearly as well in 2012 with 60 percent of support from that same group. President Obama says ‘personal insult’ if black voters don’t rally for Clinton - NYT : “With Democratic leaders increasingly worried about a lack of passion for Hillary Clinton among young black voters, President Obama is rolling out a new and more personal campaign message: ‘It’s about me.’ The president told African-Americans this weekend he would consider it a ‘personal insult’ if they did not vote for Mrs. Clinton, implicitly putting his name on the line as his former secretary of state struggles to replicate the coalition that delivered him victories in 2008 and 2012.” PA STILL A BRIGHT SPOT FOR HILLARY Amid a slew of falling poll numbers in the past week, Hillary Clinton received some good news from the Keystone State. A new Allentown Morning Call/Muhlenberg College poll shows Clinton up 9 points against Donald Trump in the two-way race, and 8 points in the four-way race. Libertarian nominee Gary Johnson takes 14 percent of support in Pennsylvania, which is largely responsible for Clinton’s smaller advantage in the four-way race. Clinton is counting on Pennsylvania as one of the, ahem, key swing states to remain in the blue category this cycle. \nAs the WSJ points out , Clinton’s ability to maintain her lead her depends on continuing to overwhelm white, blue-collar voters in the middle and western part of the state with minority and college graduates in the urban and suburban areas. Clinton has deployed numerous resources in the state, most importantly her top surrogates: Bill Clinton , Vice President Joe Biden and, most importantly, President Obama , who campaigned for her in Philadelphia last week. AUDIBLE: AND WHO ARE THE TINY MAMMALS IN THIS SCENARIO? “I think they are dinosaurs, and I think we’re the comet in this whole equation. And I’m glad for it. I’m proud of it.”– Gary Johnson in an interview explaining his take on the two-party system and how the Libertarian Party is going to destroy it. \nPLAY-BY-PLAY A dead heat for Trump, Clinton in Fla. in new NYT Upshot/Siena College poll - NYT Larry Sabato updates his map in Trump’s favor, but argues Clinton still has the best path to victory - UVA Center for Politics Buuuuttt…National Review’s Tim Alberta explains why Trump still doesn’t have a path to 270 - NRO Jane Goodall has unique critique on Trump debating - WashEx Trump, Clinton schmooze foreign heads of state in N.Y. for UN meeting - Politico Priebus threatens Republicans who won’t back Trump - Fox News \nBridgegate trial: Prosecutor says Christie knew of lane closures from the start - NYT Didn’t have to ask for them to clap: Jeb Bush steals show with Emmys bit - Fox News FROM THE BLEACHERS “Chris, it is not often that I disagree with your analysis. I suspect that Mr. Trump’s former alliance with the birther folks was not the pole that vaulted him to candidacy. It is possible that, had he abandoned that silly notion prior to the convention, his margin would have been even greater. In other words, I hope you agree, it was not only the deplorables who handed him the nomination! It took some millions of non-deplorables too. No day is complete without reading the Halftime Report…you go maestro!” – Leo Rostov , Minneapolis, Minn. \n[ Ed. note: Certainly I agree, Mr. Rostov. Trump’s appeal went beyond the kooks and conspiracy theorists early on in this presidential cycle. As you say, millions of voters drawn in by his hardline on immigration, his white-hot rhetoric about the condition of the country and its leaders, and his gift for sucking all of the oxygen out of the political space, surpassed birtherism as his top issue. But I still don’t think he would’ve been the nominee had he not been the leading proponent of that particular conspiracy. Look at it maybe like this: If Scott Walker had become the Republican nominee we could trace it back to his successful fight against government unions in Wisconsin. To have won, Walker would have needed to broaden his appeal, but we could still say that provided the core supporters, notoriety, and most importantly, the brand that Walker would have needed. Obviously, we know that didn’t happen for Walker, but with Trump the birther bomb is what set him off and provided the core support and brand that helps him develop a broader winning coalition. Next time I’m in Minneapolis I’ll meet you at Kramarczuk’s for coffee and blini. ] \n“I am beyond excited they’ve decided to put ‘I’ll Tell You What’ on television. You two have off-the-charts chemistry. Here’s my concern - when the camera comes on, you’ll edit yourself. Please don’t. The lines like Bill Clinton eating up campaigning ‘like a dog rolling around in a dead deer’ are so entertaining and down-home and well, they’re just my favorite. So as Billy Joel would say, ‘Don’t go changin’…’ I’m praying this show isn’t temporary. Big hug from Oklahoma.” – Amy Williams , Inola, Okla. \n[ Ed. note: Well I hope you caught the first installment that included a discussion of bizarrely named places in West Virginia and a comparison of one presidential candidate to a tranquilized zoo animal. I say we’re keeping it real and certainly plan to keep doing so. Thanks to you and everybody else for all of the stunning support that you have shown. It’s what made our little podcast into this fun T.V. experiment. ] \n“Pres. Obama indicated he would take it as a personal insult if African Americans voted for some other than the democrat candidate. He is non-stop with his personal insult. GOOD GRIEF!!” – Ed Adams , Vincent, Ohio [ Ed. note:Well, you can understand how the first African-American president would feel possessive about African American voters. Listen to the rueful comments from former president Bill Clinton about the way in which blue-collar white voters, especially his fellow “bubbas” have shunned his party and his wife. Being a successful politician is somewhat like being the leader of a marching band. The musicians are going to follow their footwork, but look to you for queues on when to make their moves. That’s different than them following you blindly. Even the best politicians are always only a few missteps away from getting trampled by the flugelhorns. ] Share your color commentary: Email us at and please make sure to include your name and hometown. \nHEY, STILL BETTER THAN SNAKES The Canadian Press : “A WestJet flight was grounded in Toronto after customs officers determined there were iguanas loose in the aircraft. WestJet spokesperson Lauren Stewart says a passenger on a flight from Cuba to Toronto was discovered to be carrying iguanas in his checked luggage. Stewart says the passenger had hidden four iguanas in his luggage but when they were discovered by customs officers in Toronto, only two of the lizards were in the suitcase. The flight crews were notified and the plane was stopped in order to have the cargo hold fumigated to prevent the escaped lizards from chewing through wires or damaging the aircraft. Stewart says the aircraft couldn’t fly on to Vancouver due to the delay, but passengers were transferred to another plane that left 50 minutes later.” \nChris Stirewalt is digital politics editor for Fox News. Sally Persons contributed to this report. Want FOX News Halftime Report in your inbox every day? Sign up here . \nChris Stirewalt joined Fox News Channel (FNC) in July of 2010 and serves as digital politics editor based in Washington, D.C. Additionally, he authors the daily \"Fox News First\" political news note and hosts \"Power Play,\" a feature video series, on FoxNews.com. Stirewalt makes frequent appearances on the network, including \"The Kelly File,\"\"Special Report with Bret Baier,\" and \"Fox News Sunday with Chris Wallace.\" He also provides expert political analysis for Fox News coverage of state, congressional and presidential elections. Advertisement ", "external_links": [], "published": "2016-09-19T21:35:00.000+03:00", "crawled": "2016-09-19T21:07:52.536+03:00", "highlightTitle": ""}