{"organizations": [], "uuid": "123cd6b56d3bbdfb6549d99160091a671cd5e2f1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/694940094001_5111120469001_090316-cof-trumpimm-1280.jpg", "site_section": "http://www.foxnews.com/costoffreedom/", "section_title": "The Cost of Freedom | Fox News", "url": "http://www.foxnews.com/transcript/2016/09/03/trump-immigration-plan-sparks-debate-about-sanctuary-cities/", "country": "IT", "domain_rank": 185, "title": "Trump immigration plan sparks debate about sanctuary cities", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "Trump immigration plan sparks debate about sanctuary cities | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2016-09-03T03:00:00.000+03:00", "replies_count": 0, "uuid": "123cd6b56d3bbdfb6549d99160091a671cd5e2f1"}, "author": "FoxNews.com", "url": "http://www.foxnews.com/transcript/2016/09/03/trump-immigration-plan-sparks-debate-about-sanctuary-cities/", "ord_in_thread": 0, "title": "Trump immigration plan sparks debate about sanctuary cities", "locations": [], "entities": {"persons": [{"name": "gary kaltbaum", "sentiment": "negative"}, {"name": "trump", "sentiment": "negative"}, {"name": "caitlin huey-burns", "sentiment": "none"}, {"name": "charlie gasparino", "sentiment": "none"}, {"name": "charlie", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "bill scott martin", "sentiment": "none"}, {"name": "donald", "sentiment": "none"}, {"name": "scott martin", "sentiment": "none"}, {"name": "gary", "sentiment": "none"}, {"name": "julie roginsky", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "iran", "sentiment": "none"}, {"name": "san francisco", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}, {"name": "israel", "sentiment": "none"}, {"name": "colorado", "sentiment": "none"}], "organizations": [{"name": "european union", "sentiment": "none"}, {"name": "state department", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "\nTrump: Cut Federal Tax Dollars to Sanctuary Cities\nGary Kaltbaum: Anything that disincentives more illegal immigration is good by me. 11 Million People for a reason. Everybody has turned a blind eye to it. It is about time something gets done. The costs are gargantuan and there's something called the rule of law. Three little words that's supposed to be followed that have not. This would be a good start.\nScott Martin: I mean to the degree that the cities are violating federal law, yes. And I agree with Gary's point, the risk here is too high. I think if you look at what cities have done, look at some of the incidents we've had with ICE losing track of detainees, illegal immigrants re-offend and commit other crimes after released it's out of control. If you're an illegal you've already broken one law coming over here illegally to begin with. Who's to say they're not going to commit more crimes as they already have been when they come over here. The cities should be punished for allowing that to continue to happen.\nJulie Roginsky: Well, Mr. Trump does have it wrong because the fact that we have -- we have federal government laws that don't get enforced all the time. Colorado legalized pot. The federal government hasn't. We're not cutting off their federal funds. I will tell you why. You should not have local law enforcement, not coming from me, from people like the head of the NYPD, safest large city in the country, saying essentially that we shouldn't have these people go in when they're trying to work with their communities, and putting them in danger and at risk saying we're going to arrest you if you're here illegally and trying to get them to focus on real crime going on.\nCharlie Gasparino: Do I think, you know, the world should be made a better place? Yes. This will never happen. The question is what can we force cities to do? Can we -- can the federal government go into cities and basically enforce the laws that the local jurisdictions won't do? And I think that's a better question. And it gets back to what you said. You know, the NYPD doesn't want to start enforcing federal law. That doesn't mean federal law shouldn't be enforced by border patrol agents.\nCaitlin Huey-Burns: It's a controversial issue on the campaign trail. Hillary Clinton has been supportive of these things. To your point in a lot of cases, this -- having a relationship with the community is better, you know, better to have these people identify crimes in their areas and report them and would be less inclined to do so. Donald trump and lots of republicans have been arguing against that. And so really depends on what your approach is to undocumented immigrants while they're here. I think there needs to be reform. What we saw in San Francisco, of course. If there's reform efforts for sure. But this is a really polarizing issue.\nNew Report Claims U.S. Agreed to 'Secret' Exemptions for Iran After Nuclear Deal\nCharlie Gasparino: I think it was time not do to do the deal. I wasn't a zealot against the deal. Iran's population is -- a lot is secular. These are -- this is a culture, an advanced culture for many years. This isn't like the Stone Age. It's ruled by a bunch of lunatics. It's ruled by people who want to destroy us and kill us and kill Israel. To cut deals with people like that, that's worse than the mafia. The mafia believes when you -- if you knew bob guys they believed basically among the families and peaceful coexist coexistence co-existence. They will rip everybody off and coexist while doing it. This is a regime intent to kill its enemies and finances its enemies. Someone who would love to have a detente with Iran as Russia it's insane. Russia wasn't an insane country at the time.\nGary Kaltbaum: Well, just ask yourself the question, why secrecy? Why secrecy with the exemption, why secrecy with the ransom. By the way, more than half the people in this country believe its ransom. It's a bad deal.\nCaitlin Huey-Burns: I think it highlights all the questions surrounding this, the transparency of the deal, you know, whether, you know, a lot of national security experts and people studying this have said there's nothing nefarious going on here. Donald trump said he would not necessarily rip this up on day one like all republicans have. Interested to see how he plays this out.\nScott Martin: Our own money being used against us. State Department report early July report labels Iran as the number one state sponsor of terrorism yet sending money in the middle of the night, cutting secret deals with them. I agree with Charlie, keep your enemies close and your friends maybe further away. But the reality that this is getting pool the wool over the eyes of the American people we made this great deal with Iran with regard to the nuclear program but made exemptions for it upsets you when you figure out what they will do with that money and how they want to hurt us so bad.\nJulie Roginsky: It is. Whether a good or bad deal it is a legacy deal. I will disagree with my friend Charlie. They're absolutely bent on our destruction.\nNew Outrage as European Union Hits Apple With $14.5 Billion Tax Bill\nScott Martin: There's a couple trillion dollars sitting overseas, waiting for some favorable tax premium. Maybe a saturation tax, the highest taxing in the world, mind you. Bringing that cash back, United States will create research and development, jobs and corporate earnings growth in the United States.\nCharlie Gasparino: I think the strongest part of Donald Trump's presidential platform is his tax platform and particularly the corporate taxes. Listen if you worry about the rust belt and hauling out of business America, it's because is not investing here because, guess what, our tax rates are three times as high as anyplace else. Including England that is going to survive Brexit very well because Britain has very low corporate taxes.\nJulie Roginsky: Well, we don't actually have the highest corporate tax.\nGary Kaltbaum: All you need to know companies like apple and others will actually borrow money to take care of their cash needs in the U.S. because it's too onerous to bring money back here. It's utter stupidity that we are not in line with other countries around the globe. It will make our economy much stronger and confident in what's going on here in corporate America.\nCaitlin Huey-Burns: This is a really good time to talk about tax reform. Both candidates are talking about this in various ways.\nStock Picks\nGary Kaltbaum: (YUM) YUM\nScott Martin: (DG) Dollar General", "external_links": [], "published": "2016-09-03T03:00:00.000+03:00", "crawled": "2016-09-06T23:47:22.066+03:00", "highlightTitle": ""}