{"organizations": [], "uuid": "d495f79747bf23c5ec4db8bee0ab628183d58dc7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 8, "shares": 8, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.foxnews.com", "main_image": "http://www.foxnews.com/content/dam/fox-news/logo/og-fn-foxnews.jpg", "site_section": "http://feeds.foxnews.com/foxnews/national", "section_title": "FOX News", "url": "http://www.foxnews.com/us/2016/09/30/mormon-conference-kicks-off-as-refugee-concerns-grow.html", "country": "CH", "domain_rank": 185, "title": "Mormon conference kicks off as refugee concerns grow", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Mormon conference kicks off as refugee concerns grow", "spam_score": 0.0, "site_type": "news", "published": "2016-10-01T03:29:00.000+03:00", "replies_count": 0, "uuid": "d495f79747bf23c5ec4db8bee0ab628183d58dc7"}, "author": "", "url": "http://www.foxnews.com/us/2016/09/30/mormon-conference-kicks-off-as-refugee-concerns-grow.html", "ord_in_thread": 0, "title": "Mormon conference kicks off as refugee concerns grow", "locations": [], "entities": {"persons": [{"name": "bonnie oscarson", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "dieter f. uchtdorf", "sentiment": "none"}, {"name": "thomas s. monson", "sentiment": "none"}, {"name": "mitt romney", "sentiment": "none"}, {"name": "– mormon", "sentiment": "none"}, {"name": "kim davis", "sentiment": "none"}, {"name": "patrick kearon", "sentiment": "none"}, {"name": "jesus christ", "sentiment": "none"}], "locations": [{"name": "united states", "sentiment": "none"}, {"name": "czech republic", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "kentucky", "sentiment": "none"}, {"name": "utah", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}, {"name": "salt lake city", "sentiment": "none"}], "organizations": [{"name": "the salt lake tribune", "sentiment": "none"}, {"name": "pew research center", "sentiment": "none"}, {"name": "associated press", "sentiment": "none"}, {"name": "u.s. supreme court", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Mormon conference kicks off as refugee concerns grow Published September 30, 2016   \nSALT LAKE CITY – Mormon leaders are set to deliver spiritual guidance at this weekend's twice-yearly conference as their members in the U.S. grapple with a testy presidential election and followers around the world try to respond to increasing needs of refugees. \nMore than 100,000 members of the faith are expected to attend five sessions in Salt Lake City on Saturday and Sunday. Thousands more will listen or watch around the world in nearly 100 languages on television, radio, satellite and internet broadcasts. \nLeaders from The Church of Jesus Christ of Latter-day Saints give carefully crafted speeches and make announcements about church statistics, new temples or initiatives. \nA look where the church stands on some topics that could come up during speeches: \nREFUGEES \nThe church has led a push to be welcoming toward refugees around the world at a time when some others are tightening the hatches. \nMormon leaders sent a letter a year ago urging its members to help and launched a refugee relief effort campaign in March called \"I Was A Stranger.\" Last month, the church posted a new video on its website showing how members can mentor refugees. \nThe embrace of refugees by the religion has roots in the history of the faith, which counted many immigrants among its early members. Mormons also reflect back on their own ancestors, pioneers who crossed the country looking for a place to settle and practice their beliefs. \"Their story is our story — and not that long ago,\" said Patrick Kearon, a member of a second-tier leadership council at the last church conference in April. \nOne of the highest ranking current leaders, Dieter F. Uchtdorf, was a refugee as a child when his family fled the Czech Republic amid war and moved to Germany. \nPOLITICAL CIVILITY and ELECTIONS \nMormon leaders are not expected to mention presidential candidates by name, but they could advocate again for public civility and compassion as their mostly Republican members decide how to vote in November amid a general distaste for the brash Republican presidential candidate Donald Trump. \nAt the April conference, leaders called on members to practice tolerance despite political differences but stayed true to the faith's pledge to maintain political neutrality by refraining from backing one party or endorsing candidates. \nTrump's inability to connect with Mormon voters has led to significantly fewer Latter-day Saints identifying as Republicans this year compared to four years ago when Mitt Romney, a Mormon himself, was the party's presidential nominee, according to a recent Pew Research Center survey. \nAmong the religion's top 15 leaders, six are registered Republican while nine are unaffiliated voters, according to Utah public records obtained by The Associated Press. Church President Thomas S. Monson is a Republican. \nFour years ago, 11 of the top 15 Mormon leaders were Republicans and four were unaffiliated, The Salt Lake Tribune reported. \nRELIGIOUS LIBERTY and LGBT ISSUES \nMormon leaders have been preaching the importance of preserving religious liberty while also calling on members to accept and adhere to the legalization of same-sex marriage by the U.S. Supreme Court. \nThe church still opposes gay marriage and drew the ire of gay rights advocates and many church members for banning baptisms last year for children living with gay parents. But, the religion has tried to soften its tone in recent years to become more accepting of gays and lesbians. \nBetween gay rights and religious freedom, even criticizing Kentucky clerk Kim Davis for refusing to license gay marriages. With church support, Utah passed a state law that protects gay and transgender people from housing and employment discrimination, while also protecting the rights of religious groups and individuals. \nLeaders came out in December with a statement in support of religious freedom in the wake of Donald Trump's proposal for a total ban on Muslims entering the United States. \nAt a women's conference last weekend, a top female leader called on members to defend the religion's beliefs on marriage, family and sexuality while being sensitive to other people's views. \n\"I worry that we live in such an atmosphere of avoiding offense that we sometimes altogether avoid teaching correct principles,\" said Bonnie Oscarson, president of the church's Young Women organization. Advertisement", "external_links": [], "published": "2016-10-01T03:29:00.000+03:00", "crawled": "2016-09-30T23:04:41.487+03:00", "highlightTitle": ""}