{"organizations": [], "uuid": "158cd5cad53f3c76b63c499938c5638c9418a5cf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/694940094001_5127535620001_91bb8566-3e88-4405-b4cf-0d3fc6d2fbf8.jpg", "site_section": "http://www.foxnews.com/hannity/", "section_title": "Hannity | Sean Hannity | Fox News", "url": "http://www.foxnews.com/transcript/2016/09/15/ingraham-clinton-power-as-president-would-go-unchecked-pence-americans-are/", "country": "IT", "domain_rank": 185, "title": "Ingraham: Clinton's power as president would go unchecked; Pence: Americans are seeing Trump more clearly now", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "Ingraham: Clinton's power as president would go unchecked; Pence: Americans are seeing Trump more clearly now | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2016-09-15T03:00:00.000+03:00", "replies_count": 0, "uuid": "158cd5cad53f3c76b63c499938c5638c9418a5cf"}, "author": "FoxNews.com", "url": "http://www.foxnews.com/transcript/2016/09/15/ingraham-clinton-power-as-president-would-go-unchecked-pence-americans-are/", "ord_in_thread": 0, "title": "Ingraham: Clinton's power as president would go unchecked; Pence: Americans are seeing Trump more clearly now", "locations": [], "entities": {"persons": [{"name": "clinton", "sentiment": "negative"}, {"name": "ingraham", "sentiment": "negative"}, {"name": "trump", "sentiment": "negative"}, {"name": "krauthammer", "sentiment": "none"}, {"name": "anthony scaramucci", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "george bush", "sentiment": "none"}, {"name": "lisa boothe", "sentiment": "none"}, {"name": "scalia", "sentiment": "none"}, {"name": "brian stelter", "sentiment": "none"}, {"name": "mitch mcconnell", "sentiment": "none"}, {"name": "brian", "sentiment": "none"}, {"name": "rush limbaugh", "sentiment": "none"}, {"name": "thomas", "sentiment": "none"}, {"name": "ted cruz", "sentiment": "none"}, {"name": "ronald reagan", "sentiment": "none"}, {"name": "williams", "sentiment": "none"}, {"name": "pena nieto", "sentiment": "none"}, {"name": "kelly", "sentiment": "none"}, {"name": "nate silver", "sentiment": "none"}, {"name": "steve moore", "sentiment": "none"}, {"name": "steve", "sentiment": "none"}, {"name": "steve moore", "sentiment": "none"}, {"name": "larry kudlow", "sentiment": "none"}, {"name": "john f. kennedy", "sentiment": "none"}, {"name": "matt lauer", "sentiment": "none"}, {"name": "obama", "sentiment": "none"}, {"name": "stephen moore", "sentiment": "none"}, {"name": "john mccain", "sentiment": "none"}, {"name": "eboni", "sentiment": "none"}, {"name": "mehmet oz", "sentiment": "none"}, {"name": "lauer", "sentiment": "none"}, {"name": "eboni williams", "sentiment": "none"}, {"name": "hillary", "sentiment": "none"}, {"name": "mercedes schlapp", "sentiment": "none"}, {"name": "oz", "sentiment": "none"}, {"name": "marc siegel", "sentiment": "none"}, {"name": "limbaugh", "sentiment": "none"}, {"name": "anthony scaramucci", "sentiment": "none"}, {"name": "lisa", "sentiment": "none"}, {"name": "siegel", "sentiment": "none"}, {"name": "siegel", "sentiment": "none"}, {"name": "hannity", "sentiment": "none"}, {"name": "lisa booth", "sentiment": "none"}, {"name": "marc siegel", "sentiment": "none"}, {"name": "laura ingraham", "sentiment": "none"}, {"name": "brian stelter", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "anthony", "sentiment": "none"}, {"name": "kennedy", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "hannity", "sentiment": "none"}, {"name": "paul ryan", "sentiment": "none"}, {"name": "vladimir putin", "sentiment": "none"}, {"name": "reagan", "sentiment": "none"}, {"name": "powers", "sentiment": "none"}, {"name": "boothe", "sentiment": "none"}, {"name": "lisa boothe", "sentiment": "none"}, {"name": "mitt romney", "sentiment": "none"}, {"name": "moore", "sentiment": "none"}, {"name": "jeff zucker", "sentiment": "none"}, {"name": "trumper", "sentiment": "none"}, {"name": "sean", "sentiment": "none"}, {"name": "mike pence", "sentiment": "none"}, {"name": "kelly powers", "sentiment": "none"}, {"name": "sean hannity", "sentiment": "none"}, {"name": "donald", "sentiment": "none"}, {"name": "mike pence", "sentiment": "none"}, {"name": "god", "sentiment": "none"}, {"name": "schlapp", "sentiment": "none"}, {"name": "stelter", "sentiment": "none"}, {"name": "laura ingraham", "sentiment": "none"}, {"name": "eboni williams", "sentiment": "none"}, {"name": "alex jones", "sentiment": "none"}], "locations": [{"name": "united states", "sentiment": "none"}, {"name": "saudi arabia", "sentiment": "none"}, {"name": "newsbreak", "sentiment": "none"}, {"name": "ukraine", "sentiment": "none"}, {"name": "ireland", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "iowa", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}, {"name": "lifezette", "sentiment": "none"}, {"name": "baton rouge", "sentiment": "none"}, {"name": "new hampshire", "sentiment": "none"}, {"name": "detroit", "sentiment": "none"}, {"name": "buckeye", "sentiment": "none"}, {"name": "r-ind.", "sentiment": "none"}, {"name": "indiana", "sentiment": "none"}, {"name": "hannity", "sentiment": "none"}, {"name": "louisiana", "sentiment": "none"}, {"name": "wisconsin", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "nevada", "sentiment": "none"}, {"name": "ohio", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "mexico city", "sentiment": "none"}, {"name": "new york city", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}, {"name": "hawkeye", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "michigan", "sentiment": "none"}, {"name": "pennsylvania", "sentiment": "none"}, {"name": "colorado", "sentiment": "none"}, {"name": "flint", "sentiment": "none"}], "organizations": [{"name": "foxnews.com facebook", "sentiment": "negative"}, {"name": "twitter", "sentiment": "negative"}, {"name": "fox news", "sentiment": "none"}, {"name": "fox news", "sentiment": "none"}, {"name": "monmouth university", "sentiment": "none"}, {"name": "georgetown university", "sentiment": "none"}, {"name": "cbs news/new york times", "sentiment": "none"}, {"name": "cnn", "sentiment": "none"}, {"name": "clinton foundation", "sentiment": "none"}, {"name": "supreme court", "sentiment": "none"}, {"name": "washington examiner", "sentiment": "none"}, {"name": "gallup america", "sentiment": "none"}, {"name": "gop", "sentiment": "none"}, {"name": "economic club", "sentiment": "none"}, {"name": "fox business network", "sentiment": "none"}, {"name": "department of education", "sentiment": "none"}, {"name": "fox news", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "census bureau", "sentiment": "none"}, {"name": "congress", "sentiment": "none"}, {"name": "ford", "sentiment": "none"}, {"name": "harley-davidson", "sentiment": "none"}, {"name": "mercedes", "sentiment": "none"}, {"name": "heritage foundation", "sentiment": "none"}, {"name": "fbi", "sentiment": "none"}, {"name": "cvt", "sentiment": "none"}, {"name": "suffolk university", "sentiment": "none"}, {"name": "nih", "sentiment": "none"}, {"name": "mercedes schlapp", "sentiment": "none"}, {"name": "la times", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Published September 15, 2016 FoxNews.com Facebook 0 Twitter 0 15, And welcome to \"Hannity.\" And tonight, the 2016 race continues to turn in favor of Donald Trump with the candidate now making huge gains in the polls. Just released Fox News national poll -- it shows Trump has now closed the gap with Hillary Clinton and is now in a virtual tie with Clinton's 1-point lead falling now within the margin of error.\nAlso, a brand-new CBS News/New York Times poll -- it has the race dead even for Trump and Clinton at 42 percent in a four-way contest. Now, the same poll shows Trump winning by 3 among the highly coveted independent votes, 42-29, which is a 9-point swing for Donald Trump since the poll last ran in July.\nWe also have polling out of Iowa tonight, Monmouth University poll. That shows that Trump has a commanding 8-point advantage in the Hawkeye state over Hillary Clinton, 45 to 37. And in the all-important swing state, the Buckeye state, Ohio, Suffolk University has Trump up there, as well, beating Clinton 42-39.\nAmid the very positive poll numbers, Donald Trump has been campaigning nonstop. He was in New Hampshire earlier tonight. Here are some of the highlights.\n(BEGIN VIDEO CLIP)\nDONALD TRUMP, R-PRESIDENTIAL NOMINEE: New polls have just come out, and we're leading in many of the battleground states. And we're leading all over the country. The LA Times says we're 6 points up nationwide.\n(CHEERS AND APPLAUSE)\nTRUMP: On November 8th, New Hampshire can be the state that pushes us over the top.\n(CHEERS AND APPLAUSE)\nTRUMP: We're going to win New Hampshire, and we're going to win back the White House, and we're going to make America great again. Remember that. Remember that.\n(CHEERS AND APPLAUSE)\nTRUMP: It's going to be a victory for the people, and especially those people who haven't had a hope in a long time. That's a lot of people, believe me.\nWhat we're doing is a movement. What we're doing, you're going to be so proud of your country very, very soon. So just remember that.\n(CHEERS AND APPLAUSE)\nTRUMP: So proud. And it is a movement and it's a movement that everybody's talking about. Everybody's talking about it. I'm running to be the president of all Americans. Our support comes from all regions and backgrounds and all walks of life. You are the cops and soldiers, the carpenters and welders, the accountants and lawyers, young and old, rich and poor, black, white, Latino.\nBut above all, we're all Americans, all of us together, all Americans.\n(CHEERS AND APPLAUSE)\n(END VIDEO CLIP)\nHANNITY: And here now with reaction is the editor-in-chief of Lifezette, Fox News contributor. She's also a huge nationally syndicated radio show host, Laura Ingraham. How are you?\nLAURA INGRAHAM, FOX NEWS CONTRIBUTOR: Great to see you.\nHANNITY: Great to see you in New York once in a while.\nINGRAHAM: I know. It's good to be here.\nHANNITY: All right, the polls are pretty amazing. I think anybody that can -- says they can predict with certainty how this ends in 54 days doesn't know what they're talking about, but there are real, significant reasons Trump is up. I think he's made real strides in terms of taking risks...\nINGRAHAM: Right.\nHANNITY: ... Louisiana, Mexico, black churches. He's going all around the country. He's got a really busy schedule. I think that's all contributed -- staying on message, focused on Hillary and Obama.\nINGRAHAM: I think we're seeing some of Donald Trump's heart, which is something that people needed to see. Everybody knows Trump's tough, he can throw punches. If someone hits him, he'll hit them back. He's not going to stand for America to be humiliated. He's going to be law enforcer, rule of law guy.\nBut he's showing more of his heart. And a little bit of humility ever now and then is a good thing, too. I think that's brought some of the people back to the fold.\nOver the next 56 days, whatever it is, 57 days, he has to keep reassuring the country, doing exactly what he's doing. The speech tonight, today, the economic speech...\nHANNITY: It's a good speech today.\nINGRAHAM: Oh, phenomenal speech. Any conservative who watched that, and the \"never Trumpers,\" who are now just talking to themselves because they're becoming increasingly irrelevant -- to watch that speech and to say Trump's not a real conservative -- I don't even know how you look yourself in the mirror. I really don't...\n(CROSSTALK)\nHANNITY: ... Larry Kudlow on radio. Later, we'll check in with Steve Moore, two really bright guys on the economy. I think is Kennedy. This is Reaganesque, maybe with the exception of trade.\nINGRAHAM: Right.\nHANNITY: Fair?\nINGRAHAM: Well, but although I think with trade -- remember, Ronald Reagan put those temporary tariffs on Harley-Davidson. George Bush put temporary tariffs on the steel imports coming in from China. So we have put tariffs on countries which are cheating under these international trade agreements.\n(CROSSTALK)\nHANNITY: All right, so you got a president that will say \"radical Islam\" and one that won't.\nINGRAHAM: Yes.\nHANNITY: You got the Supreme Court. Need I say more?\nINGRAHAM: Yes, no.\nHANNITY: Health care...\nINGRAHAM: That's everything.\nHANNITY: ... energy independence, education back to the states...\nINGRAHAM: Tax reform! Tax -- I mean...\nHANNITY: ... taxes today.\nINGRAHAM: I mean, health! \"Obama care\" gone!\nHANNITY: Building the military up.\nINGRAHAM: Right. We have to do it. What's not conservative about any of that?\nHANNITY: What is -- that's what I was going to ask you. What is not conservative about that agenda?\nINGRAHAM: Well, I think people sometimes -- and we all fall into this -- have a little hard time...\n(CROSSTALK)\nHANNITY: ... losing?\nINGRAHAM: Lost or wrong or feel wounded or their pride, and you know, pride cometh before the fall. And look, he has 88 percent of Republicans now supporting him. He has...\nHANNITY: He needs 93.\nINGRAHAM: He has 73 percent...\nHANNITY: I'd be more comfortable (INAUDIBLE) 93.\nINGRAHAM: Yes. But I think his (ph) thing has changed. When he is up 8 points today in Iowa, a state that Mitt Romney lost handily, and we see him up in Nevada, we see him now up in Florida and Ohio...\nHANNITY: Colorado.\nINGRAHAM: Remember -- Florida and Ohio. We haven't seen a Republican lose Florida -- I mean win Florida and Ohio and not win the presidency before, not in our lifetime.\nHANNITY: Right.\nINGRAHAM: I'm pretty sure not in our lifetime, and I don't remember the last time, so...\nHANNITY: Listen, he's within 3 in a state like Wisconsin.\nINGRAHAM: So the trend is up. Nate Silver's polls-plus today now has him at 40.8 chance of winning!\nHANNITY: Yesterday, it was at 31.\nINGRAHAM: And Sean, remember three weeks ago when I was on with you...\nHANNITY: It was 24.\nINGRAHAM: It was, like, 21! (INAUDIBLE)\nHANNITY: By the way, he changes every day, so he can say, I'm not wrong.\nINGRAHAM: Right. It changes. And it can swing right back in Hillary's favor. He does not have a strong debate performance, he starts being distracted by side issues, and the election can slip back away from him.\nHANNITY: I agree with that.\nINGRAHAM: But right now, it's a nice trajectory, but he has to build on it. Don't get overconfident. Don't get cocky. Continue to listen to the people. His listening is actually really powerful. It's nice to be listened to. People want to -- want to be listened to.\nHANNITY: You know, it's funny you say that because I go out, and obviously, people know I interview him. You have the same thing, and it's what was the one thing you'd always hear? Tell him we love him, but...\nINGRAHAM: Right.\nHANNITY: ... be quiet.\nINGRAHAM: Yes.\nHANNITY: And he's not picking fights with Gold Star dads.\nINGRAHAM: No.\nHANNITY: He's not picking fights with a judge. He's now focused on Hillary and Obama. And also, you know, he's given pretty deep policy speeches.\nINGRAHAM: Oh, my gosh! I mean, sub-parts, parts -- I mean, referring to statutes, particularly regulations they're going to repeal. I don't know now, again, in the last few elections, who has been more substantive on specific policy issues that the nation cares about -- the economy, immigration, trade, and even foreign policy. So that criticism is now out the window.\nHANNITY: You made a really good comment. I actually Quote: d you on my radio show yesterday about an admonition, if you will, to the never irrelevant Trumper people, but what you said is pretty deep and profound in this way. If she gets elected president, it's -- she will be unchecked.\nINGRAHAM: The imperial executive.\nHANNITY: Yes. Explain that.\nINGRAHAM: Well, Hillary will have -- she will have appointed all the prosecutors, all the agency heads, all the judges, appellate court, district court and probably three Supreme Court justices, two or three.\nHANNITY: At least.\nINGRAHAM: After that, who's going to stop Hillary? When Hillary Clinton decides that the equal protection clause requires a minimum standard of living, a minimum standard of education, a minimum standard of -- you know, name your -- name you -- name your pick, what does that mean?\nHANNITY: Same thing with immigration. Same thing with taxation. Same thing...\nINGRAHAM: All of it.\nHANNITY: ... with executive orders.\nINGRAHAM: She will weaponize the government against the ordinary...\nHANNITY: That is really a profound reason right there.\nINGRAHAM: Unchecked power! Trump will be...\nHANNITY: Unchecked.\nINGRAHAM: ... checked by Paul Ryan. You know Paul Ryan's going to check Trump -- eyeroll -- by Mitch McConnell and by a court that will probably be still divided. So (INAUDIBLE) Trump's going to do this and that -- Trump's going to have a lot to deal with in Congress, a lot of doubters.\nHANNITY: In terms of checks and balances.\nINGRAHAM: Checks and balances. Hillary will be unchecked! How many people -- raise your hand if you think the government is -- under Paul Ryan and Mitch McConnell is going to refuse to fund a Hillary Clinton budget and then shut the government down?\nHANNITY: You mean like they stopped Obama's agenda?\nINGRAHAM: Yes, they probably had a heart attack when Ted Cruz read \"Green Eggs and Ham\" that night. I mean, they were having a meltdown! Like, Oh, it's embarrassing us! We're going to lose the midterm elections! Then what did we do?\nHANNITY: They won.\nINGRAHAM: We won the midterm elections. So he -- she will be unchecked, Sean, and that (INAUDIBLE) .\nHANNITY: Last thing. My admonition to Trump on the debates is this. I don't really think they need to fill his head with facts and figures because I think he understands these issues. I think one of the benefits of giving these policy speeches is, hey, he's -- he's -- that's prep, if you will, for debate.\nINGRAHAM: Yes.\nHANNITY: The thing that I'm worried about -- I don't think Hillary can run on Obama's economic record, her economic record that she wants to follow in his footsteps on her foreign policy record. But I think she wants to prove to the country he doesn't have the temperament to be president. So I suspect she's going to jab...\nINGRAHAM: Oh, yes.\nHANNITY: ... and poke and prod and try and irritate, agitate, hurt, upset his feelings and make him bubble and fizz like Alka-Seltzer and...\nINGRAHAM: Sean, you know what she's going to do? Let's say he starts to interrupt her. Donald, I know you're used to interrupting and cutting women off. That's not going to happen here. Applaud in the audience!\nHANNITY: Yes.\nINGRAHAM: You know, so he's got to be careful, but he can't be timid. He has to be respectful. Remember, Reagan always -- when he delivered a punch, he always gave a hug at the same time, a punch and a hug. So a little wistfulness. You know, Reagan says, \"There you go again\"...\nHANNITY: Yes.\nINGRAHAM: ... and it was that smile and that knowing glance. And sometimes, saying nothing is really powerful and just looking at the person. Sometimes that's powerful.\nHANNITY: Do you think he will have the impenetrable shield where she can't get to him? He seems to be...\nINGRAHAM: I don't know.\nHANNITY: ... very relaxed now on the campaign trail, very at ease, very in a zone.\nINGRAHAM: I think he's getting used to not having to respond to every criticism, and that's hard. He's not a politician. He's kind of a straight fighter. He's really smart, but he's -- also, he's used to punching back. Sometimes, holding back is the strongest position to take...\nHANNITY: Yes, I don't have that skill.\nINGRAHAM: ... and I think he's learning that. No, you punch back. (INAUDIBLE) you know, this is why we've been successful in what we've done.\nHANNITY: Yes.\nINGRAHAM: But he -- sometimes, it's better to hold back a little bit...\nHANNITY: You're right.\nINGRAHAM: ... and let her talk. She has no record. And just attacking him on personal grounds, which she'll do, that kind of proves our point, doesn't it?\nHANNITY: Well, said. Laura Ingraham...\nINGRAHAM: Great to see you, Sean.\nHANNITY: ... great to see you. All right, thank you.\nAnd coming up next on this busy news night tonight here on \"Hannity\"...\n(BEGIN VIDEO CLIP)\nTRUMP: Not one single idea she's got will create one net American job.\n slamming Hillary Clinton while laying out his economic agenda. Trump's running mate, Indiana governor Mike Pence -- he's next in studio.\nAlso later tonight...\n(END VIDEO CLIP)\nTRUMP: I don't know, folks. You think Hillary would be able to stand up here for an hour and do this?\n(BOOS)\nTRUMP: I don't think so. I don't think so! I don't think so.\n questions Hillary Clinton's stamina, releases new information about his health. We'll check in with our medical A-team. They have reaction.\nAll of that and more tonight as we continue on \"Hannity.\"\n(COMMERCIAL BREAK)\n(NEWSBREAK)\n(BEGIN VIDEO CLIP)\nTRUMP: Not one single idea she's got will create one net American job or create one new dollar of American wealth for our workers. The only thing she can offer is a welfare check. That's about it. Our plan will produce paychecks, and they're going to be great paychecks for millions of people now unemployed or underemployed.\n(END VIDEO CLIP)\nHANNITY: That was Donald Trump earlier today taking a few little swipes at his Democratic rival while unveiling details of his economic plan.\nJoining us now with reaction, GOP vice presidential nominee, Governor Mike Pence. Governor, how are you?\nGOV. MIKE PENCE, R-IND., VICE PRESIDENTIAL NOMINEE: I'm great, Sean. Great to see you.\nHANNITY: Fifty-four days to go, and you may be the next vice president of the United States.\nPENCE: Very humbling.\nHANNITY: You got to love these polls.\nPENCE: Very encouraged, tremendous momentum. And beyond the numbers, I just see it everywhere I go.\nHANNITY: What changed? What do you think is different?\nPENCE: I don't think anything's really changed. I just think Donald Trump's optimistic message to make America great again, rebuild our military, have America standing tall on the world stage and revive this economy through all the principles he described today at the Economic Club in New York, through less taxes, less regulation, more (INAUDIBLE)\nHANNITY: That is a speech I think Reagan could give.\nPENCE: ... trade deals.\nHANNITY: That's a Reagan -- that's a Reagan economic policy. Maybe take aside the trade issue alone, everything else is Reagan.\nPENCE: Well, I couldn't agree more. I mean, it's not only Reagan, it's Kennedy. I mean, these were -- these were two different presidents who understood that you lower marginal tax rates, you roll back regulation, you get big government out of the way of job creators in America, and this economy will come roaring back. It did with John F. Kennedy. It did after Ronald Reagan. It'll happen again with President Trump.\nHANNITY: And he's got two other resources available to him that neither Kennedy nor Reagan had, and that is you have America's vast energy resources...\nPENCE: It's incredible.\nHANNITY: ... coupled with new technology, horizontal drilling and fracking. I mean, you're talking about millions of high-paying jobs and careers!\nPENCE: That's exactly right. He talked about that today in that speech, and what really -- ending the war on coal and unleashing the boundless potential of (INAUDIBLE)\nHANNITY: You mean he doesn't want to fire every coal worker and get rid of every coal company? That was Hillary. Oh, sorry. Wrong campaign.\nPENCE: You know, it really is amazing to think that a major party candidate actual campaigned on promising to have fewer coal mine businesses and fewer coal miners. That's exactly what Hillary Clinton said.\nHANNITY: See, I would argue I do see a little change in Mr. Trump, in this sense. I think he's more on message, very deep, substantive speeches he's given on policy. He's gotten away from distractions, fighting with a judge or whatever that could take his attention away.\nAnd I also think he's taken a lot of risks that have paid off -- Baton Rouge, thought he did a great job with the Matt Lauer forum, going to Mexico. There's a risk in doing something like that. He's going into black churches, which I love because as a conservative, I've never liked this phony label that conservatives don't care about all Americans. I find that offensive to me. And I think that, coupled with a more presidential feel to him, he seems to really hit his stride.\nPENCE: Well, I -- I'll -- we'll take the compliment.\n(LAUGHTER)\n(CROSSTALK)\nPENCE: No, well, I agree that, in a very real sense, I think America is seeing this man for who he is and the kind of president he'll be more clearly today...\nHANNITY: See, I've known him for years. He's more natural now, more the guy I've known.\nPENCE: OK. All right.\nHANNITY: Is that fair?\nPENCE: Right.\nHANNITY: I mean, that's him. What we see now...\nPENCE: So you're saying it's -- it hasn't changed. It's just him.\nHANNITY: Yes. I mean, he's...\nPENCE: That's my point.\nHANNITY: ... also combative, but I think he's adjusted to the political arena a little bit, but it's still him.\nPENCE: Make no mistake about it, this man's a fighter.\nHANNITY: He's a fighter!\nPENCE: And he's a winner. And everywhere I go, people appreciate that he can fight. But I think to your point, what people are saying when he went and met with President Pena Nieto...\nHANNITY: That was a big day.\nPENCE: ... when he -- when he and I went down to Baton Rouge, and I just saw him, you know, just order the motorcade to pull over. He jumped out of the car, an unscheduled stop, put his arms around these families, walked into homes that had been devastating...\nHANNITY: By the way, I went down after you.\nPENCE: ... under nine (ph) feet of water...\nHANNITY: It was shocking.\nPENCE: It was shocking.\nHANNITY: It was -- and the media ignored that story.\nPENCE: 40,000 families or homes.\nHANNITY: Horrible.\nPENCE: And there he was -- he was in Mexico City, sitting with a leader in a cordial discussion with whom he has strong differences of opinion. There he was on the streets of Baton Rouge, Louisiana. There he is in African- American churches, showing his heart and his commitment to make America great again for everyone, regardless of race or creed or color or gender.\nWhat people are seeing is the kind of president that Donald Trump will be, and I think that's why you're seeing all the momentum, the turnout at the rallies, and all the momentum in all these key states around the country.\nHANNITY: What do you say -- like, he laid out an extremely conservative agenda on the economy today. He has an extremely conservative plan. He likes originalists like Scalia and Thomas for the court.\nPENCE: You bet.\nHANNITY: Education back to the states, energy independence, repeal \"Obama care,\" replace it with free market solutions. His tax plan is conservative.\nWhat part of this alienates any conservative? Because you're as strong a conservative as I think I am, and I know people like the term nationalist- populist, but the agenda itself is applying conservative principles to today's problems.\nPENCE: Well, I think conservatism is, in a sense, populist. I mean, Ronald Reagan -- I was at the Reagan library last week and reflected on the similarities between these two men. And I think there are many. I mean, we all remember Ronald Reagan for his strong conservative principles and the policies that he advanced. But in a very real sense -- I'm old enough to remember Ronald Reagan was in every sense a man who spoke straight into the heart of everyday Americans.\n(CROSSTALK)\nHANNITY: ... Reagan lived (ph) conservatives for decades. Trump kind of always knew it, but he's evolved politically and people seem unwilling to accept that he now sees the answers based on his life experiences.\nPENCE: Yes. And look, I don't want to overstate it. They were two -- two different men, two different styles. But I think at their core is the same understanding of what's made this country great.\nHANNITY: Yes.\nPENCE: It's our freedom. It's our free market economics. It's our commitment to the Constitution. It's the arsenal of democracy, standing with our allies, standing up to our enemies. Donald Trump at his core just cherishes those same American ideals you and I cherish, Ronald Reagan cherished...\nHANNITY: Vetting refugees.\nPENCE: ... and I think vast majority of the American people cherish.\nHANNITY: Building up the military, building a wall, securing our borders all add to that. How important are these debates, and are you ready?\nPENCE: I'm getting ready. You know, and I know my running mate is ready.\n(LAUGHTER)\nHANNITY: He's chomping at the bit, I'm betting!\nPENCE: Yes. Yes. You know, and I honestly think he's going to bring a lifetime of experience to that stage. I think you saw that on another network last week.\nHANNITY: I think he did really well in that forum. You knew -- you knew he won because every liberal was bashing poor Matt Lauer. I mean, God forbid I have to defend Lauer!\nPENCE: Yes, the overwhelming majority of Americans thought that he did very well. But what you saw there was someone who is confident, who's ready to lead.\nAnd I just think, you know, this election really does come down to just a few core issues. It's about national security. It's about prosperity. It's about upholding the Constitution in the Supreme Court of the United States. And it's about upholding the highest standards of integrity in the highest office in the land.\nOn all of those things, Donald Trump is head and shoulders over Hillary Clinton, and I think that explains why you're seeing such tremendous momentum in this campaign.\nHANNITY: Governor, good to see you. Thanks for stopping by.\nPENCE: Thank you, Sean.\nHANNITY: Fifty-four days to go.\n(LAUGHTER)\nPENCE: But who's counting?\nHANNITY: Who's counting?\n(LAUGHTER)\nHANNITY: And up next tonight right here on \"Hannity\"...\n(BEGIN VIDEO CLIP)\nTRUMP: I don't know, folks! You think Hillary would be able to stand up here for an hour and do this?\n(BOOS)\nTRUMP: I don't know. I don't think so! I don't think so.\n casting doubt about Hillary Clinton's stamina as he now releases details about his own health. We'll check in with our medical A-team.\nAnd also coming up later tonight...\n(BEGIN VIDEO CLIP)\nTRUMP: Over the next 10 years, our economic team estimates that under our plan, the economy will average 3.5 percent growth and create a total of 25 million new jobs.\n unveiling his full economic agenda, promising historic job creation to put you, the American people, some 95 million of you out of the labor force, back to work. Anthony Scaramucci, Steve Moore -- they're here with reaction.\nThat and more tonight on \"Hannity.\"\n(COMMERCIAL BREAK)\n(BEGIN VIDEO CLIP)\nTRUMP: Oh, you think this is so easy in this beautiful room that's 122 degrees?\n(YELLING)\nHANNITY: It is hot! And it's always hot when I perform because the crowds are so big! These rooms were not designed for this kind of a crowd!\nI don't know, folks. You think Hillary would be able to stand up here and do this for an hour and do this?\n(BOOS)\nTRUMP: I don't think so! I don't think so.\n last night calling out Hillary Clinton. Earlier today, the Trump campaign released information on the GOP nominee's health. And Mr. Trump also shared his medical history on the Dr. Oz show which he taped yesterday.\nTake a look.\n(BEGIN VIDEO CLIP)\nDR. MEHMET OZ, HOST: If a patient of mine had these records, I'd be really happy and I'd send them on their way. I must say, I would have shared this earlier. Why didn't you blast this out?\nTRUMP: I didn't think it was necessary. You know, the public's known me for a long time. They've never seen me in the hospital, OK? (INAUDIBLE) if I'm in a hospital, it's going to be out there bigly (ph).\nWhen you're running for president, I think you have an obligation to be healthy. I just don't think you can do the work if you're not healthy. I don't think you can represent the country properly if you're not a healthy person.\n(END VIDEO CLIP)\nHANNITY: Joining us now, podiatric surgeon and former research and diabetes fellow at Georgetown University, Dr. Kelly Powers is with us, and from the FOX News medical A-team, Dr. Marc Siegel. Good to see you both.\nDr. Siegel, I look at his health. Looks pretty good to me. He's on a statin. He hasn't been in the hospital. He had an appendectomy at 11. Does that matter?\nDR. MARC SIEGEL, FOX NEWS CONTRIBUTOR: That certainly doesn't matter.\n(LAUGHTER)\nSIEGEL: And you know, we got a lot of specifics...\nHANNITY: I had my tonsils out when I was in 1st grade. Does that matter?\nSIEGEL: You're terrific.\nHANNITY: Yes.\nSIEGEL: You're in good health.\nHANNITY: I'm in good health.\nSIEGEL: But we -- we got a lot of info today that's helpful in terms of seeing that. He has no family history of heart disease or of cancer.\nHANNITY: Parents lived long.\nSIEGEL: Long, father into the 80s, mother into 90s. He had a calcium score of -- very low. In 2013, he had an echocardiogram...\n(CROSSTALK)\nHANNITY: ... calcium issue's important because that's -- we're talking about calcification in the arteries?\nSIEGEL: It tells you the amount of calcium that's in your coronary arteries. And if you have a lot, it's predicted that you have heart disease. If you have a little -- and both candidates have a little -- it's a predictive of no heart disease. It's very unlikely he has heart disease. EKG was normal. Echocardiogram of the heart is normal. Blood pressure is low. And as you said, his cholesterol is under control. So his heart, lungs look good. Liver tests come back good.\nHis testosterone is a little elevated, which we're not surprised to find out with all of his energy, and his prostate looks very, very good.\nHANNITY: His PSA was really low.\nSIEGEL: Really low, which is also, again, a sign that he doesn't have any prostate trouble. His chest X-ray is normal. His thyroid function normal...\n(CROSSTALK)\nSIEGEL: Yes, and -- but his weight -- his weight is his only issue, 236 pounds...\n(CROSSTALK)\nHANNITY: All right, 15 pounds overweight.\nDR. KELLY POWERS, PODIATRIC SURGEON: Right.\nSIEGEL: Right.\nPOWERS: You know, I'd like to add...\n(CROSSTALK)\nPOWERS: Yes. Sure. So bottom line, Sean, that Trump is -- you know, there's a few things he needs to work on. BMI, as you mentioned, Dr. Siegel -- BMI is a little elevated, which indicates that the body mass index...\nHANNITY: Which indicates he's an average American. But go ahead.\nPOWERS: Yes. So it's a little elevated. So he could afford to lose a few pounds. He is classified under the NIH calculations as being overweight. And you know, this does put him at risk for diabetes and heart disease, and you're right, there are a lot of Americans that have this concern. But overall, his health concerns are nowhere near Hillary Clinton's alarming medical history, such as -- you know, we've talked about it before, with DVT, CVT, memory lost, concussion, the list goes on.\nSIEGEL: I also would, and I think Dr. Powers would agree, there's something called a young 70. We don't just go only by chronological age anymore. This is a young 70. It's not only what age you are but --\nHANNITY: I'm a young 54.\nSIEGEL: Very. You exercise a lot.\n(LAUGHTER)\nHANNITY: Everyone knows I do martial arts and boxing and hitting and punching. And you do three rounds on the bag and I'm like -- does that mean anything Dr. Powers?\nPOWERS: You know, I would like to point out one thing, too. Hillary released her medical records yesterday, Trump today, as we saw. But I have a question. Where's the beef? Where is what we all want to see, which is her neuro evaluation? One, has it been done? I would think that most medical professionals would have performed a neuro evaluation and repeat MRIs to be included in that neuro eval. But where is it, and who is saying that it's not pertinent and why hasn't it been released? That's what we want to see.\nSIEGEL: I agree with that totally, Dr. Powers. And to your point, we saw a big rundown on the pneumonia which she's clearly recovering from. It was noncontagious, which I don't agree with. Pneumonia is generally contagious. But we didn't see anything about that faint or that near faint and the history of faints and the history of head trauma. We did see a CT scan that was negative but we haven't seen a lot of those records, and she just had a faint. I completely agree with that.\nHANNITY: I've got to let you both go. Go ahead, Dr. Powers. Last word.\nPOWERS: I think pneumonia, although serious, is becoming this red herring. We want the neuro evals. We want to see what's going on --\nHANNITY: I want a neurological. I'd like to see an MRI of the brain.\nPOWERS: I agree with that.\nHANNITY: I think that would tell us a lot.\nSIEGEL: Absolutely. Absolutely.\nHANNITY: I wouldn't hold your breath. If you do, it could be a very damaging medical condition.\nAnyway, up next tonight on \"Hannity.\"\n(BEGIN VIDEO CLIP)\nTRUMP: Over the next ten years, our economic team estimates that under our plan the economy will average 3.5 percent growth and create a total of 25 million new jobs.\n laying out his pro-growth economic agenda, promising to create 25 million new jobs. We'll check in with Anthony Scaramucci and Stephen Moore. They are here with reaction.\nThen later tonight --\n(BEGIN VIDEO CLIP)\nBRIAN STELTER, CNN HOST: I'm not saying Hannity or Limbaugh fit into this necessarily, but some of these figures want her to be sick. They want her to be dying. They want her to be on her death bed. It's wishful thinking.\n(END VIDEO CLIP)\nHANNITY: Clinton News Network Brian Stelter, smearing, slandering me and Rush Limbaugh with that ridiculous lie. We'll check in Mercedes Schlapp, Lisa Boothe, and Eboni Williams here with reaction.\n Donald Trump, he outlined his economic policy agenda earlier today right here in New York City. Here are some of those highlights.\n(BEGIN VIDEO CLIP)\nTRUMP: It's time to establish a national goal of reaching four percent economic growth.\n(APPLAUSE)\nTRUMP: Over the next 10 years our economic team estimates that under our plan the economy will average 3.5 percent growth and create a total of 25 million new jobs. Our tax plan will greatly simplify the code and reduce the number of brackets from seven to three. One of our greatest job creation measures is going to be our 15 percent business tax rate down from the current 35 percent rate, and a reduction of more than 40 percent.\nWe will make America wealthy again. We will make America strong again. And we will make America great again.\n(END VIDEO CLIP)\nHANNITY: All right, here with reaction, Trump campaign national finance member and co-host of \"Wall Street Week\" on the FOX Business Network, Anthony Scaramucci is back with us. Also, economist at the Heritage Foundation and a Trump economic adviser, Steve Moore. Guys, good to see you both.\nLet's go over this. Half of America doesn't pay federal income taxes now, they won't pay federal income taxes. He will drop the corporate tax rate from 40 to 15. That puts us -- we're nearly like Ireland at that point, right?\nSTEVE MOORE, TRUMP ECONOMIC ADVISER: That's right. Right now we have the highest corporate tax in the world, so our businesses are leaving. We've seen that with Burger King --\nHANNITY: I have an article right here. Ford is going to spend $1.6 billion.\nMOORE: They are leaving, and we don't have to scratch our heads and say why are they leaving. They tell us we have the highest rate. IF you cut that rate, I guarantee you, from 40 percent down to 15 so we go from the highest to the lowest, it's going to be like a magnet. Those companies are going to come back. They're going to invest in the United States.\nHANNITY: And this issue, I'll go to Anthony on this, of corporations, multinational corporations parking not millions, billions, but literally maybe as high as $5 trillion overseas because the taxation rate is too high in this country. Incentivize them with a 10 percent rate, they bring that money back. They build factories, manufacturing centers. That means people in Flint, Michigan, Detroit, Wisconsin, Ohio, Pennsylvania, do they get back to work?\nANTHONY SCARAMUCCI, TRUMP'S NATIONAL FINANCE COMMITTEE MEMBER: They not only go back to work, Sean, but the big unemployment number that people don't focus on is the U-6 unemployment number. Steve can tell you that number is still 9.5, 10 percent. If you brought half of that money back, you would get that number down into the five, six percent zone, and then you really are at full employment in the country, and you'll see an explosion in wage growth for the middle class and for working class families. And that's really been the principle focus of today's speech. Let's work at the American government level for the middle class and working class families to help them create an aspirational society.\nHANNITY: I'm a broken record -- the lowest labor participation rate since the '70s, lost home ownership rate in 51 years, worst recovery since the '40s.\nMOORE: Sean, there was another big announcement today, I mean this week. The Census Bureau came out with their income and poverty statistics.\nHANNITY: I've got it right here.\nMOORE: There's a little bump up in income, but here's an interesting thing about that.\nHANNITY: I have it right here. \"Business Insider\" had it.\nMOORE: The average income for the middle class family, working class family in America today, is lower today than it was in 2008. This has been no recovery at all. Hillary is running around the country saying everything is wonderful.\nHANNITY: We have 12 million more people on food stamps. We have 8 million more in poverty.\nMOORE: Still 42.5 million people --\nHANNITY: Where are the conservatives on this? Where are the people who say they are conservative? This is Reagan to me.\nMOORE: Yes, it is. We're going to cut taxes. Reagan did that. We're going to get rid of regulations. Reagan did that. Trump is even to the right of Reagan on school choice. You talked about this the other night. He's saying let's take the Department of Education, that $60 billion, let's give it to the parents and the kids in the inner city so they can go to good schools. We're going to have a pro-America energy policy. You go down the line, this is one of the most conservative -- I worked for Ronald Reagan. I would say this is the candidate right now, Donald Trump, who is the most Reaganesque that we've had since Reagan.\nHANNITY: Last question for Anthony. Energy is the lifeblood of our economy. Let's just be blunt. We need energy to keep everything going. Now, we're dependent on a lot of our energy sources, but we have more resources, especially with natural gas, new technologies, horizontal drilling, fracking, all these new technologies, where we could be energy independent maybe in four years and put millions of Americans to work at high-paying jobs. That's a big part of our potential success, isn't it?\nSCARAMUCCI: It's not only that, Sean. I mean, it turns out that we are actually Saudi Arabia. Imagine that 40 years ago when we were talking about peak oil. So we are actually a net exporter of energy in three to five years. And what Mr. Trump is saying is we can convert that into revenues, which will not only grow GDP but help us pay down the deficit. And so that's a brilliant strategy.\nKRAUTHAMMER: So western Europe dependent on Ukraine, and Vladimir Putin if he turns off the spigot, they are in dire straits. We can help export to them and that will create more jobs here.\nMOORE: I just wrote a book on this.\n(CROSSTALK)\nMOORE: I've got to get that for you. But we, not only -- Anthony, you're right, we can be energy dependent, but I'm going to take that a step further. We can be the energy dominant country in the globe.\nHANNITY: We could be loaded. We could be rich like the Saudis.\nMOORE: And we're talking about economics. Think about the national security if we don't have to import the oil from countries who are trying to kill us.\nHANNITY: It's huge.\nMOORE: But Hillary, by the way, her agenda is keep it in the ground. That makes no sense.\nHANNITY: And coal miners out of work.\nMOORE: She's done a good job on that.\nHANNITY: All right, up next tonight on this busy news night on \"Hannity.\"\n(BEGIN VIDEO CLIP)\nSTELTER: I'm not saying Hannity or Limbaugh fit into this necessarily, but they, some of these figures want her to be sick, they want her to be dying, they want her to be on her death bed. It's wishful thinking.\n(END VIDEO CLIP)\nHANNITY: That's called slander. Brian Stelter, the little pipsqueak who relies on Media Matters for all of the talking points, he's kind of Jeff Zucker's stenographer. Anyway, he takes a shot at me and Rush. I call it slander. We'll set the record straight and get reaction from Mercedes Schlapp, Lisa Booth, and Eboni Williams straight ahead.\n(COMMERCIAL BREAK)\nHANNITY: And welcome back to HANNITY. So last night the CNN host, I call him the pipsqueak, he's uses Media Matters as his talking point. He's kind of Jeff Zucker's stenographer, Brian Stelter, viciously slandered and attacked me and Rush Limbaugh. Watch this.\n(BEGIN VIDEO CLIP)\nSTELTER: There's a basket of legitimate questioning about Hillary Clinton's health. And some conservative commentators and media figures fit into that basket. They're right to wonder about her health in some cases.\nThen there's this other basket, the truly deplorable basket. Sean Hannity fits into it, so does Rush Limbaugh, Alex Jones, and others. These are people who bring up rumors and innuendo about Clinton's health, and they've been doing it for years. I'm not saying Hannity or Limbaugh fit into this necessarily, but they -- some of these figures want her to be sick, they want her to be dying, they want her to be on her deathbed. It's wishful thinking.\n(END VIDEO CLIP)\nHANNITY: Want her sick, want her dying, want her on her death bed? Brian, if you'd actually do some research, I know you work for the Clinton news network, but if you'd actually do some research you might discover that numerous times on my radio show -- yesterday, I said I wish her all the best, we only wish the best even though we have political differences. So what you did is a lie, a smear, a slander, basically a typical CNN day.\nAnd joining us now, Washington Examiner, contributor Lisa Boothe, Fox News contributors Mercedes Schlapp, and Eboni Williams. You know, what am I supposed to do with that. I should sue for slander.\nEBONI WILLIAMS, FOX NEWS CONTRIBUTOR: Let's go to court with him.\nHANNITY: I have better things to do. It is a slander.\nWILLIAMS: In all seriousness, look, you have well documented. I would challenge you to name one thing you agree with Hillary Clinton on. You and I have political differences.\nHANNITY: Sure.\nWILLIAMS: But I know you to be a good man.\nHANNITY: You're coming over. I'm winning you over.\nWILLIAMS: I know you to be a good man, and I've never known you to wish someone dead. It's actually a very nasty, undermined ploy. And I'm very disappointed and kind of disgusted.\nHANNITY: Mercedes, when you really dig deep here, that's kind of the playbook that Democrats, liberals like anybody that works at CNN do. Even Hillary's comments about \"deplorables,\" which he's just one-upping, I guess. He couldn't think of his own line so he's using hers. But it's followed by these are people that will never change, irredeemable, that they're racist, sexist, homophobic, xenophobic, Islamophobic. That is the narrative Democrats use every campaign, and it is a slander.\nMERCEDES SCHLAPP, FOX NEWS CONTRIBUTOR: It's a typical name calling strategy that they have. And what's fascinating is with the mainstream media is they live in a bubble. They're the ultimate Washington insiders. They're the ultimate New York elitists. They don't know how to connect with the everyday Americans.\nAnd what they have spent their time doing right now is that they criticize reporters time and time again and individuals who are just asking very simple questions on Hillary Clinton's health. Rush Limbaugh came out and said I'm simply reporting what I'm seeing. What are we seeing? Cough fits, seizure-like behaviors, questions that reporters should be asking, and yet they're defending her.\nHANNITY: It's what's on the record we've talked about, Lisa. And we see the coughing fits. We know that she claims to the FBI she couldn't remember ever being briefed ever about cyber-security. We know that she has deep vein thrombosis. We know now she has pneumonia. We saw her collapse. We know that she had some type of cerebral venous thrombosis as well. She has a real conditions here, real concussion. Is it so unfair to ask doctors what they think about what is on the record, because that's all I did, and he called that a conspiracy theory.\nLISA BOOTHE, FOX NEWS CONTRIBUTOR: No, it's not, Sean, because we saw her falling to the ground and video. There have been pictures of her having difficulty getting up the stairs. And as you mentioned, she was the one, or at least in the context of the notes of the FBI, seemingly telling them that she couldn't remember things after her concussion. So there are legitimate questions there.\nAnd Sean, these individuals, these reporters had no problem questioning John McCain's health in 2008, but somehow Hillary Clinton's health is off limits. There's a reason why according to Gallup America's trust in the news media is at an all-time low right now. And Sean, Hillary Clinton has done herself no favors by being an individual who has concealed so much information -- her private email server, the Clinton Foundation.\nHANNITY: Exit question for all of you. Simple question. Do you think we're being told the entire truth about Hillary's health? Eboni?\nWILLIAMS: No. She has a consistent transparency problem, Sean.\nHANNITY: Mercedes?\nSCHLAPP: I agree with Eboni. I think that there is this ultimate cover- up, and this is the narrative that Hillary Clinton keeps pushing forward.\nHANNITY: Lisa?\nBOOTHE: I don't think Hillary Clinton is capable of the truth.\nWILLIAMS: Lisa, get an opinion.\nBOOTHE: I don't think it's in her DNA.\n(LAUGHTER)\nHANNITY: Lisa gets the gold star for that one.\nThank you all. And coming up, we have a very important \"Question of the Day.\" We need your help. That's next.\n(COMMERCIAL BREAK)\nHANNITY: All right, time for our \"Question of the Day.\" Given the new polls, are you feeling optimistic now about Donald Trump's chances in 54 days come November 8th? Just go to Twitter, let us know what you think.\nThat's all the time we have for this evening. We will be back tomorrow night. And we'll see you here tomorrow night. Thanks for being with us.\n ", "external_links": [], "published": "2016-09-15T03:00:00.000+03:00", "crawled": "2016-09-16T23:27:54.421+03:00", "highlightTitle": ""}