{"organizations": [], "uuid": "7ae746df0584dd8de7bfde5b6e8b9aa3f9603a66", "thread": {"social": {"gplus": {"shares": 1}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 29, "shares": 29, "comments": 35}, "stumbledupon": {"shares": 0}}, "site_full": "www.buzzfeed.com", "main_image": "https://img.buzzfeed.com/buzzfeed-static/static/2016-09/21/15/campaign_images/buzzfeed-prod-web08/are-you-ready-for-the-big-debate-immigration-clas-2-3861-1474487498-0_dblbig.jpg", "site_section": "http://www.buzzfeed.com/politics.xml", "section_title": "BuzzFeed - Politics", "url": "https://www.buzzfeed.com/adriancarrasquillo/are-you-ready-for-the-big-debate-immigration-clash-between-t", "country": "US", "domain_rank": 137, "title": "Are You Ready For The Big Debate Immigration Clash Between Trump And Clinton?", "performance_score": 0, "site": "buzzfeed.com", "participants_count": 1, "title_full": "Are You Ready For The Big Debate Immigration Clash Between Trump And Clinton?", "spam_score": 0.0, "site_type": "news", "published": "2016-09-22T03:51:00.000+03:00", "replies_count": 0, "uuid": "7ae746df0584dd8de7bfde5b6e8b9aa3f9603a66"}, "author": "Adrian Carrasquillo", "url": "https://www.buzzfeed.com/adriancarrasquillo/are-you-ready-for-the-big-debate-immigration-clash-between-t", "ord_in_thread": 0, "title": "Are You Ready For The Big Debate Immigration Clash Between Trump And Clinton?", "locations": [], "entities": {"persons": [{"name": "clinton", "sentiment": "negative"}, {"name": "trump towe", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "negative"}, {"name": "todd schulte", "sentiment": "none"}, {"name": "noorani", "sentiment": "none"}, {"name": "delgado", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "aj delgado", "sentiment": "none"}, {"name": "daniel garza", "sentiment": "none"}, {"name": "obama", "sentiment": "none"}, {"name": "mark zuckerberg", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "jimenez", "sentiment": "none"}, {"name": "palomarez", "sentiment": "none"}, {"name": "javier palomarez", "sentiment": "none"}, {"name": "schulte", "sentiment": "none"}, {"name": "lester holt", "sentiment": "none"}, {"name": "garza", "sentiment": "none"}, {"name": "ali noorani", "sentiment": "none"}, {"name": "adrian carrasquillo", "sentiment": "none"}, {"name": "cristina jimenez", "sentiment": "none"}], "locations": [{"name": "washington", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}, {"name": "latina", "sentiment": "none"}, {"name": "new jersey", "sentiment": "none"}, {"name": "phoenix", "sentiment": "none"}, {"name": "central america", "sentiment": "none"}], "organizations": [{"name": "ap", "sentiment": "negative"}, {"name": "national immigration forum", "sentiment": "none"}, {"name": "united we dream", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "congress", "sentiment": "none"}, {"name": "buzzfeed news", "sentiment": "none"}, {"name": "washington post", "sentiment": "none"}, {"name": "u.s. hispanic chamber of commerce", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "AP images ID: 9642776 \nWASHINGTON — Everyone knows Donald Trump descended an escalator at Trump Tower when he launched his campaign last summer saying Mexico sends criminals and rapists to the country, promising to build a wall and deport millions. \nAnd just weeks into her campaign, Hillary Clinton sat in a high school library to sketch out her proposal for a path to citizenship for undocumented immigrants and pledged to go further than Obama’s executive actions if Congress won’t move a legislative fix. \nNo issue has been more central to the campaign. \nBuzzFeed News spoke with a wide-range of immigration stakeholders; activists who work with faith, law enforcement, the tech sector, and business; as well as undocumented activists, traditional Republicans, and a hardline Trump adviser, to find out what they expect to hear on the polarizing issue and what is left to say beyond the well-worn phrases of deportations and a wall or a path to citizenship and immigration reform. “Trump’s immigration plan does not treat immigrants like human beings.” ID: 9659358 \nAli Noorani who has worked with faith, law enforcement, and business groups to put together a coalition on immigration as executive director of the National Immigration Forum said to avoid empty buzzwords that don’t ultimately give anything of substance to viewers, both candidates should come prepared with details. For Clinton, what would her legislative package on immigration look like? And for Trump, how does he actually plan to deport millions of immigrants and do the necessary profiling to find them? \n“Clinton has the opportunity to tell the business community what a reformed legal immigration system means for the economy,” Noorani said. “To law enforcement, how do her reforms to the immigration system keep the nation safe and allow law enforcement to retain trust of the immigrant community that they serve and protect? And to the faith community, how does Clinton’s plan treat them like human beings and allow them to reach their fullest potential?” \nNoorani argued that Trump will struggle to appeal to many outside his base on immigration. “Trump’s immigration plan does not treat immigrants like human beings,” he said. \nA Washington Post analysis after Trump’s not-actually-a-pivot illegal immigration speech in Phoenix, found that his plan would put 5 to 6.5 million immigrants at risk of deportation. Todd Schulte, executive director of Mark Zuckerberg’s immigration advocacy group FWD.us, said that his organization sees 6 million as the absolute minimum in danger of removal under Trump’s plan and believes it is more in the range of 6 to 9 million. Citing polling that shows many independents and Republicans favor immigration fixes short of mass deportation, Schulte said Clinton should unapologetically lean into the issue at the debate. \n“She should go on the offense,” Schulte said. “She shouldn’t be shy in laying out that she has a clear vision on this issue.” He added that many Americans just want someone to ultimately fix this problem and said her pledge to introduce immigration in the first 100 days of her presidency is something independent voters can get behind as well as the jaded, cautious activists rolling their eyes and saying they’ve heard promises before. “Obama’s approach of more deportations will lead us to reform, didn’t work for him, and it won’t work for her.” ID: 9659937 \nCristina Jimenez, co-founder of United We Dream, is one such activist who has hit the Obama administration for deportations and wants Clinton to clearly articulate that she will make a clean break from Obama’s enforcement policy. “Obama’s approach of more deportations will lead us to reform, didn’t work for him, and it won’t work for her,” Jimenez said. \nJimenez said the debate will be an opportunity for the Latino and immigrant communities to confront Trump’s deportation doctrine. \n“We have seen he has committed to ending [Obama’s executive] DACA program. My brother would be deported, my parents, nearly everyone in United We Dream,” she said. “It contextualizes our work.” \nBut Daniel Garza, who leads the conservative LIBRE Initiative, said that while he has opposed Trump’s immigration plans from day one, he doesn’t believe Clinton has successfully made the case that she can bring together consensus on what would still be a perilous post-election minefield. \nHe said Clinton has shown “contempt and derision” in opposing driver’s licenses for undocumented immigrants in the 2008 race and in 2014 when she said most unaccompanied children crossing the border from Central America should ultimately be sent back. Now, he says, she promises “immigration reform” and going beyond Obama administratively, which he argued doesn’t help efforts for consensus. \n“What I want to hear from Hillary Clinton is that bipartisanship to reach consensus is the only positive way,” he said. “Don’t give me platitudes, don’t give me empty rhetoric, give me something pragmatic and achievable.” \nStill, Garza said everyone is endowed with unalienable rights —“those rights extend to the immigrant”— and he hopes Trump will evolve on immigration, which he argued Trump has shown signs of, tempering his rhetoric and policies. \n“What gives me hope on Donald Trump is I know he’s by instinct a negotiator,” Garza said. “To arrive at the deal he knows he has to give, at some point can he meet people in the middle? Will we get it? I have no idea.” “Clinton is the radical on immigration.” ID: 9659960 \nAJ Delgado, the firebrand Latina commentator who has supported Trump from day one before recently joining the campaign as a senior adviser, bristled at the idea that Trump has to change in large-scale ways, and said current events will once again drive his remarks on immigration at the debate. \n“I expect Mr. Trump is going to highlight that immigration, especially with recent events, is a matter of national security,” she said referring to the bombs planted in New York and New Jersey this past weekend by a man inspired by terrorists. “I think that message, which is objectively an accurate message, is going to resonate with voters outside his base.” \nLike Garza, Delgado said Clinton should have to answer for flip flopping on immigration at the debate, and said Clinton is the radical on immigration, not Trump. \n“How do you square that with a policy, now when you check her website, that is the most pro-illegal immigrant platform of any presidential candidate that I have read in modern history?” \nMany Latino leaders view immigration as one of the most crucial parts of Monday’s debate, but there is concern that the lack of a Hispanic moderator at any debate will stifle the substantive conversation needed on the issue. “[Mass deportations] that is the argument of a child and fear-mongering at its worst.” ID: 9659982 \nJavier Palomarez, president of the U.S. Hispanic Chamber of Commerce said a Latino moderator was even more important during this election. \n“One of two candidates on that stage began his political career by insulting Mexicans,” he said. “This notion that you’re going to mass deport 11.5 million people, 9 million of whom are employed, not only is irresponsible, it’s ridiculous. That is the argument of a child and fear mongering at its worst.” \n“Imagine how prepared a Hispanic moderator would have been,” Palomarez continued, “who has lived the reality of immigration reform and understands it?” \nSaying that the debate commission “lacked the courage” to make that decision, he said the current lineup excluding Hispanic journalists will be unlikely to ferret out the best responses on immigration. “It’s unfair to Hispanic viewers and it’s unfair to America.” \nGarza agreed, saying it was up to not only the moderator Lester Holt on Monday, but also to the candidates, who he says have not shown themselves to be particularly astute on immigration. \n“I worry that it will devolve into fingerpointing,” he said. “Donald Trump is going to make the case that will appeal to his base, Clinton will make the point that will appeal to her base, but America is is in the middle, with the consensus being that 12 million people should get legalization to stay here,” short of citizenship. \nSchulte said immigration sometimes lends itself to what sounds like hyperbole, but Trump’s is “the most hardline position in modern political history,” which has raised the stakes for the first debate. \n“Immigration, more than any other issue, is a referendum on who we are as a nation,” he said. “I hope it gets the time it deserves.” Adrian Carrasquillo is a political reporter for BuzzFeed News and is based in New York. Contact Adrian Carrasquillo at .", "external_links": [], "published": "2016-09-22T03:51:00.000+03:00", "crawled": "2016-09-22T00:30:32.622+03:00", "highlightTitle": ""}