{"organizations": [], "uuid": "64ff98814f9184653f7145800931cbd8cb5ed985", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 39, "shares": 39, "comments": 40}, "stumbledupon": {"shares": 0}}, "site_full": "www.buzzfeed.com", "main_image": "https://img.buzzfeed.com/buzzfeed-static/static/2016-09/1/0/campaign_images/buzzfeed-prod-web12/trump-fans-breathe-sigh-of-relief-hes-not-pivotin-2-30831-1472703782-0_dblbig.jpg", "site_section": "http://www.buzzfeed.com/politics.xml", "section_title": "BuzzFeed - Politics", "url": "https://www.buzzfeed.com/adriancarrasquillo/trump-fans-breathe-sigh-of-relief-hes-not-pivoting-from-toug", "country": "US", "domain_rank": 137, "title": "Trump Fans Breathe Sigh Of Relief: He's Not Pivoting From Tough Immigration Talk", "performance_score": 0, "site": "buzzfeed.com", "participants_count": 1, "title_full": "Trump Fans Breathe Sigh Of Relief: He's Not Pivoting From Tough Immigration Talk", "spam_score": 0.0, "site_type": "news", "published": "2016-09-01T12:23:00.000+03:00", "replies_count": 0, "uuid": "64ff98814f9184653f7145800931cbd8cb5ed985"}, "author": "Adrian Carrasquillo", "url": "https://www.buzzfeed.com/adriancarrasquillo/trump-fans-breathe-sigh-of-relief-hes-not-pivoting-from-toug", "ord_in_thread": 0, "title": "Trump Fans Breathe Sigh Of Relief: He's Not Pivoting From Tough Immigration Talk", "locations": [], "entities": {"persons": [{"name": "ross d. franklin", "sentiment": "negative"}, {"name": "walters", "sentiment": "none"}, {"name": "bernie sanders", "sentiment": "none"}, {"name": "patrick blair", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "carol walters", "sentiment": "none"}, {"name": "romney", "sentiment": "none"}, {"name": "gary johnson", "sentiment": "none"}, {"name": "obama", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "blair", "sentiment": "none"}, {"name": "ron paul", "sentiment": "none"}, {"name": "sean hannity", "sentiment": "none"}, {"name": "martinez", "sentiment": "none"}, {"name": "michael toppeta", "sentiment": "none"}, {"name": "adrian carrasquillo", "sentiment": "none"}, {"name": "willie martinez", "sentiment": "none"}, {"name": "enrique peña nieto", "sentiment": "none"}, {"name": "mccain", "sentiment": "none"}], "locations": [{"name": "phoenix", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "west phoenix", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}, {"name": "arizona", "sentiment": "none"}, {"name": "chicago", "sentiment": "none"}, {"name": "phoenix convention center", "sentiment": "none"}], "organizations": [{"name": "fox news", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "buzzfeed news", "sentiment": "none"}, {"name": "supreme court", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Ross D. Franklin / AP ID: 9545067 \nPHOENIX — Talk of a humane appoach, or a “softening” on immigration by Donald Trump, gave way to his trademark tough talk of building a wall and rounding up “criminal aliens” during an immigration policy speech Wednesday at the Phoenix Convention Center, ending an 11-day trial balloon by his campaign. \nEarlier in the day, Trump visited Mexico at the invitation of its president, Enrique Peña Nieto. Afterward, the Mexican leader said that he told Trump his country would not pay for a wall along the border as he has said Mexico would, after Trump saying the issue didn’t come up. \nFor Trump’s raucous fans in the crowd, the Mexico trip was wonderful, showcasing the statesman side of the Republican nominee. But they were ecstatic that instead of pivoting on immigration, he completed a 360 back to his original position. \n“When he first started last year he was foot in the sand, we need to go at these issues as hard as possible,” said Patrick Blair, a Trump supporter, who develops surgery centers. “At the town hall with [Fox News’ Sean Hannity] he was talking about softening, so I thought he would back off 10%, but he did not and I’m happy with what he came out with, a lot of details, he had 10 points — it was more than I thought he would have.” \nFor most of Trump’s supporters like Blair, they came for the wall, and they got what they wanted, along with a plan to triple the number of ICE deportation agents. Trump even called them a “deportation task force” for those who have evaded justice —“like Hillary Clinton,” he said. \nTrump also said he would end the so-called “catch and release” of undocumented immigrants and have zero tolerance for “criminal aliens” whom he would begin deporting on day one. He did not specify how that policy would differ from that of the Obama administration, which has prioritized the removal of criminals. Just last week, as Trump openly pondered an immigration pivot before ultimately abandoning it, he noted that Obama had deported a record number of immigrants. \nBut the lingering questions didn’t bother his supporters much, even some who differ with him on his trademark policy proposal. \n“He really doubled down tonight,” said Michael Toppeta, who works in information technology, voted for Gary Johnson in 2012 and has supported Ron Paul in the past. “Even though I don’t agree with the wall, it’s not unreasonable,” he said, adding that defending the Second Amendment and protecting the conservative balance of the Supreme Court are two big reasons he supports Trump. \nCarol Walters, who came from Chicago and has lived in Arizona for 14 years, wasn’t in the middle of the crowd. She sat in a wheelchair toward the back, but she loved what she heard and said the wall is necessary because the United States is being flooded with undocumented immigrants. \n“They’re on welfare, food stamps, all the freebies, who’s paying for that? You and I,” she said. Leaning in, she said when undocumented immigrants go to the emergency room, they should pay some of the bill. “They should at least have some of it,” she said. \n“After what he did in Mexico I’m very happy. I thought it was the best performance. It was presidential two men with opposite backgrounds discussing issues — I thought he was very professional about it,” Walters added. \nBlair, like Walters, has developed a harder edge to his political views. He voted for McCain in 2008 and Romney in 2012, but laughed when he said he was one of the ones in the crowd who mercilessly booed when McCain’s name was mentioned as a primary winner Tuesday by a Trump warm-up act. \nThe Mexico trip was a pleasant surprise, Blair said. \n“People in Mexico weren’t happy with what he said and the healing has to start sometime, he put an olive branch out,” Blair said kindly, of the reaction to Trump’s comments that Mexico sends criminals and rapists across the border. \nBut then added, “Mexico is our friend, we don’t want a third-world enemy at our Southern border.” \nIt was the kind of talk Willie Martinez, 25, standing out as one of the few Hispanics at the back of the room, had to hear for himself. \nThe West Phoenix native went to a high school that was 93% Latino, and he was a former Bernie Sanders supporter before turning to Hillary Clinton now. He came to the rally because he wanted to see if the media was fairly painting Trump’s statements or just cutting them up into sound bites. \nThe media — a constant target of Trump, his campaign, and his supporters (who yelled “do your job!” Wednesday night) — gained one fan in Martinez. \n“For the most part the media is pretty much right,” he said after the rally, as satisfied Trump supporters walked past him. “He’s just as crazy as people are saying he is.” Adrian Carrasquillo is a political reporter for BuzzFeed News and is based in New York. Contact Adrian Carrasquillo at .", "external_links": [], "published": "2016-09-01T12:23:00.000+03:00", "crawled": "2016-09-01T17:06:44.433+03:00", "highlightTitle": ""}