{"organizations": [], "uuid": "f4eff57d089339ca69675e455c5588397ae5253b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.foxnews.com", "main_image": "http://www.foxnews.com/content/dam/fox-news/logo/og-fn-foxnews.jpg", "site_section": "http://www.foxnews.com/xmlfeed/rss/0,4313,2,00.rss", "section_title": "FOX News", "url": "http://www.foxnews.com/politics/2016/09/22/email-shows-federal-immigration-bosses-in-ot-push-to-swear-in-new-citizens-due-to-election.html", "country": "US", "domain_rank": 185, "title": "Email shows federal immigration bosses in OT push to swear in new citizens 'due to election' | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "Email shows federal immigration bosses in OT push to swear in new citizens 'due to election' | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2016-09-22T03:00:00.000+03:00", "replies_count": 0, "uuid": "f4eff57d089339ca69675e455c5588397ae5253b"}, "author": "FoxNews.com", "url": "http://www.foxnews.com/politics/2016/09/22/email-shows-federal-immigration-bosses-in-ot-push-to-swear-in-new-citizens-due-to-election.html", "ord_in_thread": 0, "title": "Email shows federal immigration bosses in OT push to swear in new citizens 'due to election' | Fox News", "locations": [], "entities": {"persons": [{"name": "malia zimmerman", "sentiment": "negative"}, {"name": "email pri", "sentiment": "negative"}, {"name": "vaughan", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "stein", "sentiment": "none"}, {"name": "dan stein", "sentiment": "none"}, {"name": "jeh johnson", "sentiment": "none"}, {"name": "bill clinton", "sentiment": "none"}, {"name": "ron johnson", "sentiment": "none"}, {"name": "obama", "sentiment": "none"}, {"name": "charles grassley", "sentiment": "none"}, {"name": "clinton", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "johnson", "sentiment": "none"}, {"name": "claude arnold", "sentiment": "none"}, {"name": "arnold", "sentiment": "none"}, {"name": "jessica vaughan", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "r-iowa", "sentiment": "none"}, {"name": "houston", "sentiment": "none"}, {"name": "r-wis.", "sentiment": "none"}], "organizations": [{"name": "foxnews.com facebook", "sentiment": "negative"}, {"name": "twitter", "sentiment": "negative"}, {"name": "houston field office district 17", "sentiment": "none"}, {"name": "u.s. citizenship and immigration services", "sentiment": "none"}, {"name": "committee on homeland security", "sentiment": "none"}, {"name": "federation for american immigration reform", "sentiment": "none"}, {"name": "congress", "sentiment": "none"}, {"name": "gop", "sentiment": "none"}, {"name": "customs enforcement", "sentiment": "none"}, {"name": "homeland security investigations", "sentiment": "none"}, {"name": "department of homeland security", "sentiment": "none"}, {"name": "dhs", "sentiment": "none"}, {"name": "uscis", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Malia Zimmerman \nPublished September 22, 2016 FoxNews.com Facebook 0 Twitter 0 livefyre Email Print   \nAn internal Obama administration email shows immigration officials may be literally working overtime to swear in as many new “citizen voters” as possible before the Nov. 8 presidential election, a powerful lawmaker charged Thursday.\nThe email, from a U.S. Citizenship and Immigration Services field office chief and part of a chain of correspondence within the agency, urges the unnamed recipient to swear in as many citizens as possible “due to the election year.”\n“The Field Office due to the election year needs to process as many of their N-400 cases as possible between now and FY 2016,” reads the email, which was disclosed to FoxNews.com by Sen. Ron Johnson, R-Wis., who chairs the Committee on Homeland Security and Governmental Affairs.\n“If you have cases in this category or other pending, you are encouraged to take advantage of the OT if you can,” the email continues. “This will be an opportunity to move your pending naturalization cases. If you have not volunteered for OT, please consider and let me know if you are interested.”\nParts of the email were redacted before it was disclosed to FoxNews.com, but it was sent by the branch chief of the Houston Field Office District 17. It was not clear to whom it was addressed.\n“I couldn’t have said it better!” reads the July 21 note introducing the forwarded missive. “It’s the end of the year crunch time, so let’s get crunchy! Go Team Houston! Thanks for all your hard work!”\n2016 Election Headquarters The latest headlines on the 2016 elections from the biggest name in politics. See Latest Coverage → \nJohnson and Sen. Charles Grassley, R-Iowa, in a Wednesday letter to Department of Homeland Security Secretary Jeh Johnson, said it appears the agency is trying to swear in new citizens as the election between Democrat nominee Hillary Clinton and GOP choice Donald Trump approaches.\n“Your department seems intent on approving as many naturalization cases as quickly as possible at a time when it should instead be putting on the brakes and reviewing past adjudications,” the senator’s letter read.\nJohnson referred to a report this week from the Department of Homeland Security’s Inspector General that found at least 858 people from terror hotspots and other countries of concern had been mistakenly granted citizenship despite facing orders of deportation under other identities.\n\"Considering that USCIS already has a troubling record of inadequate review of naturalization applications, and mistakenly giving away citizenship to terrorists, criminals and other fraudsters, it is disturbing that they are now in full and blind rubber stamp mode to crank out new citizens,\" said Jessica Vaughan, director of Policy Studies for the Center for Immigration Studies.\nIn a USCIS planning document submitted to Congress earlier this year, USCIS reported it expected to receive 828,000 total applications this year, up from a planned 815,000 last year, an increase of 13,000, Vaughan said. \nA DHS official did not immediately offer comment on the matter.\nThe effort is reminiscent of a similar bid to bring in new voters when Bill Clinton ran for re-election in 1996, said Claude Arnold, a retired U.S. Immigration and Customs Enforcement special agent in charge of Homeland Security Investigations.\n\"I am not at all surprised by this revelation,\" Arnold said. \"This is a repeat of the Clinton election playbook. Then it was to help re-elect Bill Clinton, this time it is to help elect Hillary Clinton.\"\nThe all-out push shows the Obama administration is using levers to help Clinton win, said Dan Stein, president of Federation for American Immigration Reform.\n\"In the pursuit of a partisan advantage, one party has decided integrity in the system is irrelevant,\" Stein said. \"They don’t really care about checking backgrounds or verifying status and eligibility – it is more about increasing the number of eligible voters in the upcoming election.\"", "external_links": [], "published": "2016-09-22T03:00:00.000+03:00", "crawled": "2016-09-23T00:36:28.347+03:00", "highlightTitle": ""}