{"organizations": [], "uuid": "0358666e1b2d61cffb9d4209400dee5758f5e494", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 152, "shares": 152, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/FNL/Politics/0/0/Trump%20Ohio%20Latino.jpg", "site_section": "http://feeds.latino.foxnews.com/home/feed", "section_title": "FOX News", "url": "http://latino.foxnews.com/latino/politics/2016/09/01/trump-latino-surrogates-and-backers-withdraw-support-following-immigration/", "country": "US", "domain_rank": 185, "title": "Trump Latino surrogates and backers withdraw support following immigration speech", "performance_score": 1, "site": "foxnews.com", "participants_count": 1, "title_full": "Trump Latino surrogates and backers withdraw support following immigration speech | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2016-09-01T03:00:00.000+03:00", "replies_count": 0, "uuid": "0358666e1b2d61cffb9d4209400dee5758f5e494"}, "author": "Fox News Latino", "url": "http://latino.foxnews.com/latino/politics/2016/09/01/trump-latino-surrogates-and-backers-withdraw-support-following-immigration/", "ord_in_thread": 0, "title": "Trump Latino surrogates and backers withdraw support following immigration speech", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "negative"}, {"name": "jeb bush", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "jacob monty", "sentiment": "none"}, {"name": "george w. bush", "sentiment": "none"}, {"name": "helen aguirre ferré", "sentiment": "none"}, {"name": "daniel garza", "sentiment": "none"}, {"name": "fernandez", "sentiment": "none"}, {"name": "pena", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "mike fernandez", "sentiment": "none"}, {"name": "koch", "sentiment": "none"}, {"name": "aguilar", "sentiment": "none"}, {"name": "ramiro pena", "sentiment": "none"}, {"name": "leslie sanchez", "sentiment": "none"}, {"name": "peña nieto", "sentiment": "none"}, {"name": "alfonso aguilar", "sentiment": "none"}, {"name": "monty", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}], "organizations": [{"name": "fox news latino republican", "sentiment": "negative"}, {"name": "fox news latino", "sentiment": "none"}, {"name": "fox news", "sentiment": "none"}, {"name": "trump’s national hispanic advisory council", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "rnc", "sentiment": "none"}, {"name": "gop", "sentiment": "none"}, {"name": "politico", "sentiment": "none"}, {"name": "the libre initiative", "sentiment": "none"}, {"name": "republican national committee", "sentiment": "none"}, {"name": "miami herald", "sentiment": "none"}, {"name": "facebook  follow us on twitter & instagram", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "  Fox News Latino Republican presidential nominee Donald Trump AP \nMany of them stood firm, at least in public, in their support for Donald Trump, despite criticism from other Latinos who called them sellouts, or worse.\nMany responded that Trump was sure to soften his stance on immigration, and back off remarks he had made since he launched his campaign in 2015 that drew the ire of a vast number of Latinos, if polls were any indication.\nBut Trump’s 90-minute speech Wednesday night offering more details than he had previously shared on his plan to reform the immigration system made some of his most high-profile Latino supporters and surrogates recoil — some already have dropped their support or indicated that they are considering doing so.\nJacob Monty, one of the nearly two dozen members of Trump’s National Hispanic Advisory Council, resigned immediately after the speech, according to Politico . Monty had been an ardent defender of Trump.\nA few other members of the council also indicated they were considering dropping out, saying they felt misled and played. \n“I was a strong supporter of Donald Trump when I believed he was going to address the immigration problem realistically and compassionately,” said Monty, as quoted by Politico. \"What I heard today was not realistic and not compassionate.”\n“When we met [earlier in August] he was going to approach this issue with a realistic plan, a compassionate plan, with a plan that was not disruptive to the immigrants that were here that were not lawbreakers,” said Monty, who was among Latino leaders who attended a meeting with Trump in New York to discuss immigration. “He didn’t deliver any of that.”\nGOP analyst Leslie Sanchez, who served in the George W. Bush administration, tweeted: \"Hispanic leader who advises Trump camp telling me half of Trump's Hispanic advisory board is ready to resign today.\"\nMike Fernandez, a longtime major Republican donor, formally endorsed Democratic nominee Hillary Clinton on Thursday, indicating in a Miami Herald op-ed that Trump’s speech was the final straw.\n“No longer can we seek solace in wishful thinking or the illusion that this is just an election cycle and that by divine intervention all will be better after we vote,” wrote Fernandez, who had supported former Florida Gov. Jeb Bush in the GOP presidential primaries. “There is no basis in thinking that our democracy is so strong, our checks and balances so finely hedged, that no single person can lead us off the precipice. Trump can.”\n“Donald Trump is neither representative of our values nor qualified to lead the nation,” Fernandez said.\nLatino outreach officials for the Republican National Committee set out to put a positive light on Trump's stern rhetoric, saying it reflects his transparency and decision not to compromise his views.\n“[Donald Trump] is not politically correct,\" said Helen Aguirre Ferré, RNC's Latino outreach director, on the Fox News show \"On the Record.\" \"He is not going to follow the traditional path of how to do an election.\"\n\"Hillary Clinton is probably still talking to her advisors as to whether to accept the invitation from President Peña Nieto or not and Donald Trump does what he does well, which is move with instinct; he works with intellect and he saw an opportunity and he took it.”\nBut Ramiro Pena, another member of Trump’s National Hispanic Advisory Council, doesn't see it that way.\nPena, a Texas pastor, likened continuing to support the GOP nominee to being part of a \"scam.\"\nPena, who said the speech had put the final nail in the coffin for Trump’s chances of winning in November, said he was debating whether to remain on the council.\nAlfonso Aguilar, the president of the Latino Partnership for Conservative Principles and a former George W. Bush administration official who had backed Jeb Bush in the primaries, pulled his support from Trump on Thursday.  \n“It’s so disappointing because we feel we took a chance, a very risky chance,” Politico quoted Aguilar as saying. “We decided to make a big U-turn to see if we could make him change. We thought we were moving in the right direction … we’re disappointed. We feel misled.\n“Did you hear anything in that speech that was compassionate and humane? No.”\nSome others who had been taking a wait-and-see approach to Trump expressed frustration.\nDaniel Garza, executive director of The Libre Initiative, said to Fox News Latino: “Trump lost an opportunity to show Latinos – who are looking for a president who will bring both sides together in order to strengthen our economy, induce family cohesion and strengthen security – that he is the candidate who can achieve real reform.”\nThe Libre Initiative is partially funded by the billionaire Koch brothers, who traditionally back Republicans. \n“But what we got was a one-dimensional, enforcement-only policy that will only assure the status-quo continues because this plan will not produce bipartisan support.”\nLike us on Facebook \nFollow us on Twitter & Instagram", "external_links": [], "published": "2016-09-01T03:00:00.000+03:00", "crawled": "2016-09-01T23:05:49.659+03:00", "highlightTitle": ""}