{"organizations": [], "uuid": "87657d7c37750905811dd333d2d3ce1ed992dc2a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/694940094001_5138760203001_5138738250001-vs.jpg", "site_section": "http://www.foxnews.com/yourworld/", "section_title": "Your World with Neil Cavuto | Fox News", "url": "http://www.foxnews.com/transcript/2016/09/23/sen-sessions-on-cruz-endorsement-immigration-gaffes/", "country": "IT", "domain_rank": 185, "title": "Sen. Sessions on Cruz endorsement, immigration gaffes", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "Sen. Sessions on Cruz endorsement, immigration gaffes | Fox News", "spam_score": 0.005, "site_type": "news", "published": "2016-09-23T03:00:00.000+03:00", "replies_count": 0, "uuid": "87657d7c37750905811dd333d2d3ce1ed992dc2a"}, "author": "FoxNews.com", "url": "http://www.foxnews.com/transcript/2016/09/23/sen-sessions-on-cruz-endorsement-immigration-gaffes/", "ord_in_thread": 0, "title": "Sen. Sessions on Cruz endorsement, immigration gaffes", "locations": [], "entities": {"persons": [{"name": "cruz", "sentiment": "negative"}, {"name": "grassley", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "jeff sessions", "sentiment": "none"}, {"name": "romney", "sentiment": "none"}, {"name": "william buckley", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "ted cruz", "sentiment": "none"}, {"name": "ted", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "neil cavuto", "sentiment": "none"}, {"name": "cavuto", "sentiment": "none"}, {"name": "meg whitman", "sentiment": "none"}, {"name": "neil", "sentiment": "none"}, {"name": "jeff sessions", "sentiment": "none"}], "locations": [{"name": "united states", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}, {"name": "alabama", "sentiment": "none"}], "organizations": [{"name": "llc", "sentiment": "none"}, {"name": "department of justice", "sentiment": "none"}, {"name": "republican", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "republican party", "sentiment": "none"}, {"name": "irs", "sentiment": "none"}, {"name": "fox news network", "sentiment": "none"}, {"name": "tea party", "sentiment": "none"}, {"name": "inc", "sentiment": "none"}, {"name": "mitt romneys", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Published September 23,\nThis is a rush transcript from \"Your World,\" September 23, 2016. This copy may not be in its final form and may be updated.\nDONALD TRUMP, R-PRESIDENTIAL CANDIDATE: And, you know, he will come and endorse over the next little while. He will come and endorse, because he has no choice. But I don`t want his endorsement. What difference does it make? I don`t want his endorsement.\nI have such great -- I don`t want his endorsement. Just, Ted, stay home, relax, enjoy yourself.\n(LAUGHTER)\n(END VIDEO CLIP)\nNEIL CAVUTO, HOST: All right, that was then, Donald Trump very angry at Ted Cruz in a prime-time speech at the Republican Convention not endorsing him, telling a lot of folks, vote their conscience.\nThat got a lot of folks upset in and outside the Republican Party. But that changed today with this simple Facebook message from the Texas senator: \"After many months of special consideration, prayer and searching my own conscience, I decided that, on Election Day, I will vote for Republican nominee Donald Trump.\"\nAlabama Republican Senator Jeff Sessions, a member of Donald Trump`s foreign team, here to react to that, other developments.\nSenator, good to have you.\nWhat do you think of what Senator Cruz just did?\nSEN. JEFF SESSIONS, R-ALABAMA: Oh, to good news. It`s real good news.\nThat was a bitter, tough battle. There were some titans that went at each other hard. Ted Cruz was the last one standing, and Donald Trump finally won in the end with a pretty decisive margin. But I think it`s good for him and I think it`s good for Donald Trump that they have moved past that.\nCAVUTO: Well, what changed, Senator? Do you know? Do you know what changed?\nSESSIONS: Well, time. You know, Neil, some of this is personal, and you just have to think it through.\nBut, look, the William Buckley slogan, you should select and vote for the most conservative candidate who has a chance to be elected. And it`s Hillary Clinton and it`s Donald Trump. And there`s just no doubt about it.\nSo, a good conservative like Ted, I`m not surprised that he comes through and supports Trump at this time.\nCAVUTO: I`m wondering whether right now the party is coalescing around Trump, and even with the exception of the Mitt Romneys, and a couple of others, Meg Whitman out in California, most of those who were resisting Trump are now not. What do you think is going on?\nSESSIONS: Well, I think people are dealing with the reality of who the best candidate is, who will advance the policies and agenda and beliefs that we have fought for as Republicans for so many years.\nThe polling data does show that Republicans are at very high percentages of now supporting Trump. And I think that`s a very good trend. And if it continues at this rate, he will be at least as high as Romney had, which is good news, indeed, and puts him in a position to win the election.\nCAVUTO: Senator, all of this happens on the same day we`re getting more information on this DHS memo that went out about speeding up the application process for a number of largely Latin American aliens to become citizens of the United States, without necessarily having their paperwork all in order, and that there were e-mails back and forth to rush it by Election Day.\nWhat do you make of this and how it`s been handled?\nSESSIONS: Well, one former administration official said they have been doing this for years.\nIt`s not appropriate. You should not use the power, taxpayer money to advance a registration process that could be seen to favor one side or the other.\nPeople -- so, I think this was bad news. Senator Grassley and I have written the Department of Justice to make inquiries about this. It`s not appropriate, should not happen. And it may should be that when we find out more about it, some disciplinary action should be taken for those who participated in it.\nCAVUTO: It`s odd. There was a rush to get this done, but when it came to conservative groups trying to get tax-exempt status, that -- there was no particular rush at the IRS for that. What do you make of that?\nSESSIONS: This is -- really is bad.\nNeil, I was in the Department of Justice for almost 15 years. The people I knew took real pride in working to make sure that we were even- handed on these matters. And delaying something is wrong. The IRS has to be independent, as much as any agency of the government has to be independent.\nClearly, they delayed these approvals for the tax-exempt Tea Party groups. That should never have happened. And that brouhaha over it was not over nothing. It was a very serious abuse of power.\nCAVUTO: All right, Senator, thank you very, very much. Good chatting with you again.\nSESSIONS: Thank you.\nCAVUTO: All right.\nEND\nContent and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.", "external_links": [], "published": "2016-09-23T03:00:00.000+03:00", "crawled": "2016-09-25T00:17:07.791+03:00", "highlightTitle": ""}