{"organizations": [], "uuid": "d115e3fee399416166ac7a8f8b4187ecae2dc03a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 6, "shares": 6, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "latino.foxnews.com", "main_image": "http://global.fncstatic.com/static/v/all/img/fn_latino_128x128.png", "site_section": "http://feeds.latino.foxnews.com/home/feed", "section_title": "FOX News", "url": "http://latino.foxnews.com/latino/politics/2016/09/16/obama-and-clinton-hit-out-at-trump-intolerance-during-hispanic-gala/", "country": "US", "domain_rank": 185, "title": "Obama and Clinton hit out at Trump's intolerance during Hispanic gala | Fox News Latino", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "Obama and Clinton hit out at Trump's intolerance during Hispanic gala | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2016-09-16T03:00:00.000+03:00", "replies_count": 0, "uuid": "d115e3fee399416166ac7a8f8b4187ecae2dc03a"}, "author": "EFE", "url": "http://latino.foxnews.com/latino/politics/2016/09/16/obama-and-clinton-hit-out-at-trump-intolerance-during-hispanic-gala/", "ord_in_thread": 0, "title": "Obama and Clinton hit out at Trump's intolerance during Hispanic gala | Fox News Latino", "locations": [], "entities": {"persons": [{"name": "clinton", "sentiment": "negative"}, {"name": "obama", "sentiment": "negative"}, {"name": "barack obama", "sentiment": "negative"}, {"name": "trump", "sentiment": "negative"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}], "locations": [{"name": "us", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "cuba", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "hawaii", "sentiment": "none"}], "organizations": [{"name": "efe", "sentiment": "negative"}, {"name": "state", "sentiment": "none"}, {"name": "congress", "sentiment": "none"}, {"name": "washington post", "sentiment": "none"}, {"name": "congressional hispanic caucus institute", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Published September 16, 2016 EFE Washington –   US President Barack Obama and 2016 Democrat presidential candidate Hillary Clinton Thursday hit out against Republican candidate Donald Trump's \"intolerance\", during the annual gala of the Congressional Hispanic Caucus Institute (CHCI).\nBoth Obama and Clinton attacked the \"divisive and hostile\" rhetoric of the real estate tycoon at the forum, which celebrates the beginning of the Hispanic Heritage Month on Thursday, and honors the contributions of Latinos to the country.\nAmidst cheers and applause, Obama said \"immigrants are not changing the American character, but are the American character\", and reiterated the need to fight against Trump's intolerant rhetoric and politics of hate.\n\"(You) came here for the same reason that all immigrants came here, to work and learn and build a better life (...) But who is going to decide who the real America is? Who is to determine that in this nation of immigrants, a nation where unless you're a native American, you came here from some place else,\" Obama said.\nAmid shouts of \"Yes we can\" and \"We love you\", Obama also reviewed the achievements of his eight years as head of government, from legalizing gay marriage, resumption of bilateral ties with Cuba, and pulling the US economy out of the crisis of 2008.\nObama also insisted the benefits of this economic recovery must reach everyone and rejected the anti-immigrant rhetoric deployed by Trump, without actually naming him.\nLater, when Clinton took the stage, visibly recovered from the pneumonia that kept her away from the campaign for three days, she also slammed the billionaire for not recognizing, hours earlier, in an interview with The Washington Post that Obama was born on US soil.\n\"He was asked one more time where was President Obama born, and he still wouldn't say Hawaii. He still wouldn't say America,\" the presidential candidate said.\nThe former Secretary of State emphasized the differences in their policies towards the Latino community and insisted that during the November elections, this minority group will be crucial against the \"dangerous\" rhetoric of the tycoon.\nThe Democrat candidate also stressed the adoption of comprehensive immigration reform, a pending electoral promise of the young Senator Barack Obama in 2008.\n\"In (the) first 100 days, I will send a proposal for comprehensive immigration reform to the Congress (...) and it will include a path to citizenship,\" promised Clinton, and reiterated she will expand the immigration measures adopted by President Obama to end deportations.\n\"No child should have to say goodbye to their parents every morning, unsure if their mom or dad will be there when they get back home,\" added the former Secretary, referring to families, who are broken apart because of the deportations.", "external_links": [], "published": "2016-09-16T03:00:00.000+03:00", "crawled": "2016-09-16T10:26:03.140+03:00", "highlightTitle": ""}