{"organizations": [], "uuid": "ff85e2f81393b23feecb71efa1abc1069a9b90fd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "latino.foxnews.com", "main_image": "http://global.fncstatic.com/static/v/all/img/fn_latino_128x128.png", "site_section": "http://feeds.latino.foxnews.com/home/feed", "section_title": "FOX News", "url": "http://latino.foxnews.com/latino/politics/2016/09/20/obama-at-un-calls-for-true-democracies-global-cooperation/", "country": "US", "domain_rank": 185, "title": "Obama at U.N. calls for true democracies, global cooperation", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "Obama at U.N. calls for true democracies, global cooperation | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2016-09-20T03:00:00.000+03:00", "replies_count": 0, "uuid": "ff85e2f81393b23feecb71efa1abc1069a9b90fd"}, "author": "EFE", "url": "http://latino.foxnews.com/latino/politics/2016/09/20/obama-at-un-calls-for-true-democracies-global-cooperation/", "ord_in_thread": 0, "title": "Obama at U.N. calls for true democracies, global cooperation", "locations": [], "entities": {"persons": [{"name": "united nati", "sentiment": "negative"}, {"name": "obama", "sentiment": "negative"}, {"name": "barack obama", "sentiment": "negative"}, {"name": "trump", "sentiment": "none"}, {"name": "putin", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "zika", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "iran", "sentiment": "none"}, {"name": "cuba", "sentiment": "none"}, {"name": "syria", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}, {"name": "colombia", "sentiment": "none"}], "organizations": [{"name": "united nations", "sentiment": "negative"}, {"name": "u.n.", "sentiment": "negative"}, {"name": "general assembly", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "  United Nations –   U.S. President Barack Obama used his eighth and last address to the United Nations General Assembly to give a speech that was more philosophical than political, and in which he prescribed as a solution to the current crises more global cooperation and true democracy everywhere to counter the upsurge of populism.\n\"We must reject any forms of fundamentalism, or racism, or a belief in ethnic superiority that makes our traditional identities irreconcilable with modernity,\" Obama said.\n\"Instead we need to embrace the tolerance that results from respect of all human beings,\" he said.\nObama defended the need to develop and strengthen \"true democracy\" in every corner of the world, against the authoritarian models led by \"strongmen,\" an indirect reference to the Republican candidate for the White House, Donald Trump, but also included leaders like Russia's President Putin.\n\"Today, a nation ringed by walls would only imprison itself,\" Obama added in a veiled criticism of Trump and his isolationist inclinations.\nFaced with today's challenges, Obama said he wasn't surprised that some see, in his opinion mistakenly, the solution in authoritarian models rather than \"models of governance that are inclusive\" and that respect the rule of law and human rights.\nBut just as he did eight years ago in his first speech to the General Assembly, the president on Tuesday called for multilateralism and integration, urging the world to choose \"a better model of cooperation and integration\" rather than \"retreat into a world sharply divided.\"\n\"We must go forward, and not backward,\" Obama said in mentioning among the achievements during his almost eight years in office the improvement of the international economy, the thaw in relations with Cuba, the peace accord in Colombia, the nuclear pact with Iran and the Paris accord on climate change.\nTo deal with the current challenges, among which he mentioned nuclear non-proliferation, fighting illnesses like Zika and the refugee crisis, every country must do more, Obama said.\nIn his opinion, this will be a safer world if refugees receive the aid they need, and while some countries are doing the right thing in that regard, others are not.\nIn the few direct references he made to other countries in his speech, Obama accused Russia of \"attempting to recover lost glory through force.\"\n\"If Russia continues to interfere in the affairs of its neighbors, it may be popular at home, it may fuel nationalist fervor for a time, but over time it is also going to diminish its stature and make its borders less secure,\" he warned.\nAs for the conflict in Syria, Obama repeated his belief that \"there's no ultimate military victory to be won,\" so that \"we're going to have to pursue the hard work of diplomacy that aims to stop the violence, and deliver aid to those in need.\"", "external_links": [], "published": "2016-09-20T03:00:00.000+03:00", "crawled": "2016-09-21T00:52:02.751+03:00", "highlightTitle": ""}