{"organizations": [], "uuid": "6b79fb2fe747e040e203525f62c302083488467d", "thread": {"social": {"gplus": {"shares": 1}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 145, "shares": 145, "comments": 14}, "stumbledupon": {"shares": 0}}, "site_full": "www.buzzfeed.com", "main_image": "https://img.buzzfeed.com/buzzfeed-static/static/2016-09/28/13/campaign_images/buzzfeed-prod-fastlane01/the-plan-to-save-capitalism-from-donald-trump-2-11077-1475084505-0_dblbig.jpg", "site_section": "http://www.buzzfeed.com/politics.xml", "section_title": "BuzzFeed - Politics", "url": "https://www.buzzfeed.com/bensmith/saving-gop-for-capitalism", "country": "US", "domain_rank": 137, "title": "The Plan To Save Capitalism From Donald Trump", "performance_score": 1, "site": "buzzfeed.com", "participants_count": 1, "title_full": "The Plan To Save Capitalism From Donald Trump", "spam_score": 0.0, "site_type": "news", "published": "2016-09-28T23:04:00.000+03:00", "replies_count": 0, "uuid": "6b79fb2fe747e040e203525f62c302083488467d"}, "author": "Ben Smith", "url": "https://www.buzzfeed.com/bensmith/saving-gop-for-capitalism", "ord_in_thread": 0, "title": "The Plan To Save Capitalism From Donald Trump", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "neutral"}, {"name": "reagan", "sentiment": "none"}, {"name": "ben smith", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "mitt romney", "sentiment": "none"}, {"name": "edward conard", "sentiment": "none"}, {"name": "conard", "sentiment": "none"}, {"name": "paul ryan", "sentiment": "none"}, {"name": "buzzfeed", "sentiment": "none"}, {"name": "meg whitman", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "silicon valley", "sentiment": "none"}, {"name": "utah", "sentiment": "none"}, {"name": "midwest", "sentiment": "none"}, {"name": "park city", "sentiment": "none"}], "organizations": [{"name": "wall street journal", "sentiment": "none"}, {"name": "jacobin", "sentiment": "none"}, {"name": "republican party", "sentiment": "none"}, {"name": "buzzfeed", "sentiment": "none"}, {"name": "democratic party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "video-cdn.buzzfeed.com ID: 9700758 \nAt a private gathering of wealthy Republicans this June, a banker named Edward Conard made a radical proposal: To save capitalism from Donald Trump, American business leaders would need to abandon old allies and make an “odious” new deal with low-wage workers. \n“If advocates of the free enterprise want to regain control of the Republican Party … we need to find middle ground with these workers,” Conard. “The question is: How do we build a coalition with displaced workers like we did with the religious right after Roe vs. Wade, and which we used to lower the marginal tax rate from 70% to 28%?” \nThis is a blunter view of Reagan Republicanism than you usually get from the party faithful. Indeed, your editor at Jacobin might ask you to soften it a bit. But Conard was among friends. Mitt Romney, his former partner, is the host of the E2 summit in Park City, Utah, at which he spoke; Meg Whitman was in the front row; Paul Ryan was waiting to give his own remarks. The question Conard raised —“we might, as leaders of business and advocates of free enterprise, try to affect the political agenda”— felt very pressing. \nThe remarks were also off the record. I heard them because I was a speaker at this year’s gathering, and thus in the uncomfortable position for a reporter of not being able to report what I heard. But Conard likes to shock, and he has a book coming out — The Upside of Inequality — and after putting off an interview, he quietly put the speech on his website earlier this month, where you can watch or read the whole thing . (I’ve posted that striking passage above.) \nConard, clad in a blazer and slacks and the ease that can be a marker of class, spoke from scrawled notes. His solution was — to the audience — hair-raisingly radical in its simplicity. It was a kind of roadmap for one future of the Republican Party, assuming the party (or at least the Wall Street wing of it) survives Trump. His plan requires replacing the religious right in the Republican coalition with the new populists, and mollifying them with new restrictions on trade and immigration — all in exchange for the holy grail of lower marginal tax rates. \nConard’s argument starts with that fruitful relationship with the religious right. Worldly Republicans like the Utah crew have long compromised with religious conservatives many privately view as provincial crackpots, and Conard was describing the collapse of the Reagan coalition. It had been, as he said, remarkably productive: Huge cuts to marginal tax rates in exchange for lip service to a decades-long, failed effort to make abortion illegal. But it had also run its course: The tax rate, he noted, has “gradually grown back to 43% as the demographics of that coalition have eroded.” \nConard argued that capitalism needs new allies, and the new demographic would have to be the working class white voters leading the populist takeover of his party, a condition viewed in Utah with the pain and forbearance with which you talk about a close relative who has cancer. Conard called the disease “Trumpism.” At its heart, he said, was that workers have lost faith in the old Republican argument that closing a factory will, in the end, generate new jobs in other sectors for displaced workers. And Republicans, he said, need to realize that those new jobs won’t come back to the Midwest — they’ll move to Silicon Valley. \nCrucial to any new deal is that it “leaves us … us being advocates of free enterprise, in control of the coalition.” That is to say: That part of the deal is lower marginal tax rates. “Because it doesn’t do us any good to be in the coalition if they are going to destroy free enterprise in the process and turn the Republican Party into what I think the Democratic Party already is,” he said. \nAnd to replace religious conservatives in the Republican coalition with low-wage workers, he warned, would require a new set of “tough, and perhaps even odious compromises.” \nFirst, he said, the government would have to intervene in trade policy to force other countries to spend more of their savings on U.S. exports — a system he calls “balanced trade.” In his new book, he lays out a system of import licenses to enforce this — a system, he admitted when he came by BuzzFeed in New York last week, many of his friends on the right will hate. \nThe second plan is, by the open market standards of the Wall Street Journal and the American business class, even more radical. \n“Unfortunately, I think we have to dial down low-skilled immigration,” he said. “No employer is going to go through the effort to employ hard-to-employ workers unless there’s a shortage of labor, and there’s not going to be a shortage of labor in a world where there is a near infinite supply of labor unless we create it. And, if we do create it, it’s going to put pressure on employers to hire those workers and find jobs for them because they’ll be the only workers left to hire.” \nConard offered one bright lining to compensate: a dramatic increase — in immigration at the very high end. Say, 5 million new engineers and scientists and other groups of workers who are hard to find and expensive to pay. \nConard concluded by translating his proposal into “very easy” political terms. \n“We should try to engineer a large increase in the most capable workers, [in exchange] for what the Democrats want which is a truce on low-skilled immigration”— that is, a deal that lowers immigration in the future while legalizing poeple now here, he said. \nWould this be an acceptable deal to Democrats? It’s not implausible. They speak on behalf of immigrants who are here and their families; they are less accountable to potential lottery winners in other countries. The new tension might be between the top 5% of workers — the microbiologists and engineers in Silicon Valley, who might see their wages fall — Conard acknowledged that was a “concern” for them — if a boost for the venture capitalist employers. But he thinks that immigration could drive an explosion of growth — and the venture capitalists who employ them and want cheaper labor. And nobody weeps for software engineers. \nAnd then — is this how American politics really gets made? Genial bankers’ secret speeches in rooms full of plutocrats? Or is this just a fantasy of the people who used to run the Republican Party? \nConard, for one, isn’t sure. Nor, he told me, is he sure who he’ll vote for in November. Ben Smith is the editor-in-chief of BuzzFeed and is based in New York. Contact Ben Smith at .", "external_links": [], "published": "2016-09-28T23:04:00.000+03:00", "crawled": "2016-09-29T02:40:01.953+03:00", "highlightTitle": ""}