{"organizations": [], "uuid": "40386925227ebb975e47d9b52b09d8ee0825b035", "thread": {"social": {"gplus": {"shares": 4}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 30, "shares": 30, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "mic.com", "main_image": "http://thumbs.mic.com/OTVkNmFjNzJlMCMva0hVaUdIQUJKY3RhdGNzTm10cGNQaUowVkdNPS8xMXgwOjI5ODl4Mjc0NC8xMjAweDYzMC9maWx0ZXJzOnF1YWxpdHkoODUpL2h0dHBzOi8vczMuYW1hem9uYXdzLmNvbS9wb2xpY3ltaWMtaW1hZ2VzL2VzbnlkZmtxd2tvcnl2bGt6d21ubmNoZHF3dGVpbmtwc2NqZnNybmFxeHJxcGVoa3c0ZzlmeXV3eGd1b2R2OHQuanBn.jpg", "site_section": "http://mic.com/archive", "section_title": "Archive - This Week - Mic", "url": "http://mic.com/articles/153052/hillary-clinton-s-email-headache-is-about-to-get-bigger-but-it-probably-won-t-matter", "country": "US", "domain_rank": 1478, "title": "Hillary Clinton's email headache is about to get bigger — but it probably won't matter", "performance_score": 0, "site": "mic.com", "participants_count": 1, "title_full": "Hillary Clinton's email headache is about to get bigger — but it probably won't matter | Mic", "spam_score": 0.0, "site_type": "news", "published": "2016-08-31T03:08:00.000+03:00", "replies_count": 0, "uuid": "40386925227ebb975e47d9b52b09d8ee0825b035"}, "author": "mic.com", "url": "http://mic.com/articles/153052/hillary-clinton-s-email-headache-is-about-to-get-bigger-but-it-probably-won-t-matter", "ord_in_thread": 0, "title": "Hillary Clinton's email headache is about to get bigger — but it probably won't matter", "locations": [], "entities": {"persons": [{"name": "hillary clinton", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}, {"name": "barack obama", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "comey", "sentiment": "none"}, {"name": "steve schale", "sentiment": "none"}, {"name": "clinton foundation", "sentiment": "none"}, {"name": "clinton", "sentiment": "none"}, {"name": "bill burton", "sentiment": "none"}, {"name": "james comey", "sentiment": "none"}, {"name": "stu rothenberg", "sentiment": "none"}, {"name": "hillary", "sentiment": "none"}, {"name": "rothenberg", "sentiment": "none"}], "locations": [{"name": "california", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}], "organizations": [{"name": "fbi", "sentiment": "negative"}, {"name": "cnn", "sentiment": "negative"}, {"name": "monmouth", "sentiment": "none"}, {"name": "rcp", "sentiment": "none"}, {"name": "new york times", "sentiment": "none"}, {"name": "clinton foundation", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CNN reported Tuesday that the FBI could release its full report on the Hillary Clinton email investigation as early as Wednesday — prolonging the email story that's plagued the Clinton campaign for over a year.\nIt's unclear what new information, if any at all, will be released that goes beyond FBI Director James Comey's initial rebuke of Clinton's handling of classified information.\nYet Democrats say they don't think the FBI's release of the investigation notes will fundamentally alter the state of the race, in which Clinton leads Republican nominee Donald Trump by a comfortable margin.\n\"I think that this is an issue where Hillary has admitted a misdoing and the American people have made up their minds about it,\" Bill Burton, a California Democratic strategist who served as President Barack Obama's deputy press secretary in the White House, said in an interview. \"So barring some sort of big revelation, it's just hard for me to think that anything on this issue is really going to change the contours of this race.\"\nBaked in the cake? The controversy around Clinton's emails began last year, and has continued to roil even after Comey recommended against charging Clinton with any sort of crime.\nClinton continues to lead Trump by a comfortable margin in the RealClearPolitics polling average —even after a new controversy bubbled up around the charitable Clinton Foundation.\nHillary Clinton starts off the week leading Donald Trump by 6% in the RCP polling average http://ow.ly/immP303G6tO pic.twitter.com/MIaLkwtFlI\nhttps://pbs.twimg.com/media/CrCHvW0XYAAnT-4.jpg:large \"I just think that, if you've decided that you think she should go to jail and you're voting for Donald Trump, then nothing's gunna change your mind,\" Steve Schale, a Florida Democratic strategist, said in an interview. \"If you've decided Trump is an existential threat to America and you're gunna vote for her, then nothing is gunna change your mind. It's all baked in the cake. And what we're arguing about is a couple points in a couple of states. I just, at this point, really don't think that there's any new news on anybody that's going to move this election.\"\nSimilarly, even as national numbers between Clinton and Trump have tightened, she currently holds wider leads in the handful of swing states that Trump would need to sweep in order to have any shot at victory in November.\nThat combined led the New York Times to give Clinton an 88% chance of victory in November.\nUpshot forecast: Clinton has 88% chance of winninghttp://nyti.ms/2anzPBs\nAnalysts say in order to change that, Trump would not only need a bombshell in the FBI interview notes, he'd also need to erase the poor image he's built with voters throughout the course of the campaign. A recent national Monmouth poll found Trump with only a 26% favorable rating.\nMessage discipline: Democratic strategists and non-partisan analysts alike add that in order to take advantage of Clinton's email scandal, Trump would also need to deflect any negative attention away from his own campaign.\nAnd that's a tall task for Trump, who potentially on the same day as the FBI's Clinton email dump will deliver a speech laying out his immigration policy, which has become a muddled mess of confusion over the past week.\nIf Trump attempts to abandon his promise of deporting undocumented immigrants or his signature issue of building a literal wall along the U.S.-Mexico border, he'll be labeled as a flip-flopper — even among his most fervent supporters. If he sticks to his original plan, his support among Hispanic Americans is unlikely to grow to the level he needs to win the general election.\n@JoeNBC: Nobody in #AmnestyDon's own campaign can tell you what #AmnestyDon's position is on immigrationhttp://nbcnews.to/2c2eafl\n\"It's hard for me to believe that [the FBI email dump] is going to remake the race, because remember, I think it's important to point out, there are other things swirling about the Trump campaign as well,\" Stu Rothenberg, a non-partisan political analyst, said in an interview. \"The issue of if Trump is changing his position on immigration, the issue of white nationalists around his campaign, there are other issues circulating as well.\"\nAdditionally, throughout the race, Trump has repeatedly proven his ability to step on a good news cycle for his campaign's cause with inflammatory comments or staff shake-ups that shift the negative news cycle toward Trump.\n\"In the near term, the Clinton people would rather the topic du jour not be Clinton emails or the Clinton Foundation,\" Rothenberg said. \"But it's not as if ... it's automatically fatal for her.\"", "external_links": ["https://pbs.twimg.com/media/CrCHvW0XYAAnT-4.jpg:large&quot;", "http://www.cnn.com/2016/08/30/politics/fbi-report-hillary-clinton-investigation/index.html", "https://twitter.com/RealClearNews/status/770264786345099264", "https://twitter.com/morning_joe/status/770214842162491392", "https://twitter.com/tackettdc/status/770648217532891136", "http://nyti.ms/2anzPBs", "http://www.cnn.com/2016/08/23/politics/donald-trump-immigration-proposals-softening/", "https://twitter.com/Morning_Joe/status/770214842162491392", "https://twitter.com/morning_joe/status/770214842162491392&quot;", "https://twitter.com/RealClearNews/status/770264786345099264&quot;", "http://www.monmouth.edu/polling-institute/reports/MonmouthPoll_US_082916/", "http://ow.ly/immP303G6tO", "https://twitter.com/tackettdc/status/770648217532891136&quot;", "http://nbcnews.to/2c2eafl", "https://pbs.twimg.com/media/CrCHvW0XYAAnT-4.jpg:large"], "published": "2016-08-31T03:08:00.000+03:00", "crawled": "2016-09-01T04:07:30.718+03:00", "highlightTitle": ""}