{"organizations": [], "uuid": "eca169918481d1fb4462775352dadb22d3528f91", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/694940094001_5111169546001_090316-forbesfox-clintons1280.jpg", "site_section": "http://www.foxnews.com/costoffreedom/", "section_title": "The Cost of Freedom | Fox News", "url": "http://www.foxnews.com/transcript/2016/09/03/democrats-pressing-clintons-sever-all-ties-with-foundation/", "country": "IT", "domain_rank": 185, "title": "Democrats pressing Clintons sever all ties with foundation", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "Democrats pressing Clintons sever all ties with foundation | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2016-09-03T03:00:00.000+03:00", "replies_count": 0, "uuid": "eca169918481d1fb4462775352dadb22d3528f91"}, "author": "FoxNews.com", "url": "http://www.foxnews.com/transcript/2016/09/03/democrats-pressing-clintons-sever-all-ties-with-foundation/", "ord_in_thread": 0, "title": "Democrats pressing Clintons sever all ties with foundation", "locations": [], "entities": {"persons": [{"name": "clintons", "sentiment": "negative"}, {"name": "sabrina schaeffer", "sentiment": "negative"}, {"name": "david", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "steve", "sentiment": "none"}, {"name": "bill clinton", "sentiment": "none"}, {"name": "bill bladwin", "sentiment": "none"}, {"name": "bruce japsen", "sentiment": "none"}, {"name": "jason bourne", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "rich karlgaard", "sentiment": "none"}, {"name": "hillary", "sentiment": "none"}, {"name": "bill baldwin", "sentiment": "none"}, {"name": "harry truman", "sentiment": "none"}, {"name": "mike ozanian", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}], "organizations": [{"name": "clinton foundation worker asked state dept", "sentiment": "negative"}, {"name": "pew research", "sentiment": "none"}, {"name": "irs", "sentiment": "none"}, {"name": "cia", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "cbs", "sentiment": "none"}, {"name": "clinton foundation", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "\nREPORT: CLINTON FOUNDATION WORKER ASKED STATE DEPT FOR DIPLOMATIC PASSPORTS\nSabrina Schaeffer: You know, it's so interesting, David, when you look at some of the deeper numbers, like Pew Research is found out more than 50 percent said they actually know a lot about Hillary’s policies. What people are uncomfortable with is sort of her untrustworthiness and her honesty. There's so much for the time in office, the Clinton Foundation, $2 billion operation and their business deals, that is what is getting voters uncomfortable.\nBruce Japsen: The thing is, in paragraph three of all of these stories about the e-mails and Clinton Foundation, they say they did nothing illegal and so forth. I realize that you're going to get investigations and all of this other stuff. But the Clinton Foundation has done billions of dollars of good. As a matter of fact, it did good for Trump, because he gave them $100,000. One of the reasons is why he did charitable work --\nRich Karlgaard: Yeah, viewers should know that the fund this where talking about were started in the 1950s to keep ex-presidents out of poverty. Harry Truman was living pretty close to the financial edge and specifically to avoid presidents doing unseemly things. Bill Clinton has used this a lot. Far more than any ex-president. Ten people are dipping into this. Ten staffers are getting funded to money that was supposed to go to Bill Clinton. And even IT equipment like servers. Is it technically illegal. I guess we'll find out but it sure reeks of the Clintons having this entitlement that's beyond any ex-president.\nMike Ozanian : There isn’t any doubt, David, that the Clinton Foundation is about pay for play. Not in my mind, but as far as Hillary Clinton’s election goes, the worst thing i think she can do at this point is remove herself and her daughter and husband from it.\nBill Baldwin: Well, i found out that 44 percent of the Americans don't follow the news. I don't think the Clintons should sever ties to the foundation. That would give an aura of legitimacy to it. Far better left as over it is pay for play. What the white house says making bedrooms –\nIRS FAILS TO INFORM 1.1M AMERICANS THEIR ID'S WERE STOLEN SOME OF THEM BY ILEGAL WORKERS\nRich Karlgaard: Well if you ran a publicly traded company or if you didn't dispose an act like this, you would have federal lawsuits all over the place. This just proves in addition to the IRS being the bullying incompetent organization it has always been, it is now corrupt in a way that is just find mind-boggling to targeting political enemies and now this.\nBill Bladwin: I suppose the IRS, here's why, ten immigrants get jobs by using social security numbers. At that point, the IRS assigns the ten social security numbers, rich, how are you harmed?\nMike Ozanian: I think what is basically happening here, the IRS is spending more and more taxpayer money on trying tax these identity thefts. In 2014, they paid out $5.8 Billion in fraudulent tax returns through identity theft. I think what goes a long way, they stopped use refunds with pre-paid deb the accounts.\nBruce Japsen: Well, I mean, i read this report and they said they'll be notifying people in January. I understand that's not prompt. One of the residences they did not go after people right away, they want to make sure they get these folks who are trying to avoid taxes to pay taxes. And I think this could be solved with a comprehensive immigration bill to give these people some kind of an ID so they're paying taxes.\nSabrina Schaeffer: Six months away. Since Steve isn't here today, I’m going to throw it out maybe one solution is having a flat tax, getting rid of the IRS and simplifying things. I think the IRS does need to notify people. If somebody is using your social security number to get a job is the least of your problems if have you identity theft. It can't wait till January.\nWSJ:CIA’S VENTURE CAPITALISM FIRM OPERATES 'IN THE SHADOWS'\nMike Ozanian : All that is investing into this fund is crony capitalism. And anybody who doesn't think that haven't even the Jason Bourne movies.\nRich Karlgaard: Look, I wouldn't want to be a limited partner in that venture fund because they have a different purpose than the research project agencies. I think it's a way to tap all the talents out there. China has millions of people working on spy ware. We need the best and brightest in this country, too.\nSabrina Schaeffer : Yeah, I’m a little bit on the fence here, David. I like the government thinking a little bit more, a private industry and being creative. At the same time, there's no real competition here. It seems there's too many potential conflicts of interest, once again.\nBruce Japsen: What I want to know is what kind of financial return is the taxpayer get on this?\nBill Baldwin : I don't think it's good for the government to invest in that.\nSTOCK PICKS\nBill Bladwin: (CBS)\nMike Ozanian: (CHCO)", "external_links": [], "published": "2016-09-03T03:00:00.000+03:00", "crawled": "2016-09-06T23:47:25.964+03:00", "highlightTitle": ""}