{"organizations": [], "uuid": "98466a581f6af2824e3ec9e1bee3920153c92b63", "thread": {"social": {"gplus": {"shares": 3}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 15, "shares": 15, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/video/0/0/INT0539-091616OURAMERICANDREAMJULISSAARCE-47JTNN4A_FNC_091916_08-27.jpg", "site_section": "http://feeds.latino.foxnews.com/home/feed", "section_title": "FOX News", "url": "http://latino.foxnews.com/latino/lifestyle/2016/09/19/julissa-arce-story-from-intern-to-wall-street-executive-all-while-undocumented/", "country": "US", "domain_rank": 185, "title": "Julissa Arce's story: From intern to Wall Street executive – all while undocumented", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "Julissa Arce's story: From intern to Wall Street executive – all while undocumented | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2016-09-19T03:00:00.000+03:00", "replies_count": 0, "uuid": "98466a581f6af2824e3ec9e1bee3920153c92b63"}, "author": "Rebekah Sager", "url": "http://latino.foxnews.com/latino/lifestyle/2016/09/19/julissa-arce-story-from-intern-to-wall-street-executive-all-while-undocumented/", "ord_in_thread": 0, "title": "Julissa Arce's story: From intern to Wall Street executive – all while undocumented", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Rebekah Sager \n  Julissa Arce: I hope my book helps break down stereotypes Our American Dream: Dr. Enriquez, Head Start director Julissa Arce, a once undocumented immigrant from Mexico who became a Wall Street executive, hopes to leave a mark by sharing her remarkable – and controversial – life story in “My (Underground) American Dream,” which hit bookstores last week just in time to kick off this year’s Hispanic Heritage Month.\n\"I’m hopeful my book can help to break down stereotypes and change the dialogue,” Arce told Fox News Latino.\nArce, 33, climbed the corporate ladder essentially with her hands tied.\nBrought to the U.S. at age 11 on a tourist visa, Arce settled with her family in San Antonio, Texas, and years later was admitted at the University of Texas at Austin. She was able to afford it with the help of her parents, who owned a food truck, and also thanks to a 2001 Texas law that allowed undocumented students to pay in-state tuition.\nBut her source of income stopped when her parents decided to return to Mexico, so she opted to buy a fake green card and a fake social security card to try and find a good-paying job and get through college.\n“I wish it was something I didn’t have to do,” she told FNL. “I wish there could have been a legal pathway for me to fix my status.”\n“For me, education is what opened so many doors of opportunity,” said Arce, who is co-founder of the Ascend Educational Fund , which provides college scholarships to immigrant students regardless of their status.\n“I want to make sure the next generation of students has access to those opportunities [that I had],” she added.\nWhile in college, in the summer before her senior year, Arce got an internship through a non-profit called Sponsors for Educational Opportunity – she was thrilled to be placed at New York City’s banking firm Goldman Sachs. A year later, after graduation, she returned to the Big Apple with a full-time job on Wall Street.\nHowever, she said her dream job was rife with stress and pressure: from the fear of being found out as undocumented immigrant, to long hours in a dog-eat-dog world of finance.\n“There were times if I got called into the boss’ office unexpectedly and I would think ‘this is it’,” Arce told Fox News Latino. \"I'm going to lose my job, get deported or sent to a detention center.\"\n“In some ways having the high pressure environment [of Wall Street] helped me suppress the worries about my immigration status,” she added.\nAfter almost 10 years at Goldman Sachs and a marriage to a U.S. citizen, resulting in her green card and then her citizenship, Arce left Wall Street and began the next chapter of her life – helping other undocumented people and writing her life story.\nThe rights to Arce’s book have been optioned to America Ferrera’s Take Fountain Productions with plans to develop it into a TV series. She was also featured in HBO’s star-studded show “Habla y Vota.”\n“I recently read that two-thirds of the roles that Latinas play on television are maids (…) and not that being a maid isn’t an important job and it’s not a dignified job, but when that’s the only image we see, then that’s all we feel we can aspire to,” Arce said.\n“So the biggest thing I’m excited about is seeing a Latina on Wall Street being portrayed on television,” she added.\nWhen it comes to the upcoming   Arce understands, maybe more than many, the important role the topic of immigration plays.\nShe said we need to start at looking and speaking about immigration in a very different way.\n“We are using immigrants as scapegoats for all the very real issues that are in our country. Until we start looking at immigration as a potential solution for those issues, we’re not going to get anywhere,” she said. “We’re not going to get anywhere by deporting 11 million people because what it’s going to do to our economy is disastrous.”\nArce was officially sworn in as an American citizen in August of 2014 and will vote in a presidential election for the first time this year.\n\nRebekah Sager is a writer/editor for Fox News Latino. She can be reached at rebekah.sager@foxnewslatino.com. Follow her on Twitter @rebekah_sager \n ", "external_links": [], "published": "2016-09-19T03:00:00.000+03:00", "crawled": "2016-09-19T19:18:07.640+03:00", "highlightTitle": ""}