{"organizations": [], "uuid": "11cb46627844f33f7fa2aa730cd4b8abe7af5a7b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.foxnews.com", "main_image": "http://global.fncstatic.com/static/v/all/img/og/og-fn-foxnews.jpg", "site_section": "http://www.foxnews.com/journal/", "section_title": "Journal Editorial Report | Fox News", "url": "http://www.foxnews.com/transcript/2016/09/24/candidates-locked-in-tight-race-ahead-first-debate-is-it-too-late-for-trump-and/", "country": "IT", "domain_rank": 185, "title": "Candidates locked in tight race ahead of first debate; Is it too late for Trump and Hispanic voters?", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "Candidates locked in tight race ahead of first debate; Is it too late for Trump and Hispanic voters? | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2016-09-24T03:00:00.000+03:00", "replies_count": 0, "uuid": "11cb46627844f33f7fa2aa730cd4b8abe7af5a7b"}, "author": "FoxNews.com", "url": "http://www.foxnews.com/transcript/2016/09/24/candidates-locked-in-tight-race-ahead-first-debate-is-it-too-late-for-trump-and/", "ord_in_thread": 0, "title": "Candidates locked in tight race ahead of first debate; Is it too late for Trump and Hispanic voters?", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}, {"name": "freeman", "sentiment": "none"}, {"name": "bill clinton", "sentiment": "none"}, {"name": "george w. bush", "sentiment": "none"}, {"name": "kanye west", "sentiment": "none"}, {"name": "joe rago", "sentiment": "none"}, {"name": "al awlaki", "sentiment": "none"}, {"name": "reynolds", "sentiment": "none"}, {"name": "james freeman", "sentiment": "none"}, {"name": "tsarnaev", "sentiment": "none"}, {"name": "mike tyson", "sentiment": "none"}, {"name": "ted cruz", "sentiment": "none"}, {"name": "ronald reagan", "sentiment": "none"}, {"name": "nadal hasan", "sentiment": "none"}, {"name": "kim", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "rahami", "sentiment": "none"}, {"name": "rago", "sentiment": "none"}, {"name": "joe rago", "sentiment": "none"}, {"name": "paul", "sentiment": "none"}, {"name": "whit", "sentiment": "none"}, {"name": "barack obama", "sentiment": "none"}, {"name": "james", "sentiment": "none"}, {"name": "bernie sanders", "sentiment": "none"}, {"name": "ayres", "sentiment": "none"}, {"name": "comey", "sentiment": "none"}, {"name": "o'grady", "sentiment": "none"}, {"name": "gary johnson", "sentiment": "none"}, {"name": "obama", "sentiment": "none"}, {"name": "paul gigot", "sentiment": "none"}, {"name": "clinton", "sentiment": "none"}, {"name": "michael mukasey", "sentiment": "none"}, {"name": "marco rubio", "sentiment": "none"}, {"name": "jill stein", "sentiment": "none"}, {"name": "ahmad khan rahami", "sentiment": "none"}, {"name": "whit ayres", "sentiment": "none"}, {"name": "hillary", "sentiment": "none"}, {"name": "mary anastasia o'grady", "sentiment": "none"}, {"name": "elizabeth warren", "sentiment": "none"}, {"name": "mukasey", "sentiment": "none"}, {"name": "donald trumps", "sentiment": "none"}, {"name": "harry truman", "sentiment": "none"}, {"name": "gigot", "sentiment": "none"}, {"name": "paul gigot", "sentiment": "none"}, {"name": "mccain", "sentiment": "none"}, {"name": "michael mukasey", "sentiment": "none"}, {"name": "william", "sentiment": "none"}, {"name": "bashar al assad", "sentiment": "none"}, {"name": "mcgurn", "sentiment": "none"}, {"name": "bernie", "sentiment": "none"}, {"name": "mary", "sentiment": "none"}, {"name": "kim strassel", "sentiment": "none"}, {"name": "omar mateen", "sentiment": "none"}, {"name": "barack obama", "sentiment": "none"}, {"name": "obama", "sentiment": "none"}, {"name": "mukasey", "sentiment": "none"}, {"name": "whit ayres", "sentiment": "none"}, {"name": "joe", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "kim strassel", "sentiment": "none"}, {"name": "cheryl mills", "sentiment": "none"}, {"name": "glenn reynolds", "sentiment": "none"}, {"name": "bill mcgurn", "sentiment": "none"}, {"name": "mitt romney", "sentiment": "none"}, {"name": "x. mukasey", "sentiment": "none"}, {"name": "bill mcgurn", "sentiment": "none"}, {"name": "bill", "sentiment": "none"}, {"name": "james comey", "sentiment": "none"}, {"name": "snowden", "sentiment": "none"}, {"name": "cruz", "sentiment": "none"}, {"name": "kim kardashian", "sentiment": "none"}, {"name": "james freeman", "sentiment": "none"}, {"name": "mary anastasia o'grady", "sentiment": "none"}], "locations": [{"name": "united states", "sentiment": "none"}, {"name": "cuba", "sentiment": "none"}, {"name": "iran", "sentiment": "none"}, {"name": "new america", "sentiment": "none"}, {"name": "syria", "sentiment": "none"}, {"name": "ukraine", "sentiment": "none"}, {"name": "north korea", "sentiment": "none"}, {"name": "boston", "sentiment": "none"}, {"name": "nicaragua", "sentiment": "none"}, {"name": "afghanistan", "sentiment": "none"}, {"name": "colombia", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}, {"name": "orlando", "sentiment": "none"}, {"name": "charlotte", "sentiment": "none"}, {"name": "iraq", "sentiment": "none"}, {"name": "tulsa", "sentiment": "none"}, {"name": "burma", "sentiment": "none"}, {"name": "el salvador", "sentiment": "none"}, {"name": "aleppo", "sentiment": "none"}, {"name": "middle east", "sentiment": "none"}, {"name": "nevada", "sentiment": "none"}, {"name": "ohio", "sentiment": "none"}, {"name": "minnesota", "sentiment": "none"}, {"name": "miami", "sentiment": "none"}, {"name": "pakistan", "sentiment": "none"}, {"name": "ft. hood", "sentiment": "none"}, {"name": "latin america", "sentiment": "none"}, {"name": "philadelphia", "sentiment": "none"}, {"name": "libya", "sentiment": "none"}, {"name": "hollywood", "sentiment": "none"}, {"name": "benghazi", "sentiment": "none"}, {"name": "oklahoma", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "argentina", "sentiment": "none"}, {"name": "north carolina", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}, {"name": "new jersey", "sentiment": "none"}, {"name": "colorado", "sentiment": "none"}, {"name": "quetta", "sentiment": "none"}], "organizations": [{"name": "verizon", "sentiment": "none"}, {"name": "mexico trump", "sentiment": "none"}, {"name": "u.n.", "sentiment": "none"}, {"name": "islamic state", "sentiment": "none"}, {"name": "fox news", "sentiment": "none"}, {"name": "republican party", "sentiment": "none"}, {"name": "islam", "sentiment": "none"}, {"name": "congress", "sentiment": "none"}, {"name": "ithaca college", "sentiment": "none"}, {"name": "intel", "sentiment": "none"}, {"name": "fbi", "sentiment": "none"}, {"name": "nbc/wall street journal/telemundo", "sentiment": "none"}, {"name": "isis", "sentiment": "none"}, {"name": "wall street journal potomac watch", "sentiment": "none"}, {"name": "nbc", "sentiment": "none"}, {"name": "taliban", "sentiment": "none"}, {"name": "nato", "sentiment": "none"}, {"name": "united nations general assembly", "sentiment": "none"}, {"name": "united nations", "sentiment": "none"}, {"name": "temple university", "sentiment": "none"}, {"name": "ebay", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Published September 24, Email Print Watch the latest video at video.foxnews.com\nThis is a rush transcript from \"Journal Editorial Report,\" September 24,\nPAUL GIGOT, HOST: Welcome to the \"Journal Editorial Report.\" I'm Paul Gigot.\nWe're live this weekend as we count down to the first presidential debates. The stakes couldn't be higher for both Hillary Clinton and Donald Trump who are in a very tight race. The latest RealClearPolitics polling average shows Hillary Clinton with a narrow lead nationally, while a Fox News poll shows Donald Trump ahead in the key swing states of Nevada, North Carolina and Ohio. So what do the candidates need to do Monday night to move those numbers?\nLet's ask Wall Street Journal Potomac Watch columnist, Kim Strassel; Main Street columnist, Bill McGurn; editorial board member, Joe Rago; and assistant editorial page editor, James Freeman.\nSo, Kim, let's set the stage first. Do you agree that Hillary Clinton is slightly ahead here in the election?\nKIM STRASSEL, POTOMAC WATCH COLUMNIST: I think there is no doubt, and she has been by and large this entire race. But what we're seeing is this interesting change where she seems to be getting a little bit of bump in the national polls and just in the last week while Donald Trump seems to be tightening things, even moving ahead in some very key swing states.\nGIGOT: Let's start with Mrs. Clinton. What does she need to do to stay ahead and move those numbers up for her?\nSTRASSEL: I think this debate is going to come down to one issue and that is can Donald Trump look presidential. She has made this the core of her campaign. She hasn't spent a lot of time talking about her own agenda and she's instead made it all about -- make the argument he's unfit to be president. And she'll try and do that at the debate. She'll try to outrun him on facts and policy, maybe a couple of gotcha moments. Just in general, try to make him look incompetent. And the question is, can she parry those and, in some way, try to change the portrait that she has painted of him.\nGIGOT: But, Bill, the idea is that she is -- she's premised her whole campaign, as Kim said, on the fact that on Trump is unacceptable, unfit.\nDoes that mean she's going to try to needle him, bait him, get him to blow up?\nBILL MCGURN, MAIN STREET COLUMNIST: I think that would be her hope. Look people are going to be watching --\nGIGOT: Is that going to be her strategy?\nMCGURN: It depends. The story is she's preparing for a lot of Donald Trumps. Republicans are hoping the Mexico Donald Trump will show up.\n(LAUGHTER)\nGIGOT: When he showed up -- that's when he met the Mexican president.\nMCGURN: Right. This is a huge opportunity and a danger for both of them because it's a big moment, and people are going to be watching this like they watch Mike Tyson's fights, hoping somebody's going to get their ear chewed off.\n(LAUGHTER)\nAnd Donald Trump, I think, if you look at the \"who,\" the \"who\" question is, who is he trying to appeal to? I think it's Republicans who don't like Mrs. Clinton but haven't made up their minds about him because they think he can't be trusted.\nGIGOT: Right.\nBut I want to talk, James, about Mrs. Clinton. I think she is going to try to have Donald Trump erupt if he can.\nJAMES FREEMAN, ASSISTANT EDITORIAL PAGE EDITOR: Sure.\nGIGOT: If he does, if he takes the bait. But also her strength is experience, knowledge. There's no way in the world that Donald Trump is going to out-do Hillary Clinton when it comes to knowledge about the Syrian battle front or any of these details, who the prime minister of Ukraine is.\nIs that smart for her to play that card?\nFREEMAN: Yeah, she should have the advantage. She spent a whole career doing this. Obviously, first off, number one, she has to remain standing through the debate.\nGIGOT: Oh, come on. That's a cheap shot.\nFREEMAN: Beyond that I think --\nGIGOT: That's a cheap shot.\n(LAUGHTER)\nFREEMAN: -- that is her hope here is that she shows over the course of an hour and a half, without a whole lot of people on the stage, just the two of them, that she can sustain a fact-filled policy argument and he can't and he's really not in the major leagues.\nGIGOT: You expect her to try to do that?\nFREEMAN: I would think.\nGIGOT: What about Donald Trump? What is his -- what does he have to do, Joe?\nJOE RAGO, EDITORIAL BOARD MEMBER: I think he has to start to normalize himself. If you look at the polls, there are a lot of undecided voters, and a lot of that is a question about whether Donald Trump has the character and temperament to be president. If he gets up there, if he's magnanimous, controlled, I think that perception of him, people might start to look at him and say, oh, he could be a plausible president.\nGIGOT: That's the Mexico Trump?\nRAGO: Yeah.\nMCGURN: And I think Joe is right. I would go further. He can't be as inknowledged (sic) and experienced about the political party. He ought to concede that up front because the issue suspect whether Mrs. Clinton knows more about Iraq and Libya, it's her judgment and the policies that she's associated with. I think it would be wise for him to concede her superior knowledge about the world and how it is and just get into, but this is the same woman that gave us Libya and some of the other --\nGIGOT: What about going after her on Benghazi, for example, on the e- mails, on the Clinton Foundation? That could make him look he's really -- he's not cool and restrained.\nFREEMAN: Right. I think, baseline, he needs to show he's got the head and heart to be president. You want to see that kind of even-tempered person with judgment. But the real homerun ball is, not to try to fill his head with a lot of statistics, is to recognize that he's got a lot of good facts. And if could just say, for example, talk about the economy, declining productivity for three straight quarters. Hasn't happened since the 1970s. Instead of just saying, it's a disaster. If he can work some of that in, my tax plan cuts your taxes by trillions, she raises them by a trillion and a half. I think he's got a lot of good facts. And you don't want to turn him into someone he's not, but that, for him, I think is the upside, because people don't expect that.\nGIGOT: Kim, what about the moderator and the role of the moderator. Should the moderator be, as a lot of people are saying, a fact checker? Oh, sorry, Mrs. Clinton, you're wrong there.\nSTRASSEL: Absolutely not. This is called a debate. These are supposed to be the two candidates conflicting with each other. He should remove himself from the entire question. He should say so up front and he says, if somebody says something and you disagree, come out and say where you're wrong. This is supposed to be the debate between the two of them. If he inserts himself in this, he ends up making this debate about himself rather than about their answers.\nGIGOT: Joe, just to finish up here, I wanted to ask, Ted Cruz endorsed Trump after -- at the Republican convention, pointedly not doing so, to not a great reaction. Why do you think Cruz turned now?\nRAGO: Look, this is a much closer race than it was in July at the convention, when it was sort of cost free for Cruz to decline to endorse him in a very big way.\nGIGOT: So he thought then, Donald Trump was going to get blown out?\nRAGO: Right. And I think he thought that he's going to get the blame if Trump loses very narrowly, one or two points. Everybody's going to say, what about these holdouts here? Cruz, the most prominent among them.\nGIGOT: OK, thanks, Joe.\nWhen we come back, a new poll shows Hillary Clinton with a big lead over Donald Trump with Hispanic voters. What can the Republican nominee do to appeal to this key voting group, and can he win without them?\n(COMMERCIAL BREAK)\n Since President Obama came into office, another two million Hispanic Americans have fallen into poverty. It's catastrophic. And it's totally unacceptable. To the Hispanic community, I say we are going to protect your jobs, we're going to build up your schools, and we're going to deliver safety and opportunity for your children.\n(END VIDEO CLIP)\nGIGOT: That was Donald Trump making his pitch to Hispanic voters in Miami, Florida, last week, arguing that they have suffered under eight years of President Obama's economic policies. Despite this, a new NBC/Wall Street Journal/Telemundo poll shows Hillary Clinton leading him among likely Hispanic voters by almost 50 points. Is it too late for Trump to make inroads with this voting group, and can he win in November without them?\nRepublican pollster, Whit Ayres, worked for Marco Rubio's presidential campaign. He's author of the book \"2016 and Beyond, How Republicans Can Elect a President in the New America.\"\nWhit, thanks for coming in today. Good to see you again.\nWHIT AYRES, REPUBLICAN POLLSTER: Paul, good to be with you again.\nGIGOT: So let's step back a little bit first before we talk about the Hispanic voter. I want to get your thoughts on the state of the race, because I think you had expected that Donald Trump would lose pretty big.\nAre you surprised it's this close at this stage of the game?\nAYRES: Oh, no, we have a pretty evenly divided country. But the challenge for Donald Trump and any Republican candidate is that any presidential candidate is that every single presidential election since 1996, when Bill Clinton was re-elected, the percentage of white voters has gone down by 2 or 3 percentage points. If that trend continues, and there's no reason to think that it won't, we're looking at an electorate this year of about 70 percent white and about 30 percent nonwhite. That means it's increasingly harder to win an election by getting a higher and higher percentage of a lower and lower portion of the electorate.\n(CROSSTALK)\nAYRES: Mitt Romney won a landslide among whites and still lost.\nGIGOT: Are you saying that Donald Trump can't expand that white share of the electorate? A lot of people have talked about that. He's got that appeal to the working class voter who may not have voted in the last two elections.\nAYRES: He may very well. The question is how much can he expand it and will it be enough to expand the majority. To win a majority of the popular vote, if you do no better than Mitt Romney did among nonwhites, you would need somewhere around 65 percent of the white vote in order to win a majority of the popular vote. That's something that no president has done since Ronald Reagan in 1984.\nGIGOT: Let's talk about Donald Trump and Hillary Clinton's standing with Hispanic voters. It doesn't look good in this Telemundo/WSJ/ NBC poll. I think that positive view is 57 percent of the Hispanics polled that have a positive view of Mrs. Clinton, Donald Trump only 15 percent. To what do you attribute that, those numbers?\nAYRES: Well, those are pretty toxic ratings. And Mr. Trump had had a series of statements, going back 15 months, that have meant that he has dug a serious hole among Hispanics.\nGIGOT: Right.\nAYRES: Mitt Romney was at 27 percent. According to your poll, Donald Trump is down to 17 percent among Hispanics. That is a major problem for states with large Hispanic populations, like Florida, Colorado and Nevada.\nGIGOT: You attribute it to the statements. To what extent are policies behind it? I'm thinking in particular about something like immigration. I know Hispanics are not single-issue voters anymore than the rest of Americans, but immigration is something that resonates. Is that a big part of it, too?\nAYRES: Sure, it's a big part of it. And the talk about forcible deportation of 11 million Hispanics, a population the size of Ohio, has created a hole for him. It's a big hole. He's trying to modify that a little bit now. We'll see if it's too little, too late.\nGIGOT: If that's true -- and I have agreed with your analysis about the Republican Party needing to broaden its appeal, needing to appeal to nonwhite voters. But if that's true, why then, when you look at some of the battleground states, like Florida, for example, or even Nevada, which has a big proportion of Hispanic voters, why is Trump -- in Florida, he's either ahead or tied. And in Nevada, it quite close. Why is that happening?\nAYRES: Because these are swing states. They're swing states for a reason, Paul. They're very even and very close. But that's where it makes a real difference if you're getting a higher proportion of any particular group or a lower proportion of a particular group. In a very close race, that could make the difference.\nGIGOT: OK, so 27 percent was Mitt Romney's number of Hispanic votes. What do you think Trump needs to get to win the election this year? What do you expect him to get?\nAYRES: I don't know what I expect him to get. Based on that poll, it's not going to be very high.\nGIGOT: Right.\nAYRES: But a Republican, to do well and come close to winning a majority of the popular vote, ought to be somewhere in the neighborhood of 40 percent of the Hispanic vote, depending upon how well he does among white voters.\nGIGOT: How would you advise Trump at this stage to win enough of those Hispanic voters back? Push the economy, for example, push health care?\nAYRES: To keep doing what he did in those clips that you just played a few moments ago.\nGIGOT: OK.\nAYRES: That's the right message to bring Hispanics back, to bring all Americans back who are worried about this weak economy.\nGIGOT: So focus on jobs, focus on economic growth, soft sell the immigration issue?\nAYRES: Well --\nGIGOT: He can't do that.\nAYRES: He's going the have a hard time doing that, a very hard time.\n(LAUGHTER)\nThe best he can do is change the subject.\nGIGOT: All right, thanks, Whit. Thanks for coming in. Appreciate it.\nAYRES: Surely, Paul. Good to be with you.\nGIGOT: When we come back, Hillary Clinton facing her own problems with a key voting group. A look at buy Millennials aren't warming to the Democratic nominee.\n(COMMERCIAL BREAK)\n(BEGIN VIDEO CLIP)\nHILLARY CLINTON, D-PRESIDENTIAL CANDIDATE: I need you as partners, not just for winning this election, but for driving real change over the next four years. It's going to take all of us working side by side to build the kind of future we want. That's why, if I'm in the White House, young people will always have a seat at any table where any decision is being made.\n(CHEERING)\n(END VIDEO CLIP)\nGIGOT: Hillary Clinton at Temple University in Philadelphia this week, making a direct appeal to younger voters. Millennials made up a critical part of President Obama's winning coalition, giving him 66 percent of the vote in 2008 and 60 percent in 2012. But recent polls show Clinton lagging far behind those numbers with the latest Fox News poll showing just 38 percent of likely voters under the age of 35 saying they'll vote for her, compared to 33 percent for Donald Trump.\nWe're back with Kim Strassel, Bill McGurn, James Freeman and Joe Rago.\nJoe, I think you'll qualify as a Millennial, just barely.\nRAGO: Just barely.\nGIGOT: But your peers loved Barack Obama, OK? Big numbers for him. How much trouble is Hillary Clinton is with those voters?\nRAGO: I think she's in a lot of trouble as the numbers pointed out. If you look at the polls, younger voters, like most voters, do not find Hillary Clinton honest and trustworthy. And then if you get beyond the ethical issues, she doesn't really have a vision for where she wants to take the country. She's the status quo. And although she has hundreds of thousands of words about policy on her website, can you really identify any of them that are Hillary Clinton's signature issues?\nGIGOT: OK, but wait a minute. So you're saying the initial skepticism about her among younger voters is personal? That is, it's her personal characteristics. They don't trust her. They don't think she's honest.\nAnd yet, if you look at the ideas -- your peers, the younger voters are supposed to like things, like caring about climate change, for abortion rights. They want free college, heaven knows. So those issues are the ones she's trying to drive and bring to her side. And she's still not doing it.\nRAGO: Is it really authentic? I mean, look, the class of 2020 was born in 1998. That was when she --\nGIGOT: That's really shocking.\n(LAUGHTER)\nRAGO: Wrapping up --\nGIGOT: And depressing.\nRAGO: Wrapping up her first stint as first lady. She hasn't been running on free college for her entire career. That's something she conjured up to defeat Bernie Sanders in the primary.\nGIGOT: Bernie Sanders, a key. Bernie's older than she is, James. And he has my hair color. So why did they like him so much and not her?\nFREEMAN: Well, obviously, they tend to be idealistic. As Joe mentioned, they tend to not trust her, not believe her. But there's just some bad facts here. To the extent Millennials tune in and they're generally not -- most of them will not be watching on Monday night. But it is a big demographic, 69 million people, basically tied with the baby boomers now.\nIt's the biggest, if they choose to show up. But this is the generation that took on a trillion dollars of student debt. She's saying free college. What they really want is a job. We look at the 25 to 34 year old demographic, heart of Millennials, above average unemployment. It's not a good situation for them.\nGIGOT: OK, let's look at -- we're bringing in Hollywood here, Kim, to help her. Let's take a look.\n(BEGIN VIDEO CLIP)\nUNIDENTIFIED ACTOR: On Tuesday, November 8th, this country will make one of the most important --\nUNIDENTIFIED ACTOR: The most important --\nUNIDENTIFIED ACTOR: The most important decisions in its history.\nUNIDENTIFIED ACTOR: You have a chance.\nUNIDENTIFIED ACTOR: You have an obligation.\nUNIDENTIFIED ACTOR: To be a part of that decision.\nUNIDENTIFIED ACTOR: You might think it's not important, you might think you're not important, but that's not true.\n(END VIDEO CLIP)\nGIGOT: All right, Kim, is that going to mobilize you to come out and vote for Hillary Clinton?\n(LAUGHTER)\nSTRASSEL: I'm very far from a Millennial.\n(LAUGHTER)\nBut, look, one of the things Hillary Clinton has been doing with ads like this and things like this is trying to make voters turn away, this generation turn away from Donald Trump. That's been an aspect of her campaign. It was part of the \"basket of deplorables\" comments, saying these people are racist and homophobes, and this is not in tune with her values. She may have actually been a little success with that in that she is beating him with Millennials. But a lot of the Millennials have heard that message. If they are not voting for her -- and they're not voting for Trump, they've decided they're also not going to vote for her. They're voting for Gary Johnson. They're voting for Jill Stein. They're going to the third and fourth party candidate. And the reason is because of what she's talking about in that ad in the beginning. Notice she's talking about change. They want a real change candidate and they don't think she's the one that's going to do it.\n(CROSSTALK)\nSTRASSEL: They want a candidate with a narrative.\nMCGURN: That's the big issue. Bernie proved you can be old and get young people. It also helps if you're a little unknown. Bernie's been around a long time but very few people knew who he was outside the state. Same thing with Barack Obama. Her problem is they want change. There's a conflict between more of the same, the Obama administration, and change.\nShe's been around a long time --\nGIGOT: OK.\nMCGURN: -- and she's a tired figure. She kind of has the McCain aura.\nGIGOT: Then, why, as the change candidate --\nMCGURN: Right.\nGIGOT: -- isn't Donald Trump capitalizing more and getting more of those voters instead of the ones going to Gary Johnson or Jill Stein?\nMCGURN: I think they don't like him on a whole host of other issues --\nGIGOT: What are those issues?\nMCGURN: Social issues, and so forth --\nGIGOT: Diversity and --\nMCGURN: Diversity, and maybe immigration and abortion, and so forth. I mean Republicans typically have a hard time with young people on a lot of those issues.\n(CROSSTALK)\nMCGURN: But if they vote for Gary Johnson, it helps Donald Trump.\nGIGOT: And that's why she --\nMCGURN: Or Jill Stein. They don't have to vote for him for him to benefit.\nGIGOT: That's why they're making such a concerted effort to draw Millennials over, because they're afraid they're not going to vote for her or him.\nFREEMAN: A single-digit loss for Trump and generally low turnout among Millennials means he probably wins.\nGIGOT: Wow.\nFREEMAN: The election, generally.\nGIGOT: OK. All right, James, thank you.\nStill ahead, as the investigations into last weekend's terror attacks in New York and New Jersey continues, new questions about what the federal law enforcement missed, some red flags, so is it time to reopen the interrogation and surveillance debates. We'll ask former attorney general, Michael Mukasey, when we come back.\n(COMMERCIAL BREAK)\nGIGOT: As new details emerge about the man charged with the bombing last weekend in New York and New Jersey, new questions are being raised about whether the FBI may have missed some red flags. 28-year-old Ahmad Khan Rahami, whose family came to the United States from Afghanistan in 1995, was arrested in 2014 for stabbing his brother. His father told the police at the time that his son was involved in terrorism, though he later retracted those comments. Authorities also say Rahami traveled to Pakistan and Afghanistan several times over the last decade, including a year in the Taliban stronghold of Quetta.\nMichael Mukasey served as attorney general of the United States from 2007 until 2009.\nJudge, welcome.\nMICHAEL MUKASEY, FORMER U.S. ATTORNEY GENERAL: Good to be here.\nGIGOT: So, good police work, after the fact here, identifying Rahami, capturing him. What about before that? What do you think?\nMUKASEY: He falls into a category, of which we've seen several, that are (INAUDIBLE) referred to as lone wolves, in part, to take down the fiction that these are lone wolves somehow out there and we can't detect them. The Tsarnaev brothers in Boston --\nGIGOT: Right. Omar Mateen in Orlando.\nMUKASEY: Omar Mateen in Orlando, Nadal Hasan at Ft. Hood. They are all people who had come across the radar, were all people as to whom there had been suspicions, all people who were passed over.\nGIGOT: A couple of them were even on the terror database.\nMUKASEY: Right.\nGIGOT: But the argument from the FBI is, we investigated them, we did what they call an assessment, which can last 90 days.\nMUKASEY: That's the lowest level of inquiry.\nGIGOT: Of inquiry, OK. And if there's no criminal act, or no further evidence of terrorist tendencies, we can't do anything. How do you respond to that?\nMUKASEY: I think that's true under the guidelines under which they operate. But it may be time to reassess the guideline.\nGIGOT: Right.\nMUKASEY: We put them in place when I was attorney general in 2008. And it may be time to reassess what we can do and what we can't.\nBut I think there's a deeper problem, which is that when they're referred to as lone wolves, when people talk about self-radicalization, they're concealing the fact that these people are not lone, they interact with others. Nadal Hasan interacted with al Awlaki. The Tsarnaev brothers\ninteracted with people. They don't invent this doctrine themselves.\nThey're applying doctrine of a particular branch, a fundamental branch of Islam that's accepted by large numbers people. It's rejected by many people, too. But it's accepted by a large number of people here. And we have to get our minds around that and approach it as a doctrine that's coherent unto itself, it's coherent to the people who subscribe to it, and they interact with other people. They're not loners.\nGIGOT: OK. That's a state of mind, a mentality. And you can see it expressed if they're sampling terrorist websites or something. And yet, you still have an issue of when law enforcement intervenes and what it can do and how it can take action to stop someone like a Rahami. Is it when, for example, he buys ball bearings on eBay, which we're told he did, for example. That's not a criminal act. You can do that. I can buy ball bearings on eBay, too.\nMUKASEY: Correct. But when you put that together with having expressed tendencies to kill, when you buy ball bearings, that's a step in the right direction, number one. Number two, we don't have any interrogation program. Nadal Hasan, the underwear bomber, Rahami, all could have been treated as unlawful combatants, which is to say, they could have been put in the hands of interrogators who would try to get intelligence from them, so that we could find out who they work with --\nGIGOT: Right.\nMUKASEY: -- and who was responsible for their radicalization. And then don't use any of that evidence in any criminal trial, turn them over to prosecutors later on.\nGIGOT: But that is after the fact. So that is after the fact. And in this case, they read him his Miranda rights, Rahami, and now he's been charged --\nMUKASEY: Yes.\nGIGOT: A couple of times. So he's going to get a lawyer, and he's not going to be talking. You would have said, you would have recommended, with the evidence you know from outside, make him an unlawful combatant and hold him for as long as it takes until he does talk.\nMUKASEY: There's no -- correct. And then prosecuting him then becomes secondary.\nGIGOT: Right.\nMUKASEY: His greatest value is as a source of intelligence.\nGIGOT: Preventing the next attack?\nMUKASEY: Yes.\nGIGOT: What about the surveillance of these gentlemen. Have we given up some of the surveillance capability since Snowden than we had had before?\nMUKASEY: We have. The Congress voted in a coalition of Libertarian Republicans and liberal Democrats to end the gathering of metadata, and instead to require that the authorities go to each provider. Metadata is simply the record of the time of a call, the calling number and called number.\nGIGOT: It's not listening on a phone call.\nMUKASEY: It's not listening on a call. The purpose is to establish a database so if we get a suspicious number, we can run the suspicious number against the database to find out whether it has called or been called by one of those numbers, and then get a search warrant based on probable cause.\nGIGOT: Right.\nMUKASEY: We're not doing that any more.\nGIGOT: You've got to take that additional step of requesting, making a specific request of the providers, like Verizon or anybody else, and saying we need all of the metadata on X.\nMUKASEY: Right.\nGIGOT: Sometimes you don't know who that person is you're looking for.\nMUKASEY: You never know. You're looking for metadata as that point on a number. When you get a corresponding number within the metadata that they give you, then you can find out who that number is registered to and so on and so forth.\nGIGOT: So what I think I hear you saying is we need to rethink some of the tools we have given up because this problem is not going away.\nMUKASEY: Precisely.\nGIGOT: All right, thank you, Judge. Appreciate it.\nStill ahead with this week's terror arrest and protests in Charlotte over a police shooting, issues of law and order and national security are sure to take center stage at Monday night's debate. So which candidate has the better agenda for keeping America safe?\n(COMMERCIAL BREAK)\nGIGOT: With last weekend's terror attacks in New Jersey, New York and Minnesota, and this week's protests in Charlotte, North Carolina, following a police shooting of a black man there, and another in Tulsa, Oklahoma, issues of law and order and national security are sure to take center stage at Monday night's debate. So which candidate has the better agenda when it comes to keeping America safe?\nWe're back with Kim Strassel, Bill McGurn and Joe Rago. And Wall Street Journal columnist, Mary Anastasia O'Grady, joins us as well.\nHi, Mary.\nMARY ANASTASIA O'GRADY, COLUMNIST: Hi, Paul.\nGIGOT: So Trump and Hillary Clinton, the reaction to the terror attacks first. What do you make of their different responses, what do they tell us about the candidate?\nO'GRADY: I think Trump has the upper hand here, and not because he has a really good plan to deal with this, but he's been more forceful in the idea that he's going to go after the problem aggressively. And Hillary has really two things she wants to do. One, she's talked about an intelligence surge.\nGIGOT: Right.\nO'GRADY: It's a little hard to believe coming from a Democrat. I mean, these were people who were so much opposed to the use of the FISA court and the surveillance that was under the Patriot Act. Now she says she's going to do an Intel surge. I'm not exactly sure what that means. And she says she doesn't want to fight them overseas. First, she was in favor of troops, and now she's saying she's against troops. And she says, well, no\n--\n(CROSSTALK)\nGIGOT: Against ground troops?\nO'GRADY: Ground troops, but that can mean people on the ground, so I would divide those between combat and training troops. And she's basically saying, well, she would send some for training, but now she's against combat. So she sends a very mixed message.\nGIGOT: But I have to say, Mary, with Donald Trump's specifics, he does sound a tougher note, but when you get into the details, he doesn't really give a lot of note.\nO'GRADY: I agree with you. He's talked about 20,000 to 30,000 troops overseas, but he backs away from that. I mean he ran basically as an isolationist who wasn't going to do anything overseas. I just think that his overall message is tougher and people hear that.\nGIGOT: On the details that -- I was talking about with Judge Mukasey -- I don't think Donald Trump understands any of that.\nBILL MCGURN, MAIN STREET COLUMNIST: Right. Right. But what he does understand is, what people get from Donald Trump is, I have these solutions, radical Islam is a threat to us, and I am not going to let political correctness get in the way.\nGIGOT: OK.\nMCGURN: Hillary Clinton is locked in by her party. This is not the party of Harry Truman. This is the party of Elizabeth Warren. And the weakness of Hillary Clinton's position, going back to her vote for intervention in Iraq, everything she does is political. It's never about winning or whatever the substance it is. When it was a pro-war atmosphere, she voted to go to war. When that turned, she voted against the surge. Now she wants to look tough without having troops, so we have to pretend that the Special Forces over there aren't really troops.\nGIGOT: But I look at Donald Trump's position on what to do about ISIS, for example, the Islamic State in Syria and Iraq, Joe, and what Secretary Clinton says, and I don't see much difference. They both say, well, we'll both do more bombing, we'll both have a save zone, we don't know quite how we'll do it, but we don't want to do too much over there. And Donald Trump says, we'll take the oil. That's -- whatever that means.\n(LAUGHTER)\nJOE RAGO, EDITORIAL BOARD MEMBER: Take the oil, we didn't take the oil. No. In terms of foreign policy, there's a remarkable overlap, I think, between the Obama-Clinton status quo and what Donald Trump is proposing. On the domestic front, Trump is treating this almost exclusively as a problem of immigration.\nGIGOT: Immigration. That's where he really puts his emphasis. And that resonates with a lot of Americans.\nRAGO: But it doesn't really solve the problem. If you look at the New York and the New Jersey bomber, Rahami, he came here as an Afghan asylum seeker as a child. So that's really not a solution to some of these domestic attacks.\nGIGOT: You could have the most extreme vetting you wanted and it still would not have done anything about Rahami.\nRAGO: Right.\nO'GRADY: If you're looking for policy solutions, you're not going to get them in either one of these candidates. I'm just saying that as a figure on the stage, he's going to come off as the guy who has the more forceful, as Bill says, approach to the problem, that he's going to do something about it, he's not going to let political correctness stop him. And she's much weaker in those areas. And you get whiplash listening to her.\nGIGOT: Kim, let's talk about Charlotte and Tulsa for at least a bit.\nAgain, police shootings. Donald Trump's theme has been law and order, but on the other hand, he's also -- Hillary Clinton's fighting back and saying he's preaching a message of hate. So who has the upper hand here?\nKIM STRASSEL, POTOMAC WATCH COLUMNIST: Look, I think that when you're watching those tv reels of everybody rioting down in Charlotte -- because these were not peaceful protests, these were very ugly rioters out there -- it really does back up the theme that a lot of Americans are worried that there is a law-and-order problem in this country. To the extent that Hillary Clinton is not even addressing that, is instead sort of very much pitching herself on the side of the Black Lives Matter, this is always the police's fault, I don't think most Americans buy that. And Trump is on top of that issue.\nGIGOT: But Trump has to worry about going to far in term of polarization. Doesn't he have to have a message of opportunity?\nSTRASSEL: He does, which he's been doing at the same time, talking about how we need to be changing inner cities so that we don't have some of this conflict.\nGIGOT: All right, thank you, Kim.\nWhen we come back, as President Obama delivers his final speech to the United Nations, a look at the world he's leaving behind.\n(BEGIN VIDEO CLIP)\nPRESIDENT BARACK OBAMA: There appears to be a growing contest between authoritarianism and liberalism right now. And I want everybody to understand, I am not neutral in that context.\n(END VIDEO CLIP)\n(COMMERCIAL BREAK)\n(BEGIN VIDEO CLIP)\nOBAMA: The world that left the age of empire behind, we see Russia attempting to recover lost glory through force. If Russia continues to interfere in the affairs of its neighbors, it may be popular at home, it may fuel nationalist fervor for a time, but over time, it's also going to diminish its stature and maybe its borders less secure.\n(END VIDEO CLIP)\nGIGOT: That was President Obama Tuesday in his final address to the United Nations General Assembly where he chastised Russia for its failure to abide by international norms. The scolding came as the U.S.-baked ceasefire in Syrian collapsed once again, with Russian and Syria regime forces renewing their offensive against the besieged city of Aleppo on Friday, killing 27 civilians in air and ground attacks.\nSo, Bill, the liberal versus the authoritarian conflict, the president recognizing this in year eight.\nMCGURN: Yes. It's -- we're getting a very bright line now. It used to be just a red line. But now it's a really bright red line that he seems to be drawing.\nLook, it depends who you want to compare this to. Compare it to George W.\nBush, when he left, we had Iraq, basically, pacified and so forth. We didn't have a deal with Iran.\n(CROSSTALK)\nGIGOT: We did have trouble in Afghanistan.\nMCGURN: We did have trouble in Afghanistan, but we were in a better place to deal with it because Iraq was much more stable. Now we have the Russians with the foothold in the Middle East, Iran flouting us, flouting their own accord on nukes, we have a militant Russia. This is, again, it's not Harry Truman, you know, with NATO and so forth. It's a very bad situation.\nGIGOT: But I think, Mary, the president would say, that Iran deal is going to be my great legacy, because I have reined in Iran's nuclear program, we'll see how it turns out, but tht will be somebody's else's -- I at least put in place the strictures that could prevent them from getting a nuclear weapon.\nO'GRADY: Yes, he would say that.\n(LAUGHTER)\nGIGOT: And you would say?\nO'GRADY: But, unfortunately, well, what's going to happen after he leaves? Because I think we're already seeing them, you know, trying to break the deal. You know, he says liberalism versus authoritarianism, and we all know where he comes down on this. And I would say when you look at the record, we're not really sure. I mean, look at Latin America. He breathed new life back into the Cuban military dictatorship. He let the Venezuelan consolidate power further to the point where there's actually no chance for a democracy there. Colombia is going to lose its democracy in the next week. El Salvador, Nicaragua, he hasn't done a thing on any of these regimes. Every bit of aggression leaves -- you know, handle it, walking the walk, as to whether or not there might be something that he could. And if he can't -- he doesn't understand that everyone in the U.N. sitting there listening to him knows exactly how indecisive he is.\nGIGOT: Kim, how do you think the world is going to -- and history will consider the president's Syria policy, which is the ongoing civil war continues, ceasefire after the ceasefire breaks down. He wants to stop it, and now there's a debate about whether they should arm our Kurdish allies, but that would upset the Turks. It looks like that's going to continue well past his January 20th date when he leaves town.\nSTRASSEL: Look, I think they're going to ask, what was his policy, because, of course, that's the problem. He never really had an aggressive one. He's never been willing to move against Bashar al Assad. He said recently this will haunt him. It probably should, because what we see going on there is, in essence, a genocide happening in the country, and the United States has been absent without leave from that entire situation, because Barack Obama did not want to commit us to any further engagement overseas. His entire focus has been on the early withdrawal in Iraq. And, in general, our retreat from the world is why so much of it is today on fire.\nGIGOT: All right, Joe, let's try to take the other side, briefly. What do you think -- if we can. What is the -- what is the best legacy the president will leave behind on foreign policy? Are there any big victories? Well, even small victories you can point to.\nRAGO: He made the point in this speech that the world is getting better.\nThere's fewer premature deaths, births, things like that. The pace of technology is improving.\nGIGOT: That's not -- but that's just things getting better.\n(LAUGHTER)\nThat's -- how about Burma? The Burma dictatorship has moved in the right direction. We have an elected government there. They helped nurture that.\nAm I going too far here?\nRAGO: No. You can point to isolated examples of specific policy choices but --\n(CROSSTALK)\nGIGOT: He would say the opening to Cuba is a tremendous victory.\nO'GRADY: It is not a victory. The human rights situation there has deteriorated a lot. And Cuba now is very open about its relationship with North Korea. There's officials going back and forth all the time. They don't even try to hide it anymore.\nGIGOT: So, and things -- opening in Argentina, getting better there.\nThat's not anything having to do with the president.\n(CROSSTALK)\nGIGOT: All right, thank you, Mary.\nWe have to take week.\nKim, start us off.\nSTRASSEL: To Twitter for this week suspending the account of conservative law professor, Glenn Reynolds. In commenting on what motorists should do when surrounded in Charlotte by angry rioters, Mr. Reynolds tweeted, \"Run them down.\" Now, let's be clear, he was not inciting violence. He was talking about the risks of getting dragged out of your car by a mob. And let's also be clear, Twitter has no issue with those who do incite violence, in particular Black Lives Matter tweeters, who say that we should kill cops. If they're going to have a speech code, they should make it clear, and enforce it equally and stop acting as the police speech against just conservative.\nGIGOT: All right, Kim, thank you.\nWilliam?\nMCGURN: Paul, a hit and a miss to the students at Ithaca College. Last academic year, they had a lot of student protests demanding the ouster of the president, saying the university was insufficiently attentive to diversity and inclusiveness. This year, the university responded, gave them most of what they wanted and they had inclusive and diversity circles at the school for discussion. The student paper reports not a single student showed up for this. So, I give them a hit for realizing the worthlessness of these politically correct episodes and a miss for demanding them in the first place.\nGIGOT: All right.\nJoe?\nRAGO: Paul, Ted Cruz came out this week and endorsed Donald Trump, as we mentioned. But to my mind, the bigger news was that Kim Kardashian said she was open to voting for Trump. Now, you could read the fact that this matters as a miss, the shallowness of our politics and the importance of reality TV. But I like to think of it as a hit in the historical sense, because in 2020 or 2024, we're going to look back at this moment and say, we realize that Kim Kardashian was going to be first lady and Kanye West was going to be president.\nGIGOT: All right.\n(LAUGHTER)\nJames, old man?\nJAMES FREEMAN, ASSISTANT EDITORIAL PAGE EDITOR: Can't talk about it.\n(LAUGHTER)\nBut I will give a miss to FBI Director James Comey. He's really tarnishing the reputation of the FBI and, more importantly, denying Americans the vigilant defense of the rule of law they deserve. We learned this week that he gave immunity to Clinton aide, Cheryl Mills. This is along with four others. Seems to have gotten nothing in return, not even a promise to share with the public what happened. And the question for Mr. Comey, he told us no criminal case against Mr. Clinton, why do they all need immunity then.\nGIGOT: All right, thank you, James.\nThat's it for this week's show. I'm Paul Gigot. And we sure hope to see you right here next week.\n ", "external_links": [], "published": "2016-09-24T03:00:00.000+03:00", "crawled": "2016-09-26T23:32:12.470+03:00", "highlightTitle": ""}