{"organizations": [], "uuid": "4805d965d7d1ed3c7f7866cba49fc6f2877166ba", "thread": {"social": {"gplus": {"shares": 1}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 586, "shares": 586, "comments": 4}, "stumbledupon": {"shares": 0}}, "site_full": "www.buzzfeed.com", "main_image": "https://img.buzzfeed.com/buzzfeed-static/static/2016-09/19/7/campaign_images/buzzfeed-prod-fastlane01/thousands-of-life-jackets-have-been-laid-out-in-l-2-14413-1474285502-2_dblbig.jpg", "site_section": "https://www.buzzfeed.com/index.xml", "section_title": "BuzzFeed Index - Latest", "url": "https://www.buzzfeed.com/aliciamelvillesmith/thousands-of-life-jackets-have-been-laid-out-in-london-in-tr", "country": "US", "domain_rank": 137, "title": "Thousands Of Life Jackets Have Been Laid Out In London In Tribute To Refugees", "performance_score": 5, "site": "buzzfeed.com", "participants_count": 1, "title_full": "Thousands Of Life Jackets Have Been Laid Out In London In Tribute To Refugees", "spam_score": 0.0, "site_type": "news", "published": "2016-09-19T17:26:00.000+03:00", "replies_count": 0, "uuid": "4805d965d7d1ed3c7f7866cba49fc6f2877166ba"}, "author": "Alicia Melville-Smith", "url": "https://www.buzzfeed.com/aliciamelvillesmith/thousands-of-life-jackets-have-been-laid-out-in-london-in-tr", "ord_in_thread": 0, "title": "Thousands Of Life Jackets Have Been Laid Out In London In Tribute To Refugees", "locations": [], "entities": {"persons": [{"name": "abdelmoneim", "sentiment": "none"}, {"name": "michael traboulsi", "sentiment": "none"}, {"name": "ben", "sentiment": "none"}, {"name": "rose troup buchanan", "sentiment": "none"}, {"name": "javid abdelmoneim", "sentiment": "none"}, {"name": "ahmad", "sentiment": "none"}, {"name": "alicia melville-smith", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "greece", "sentiment": "none"}, {"name": "calais", "sentiment": "none"}, {"name": "syria", "sentiment": "none"}, {"name": "turkey", "sentiment": "none"}, {"name": "libya", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "ircuk", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "parliament square", "sentiment": "none"}, {"name": "mediterranean", "sentiment": "none"}, {"name": "aleppo", "sentiment": "none"}], "organizations": [{"name": "refugees rose troup buchanan buzzfeed news", "sentiment": "negative"}, {"name": "msf", "sentiment": "none"}, {"name": "un", "sentiment": "none"}, {"name": "buzzfeed news", "sentiment": "none"}, {"name": "turtle productions", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Rose Troup Buchanan BuzzFeed News Reporter 1. Thousands of life jackets used by refugees who made the dangerous journey to Europe have been laid beneath Big Ben in central London. SWNS ID: 9639766 2. Around 2,500 vests were laid out in lines on Parliament Square overnight, creating a dramatic spectacle for commuters on Monday, which was labelled a ‘life jacket graveyard.’ SWNS ID: 9639775 3. Dozens of volunteers arrived at 5 a.m. to unload the lorry carrying the life jackets — 625 of them were used by children. SWNS ID: 9639776 4. The display, which was organised by production company Snappin’ Turtle Productions and supported by refugee charities, is designed to raise the profile of the UN Summit on refugees happening in New York on Monday. \nOn the day of the UN summit we are #WithRefugees. Lifejacket graveyard appearing in Parliament Sq. #LifeJacketLondon — Snappin' Turtle (@snappint) ID: 9639840 5. The life jackets were worn by refugees who crossed the treacherous and deadly stretch of sea between Turkey and the Greek island of Chios. Twitter / @johaneldebo / Via Twitter: @johaneldebo ID: 9639895 6. Snappin’ Turtle director Michael Traboulsi said “each jacket tells its own story, whether it’s an adult or a child or a whole family.” Twitter / @4refugeewomen / Via Twitter: @4refugeewomen “By seeing the jackets first hand we hope people will think carefully about why families are being forced to take such risks and will challenge governments around the world to do more,” he said. ID: 9639906 7. A number of refugees at the Parliament Square talked to people about their experiences of fleeing war. Twitter / IRCUK / Via Twitter: @IRCuk Ahmad, 26, is from Aleppo in Syria and fled in May 2015. He traveled into Turkey after crossing his own country, then from Turkey to Greece in a dingy. \n“The last time I saw a life jacket I was on a dingy with eighty-eight people crossing from Turkey to Greece,” he told BuzzFeed News. Ahmad said half of the people on the boat were women and children, “and they were all crying”. \n“I remember there was one child, he was about two or something, his mother came over with this small, very small, life jacket saying ‘please, please, help me fasten it.’ We found out it was a fake life jacket, and we were so shocked,” he said. “That is what these life jackets bring back.” \nAfter he made it to Greece, Ahmad travelled to the French port of Calais, then was smuggled into the UK in the back of a lorry. ID: 9639941 8. “If you are a Syrian,” he said, “wherever you look there is death. There is bombing, there is shelling, there are snipers. The last resort is sea. But it is still not safe, it is still dangerous.” Twitter / @iankugler / Via Twitter: @iankugler Ahmad said people in Europe and the UK needed to understand the desperation of those trapped in Syria. “Imagine, if you are a father or a mother, you wake up one day and find you are under bombings, under shillings, and the only way you have to [get out] is to cross the sea. \n“Imagine you see your child, your daughter, in front of your eyes in the middle of the sea and you don’t have an option,” he said. “What are you going to do?” ID: 9639953 9. Dr. Javid Abdelmoneim, a Médecins Sans Frontières doctor, said more people needed to speak out about the crisis and that the life jackets were a powerful reminder of the people who didn’t make it. BuzzFeed News ID: 9640523 Abdelmoneim, who worked on the MSF vessel Aquarius for three weeks over the summer, said it was worrying that the number of deaths at sea were already up this year on last year’s total. “but don’t forget, these are the deaths that are counted. Bodies sink.” \n“We don’t know if we are catching every rubber dingy when we are out there in the Mediterranean off the coast of Libyan. This is just counted deaths.” \nHe noticed the type of person making the journey had changed: “Nearly one in five are children, under the age of 18, and about 90% of them are unaccompanied minors. That’s a much larger proportion from last year.” \n“One of my patients was a seven-month pregnant woman with a freshly broken ankle. Her bone was wobbling,” Abdelmoneim said. “What makes that woman get into a rubber dingy in Libya? How does she even get there? She deserves not to have to walk on a broken ankle at seven-months pregnant and not get in a rubber dingy.” ID: 9640499 11. Volunteers will also be at the site all day to answer questions before the life jackets are removed in the evening. Twitter / @DErskineDesign / Via Twitter: @DErskineDesign , Twitter / @HRantonia / Via Twitter: @HRantonia ID: 9639957 Alicia Melville-Smith is a homepage editor and reporter for BuzzFeed News and is based in London. Rose Troup Buchanan is a reporter for BuzzFeed News and is based in London.", "external_links": [], "published": "2016-09-19T17:26:00.000+03:00", "crawled": "2016-09-19T16:06:16.750+03:00", "highlightTitle": ""}