{"organizations": [], "uuid": "f47e433aeb5e576f074b29c3df534ee2608e83d7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.foxnews.com", "main_image": "http://global.fncstatic.com/static/v/all/img/og/og-fn-foxnews.jpg", "site_section": "http://www.foxnews.com/hannity/", "section_title": "Hannity | Sean Hannity | Fox News", "url": "http://www.foxnews.com/transcript/2016/09/19/giuliani-puts-responsibility-for-isis-on-clinton-obama-carson-slams-politically/", "country": "IT", "domain_rank": 185, "title": "Giuliani puts responsibility for ISIS on Clinton, Obama; Carson slams politically correct response to bombings", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "Giuliani puts responsibility for ISIS on Clinton, Obama; Carson slams politically correct response to bombings | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2016-09-19T03:00:00.000+03:00", "replies_count": 0, "uuid": "f47e433aeb5e576f074b29c3df534ee2608e83d7"}, "author": "FoxNews.com", "url": "http://www.foxnews.com/transcript/2016/09/19/giuliani-puts-responsibility-for-isis-on-clinton-obama-carson-slams-politically/", "ord_in_thread": 0, "title": "Giuliani puts responsibility for ISIS on Clinton, Obama; Carson slams politically correct response to bombings", "locations": [], "entities": {"persons": [{"name": "carson", "sentiment": "negative"}, {"name": "clinton", "sentiment": "negative"}, {"name": "giuliani", "sentiment": "negative"}, {"name": "obama", "sentiment": "negative"}, {"name": "mccaul", "sentiment": "none"}, {"name": "steinbeck", "sentiment": "none"}, {"name": "jeb bush", "sentiment": "none"}, {"name": "gorka", "sentiment": "none"}, {"name": "assad", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "tim kaine", "sentiment": "none"}, {"name": "bill clinton", "sentiment": "none"}, {"name": "el-sisi", "sentiment": "none"}, {"name": "brennan", "sentiment": "none"}, {"name": "kelly", "sentiment": "none"}, {"name": "steinback", "sentiment": "none"}, {"name": "tsarnaev", "sentiment": "none"}, {"name": "clarke", "sentiment": "none"}, {"name": "david clarke", "sentiment": "none"}, {"name": "ben carson", "sentiment": "none"}, {"name": "oliver north", "sentiment": "none"}, {"name": "doug schoen", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "rahami", "sentiment": "none"}, {"name": "catherine herridge", "sentiment": "none"}, {"name": "sebastian gorka", "sentiment": "none"}, {"name": "ben carson", "sentiment": "none"}, {"name": "sara carter", "sentiment": "none"}, {"name": "mohamed morsi", "sentiment": "none"}, {"name": "barack obama", "sentiment": "none"}, {"name": "clapper", "sentiment": "none"}, {"name": "boko haram", "sentiment": "none"}, {"name": "comey", "sentiment": "none"}, {"name": "cuomo", "sentiment": "none"}, {"name": "catherine herridge", "sentiment": "none"}, {"name": "petraeus", "sentiment": "none"}, {"name": "gorka", "sentiment": "none"}, {"name": "schoen", "sentiment": "none"}, {"name": "sara carter", "sentiment": "none"}, {"name": "oliver north", "sentiment": "none"}, {"name": "carter", "sentiment": "none"}, {"name": "ahmad khan rahami", "sentiment": "none"}, {"name": "catherine", "sentiment": "none"}, {"name": "doug schoen", "sentiment": "none"}, {"name": "hillary", "sentiment": "none"}, {"name": "rick leventhal", "sentiment": "none"}, {"name": "islamophobes", "sentiment": "none"}, {"name": "rick", "sentiment": "none"}, {"name": "barack obama", "sentiment": "none"}, {"name": "dinesh d'souza", "sentiment": "none"}, {"name": "abu sayyef", "sentiment": "none"}, {"name": "shep smith", "sentiment": "none"}, {"name": "mayor", "sentiment": "none"}, {"name": "joe concha", "sentiment": "none"}, {"name": "al shabaab", "sentiment": "none"}, {"name": "angela merkel", "sentiment": "none"}, {"name": "clarke", "sentiment": "none"}, {"name": "de blasio", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "bozo de blasio", "sentiment": "none"}, {"name": "dinesh d'souza", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "hannity", "sentiment": "none"}, {"name": "dinesh", "sentiment": "none"}, {"name": "fox", "sentiment": "none"}, {"name": "al baghdadi", "sentiment": "none"}, {"name": "vladimir putin", "sentiment": "none"}, {"name": "doug", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "andrew cuomo", "sentiment": "none"}, {"name": "cuomo", "sentiment": "none"}, {"name": "zawahiri", "sentiment": "none"}, {"name": "josh earnest", "sentiment": "none"}, {"name": "sebastian gorka", "sentiment": "none"}, {"name": "bill de blasio", "sentiment": "none"}, {"name": "sean", "sentiment": "none"}, {"name": "rudy giuliani", "sentiment": "none"}, {"name": "rick leventhal", "sentiment": "none"}, {"name": "sara", "sentiment": "none"}, {"name": "morsi", "sentiment": "none"}, {"name": "rudy giuliani", "sentiment": "none"}, {"name": "david clarke", "sentiment": "none"}, {"name": "allen", "sentiment": "none"}], "locations": [{"name": "united states", "sentiment": "none"}, {"name": "iran", "sentiment": "none"}, {"name": "tanzania", "sentiment": "none"}, {"name": "milwaukee", "sentiment": "none"}, {"name": "union county", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "afghanistan", "sentiment": "none"}, {"name": "orlando", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}, {"name": "iraq", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "united states of america", "sentiment": "none"}, {"name": "chattanooga", "sentiment": "none"}, {"name": "middle east", "sentiment": "none"}, {"name": "ohio", "sentiment": "none"}, {"name": "khobar towers", "sentiment": "none"}, {"name": "chechnya", "sentiment": "none"}, {"name": "gitmo", "sentiment": "none"}, {"name": "u.s", "sentiment": "none"}, {"name": "libya", "sentiment": "none"}, {"name": "new york city", "sentiment": "none"}, {"name": "benghazi", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "san bernardino", "sentiment": "none"}, {"name": "new jersey", "sentiment": "none"}, {"name": "sweden", "sentiment": "none"}, {"name": "saudi arabia", "sentiment": "none"}, {"name": "syria", "sentiment": "none"}, {"name": "cleveland", "sentiment": "none"}, {"name": "mars", "sentiment": "none"}, {"name": "north korea", "sentiment": "none"}, {"name": "great britain", "sentiment": "none"}, {"name": "chelsea", "sentiment": "none"}, {"name": "kenya", "sentiment": "none"}, {"name": "hannity", "sentiment": "none"}, {"name": "minnesota", "sentiment": "none"}, {"name": "seaside park", "sentiment": "none"}, {"name": "tehran", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "fort hood", "sentiment": "none"}, {"name": "milwaukee county", "sentiment": "none"}, {"name": "linden", "sentiment": "none"}, {"name": "egypt", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "boston marathon", "sentiment": "none"}, {"name": "belgium", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}, {"name": "soviet union", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}, {"name": "new york city", "sentiment": "none"}], "organizations": [{"name": "isis", "sentiment": "negative"}, {"name": "fox news alert", "sentiment": "negative"}, {"name": "red bull", "sentiment": "none"}, {"name": "fox news", "sentiment": "none"}, {"name": "fox news", "sentiment": "none"}, {"name": "al qaeda", "sentiment": "none"}, {"name": "fox news", "sentiment": "none"}, {"name": "islam", "sentiment": "none"}, {"name": "congress", "sentiment": "none"}, {"name": "solidarity", "sentiment": "none"}, {"name": "new york police department", "sentiment": "none"}, {"name": "cnn", "sentiment": "none"}, {"name": "holy land foundation", "sentiment": "none"}, {"name": "nice", "sentiment": "none"}, {"name": "clinton foundation", "sentiment": "none"}, {"name": "supreme court", "sentiment": "none"}, {"name": "fbi", "sentiment": "none"}, {"name": "new york post", "sentiment": "none"}, {"name": "boston marathon", "sentiment": "none"}, {"name": "taliban", "sentiment": "none"}, {"name": "muslim brotherhood", "sentiment": "none"}, {"name": "al qaeda", "sentiment": "none"}, {"name": "fmr", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Published September 19, 19, And this is a Fox News Alert. Terror rocked the United States this weekend. And welcome to \"Hannity.\" Twenty- eight-year-old Ahmad Khan Rahami, a naturalized U.S. citizen born in Afghanistan, captured by police earlier today. Now, he's suspected of setting off bombs this weekend in New York and New Jersey.\nNow, for the very latest, we'll go to Fox News's Rick Leventhal. He's got -- standing by with what's happening. Rick, what's going on?\nRICK LEVENTHAL, FOX NEWS CORRESPONDENT: Sean, remarkably fast work by law enforcement who caught Rahami after a shootout in Linden, New Jersey, just three hours after the FBI released his photo and roughly 48 hours after that first explosive device, the pipe bomb, went off in Seaside Park, New Jersey.\nThe blast here in Chelsea Saturday night injured 28 people, many hit by shrapnel, including BBs and ball bearings, from the pressure cooker bomb that was very similar to the one used by the Boston Marathon bombers. A second pressure cooker bomb four blocks to the north of us did not detonate. And pipe bombs at a train station also failed to explode, even after a couple of homeless guys grabbed the backpack the bombs were in and carried it a thousand yards. A police robot later detonated one of those devices.\nAnd late today, after that shootout that left several officers hurt and Rahami with a couple of bullet wounds, he was charged in Union County, New Jersey, with five counts of attempted murder of a law enforcement officer and weapons charges. He's being held on $5.2 million bail, and his first court appearance tentatively set for next Wednesday, September 28th.\nBut Sean, Rahami will also likely will hit with numerous state and federal charges in connection with the attack, so he likely won't be bonding out of jail anytime soon.\nHANNITY: All right, Rick Leventhal, thank you.\nAlso tonight, authorities say Rahami was not on law enforcement's radar before the bombings. Joining us with more, Fox News chief intelligence correspondent Catherine Herridge.\nNow, Catherine, he did apparently -- sued police, along with his family, for profiling of Muslims, correct?\nCATHERINE HERRIDGE, FOX NEWS CORRESPONDENT: Well, that's right. We're going to get to that in just one second, Sean.\nLate today, there was new information about prior contact between the FBI and the suspect Rahami after a domestic dispute. The victim there alleged that Rahami also showed signs of possible radicalization at that time. Two sources confirmed the FBI followed up on the lead, but there was not enough to pursue it at that time, and the original allegations were withdrawn.\nHere's how the FBI described the episode at today's news conference.\n(BEGIN VIDEO CLIP)\nUNIDENTIFIED MALE: There's nothing to indicate that, currently, he was on our radar. We had a report of a domestic incident some time ago. That was -- the allegations were recanted, and I don't have any other information. We'll keep digging.\n(END VIDEO CLIP)\nHERRIDGE: The FBI is very focused on Rahami's overseas travel and at least three trips to his native Afghanistan. A law enforcement source says the frequency of the trips was not suspicious at the time because of his family ties, and the number of trips did not suggest Rahami had outside help to pay for the flights. A second law enforcement source backed up that account, adding the FBI is now investigating who Rahami met with overseas and whether they planted the seeds of radicalization.\nRahami immigrated to the U.S. legally with his family when he was 7 years old, and he is also a naturalized U.S. citizen. And while police say they are not looking for other suspects or a broader cell, they are running down leads from the New York City surveillance video where the pressure cooker bomb exploded, injuring 29.\n(BEGIN VIDEO CLIP)\nUNIDENTIFIED MALE: We identified -- well, we have a video of two persons who picked up the bag, took the device out of it and then walked off with the bag. Now, we went back to see where they came from. They looked like they were two gentlemen just strolling up and down 7th Avenue at the time. We have no information that would link them to this at all. However, we still want to talk to them.\n(END VIDEO CLIP)\nHERRIDGE: Based on the news conferences today, there was really a long stretch from 2002 until 2012 where there was a dispute over the family's restaurant, and according to court papers, they sued at one point alleging that they were being marginalized and targeted because of their faith, Sean.\nHANNITY: All right, Catherine Herridge, thank you.\nAmericans are on edge tonight, and a Drudge Report headline from earlier today -- it sums it up best. It say, \"ISIS among us.\" The bombings in New York and New Jersey weren't the only terror-related attack this weekend. On Saturday, a 22-year-old Somali man stabbed 10 people at a mall in Minnesota. It is being reported that he mentioned Allah-u Akbar during the attack and allegedly asked one of the victims if he was a Muslim. ISIS, in fact, has claimed responsibility for that bloody rampage.\nAnd that's not all. Late last week in New York City, a homeless Palestinian man with a Jordanian passport -- well, he went after police officers with a meat cleaver after they caught him trying to remove a boot from his car. A boot is one of those things that prevents a car from leaving a parking spot. If you don't live in New York, you might not understand that.\nBut anyway, according to The New York Post, the U.S. was trying to deport him, and he was shouting Allah-u Akbar once again before lunging at police. One of the brave officers was released from the hospital on Friday. Look at this video, struck in the face by a meat cleaver. He needed 70 stitches in his face -- 70! Anyway, that's among the news for today.\nAnd joining us now, we have former New York City mayor -- no? Rudy Giuliani is with us, apparently. OK. Mr. Mayor, how are you?\nRUDY GIULIANI, FMR. NEW YORK CITY MAYOR: How are you, Sean?\nHANNITY: Let me start with -- you know, this guy recently went to Afghanistan. One of his friends was interviewed earlier with Shep Smith on Fox today, and I paid very close attention. He's saying that he changed when he went there.\nYou know, if somebody's going to visit Afghanistan, Iraq, Syria, Saudi Arabia, why is that a red flag in my mind? Is that fair?\nGIULIANI: Sean, that's very fair. And I disagree with the FBI analysis of this, and I disagreed with it also with regard to the Boston Marathon bomber, Tsarnaev. I thought it was a major red flag when he not only went to Russia, but he went to Chechnya.\nAnd here's -- here's what I object to and what I'd like to know the answer to. Did they give that information to the local police? Because if they didn't, then the FBI needs to be straightened out also, and somebody has to have the courage to say that.\nWhen the FBI has information like this, the reason they're not following up on it is because there are only 14,000 FBI agents. There are 36,000 New York City police officers. There are over 800,000 sworn law enforcement officers in the United States. The FBI has to begin to give this information to the local police because maybe they'll have the extra cop or two that can watch a guy like this.\nNow, I put the responsibility for ISIS completely on Obama and Hillary Clinton. This would not have happened had they not withdrawn the troops from Iraq. They were handed a somewhat stable Iraq that, miraculously, the surge under Petraeus worked. We had stabilized Iraq. We had used the Sunnis to fight for us to win the eastern part of Iraq.\nAnd then when Obama imposed his deadline -- I have no idea what kind of irrational mind would think you should have a timetable for a war. But when we pulled out, a lot of those Sunnis went into the hills, and the other Sunnis joined ISIS. That joined up with the Syrian rebels, and then all of the sudden...\nHANNITY: And it's even worse...\nGIULIANI: ... the JV team...\n(CROSSTALK)\nHANNITY: It's worse because they have the oil! As an ability...\n(CROSSTALK)\nHANNITY: ... pay for it!\nGIULIANI: And we left them with a fountain of gold, right? We left them with a fountain of gold, and they are now in 28...\nHANNITY: (INAUDIBLE)\nGIULIANI: They are now in 28 countries. In the last year, we've had more attacks in America than at any time from September 11. From September 11 until Obama, we had no attacks on America. They've all started under Obama. They are provoked by his weakness, by her weakness, by her having the government of Libya overthrown, where ISIS also has a major stronghold. We've lost four Americans there. She seems to have forgotten that.\nHANNITY: Let me -- let me ask you this...\nGIULIANI: And we're living in a much more complex and dangerous world than we were living in before Barack Obama and Hillary Clinton came into office.\nHANNITY: You know, Hillary voted for that war, and then she pulled out of the war. As you said, they gave a drop-dead. That created the vacuum for ISIS.\n(LAUGHTER)\nHANNITY: No, this is important. And then she callously said recently, I made a mistake. We've got to learn from the mistake. Now, if I'm the parent of one of the nearly 5,000 people that died there, or if I'm one of the brave men and women that fight, bled, lost a limb, a leg, an arm, or was disfigured, and oops, I made a mistake and we got to learn from it -- that's a pretty severe mistake.\nGIULIANI: Sean, I don't know what Hillary is good at. I can tell you what she's not good at, foreign policy.\nHANNITY: Well, I...\nGIULIANI: She voted for the war, then she was against the war. She was against the surge. She embarrassed Petraeus, you might remember, when he appeared before Congress to describe how the surge was working.\nAnd the reality is, everything in the world that was handed over to her when she became secretary of state was much worse when she left office, not to mention all the e-mails that she exposed and all the money that she took for the foundation, for the Clinton Foundation.\nI mean, the reality is that this woman's knowledge of foreign affairs is like...\nHANNITY: But this is as big a choice election as I think we'll ever see in our lifetime, on every big issue, from \"Obama care\" to the economy to the Supreme Court justices. But there are three issues that impact this issue profoundly. One, one candidate can say the words \"radical Islam.\"\nGIULIANI: Thank God.\nHANNITY: I mean, the tortured -- the tortured pretzel, you know -- they're turning themselves into pretzels. They ride a razor's edge of political correctness. They can't say it!\nAnd here's the other two. Building a wall will protect the country, and extreme vetting. Here's my question on vetting. Hillary wants a 550 percent increase in refugees.\nGIULIANI: Right.\nHANNITY: Our -- every top law enforcement official, intelligence official, Comey, Clapper, Steinback (ph), McCaul, General Allen have all warned, and Brennan -- all warned that ISIS will infiltrate the refugee population. She wants a 550 percent increase.\nHere's my question. If somebody -- I know the Saudis, for example, gave her, what -- foundation up to $25 million, $10 million for the library. So if you grow up in a country where as a man, you get to tell women they can't drive, you get to tell women what to wear, you get to say whether they go to work or school or can leave the country, you get -- you -- you grow up in a country where they kill gays and lesbians, where they persecute Christians and Jews. She takes their money. They buy her silence.\nIf you grow up under that cultural divide, a direct -- the direct antithesis to our constitutional republic, why can't we ask if you want to abide by our laws and our culture before you come here? Why is that described as bigoted?\nGIULIANI: Not only should we ask that, that's the oath that you take when you become a citizen of the United States. You renounce allegiance to all other sovereigns. You pledge allegiance to the United States and you pledge you'll give up your life in defense of the United States.\nSo when we say that we want people, as Donald Trump says, that come to the United States who love this country, that's built right into our Constitution. Hillary Clinton doesn't understand our Constitution. She doesn't respect our Constitution. Her knowledge of foreign policy is a joke. Her performance in foreign policy was a disaster. Every single thing in the world is worse.\nHANNITY: But let me ask you this question because Donald Trump said today -- now, by the way, CNN -- I just read Joe Concha's column in The Hill -- he never said racial profiling. He said profile. Now, should we profile...\nGIULIANI: Of course you profile!\nHANNITY: ... people that have a huge cultural divide and grow up in a society that says, We're going to kill gays and lesbians and we're going to tell women how to dress and we're going to persecute Christians and Jews?\nGIULIANI: Sean -- Sean...\nHANNITY: I want to profile them!\nGIULIANI: Sean, I investigated lots of crimes, right?\nHANNITY: Right.\nGIULIANI: I used FBI profilers to help me figure out who the killer was, who the person was. If I have a few little -- if I have a few little pieces of information, the guy's 6-5 and he's white, I don't go look for a 5-foot-4 black.\nHANNITY: Yes.\nGIULIANI: Profiling is absolutely appropriate and necessary to solve crime...\nHANNITY: Do you know...\nGIULIANI: ... so long as it's based on fact and not prejudice.\nHANNITY: After 9/11...\n(CROSSTALK)\nHANNITY: ... the NYPD had a mosque surveillance program, and Comrade Bozo de Blasio, is what I call him -- he eliminated that program. Was that a mistake?\nGIULIANI: Big mistake. Now, he looked pathetic this weekend.\nHANNITY: Oh, it was so embarrassing. It was humiliating.\nGIULIANI: As a former mayor of New York...\nHANNITY: Embarrassing!\nGIULIANI: ... I was embarrassed watching him on television. He couldn't even say that a bombing was an act of terror.\nHANNITY: He was so bad.\nGIULIANI: Governor Cuomo had to come in almost as if he was his mentor and say, Hey, by the way, you know, if there's a bomb and it hurts 29 of your citizens, it's an act of terror. Then we'll figure out if it's Islamic or not.\nHANNITY: It was an intentional act. We did get that information...\nGIULIANI: It was an intentional act...\nHANNITY: ... intentional bomb threat (ph).\nGIULIANI: But not an act of terror. A bombing in and of itself is an act of terror. It can be Islamic terror. The odds are that it is Islamic terror.\nI'm going to tell you, Sean, the moment I heard about it, the moment I heard what kind of bomb it was, I knew exactly where it came from.\nHANNITY: Anybody with common sense did.\nGIULIANI: We're fighting a two-front war. We're fighting a war over in the Middle East, and we're fighting a war on the streets of America. And Obama, Clinton and this guy they have on the ticket, Tim Kaine, who says that we're winning...\nHANNITY: Yes.\nGIULIANI: If this is winning...\nHANNITY: The JV team.\nGIULIANI: ... I'd hate to be losing! We're winning and we've -- how many attacks have we had since San Bernardino? And this guy on her ticket thinks we're winning. He must be living on Mars.\nHANNITY: All right, Mr. Mayor, thank you for being with us.\nGIULIANI: Thank you.\nHANNITY: And by the way, all of you out there, in 50 days, think of the three big issues just on this issue where there are profound differences. Do you want a president that can say the words \"radical Islam\"? Do you think it's important for national security to build a wall along our border? And do you think vetting people that come from countries like Saudi Arabia, where they treat women like third-class citizens, they kill gays and lesbians, and of course, persecute Christians and Jews -- do you think somebody coming from that culture that we should be vetting?\nUp next tonight right here on \"Hannity\"...\n(BEGIN VIDEO CLIP)\nMAYOR BILL DE BLASIO, D-NYC: We're not going to jump to conclusions. We're not going to offer you easy answers.\nGOV. ANDREW CUOMO, D-N.Y.: So we know what we know at this point, and I'd be dubious about speculating on what we don't know.\n(END VIDEO CLIP)\nHANNITY: All right, so after the bombings this weekend in New York and New Jersey, Democrats went out of their way to thread the needle. They never wanted to say that this was a radical Islamic terrorist attack. Why this mysterious reluctance, resistance? We'll check in with Lieutenant Colonel Oliver North and Dr. Ben Carson.\nThat and much more on this busy news night tonight on \"Hannity.\"\n(COMMERCIAL BREAK)\nHANNITY: And welcome back to \"Hannity.\" So the Democrats continue to prove they just don't get it. So in the aftermath of the New York and New Jersey bombings, you know what your liberal leaders were telling you? Well, they all said, Don't rush to judgment. It's probably not terrorism. No, it's an isolated incident. They're not connected, even though they all happen to have flip phones cell triggers just by coincidence.\nHILLARY CLINTON, D-PRESIDENTIAL NOMINEE: I think it's always wiser to wait until (INAUDIBLE) you have information before making conclusions.\nDE BLASIO: We're going to be very careful and patient to get to the full truth here. We are not going to jump to conclusions. We're not going to offer you easy answers. We're going to make sure we have all of the facts.\nCUOMO: You can guess, you can hypothesize, or you can just wait for the facts and go from there. So we know what we know at this point, and I'd be dubious about speculating on what we don't know.\nPRESIDENT BARACK OBAMA: I would ask that the press try to refrain from getting out ahead of the investigation. It does not help if false reports or incomplete information is out there.\n(END VIDEO CLIP)\nHANNITY: All right, here with reaction now is the host of \"War Stories,\" Lieutenant Colonel Oliver North.\nColonel, you know, once again, the mysterious reluctance, resistance -- man-caused disasters, overseas contingencies, workplace violence, and now we're threading a new needle here. This was an intentional act. It was intentional. A bomb being set -- geez, talk about stating the obvious.\nOLIVER NORTH, \"WAR STORIES\" HOST: And then we have Josh Earnest saying it's a narrative (ph) war. I would commend to him to pay a little attention to all the bodies that come back draped with American flags.\nLookit, I've got the answer for them. And I don't take a second from Ben Carson because I know he's up next. Here's the slogan for the next commander-in-chief of the United States of America. Stop the jihad. It doesn't matter the trade name, ISIS, al Qaeda, al Shabaab, Boko Haram, Abu Sayyef, all of them are just different trade names for these franchises from hell, all of them pushing the same product, death to infidels like us.\nHere's how to stop the jihad being waged against us. Number one, it's not enough to condemn in the strongest terms or beg for more time or investigations (INAUDIBLE) stand shoulder to shoulder. That's baloney, and the jihadis know it.\nNumber two, stop guessing about whether the perps are directed, inspired, radicalized or lone wolves! They're all jihadis. Pledge to stop the jihad.\nNumber three, commander-in-chief has to lead Western leaders to known jihadi safe havens where self-proclaimed leaders like al Baghdadi and Zawahiri can create their own propaganda.\nNumber four, they have to be killed. And when they're killed, don't hold a press conference to show pictures of POTUS and his pals wringing their hands in the Sit Room.\nNumber five, forge a Sunni-Kurd-Egyptian-Jordanian-UAE-Saudi force to end the Syrian civil war and keep the peace.\nNumber six, the next commander-in-chief has to cancel the Iran nuke deal and break the perception that the United States is joined at the hop with the ayatollahs in Tehran! It will deny a hot button issue to all jihadis.\nNumber seven, keep Gitmo open, try enemy combatants in military tribunals, stop the unvetted refugees from entering the United States and start a public diplomacy program like we did against the Soviet Union with Solidarity -- Radio Liberty, Radio Freedom.\nAnd finally, just like the mayor just said a moment ago. America's mayor was right. Reactivate the surveillance programs like New York Police Department Commissioner Kelly created back when he was mayor and that de Blasio abandoned.\nThere's the eight ways and...\nHANNITY: By the way, the only way those things -- and I agree wholeheartedly with all eight on your list -- that's going to happen is if Donald Trump is elected because Hillary won't do it.\nLet me give you another example. She not only screwed up, you know, voting for the Iraq war, then giving a date of return and then saying, Oops, sorry, we made a mistake, sorry about your sons and daughters dying. I'm sorry about you being disfigured and losing your legs and your arms. We have to learn from that.\nBut she's made a lot of mistakes. Then we've got -- we've got Iraq, Afghanistan and we've got Syria. Then you've got, of course, the Russian reset. She hasn't done anything with North Korea.\nAdd to that, though, Donald Trump met tonight with President el-Sisi of Egypt. And Hillary, though, and Obama -- they supported the former Muslim Brotherhood head...\nNORTH: Listen...\nHANNITY: ... a guy by the name of Morsi and gave him F-16s, tanks and $1.5 billion taxpayer, a guy that once referred to the Israelis and Jews as \"descendants of apes and pigs.\" Is there any place foreign policy-wise that you can point to where she has had a success story to tell?\nNORTH: Yes. She traveled to more places than any previous secretary of state.\nHANNITY: That's not a success story.\nNORTH: I'm just -- that's part of her legacy. Lookit, Sean, we cannot undo the damage that these people have done in the last eight years. What we can do is rectify it. And the ways you rectify that is having a foreign policy that's America first -- I'm not trying to Quote: a campaign -- and that supports the ideals of the American people. We don't have that today.\nOne of the big reasons why their -- the -- the disconnect that's occurred is because the folks who've been running our government for the last eight years are in nirvana. Look at the way they talk! They don't want to make a conclusion about a bomb going off, for crying out loud. I mean, everything that they have done has been done wrong. We can't undo what they did, but we can fix it.\nHANNITY: Well, I agree, Colonel. You had it right, I had it right and they had it wrong, and the Iranian deal is at the heart of the worst decision they made.\nNORTH: Absolutely right.\nHANNITY: Libya second, Iraq and Syria a close first, second and third, and Egypt another mistake. Thank you, sir. Appreciate it. Safe home.\nNORTH: Bless you, buddy. Appreciate you.\nHANNITY: All right, joining me now, former 2016 presidential candidate Dr. Ben Carson. Dr. Carson, what is your reaction to this mysterious reluctance and resistance to say the words \"radical Islam\"? Why is that so hard?\nDR. BEN CARSON, FMR. PRESIDENTIAL CANDIDATE: I believe it's the loss of common sense. People are so caught up in their political correctness that they lose control of rational thinking. And unfortunately, this is exactly what the radical Islamists want.\nThe memorandum of understanding that was uncovered during the Holy Land Foundation trial -- they found this memorandum, and it talked about civilization jihad, how they would be able to take over here, and they would use our political correctness against us.\nIt really is quite silly. And it seems like all we have to do is look at Europe, look at France, look at Germany. Can we learn from their mistakes, or do we have to make the same mistakes over again? It really is just maddening how we've completely lost our senses.\nHANNITY: You know...\nCARSON: And you know, this whole thing about profiling -- you know, forget about the label. People are so concerned about the label. If you know that there's a mass murderer who's 7 feet tall and has green eyes and you're in a room full of people, which ones are you going to look for? You're going to look for the tall ones with green eyes. Doesn't mean that every tall one with green eyes is the one. But certainly, that's the group that you need to be concentrating on. That's common sense!\nHANNITY: Dr. Carson, we're 50 days away from election day tonight, 50 days. So I view this as one of the biggest choice elections. Number one, Supreme Court. It will impact this country for generations. Extreme vetting or no vetting, a wall as Trump wants, or a bridge and what Hillary wants. Saying radical Islam, not being able to say it. You know, \"Obama care\" eliminate it, repeal, replace it, or keep it.\nOn so many big issues -- education, energy independence...\nCARSON: Absolutely.\nHANNITY: These are deep and profound differences between these two candidates. What do you say to those Republicans that have been sabotaging and undermining Donald Trump, and I would argue, helping Hillary Clinton in the process?\nCARSON: I would say to them this is not going to be a four or an eight- year issue. You think that we can just blow through this and Hillary will be OK because she's a known quantity. Wrong. The problem here is that when you get the federal court system and the Supreme Court in the hands of those radicals, it will be there for a generation or two.\nHANNITY: Oh, at least!\nCARSON: And the United States will never be the same again.\nHANNITY: I don't know if...\n(CROSSTALK)\nCARSON: ... need to understand.\nHANNITY: Economic policy, raising taxes, cutting taxes, energy independence, education back to the states or top down Common Core from Washington, you know, supporting -- supported by the NEAS (ph).\nCARSON: Absolutely.\nHANNITY: It's deep and profound.\nCARSON: And you know, it's not -- it's not a Republican or Democrat issue. This is an American issue. People have got to get beyond that because we're talking about our children.\nHANNITY: Are we going to see you in Ohio, in Cleveland on Wednesday for our town hall with Mr. Trump?\nCARSON: I will be there.\nHANNITY: All right, we'll see you there. Dr. Carson, thank you.\nCARSON: Looking forward to it.\nHANNITY: And coming up next tonight, we'll give you details on that town hall in a few minutes. But up next on \"Hannity\"...\n(BEGIN VIDEO CLIP)\nDONALD TRUMP, R-PRESIDENTIAL NOMINEE: We want people to come into our country, but they have to come in legally through a process, and we need extreme screening!\n After a wave of terror attacks right here on U.S. soil, Donald Trump is calling for extreme vetting of refugees and immigrants. We'll check in with Dr. Sebastian Gorka. He's next.\nThat and more tonight straight ahead on \"Hannity.\"\n(COMMERCIAL BREAK)\n(BEGIN VIDEO CLIP)\nTRUMP: These attacks and many others were made possible because of our extremely open immigration system which fails to properly vet and screen the individuals or families coming into our country.\nWe should temporarily suspend immigration entirely from regions where safe and adequate screening with cannot occur.\nThe pro-immigrant position is the position that favors tough screening and tight controls. And we want people to come into our country, but they have to come in legally through a process, and we need extreme screening.\n(END VIDEO CLIP)\nHANNITY: Donald Trump talking about his plans for extreme vetting for refugees and immigrants who want to enter the U.S. Here now, the author of \"Defeating Jihad, The Winnable War,\" Dr. Sebastian Gorka. So Clapper, Comey, Brennan, if you look at the names, Steinbeck, McCaul, General Allen, all said ISIS will infiltrate. Trump is listening, and he's saying, OK, if they're going to infiltrate, we better vet them to keep Americans safe. Why is Hillary Clinton and Barack Obama willing to gamble with the lives of Americans, because that's what they're doing? Why would they be willing to do that?\nDR. SEBASTIAN GORKA, AUTHOR, \"DEFEATING JIHAD\": It's part of their ideology, Sean. Remember, these are people that are shaped by the one world multiculturalism. These are postmodern secularists, and they think it's unfair to close our borders. We had the former secretary of homeland security, state recently that our borders should be porous. There should be no such thing as airtight borders. It's not about national security, Sean. It's about ideology. It's about one world multiculturalism.\nHANNITY: What is the ideology expect that if you don't listen to these top intelligence officials saying yes, ISIS will infiltrate, then if they come in and they kill Americans, then don't you bear part of the responsibility for those Americans that are victims of whatever terror attack they bring with them?\nGORKA: As we've discussed before, Sean, reality is optional on the left. It's not about truth. It's about their narrative. Look at this weekend. We've had 11 devices deployed. Only a handful of them exploded. But 11 devices were deployed, IEDs. How many people have to walk around America with shrapnel in their bodies, how many people have to be killed or maimed until they say yes, there is a threat? ISIS said they're going to use refugee streams, and you know what, they've done it in Europe.\nHANNITY: So let me ask you this. We know there are 88 sharia courts in Great Britain. We know the no-go zones are real. I don't care how many times the liberal says they're non-existent when they are. We know what happened -- look at what happened with Angela Merkel. Her party was destroyed in the elections. Add to that Belgium, add to that Sweden, all to that all of Europe and the impact that this is having -- the Islamization of Europe.\nSo I guess with 50 day to go we're going to elect a president that either acknowledges radical Islam, that will vet these refugee to keep American safe, build a wall to protect our borders, or we won't. So the Americans have a very clear choice, don't they, in 50 days?\nGORKA: Sean, this has become a national security election. I believe in my heart the majority of Americans when they walk into that polling both will be making this decision. Which person is going to protect me and my family? Is it Donald Trump who has declared war on the Islamists, or is it Hillary Clinton who until the Nice attack wouldn't even use the word \"jihad\" to describe our enemies? Which one is going to protect us?\nHANNITY: She's still playing word games and threading a needle and is afraid and doesn't want to hurt people's feelings. All right, Dr. Gorka, always good to see you. Thank you.\nGORKA: Thank you, Sean.\nHANNITY: And up next, tonight right here on this busy news night on HANNITY.\n(BEGIN VIDEO CLIP)\nCLINTON: A lot of the rhetoric we've heard from Donald Trump has been seized on by terrorists.\nTRUMP: Hillary Clinton talks tougher about my supporters than she does about Islamic terrorists.\n(END VIDEO CLIP)\nHANNITY: It says a lot about Hillary, doesn't it? Anyway, Hillary accuses Trump of aiding ISIS, really? He's firing back on the campaign trail. Sheriff David Clarke, Dinesh D'Souza, they're next.\n(COMMERCIAL BREAK)\n(BEGIN VIDEO CLIP)\nCLINTON: We know that a lot of the rhetoric we've heard from Donald Trump has been seized on by terrorists, in particular ISIS, because they are looking to make this into a war against Islam.\nSecondly, we know that Donald Trump's comments have been used online for recruitment of terrorists. The kind of rhetoric and language that Mr. Trump has used is giving aid and comfort to our adversary.\n(END VIDEO CLIP)\nHANNITY: Wait a minute, Hillary. Maybe you being part of negotiations with the number one state sponsor of terror, that being Iran, and giving them $150 billion, the right to spin their centrifuges, the right to partner with Vladimir Putin and build missile defense and build up their conventional forces, oh, and the brilliance of 25 days notice before inspections, not any place any time. Pretty despicable.\nAnd then I can add to that Libya and the disaster there. Then we can add to that your support of a man who was a former head of the Muslim Brotherhood in Egypt who once referred to Jews as descendants of apes and pigs. And we might want to talk about some other places in the world like Syria when you draw a red line in the sand and don't follow up about it.\nAnyway, here's what Trump said about his Democratic rival earlier today at a rally in Florida.\n(BEGIN VIDEO CLIP)\nTRUMP: The president of United States, or my opponent, and both won't even say the words \"radical Islamic terror.\"\n(BOOS)\nTRUMP: In fact, Hillary Clinton talks tougher about my supporters than she does about Islamic terrorists, right?\n(END VIDEO CLIP)\nHANNITY: What a profound point. Joining us now, Milwaukee County Sheriff David Clarke as well as the creator, bestselling author of \"Hillary's America\" Dinesh D'Souza. Sheriff, I think Trump's right. She's more mean, harsh, combative, not towards Iran, not towards Assad and Syria, not toward a guy who refers to Jews as descendants of apes and pig, not toward ISIS, but towards Trump. What is wrong with that priority?\nSHERIFF DAVID CLARKE, MILWAUKEE COUNTY: Well, Sean, if ISIS has seized on anything, it's been the weakness of President Barack Obama. Mrs. Bill Clinton and Barack Obama are sleepwalking through this war on terror. They have absolutely no sense of urgency. She keeps saying we need to move slowly on this. Someone ought to give her a Red Bull, because the wolf is at the door. The wolf is chewing through the door.\n(LAUGHTER)\nCLARKE: She has a record of performance, and it's called Benghazi.\nHANNITY: She makes Jeb Bush look like the energizer bunny. She does make Jeb Bush look like the energizer bunny. There's no doubt. She's like, you know, low energy on steroids in a way.\nDinesh, you did this whole thing, we're all a basket of deplorables in Hillary's mind, you know, Islamophobic, misogynist, sexist, homophobic, xenophobic. She's so critical, but she's best friends with Iran and Mohamed Morsi and didn't do anything in Syria or Libya. It makes you think that Donald Trump has a pretty good point here.\nDINESH D'SOUZA, \"HILLARY'S AMERICA\": The bizarre thing about what Hillary is saying is essentially she's saying that to call out the radical Muslims and to fight them is to play into their hands, that basically if you attack them verbally and if you declare a plan to defeat them, this is going to help them with their recruitment videos.\nEssentially Donald Trump has never said that most or all Muslims or terrorists. But what he is implying is a politically incorrect truth, which is that most terrorists are Muslims. This is true in America. It's true around the world.\nHANNITY: You raise a good point. The 9/11 Commission report said after the Khobar Towers, the embassy bombings in Kenya and Tanzania, after the first Trade Center bombing and the USS Cole, they concluded, Sheriff Clarke, they, radical Islamists, were at war with us. We weren't at war with them.\nNow, let's jump ahead, the next 9/11 happens because we now are at a pre- 9/11 mentality because of Obama and Hillary. Are we going to refer to New York and New Jersey, are we going to refer to San Bernardino and Chattanooga and Fort Hood and Orlando, and are we're going to say, oh, they were at war with us and Hillary Clinton was worried about offending them.\nCLARKE: Well, Clinton and Obama plainly do not get it when it comes to the threat that we face here with radical Islamic terrorism. Donald Trump is right. He will have a strategy. After listening to his military commanders, his national security people, and his homeland security people, and he will present a clear and coherent strategy to go after these individuals. Until then we're going to have to get used to these attacks unfortunately.\nHANNITY: It sounds like she's willing to kiss their ass and appease them. Isn't that what -- it sounds like, oh, please, I don't want to offend the terrorists. That's what it sounds like to me.\nCLARKE: Well, Clinton's strategy is to call the American people Islamophobes. That's her terror strategy, and to lecture us on how we need to be nice to terrorists in order to appease them.\nHANNITY: If we kiss their ass and suck up, they'll be nicer to us? If we give them $150 billion, the Iranians will like us, Dinesh?\nCLARKE: It's been a disastrous strategy.\nD'SOUZA: Sean, just listen to the absurdity of what Obama and Hillary are saying. Take this fellow Rahami in New York. He's pretty typical of Islamic terrorists in the sense that he's been a Muslim all of his life. He sees what he is doing as an expression of his own piety. Obama and Hillary, who are not Muslims, are presuming to tell Muslims, pious Muslims who are acting in the name of Islam that they are not truly Muslims. And they're expecting anyone with a straight face to believe this absurdity.\nHANNITY: Let's kiss the ass of every radical Islamist and let's not a thing. Let's not offend them. And maybe if we give them $150 billion, or give Mohamed Morsi F-16s and tanks and $1.5 billion in cash, maybe they'll be -- if we're nice to the Islamists they'll be nicer to us. That is beyond naive. Guys, thank you.\nComing up, Donald Trump and Hillary Clinton clash on the campaign trail taking in -- they're talking about refugees. Sara Carter and Doug Schoen, they'll join us next as we continue straight ahead.\n(COMMERCIAL BREAK)\nHANNITY: And welcome back to \"Hannity.\" Election Day is only 50 days away, and tonight all Americans are talking about this weekend's terrorist attacks. Here with reaction from Circa Sara Carter, and FOX News contributor Doug Schoen. Doug, let me start with you.\nDOUG SCHOEN, FOX NEWS CONTRIBUTOR: Sure.\nHANNITY: It's pretty disgusting, you know, with all of these people attacking and all these terrorist attacks, Hillary says Donald Trump saying \"radical Islam\" is aiding and abetting, especially from a woman that sucked up to the Iranians, gave them $150 billion, did nothing when the Syrians used weapons of mass destruction on their own people, and even more, supported Mohamed Morsi of the Muslim Brotherhood.\nSCHOEN: On a day like today what Secretary Clinton should have done is we all stand together, including me and Secretary Clinton, against terror and against Islamic radicalism.\nHANNITY: She can't say radical Islam.\nSCHOEN: To say what she said is a political and profound mistake. The fact that she said what you Quote: d is wrong on the merits, it's wrong substantively, and I think she needs to change her approach if she's going to benefit in the debates. I was disappointed as a Clinton supporter who was hoping for more.\nHANNITY: Sara, that is a pretty strong reaction are from a Democrat.\nSARA CARTER, CIRCA NEWS: It is.\nSCHOEN: An American.\nHANNITY: An American Democrat.\nCARTER: An American Democrat. Yes, but he's right. It's a fallacy on its face. I mean, ISIS does not need Trump to garner support. I mean, that is just a complete fallacy on its face. And when you look at what Hillary Clinton is trying to establish, it makes no sense, Sean. All you have to do is talk to law enforcement, talk to adjudicators, talk to federal law enforcement officials that have to deal with this every day, vetting people coming into the United States. I mean, we have no capabilities. We don't have the resources. We don't have the appropriate tools to do this.\nHANNITY: We're short on time. Three big issues in this campaign -- a president that can say radical Islam, one that won't. You've got somebody who wants extreme vetting, somebody that doesn't. You've got somebody that wants to build a wall, and somebody that says no walls, let's build bridges. Who do you agree with more on those three specific issues, Trump or Clinton?\nSCHOEN: I actually disagree with both because there is a fourth issue that is more important to me -- killing them, going where they are --\nHANNITY: And bombing the living -- out of them according to him.\nSCHOEN: But I've got to hear a real plan from him and Hillary. I haven't heard it.\nHANNITY: Last word.\nCARTER: But I think we have that plan already in place. We've been drone striking leaders. We've been going after Al Qaeda. We've been going after ISIS, and we've been going after the Taliban. It needs to be a combined enforcement, both ideological as well as drone strikes, Doug. That is just what I think.\nSCHOEN: I agree. I think you're right.\nHANNITY: Thank you both. More \"Hannity\" right after this break. We need your help.\n(COMMERCIAL BREAK)\nHANNITY: Welcome back to \"Hannity.\" Before we go, quick programming note. Be sure to tune in Wednesday night, 10:00 p.m. I'll be in Cleveland, Ohio, with Donald Trump for the hour. We'll be doing a town hall focusing on issues that matter most and impact minority voters. That is this Wednesday, 10:00 p.m.\nThat is all the time we have left this evening. As always, we appreciate you being here. And Hillary, you owe Trump an apology. Aiding and abetting, really? I think you want to take that back.\nIt's 49 days to go tomorrow night until Election Day. Thanks for being with us. We'll see you back here then.\n ", "external_links": [], "published": "2016-09-19T03:00:00.000+03:00", "crawled": "2016-09-22T01:34:22.347+03:00", "highlightTitle": ""}