{"organizations": [], "uuid": "c8ec7030bc5151f8d06e1157337181fae1a597cd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 11, "shares": 11, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.foxnews.com", "main_image": "http://www.foxnews.com/content/dam/fox-news/logo/og-fn-foxnews.jpg", "site_section": "http://feeds.foxnews.com/foxnews/world", "section_title": "FOX News", "url": "http://www.foxnews.com/world/2016/09/05/latest-us-france-germany-discuss-ukraine-at-g-20.html", "country": "IT", "domain_rank": 185, "title": "The Latest: US, France, Germany discuss Ukraine at G-20 | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "The Latest: US, France, Germany discuss Ukraine at G-20 | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2016-09-05T03:00:00.000+03:00", "replies_count": 0, "uuid": "c8ec7030bc5151f8d06e1157337181fae1a597cd"}, "author": "Associated Press", "url": "http://www.foxnews.com/world/2016/09/05/latest-us-france-germany-discuss-ukraine-at-g-20.html", "ord_in_thread": 0, "title": "The Latest: US, France, Germany discuss Ukraine at G-20 | Fox News", "locations": [], "entities": {"persons": [{"name": "sergey lavrov", "sentiment": "none"}, {"name": "tusk", "sentiment": "none"}, {"name": "barack obama", "sentiment": "none"}, {"name": "peskov", "sentiment": "none"}, {"name": "francois hollande", "sentiment": "none"}, {"name": "kerry", "sentiment": "none"}, {"name": "angela merkel", "sentiment": "none"}, {"name": "john kerry", "sentiment": "none"}, {"name": "lavrov", "sentiment": "none"}, {"name": "recep tayypip erdogan", "sentiment": "none"}, {"name": "merkel", "sentiment": "none"}, {"name": "bashar assad", "sentiment": "none"}, {"name": "vladimir putin", "sentiment": "none"}, {"name": "malcolm turnbull", "sentiment": "none"}, {"name": "putin", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "donald tusk", "sentiment": "none"}, {"name": "recep tayyip erdogan", "sentiment": "none"}, {"name": "alexander litvinenko", "sentiment": "none"}, {"name": "obama", "sentiment": "none"}, {"name": "hollande", "sentiment": "none"}, {"name": "erdogan", "sentiment": "none"}, {"name": "dmitry peskov", "sentiment": "none"}, {"name": "xi", "sentiment": "none"}, {"name": "xi jinping", "sentiment": "none"}, {"name": "turnbull", "sentiment": "none"}], "locations": [{"name": "france", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "ukraine", "sentiment": "none"}, {"name": "hangzhou", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "seoul", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "moscow", "sentiment": "none"}, {"name": "syria", "sentiment": "none"}, {"name": "turkey", "sentiment": "none"}, {"name": "north korea", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "u.k.", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "incirlik", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "ankara", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}, {"name": "hangzhou", "sentiment": "none"}, {"name": "aegean sea", "sentiment": "none"}], "organizations": [{"name": "associated press facebook", "sentiment": "negative"}, {"name": "fox news", "sentiment": "negative"}, {"name": "islamic state", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "kremlin", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Published September 05, 2016 Associated Press Facebook 0 Twitter 0 Email Print HANGZHOU, China –   The Latest on the G-20 summit in China (all times local):\n1 p.m.\nThe leaders of the U.S., France and Germany are taking a time away for economic talks in China to discuss the situation in Ukraine.\nThe White House says President Barack Obama, French President Francois Hollande and German Chancellor Angela Merkel are meeting on the sidelines of the G-20 summit to review the status of the conflict.\nAfter weeks of intensifying fighting between government forces and Russian-backed rebels in eastern Ukraine, a new cease-fire took effect last week and has been holding.\nReporters covering the summit had no access to the private meeting between the leaders. The White House said it would release more details on the talk later Monday.\n____\n10:30 a.m.\nChinese President Xi Jinping has told his South Korean counterpart that China is opposed to the deployment of a powerful U.S. anti-missile system in her country.\nDuring their bilateral meeting on Monday's final day of the G-20 meeting, Xi warned that \"mishandling the issue is not conducive to strategic stability in the region, and could intensify disputes.\"\nChina has responded angrily to Seoul's decision to base the U.S. Terminal High Altitude Area Defense, or THAAD, system south of the South Korean capital, Seoul.\nWhile Seoul and Washington say the system is intended solely to defend against North Korea's missile threat, Beijing says it will allow the U.S. military to peer deeply into northeastern China.\nBeijing's reaction has also stoked public outrage, threatening everything from tourism exchanges to appearances by K-pop stars in China.\n____\n9 a.m.\nAustralian Prime Minister Malcolm Turnbull said his country is determined to provide its great friend and ally Britain with \"all the support and assistance\" it needs as it negotiates its exit from the EU.\nTurnbull spoke ahead of a formal meeting with British Prime Minister Theresa May on the sidelines of the G-20 economic summit in China.\nMay said she was grateful to Turnbull who had offered to discuss a free-trade agreement with Britain shortly after she became leader in July after the British people narrowly voted to leave the EU in a referendum.\nMay said she didn't want Britain to become inward looking. \"We want to be even more outward looking around the whole of the world, and Australia, with our long standing ties and our close relationship, will be one of the first countries we will be looking to.\"\n____\n1:45 a.m.\nRussian President Vladimir Putin and Turkish leader Recep Tayypip Erdogan have met on the sidelines of the G-20 summit to discuss both Syria and improving their countries' frayed relations.\nRussian news agencies on Sunday cited Kremlin spokesman Dmitry Peskov as saying that both countries' delegations met and then the meeting continued between the leaders one-on-one with their foreign ministers present.\nRussia and Turkey suffered a roughly seven-month rupture in relations after Turkey shot down a Russian bomber on its border with Syria in November just as tensions mounted over Syria, where Moscow and Ankara back opposing sides in the conflict. Relations began improving in late June after Erdogan apologized for the plane's downing.\nRussian and Turkish officials discussed the outlook for lifting Russia's ban on Turkish food imports as part of their rapprochement process on Sunday, Peskov said.\n____\n10:50 p.m.\nFrench President Francois Hollande says he wants other world leaders to better regulate the global economy to protect workers and the environment.\nIn a Facebook post laying out his goals at the Group of 20 summit in China, Hollande said Sunday that \"France's role is to contribute to regulating the planet.\"\nThe socialist leader, whose country is known for its extensive labor rules, continued, \"Our country refuses a globalization without rules, where social models are pit against each other and dragged downward, where inequalities grow and intellectual property rights, and therefore cultural diversity, are threatened.\"\nHollande argued against trade deals that don't respect worker rights. He hailed the U.S. and China for approving the Paris climate accord and said he would champion \"green\" treasury bonds at the G-20 to support environmentally sustainable investment.\n___\n7:35 p.m.\nGerman Chancellor Angela Merkel says she sees the possibility of a \"positive outcome\" to negotiations between Turkey and the European Union on a visa waiver for Turks, but that it will still take weeks of work.\nThe offer to scrap visas for Turks entering the EU was one incentive for Turkey to agree to a deal to curb the flow of migrants across the Aegean Sea. But it's conditional on, among other things, Turkey modifying its definition of terrorism and what constitutes a terror act to ensure that journalists and academics aren't arrested. Ankara has refused to make changes.\nMerkel said after meeting Turkish President Recep Tayyip Erdogan Sunday at the G-20 summit that they didn't discuss a precise time frame but \"we agreed that there is still work to do.\"\n___\n6:40 p.m.\nGerman Chancellor Angela Merkel says she's hopeful after meeting the Turkish president that Turkey will soon lift a ban on German lawmakers visiting their country's military personnel at a Turkish air base.\nMerkel met President Recep Tayyip Erdogan Sunday at the Group of 20 summit in China. German-Turkish relations have been strained since the German Parliament voted in June to label as genocide the killings of Armenians by Ottoman Turks a century ago.\nTurkey has refused to allow German lawmakers to visit personnel stationed at its Incirlik air base with aircraft supporting the campaign against the Islamic State group.\nGerman news agency dpa reported that Merkel said she expects \"positive news\" on that front in the coming days. On Friday, the German government stressed the parliamentary resolution isn't legally binding.\n___\n6:40 p.m.\nU.S. Secretary of State John Kerry says the United States will not rush into a deal with Russia to try to end Syria's civil war.\nKerry has been negotiating with Russian Foreign Minister Sergey Lavrov in China on the sidelines of the G-20 summit. They are discussing a cease-fire between Syria's government and moderate rebels, and a possible U.S.-Russian military partnership against extremist groups.\nKerry says they've worked out many technical issues but others are unresolved.\nKerry says he and Lavrov plan to meet again Monday. He says the U.S. will take the time needed to ensure the agreement has the best chance for success.\nSeveral previous U.S.-Russia deals on Syria have failed to halt the violence.\n___\n3:55 p.m.\nChinese President Xi Jinping has officially opened a two-day summit of the world's major economies, saying the Group of 20 should adopt new measures to generate growth momentum and avoid protectionism.\nThe 11th G-20 economic forum takes place in the eastern Chinese city of Hangzhou.\nXi shook hands and posed for photos Sunday afternoon with leaders including President Barack Obama, German Chancellor Angela Merkel and Russian President Vladimir Putin with a G-20 backdrop. The leaders then traveled up several flights of stairs to a summit conference room.\nIn opening remarks, Xi said the world economy is recovering but faces multiple challenges in finance, trade and investment.\nHe said the summit will discuss innovation-driven growth and more efficient global economic and financial governance.\n___\n3:35 p.m.\nIn their first meeting together, British Prime Minister Theresa May has told Russian President Vladimir Putin that she wants a \"frank and open relationship\" with Moscow despite their differences.\nBilateral relations have been strained in recent years by the fighting in Ukraine, Russia's backing of Syrian President Bashar Assad and the poisoning death of ex-Russian spy Alexander Litvinenko in London.\nAt their meeting on the sidelines of the G-20 summit in China, May told Putin the world faces many challenges today.\nShe said: \"And while I recognize there will be some differences between us, there are some complex and serious areas of concern and issues to discuss, I hope we will be able to have a frank and open relationship and dialogue.\"\n___\n2:15 p.m.\nTurkey's President Recep Tayyip Erdogan says there should be no distinction between \"good terrorists\" and bad ones.\nErdogan is meeting with President Barack Obama on the sidelines of the Group of 20 economic summit in Hangzhou, China.\nErdogan says all terrorism is bad. He says the U.S. and Turkey must adopt a common attitude against terrorism.\nTurkey and the U.S. have been at odds over the role of Kurdish forces in fighting the Islamic State group in Syria. U.S.-backed Syrian Kurds have been the most effective fighting force against IS, but Turkey worries they are seeking a contiguous and autonomous zone along Turkey's border.\n___\n2:10 p.m.\nPresident Barack Obama is reassuring Turkey's President Recep Tayyip Erdogan that the U.S. will work to ensure those responsible for a failed coup are brought to justice.\nObama is holding his first meeting with Erdogan since this summer's coup attempt. Obama says he condemns the attempted overthrow.\nThe U.S. president also says it's critical to \"finish the job\" of securing Turkey's border with Syria. That's where Islamic State fighters have flooded into Turkey and would-be recruits into Syria.\nObama also says Turkey mustn't carry alone the burden of addressing the Syrian refugee crisis.\nThe leaders met on the sidelines of the Group of 20 economic summit in Hangzhou, China.\n___\n12:45 p.m.\nEuropean Council President Donald Tusk says there will be no negotiations with Britain on the terms of its departure from the European Union until London formally invokes the two-year leaving process.\nSpeaking ahead of the G-20 summit in Hangzhou, China, Tusk said such pre-negotiations are not in the interests of the remaining 27 EU members.\nTusk says: \"We need to protect the interests of the members of the EU that want to stay together, not the one which wants to leave.\"\nSpeaking earlier Sunday, British Prime Minister Theresa May said: \"There will be no second referendum, no attempt to turn the clock back or get out of this. (Britain) will be leaving the European Union.\"\nThe U.K. has to invoke Article 50, the EU treaty clause that sets up the departure of a nation from the current 28-member bloc.\nThe Brexit, as it's known, is one of the main topics of concern at the economic forum.\n___\n12:15 p.m.\nPresident Barack Obama says he doesn't think disputes over media access during his trip to China reflect trouble in the U.S.-China relationship.\nObama says tensions always arise when the White House negotiated how much access the U.S. press will get to the president and foreign leaders overseas.\nThe White House doesn't apologize for pushing to press access because \"we don't leave our values and our ideals behind when we take those trips.\"\nBut Obama says he wouldn't \"overcrank\" the significance of a shouting match that broke out between White House and Chinese officials as he arrived in China Saturday.\n___\n12 noon\nBritish Prime Minister Theresa May says there will be \"no second referendum\" in the U.K. on exiting the European Union. She says the U.K. will be leaving the EU.\nMay is meeting with President Barack Obama in China. She says the U.K. plans to continue pursuing an aggressive trade relationship with the U.S. despite the decision to leave the EU.\nMay and Obama are downplaying concerns that Britain becomes a lower trading priority for the U.S. by leaving the European bloc. The U.S. has been negotiating a broad EU trade deal and said ahead of the Brexit vote that Britain would go to the back of a line for a two-country deal if it left the EU.\nObama says he never said Britain would be punished. But he says it wouldn't make sense for the U.S. to lose focus on its European trade talks. He says the first priority for Britain now that it's leaving is to figure out its new trading relationship with its European neighbors.\n___\n11:55 a.m.\nPresident Barack Obama says U.S. and Russian negotiators are working \"around the clock\" to try to strike a deal to reduce violence in Syria but says \"we're not there yet.\"\nObama is addressing the Syria crisis during a meeting with British Prime Minister Theresa May on the sidelines of the Group of 20 summit in China.\nObama says the U.S. is skeptical given the fact that previous cessations of hostilities have failed to hold. He says the negotiations are difficult and the U.S. and Russia have \"grave differences.\"\nBut Obama says it's \"worth trying\" given Russia's role in supporting Syrian President Bashar Assad.\n___\n11:45 a.m.\nPresident Barack Obama says the U.S. and the U.K. will continue strengthening their \"special relationship\" even as Britain pursues its exit from the European Union.\nObama is holding his first meeting with new British Prime Minister Theresa May since she took over. He says the U.S. doesn't have a stronger partner in the world. Obama says the two countries will keep cooperating closely on cyber security, terrorism and trade despite the \"turbulence\" of recent political events. He's referring to the British vote to exit the EU, or Brexit.\nMay says the U.K. and the U.S. will \"pursue the opportunities that Brexit presents.\" She says they'll \"make a success of it.\"", "external_links": [], "published": "2016-09-05T03:00:00.000+03:00", "crawled": "2016-09-05T08:16:17.580+03:00", "highlightTitle": ""}