{"organizations": [], "uuid": "1a5ca1459a9e3f9a85f67c514db217c4653c20d9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 7, "shares": 7, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/politics/0/0/Immigration%20and%20upcoming%20election.jpg", "site_section": "", "section_title": "", "url": "http://latino.foxnews.com/latino/politics/2016/09/17/immigration-among-top-most-important-issues-in-election/", "country": "US", "domain_rank": 185, "title": "Immigration among top most important issues in election | Fox News Latino", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Immigration among top most important issues in election | Fox News Latino", "spam_score": 0.447, "site_type": "news", "published": "2016-09-17T23:15:00.000+03:00", "replies_count": 0, "uuid": "1a5ca1459a9e3f9a85f67c514db217c4653c20d9"}, "author": "", "url": "http://latino.foxnews.com/latino/politics/2016/09/17/immigration-among-top-most-important-issues-in-election/", "ord_in_thread": 0, "title": "Immigration among top most important issues in election | Fox News Latino", "locations": [], "entities": {"persons": [{"name": "anthony kennedy", "sentiment": "none"}, {"name": "bernie sanders", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "barack obama", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "garland", "sentiment": "none"}, {"name": "scalia", "sentiment": "none"}, {"name": "barrack obama", "sentiment": "none"}, {"name": "obama", "sentiment": "none"}, {"name": "merrick garland", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "clinton", "sentiment": "none"}, {"name": "kim", "sentiment": "none"}, {"name": "kim jong un", "sentiment": "none"}, {"name": "antonin scalia", "sentiment": "none"}], "locations": [{"name": "united states", "sentiment": "none"}, {"name": "iran", "sentiment": "none"}, {"name": "syria", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "north korea", "sentiment": "none"}, {"name": "afghanistan", "sentiment": "none"}, {"name": "iraq", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "pacific", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "asia-pacific", "sentiment": "none"}, {"name": "tehran", "sentiment": "none"}, {"name": "new york supreme", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "north korea", "sentiment": "none"}, {"name": "korea", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "iran", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}], "organizations": [{"name": "fox news latino", "sentiment": "neutral"}, {"name": "obama justice department", "sentiment": "none"}, {"name": "islamic state", "sentiment": "none"}, {"name": "border patrol", "sentiment": "none"}, {"name": "associated press", "sentiment": "none"}, {"name": "congress", "sentiment": "none"}, {"name": "gop", "sentiment": "none"}, {"name": "american association for the advancement of sciences", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "medicare", "sentiment": "none"}, {"name": "republican senate", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "ap", "sentiment": "none"}, {"name": "supreme court", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Immigration among top most important issues in election Published September 17, 2016 Fox News Latino FILE - In this June 24, 2016, file photo, demonstrators protest against a Supreme Court decision on immigration outside the New York Supreme court in New York. The future of millions of people living in the U.S. illegally could well be shaped by the presidential election. The stakes are high, too, for those who employ them, help them fit into neighborhoods, or want them gone. (AP Photo/Mary Altaffer, File) Copyright 2016 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistribu \nWASHINGTON (AP) – A selection of issues at stake in the presidential election and their impact on Americans, in brief: \nIRAN \nLast year's nuclear deal with Tehran has removed for now the threat of a U.S.-Iranian military confrontation. But the deal rests on shaky ground. \nThe accord curtailed Iran's nuclear program, pulling it back from atomic weapons capability in exchange for the end of many economic sanctions. \nBut the next president could have his or her hands full, dealing with Iran in general and the agreement in particular. Various restrictions on Iran start ending in about seven years. \nFor Hillary Clinton and Donald Trump, it's basically a question of continuity versus change. \nAs secretary of state, Clinton helped lay the groundwork for the pact. She supports it, while taking a generally tougher tone on Iran than President Barack Obama. \nTrump hates the deal. But he contends that he can renegotiate its terms. \nBoth are prepared to use force to prevent Tehran from acquiring the bomb. If the deal collapses or expires without sufficient safeguards, that possibility is back in play. \n___ \nREFUGEES \nWith millions of Syrians displaced by a yearslong war and hundreds of thousands of people fleeing to Europe, countries around the world are being pressed to help resettle people seeking refuge. \nThe United States pledged to accept 10,000 such refugees by the end of the budget year in September and did so, a month early. \nRepublicans have balked at the idea of allowing people from Syria into the United States and Donald Trump has called for a halt on refugee resettlement for them. He says vetting of these refugees is inadequate. \nHillary Clinton has pledged to expand the Syrian refugee program and allow as many as 65,000 such refugees into the United States. \nThe fate of the program almost certainly hinges on the outcome of the November election. \n___ \nCHILD CARE/PAY EQUITY \nIn much of the U.S., families spend more on child care for two kids than on housing. And if you're a woman, it's likely you earn less than your male colleagues. That's according to the latest research, which suggests that while the U.S. economy has improved, women and their families are still struggling to make the numbers work. \nClinton wants a 12-week government-paid family and medical leave program, guaranteeing workers two-thirds of their wages up to a certain amount. Trump proposes six weeks of leave for new mothers, with the government paying wages equivalent to unemployment benefits. Both candidates propose tax relief for child care costs. Trump's plan provides for a new income tax deduction for child care expenses, other tax benefits and a new rebate or tax credit for low-income families. Clinton says no family should spend more than 10 percent of its income on child care and has called for child-care subsidies and tax relief offered on a sliding scale. \nClinton also favors forcing businesses to disclose gender pay data to the government for analysis. Trump says only that working moms should be \"fairly compensated.\" \nWomen comprise about 57 percent of the labor force and many of them have young children. If they aren't getting paid enough to make ends meet, more families will seek out government aid programs or low-quality, unlicensed daycares for their children. \n___ \nEDUCATION \nEducation is a core issue not just for students and families, but for communities, the economy, and the nation as a global competitor. \nThe country has some 50 million K-12 students. Teaching them, preparing them for college and careers, costs taxpayers more than $580 billion a year, or about $11,670 per pupil per year. A better education usually translates into higher earnings. \nAnd while high school graduations are up sharply and dropout rates down, the nation has a ways to go to match the educational outcomes elsewhere. American schoolchildren trail their counterparts in Japan, Korea, Germany, France and more. \nFor students seeking higher education, they face rising college costs and many are saddled with debt. \nHillary Clinton has proposed free tuition at in-state public colleges and universities for working families with incomes up to $125,000 — free for families, that is, not for taxpayers. Donald Trump has focused on school choice, recently proposing to spend $20 billion in his first year in office to expand programs that let low-income families send their children to the local public, private, charter or magnet school that they think is best. \n___ \nIMMIGRATION \nThe future of millions of people living in the U.S. illegally could well be shaped by the presidential election. The stakes are high, too, for those who employ them, help them fit into neighborhoods, or want them gone. \nRepublican Donald Trump at first pledged to deport the estimated 11 million immigrants in the country illegally. Not only that, he'd build a wall all along the Mexican border. But his position has evolved. He's sticking to his vow to build the wall and make Mexico pay. But he's no longer proposing to deport people who have not committed crimes beyond their immigration offences. Still, he's not proposing a way for people living in the country illegally to gain legal status. \nDemocrat Hillary Clinton, in contrast, would overhaul immigration laws to include a path to citizenship, not just legal status. \nIllegal immigration has been at nearly 40-year lows for several years. It even appears that Mexican migration trends have reversed, with more Mexicans leaving the U.S. than arriving. Billions of dollars have been spent in recent years to build fencing, improve border technology and expand the Border Patrol. \nNonetheless the Mexican border remains a focal point for those who argue that the country is not secure. \n___ \nCLIMATE CHANGE \nIt's as if Donald Trump and Hillary Clinton live on two entirely different Earths: one warming, one not. Clinton says climate change threatens us all, while Trump repeatedly tweets that global warming is a hoax. \nMeasurements and scientists say Clinton's Earth is much closer to the warming reality. And it is worsening. \nThe world is on pace for the hottest year on record, breaking marks set in 2015, 2014, and 2010. It is about 1.8 degrees warmer than a century ago. \nBut it's more than temperatures. Scientists have connected man-made climate change to deadly heat waves, droughts and flood-inducing downpours. \nStudies say climate change is raising sea levels, melting ice and killing coral. It's making people sicker with asthma and allergies and may eventually shrink our bank accounts. \nThe American Association for the Advancement of Sciences says warming can be highly damaging to people and the planet and potentially irreversible. \n___ \nROLE OF GOVERNMENT \nIt's the Goldilocks conundrum of American politics: Is the government too big, too small or just right? Every four years, the presidential election offers a referendum on whether Washington should do more or less. \nDonald Trump favors cutting regulation and has promised massive tax cuts, but his plans are expected to add trillions to the national debt. Unlike most conservatives, he supports eminent domain and has spoken positively about government-run health care. And don't forget that massive border wall. Hillary Clinton has vowed new spending on education and infrastructure that could grow government, too. She strongly supports \"Obamacare,\" which most small government proponents see as overreach. \nAt its heart, the debate about government's reach pits the desire to know your basic needs will be cared for against the desire to be left alone. For the last few decades, polls have found Americans generally feel frustrated by the federal government and think it's wasteful. A smaller government sounds good to a lot of people until they're asked what specific services or benefits they are willing to do without. \n___ \nDEBT \nThe federal government is borrowing about one out of seven dollars it spends and steadily piling up debt. Over the long term, that threatens the economy and people's pocketbooks. \nMost economists say rising debt risks crowding out investment and forcing interest rates up, among other problems. At the same time, rapidly growing spending on federal health care programs like Medicare and the drain on Social Security balances caused by the rising tide of baby boomers could squeeze out other spending, on roads, education, the armed forces and more. \nIt takes spending cuts, tax increases or both to dent the deficit. Lawmakers instead prefer higher spending and tax cuts. \nNeither Hillary Clinton nor Donald Trump has focused on the debt. \nTrump has promised massive tax cuts that would drive up the debt and he's shown little interest in curbing expensive benefit programs like Medicare. \nClinton, by contrast, is proposing tax increases on the wealthy. But she wouldn't use the money to bring down the debt. Instead, she'd turn around and spend it on college tuition subsidies, infrastructure and health care. \n___ \nTRADE \nIn this angry election year, many American voters are skeptical about free trade — or hostile to it. \nThe backlash threatens a pillar of U.S. policy: The United States has long sought global trade. \nEconomists say imports cut prices for consumers and make the U.S. more efficient. \nBut unease has simmered, especially as American workers faced competition from low-wage Chinese labor. Last year, the U.S. ran a $334 billion trade deficit with China — $500 billion with the entire world. \nThe Democratic and Republican presidential candidates are both playing to public suspicions about trade deals. Hillary Clinton broke with President Barrack Obama by opposing an Asia-Pacific trade agreement that she had supported as secretary of state. \nDonald Trump vows to tear up existing trade deals and to slap huge tariffs on Chinese imports. \nBut trade deals have far less impact on jobs than forces such as automation and wage differences between countries. Trump's plans to impose tariffs could start a trade war and raise prices. \n___ \nSUPREME COURT \nThe ideological direction of the Supreme Court is going to tip one way or the other after the election. The outcome could sway decisions on issues that profoundly affect everyday Americans: immigration, gun control, climate change and more. \nThe court has been operating with eight justices since Antonin Scalia died in February. His successor appears unlikely to be confirmed until after the election, at the earliest. The court is split between four Democratic-appointed, liberal justices and four conservatives who were appointed by Republicans — although Justice Anthony Kennedy has sided with the liberals on abortion, same-sex marriage and affirmative action in the past two years. \nThe ninth justice will push the court left or right, depending on whether Democrat Hillary Clinton or Republican Donald Trump becomes president. President Barack Obama has nominated Merrick Garland to take Scalia's seat, but the Republican Senate has refused to consider Garland's nomination, in an effort to prevent a liberal court majority. \n___ \nCHINA \nTensions have been rising over China's assertive behavior in the seas of Asia. The U.S. also accuses China of unfair trading practices and cyber theft of business secrets. \nDonald Trump says that the sheer volume of trade gives the U.S. leverage over China. He accuses China of undervaluing its currency to make its exports artificially cheap and proposes tariffs as high as 45 percent on Chinese imports if Beijing doesn't change its behavior. Such action could risk a trade war that would make many products in the U.S. more expensive. \nClinton says the U.S. needs to press the rising Asian power to play by international rules, whether on trade or territorial disputes. \nWhile many of China's neighbors are unnerved by its military build-up, the wider world needs the U.S. and China to get along, to tackle global problems. The U.S. and China are also economically inter-dependent, and punishment by one party could end up hurting the other. \n___ \nINCOME INEQUALITY \nIncome inequality has surged near levels last seen before the Great Depression. The average income for the top 1 percent of households climbed 7.7 percent last year to $1.36 million, according to tax data. That privileged sliver of the population saw pay climb at almost twice the rate of income growth for the other 99 percent, whose pay averaged a humble $48,768. \nDogged on the issue during the primaries by Bernie Sanders, Hillary Clinton has highlighted inequality in multiple speeches. She hopes to redirect more money to the middle class and impoverished. Clinton would raise taxes on the wealthy, increase the federal minimum wage, boost infrastructure spending, provide universal pre-K and offer the prospect of tuition-free college. \nDonald Trump offers a blunter message about a system \"rigged\" against average Americans. To bring back jobs, Trump has promised new trade deals with better terms, greater infrastructure spending than Clinton foresees and tax cuts that he says would propel stronger growth (though independent analysts say his budget plans would raise deficits). \n___ \nOPIOID EPIDEMIC \nMore than 28,000 Americans died from overdosing on opioids in 2014, a record high for the nation. \nThat's 78 people per day, a number that doesn't include the millions of family members, first responders and even taxpayers who feel the ripple of drug addiction in their daily lives. \nA rise in prescription painkillers is partially to blame: The sale of these drugs has quadrupled since 1999, and so has the number of Americans dying from an addiction to them. When prescriptions run out, people find themselves turning to the cheaper alternative heroin and, increasingly, the even more deadly drug fentanyl. \nRecovering addicts and their family members are increasingly speaking out, putting a face on drug addiction and lessening the stigma surrounding it. But dollars for prevention, treatment and recovery services are still hard to come by, leaving many people waiting weeks or months to find the treatment they're seeking. Meantime, family members empty bank accounts in search of help, while law enforcement officers and emergency rooms serve as a first line of defense. \nDonald Trump says the wall he wants to build along the southern border is essential to stopping the flow of illegal drugs into the country. Hillary Clinton, meanwhile, pledges to spend $10 billion to increase access to prevention, treatment and recovery services, among other things. \n___ \nNORTH KOREA \nPariah state North Korea could soon be capable of targeting America with nuclear weapons. What can the U.S. do to stop it? \nDiplomacy and economic sanctions have not worked so far. North Korea's isolation is deepening, but it has continued to conduct nuclear test explosions and make advances in its missile technology. \nRepublican presidential candidate Donald Trump says the U.S. can put more pressure on China to rein in its North Korean ally. He says he is willing to meet the North Korean leader, Kim Jong Un. \nDemocrat Hillary Clinton wants the world to intensify sanctions as the Obama administration did with Iran, a course that eventually opened the way for a deal to contain its nuclear program. \nBut it will be tough to force North Korea back to negotiations that aim at its disarmament in exchange for aid. Kim views atomic weapons as a security guarantee for his oppressive regime \n___ \nHEALTH CARE \nAbout 9 in 10 Americans now have health insurance, more than at any time in history. But progress is incomplete, and the future far from certain. Rising costs could bedevil the next occupant of the White House. \nMillions of people previously shut out have been covered by President Barack Obama's health care law. No one can be denied coverage anymore because of a pre-existing condition. But \"Obamacare\" remains divisive, and premiums for next year are rising sharply in many communities. \nWhether Americans would be better off trading for a GOP plan is another question. A recent study found that Donald Trump's proposal would make 18 million people uninsured. GOP congressional leaders have a more comprehensive approach, but key details are still missing. \nOverall health care spending is trending higher again, and prices for prescription drugs — new and old — are a major worry. \nMedicare's insolvency date has moved up by two years — to 2028. \nHillary Clinton would stay the course, adjusting as needed. Republicans are united on repealing Obama's law, but it's unclear how they would replace it. \n___ \nAMERICA AND THE WORLD \nHow the U.S. uses its influence as the world's sole superpower is a central feature of presidential power. \nIt can mean taking the country to war — to protect the homeland or to defend an ally. Or it can mean using diplomacy to prevent war. It can affect U.S. jobs, too, as choices arise either to expand trade deals or to erect barriers to protect U.S. markets. \nIn the contest between Hillary Clinton and Donald Trump, America's role in the world is a point of sharp differences. Each says the U.S. must be the predominant power, but they would exercise leadership differently. Trump calls his approach \"America first,\" meaning alliances and coalitions would not pass muster unless they produced a net benefit to the U.S. Clinton sees international partnerships as essential tools for using U.S. influence and lessening the chances of war. \nThese divergent views could mean very different approaches to the military fight and ideological struggle against the Islamic State, the future of Afghanistan and Iraq, the contest with China for influence in Asia and the Pacific, and growing nervousness in Europe over Russian aggression. \n___ \nVOTING RIGHTS \nVoting rights in America are in flux. Republican-controlled legislatures are tightening voter laws, placing limits on early voting and same-day registration, and imposing new requirements for IDs at polling places. In 2013, the Supreme Court invalidated a key provision of the 1965 Voting Rights Act. That provision had required states with a history of racial discrimination to get federal preclearance to change election laws. \nThe issue has become highly partisan with the rapid growth of minority populations, which in recent presidential elections have tilted heavily Democratic. \nThe Obama Justice Department has challenged voter ID and other laws, saying they could restrict access for minorities and young people. Recent lower court rulings temporarily softened some of the toughest restrictions, but litigation remains knotted up with Supreme Court appeals likely. Bills in Congress to restore the Voting Rights Act are stalled. \nDonald Trump opposes same-day voter registration, backing laws to ensure only citizens vote. Hillary Clinton wants Congress to restore the Voting Rights Act and seeks a national standard of at least 20 days of early in-person voting. \nLike us on Facebook ", "external_links": [], "published": "2016-09-17T23:15:00.000+03:00", "crawled": "2016-09-17T20:23:32.811+03:00", "highlightTitle": ""}