{"organizations": [], "uuid": "64295ac81f7aa0fadc9a339bc1b4262da9c1b0e4", "thread": {"social": {"gplus": {"shares": 1}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 28, "shares": 28, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nbcnews.com", "main_image": "http://media3.s-nbcnews.com/j/newscms/2016_35/1695876/snaps-mtp-still-about-meet-the-press-on-nbc-news-a-net-backup_yz_93b9dbf2d0686f5127dea3e730bcd791.nbcnews-fp-1200-800.jpg", "site_section": "https://news.google.com/news/feeds?output=rss&#038;q=graffiti+street+art", "section_title": "Top Stories - Google News", "url": "http://www.nbcnews.com/meet-the-press/meet-press-september-4-2016-n642656", "country": "US", "domain_rank": 478, "title": "Meet the Press - September 4, 2016 - NBCNews.com", "performance_score": 0, "site": "nbcnews.com", "participants_count": 0, "title_full": "Meet the Press - September 4, 2016 - NBCNews.com", "spam_score": 0.0, "site_type": "news", "published": "2016-09-04T23:52:00.000+03:00", "replies_count": 0, "uuid": "64295ac81f7aa0fadc9a339bc1b4262da9c1b0e4"}, "author": "", "url": "http://www.nbcnews.com/meet-the-press/meet-press-september-4-2016-n642656", "ord_in_thread": 0, "title": "Meet the Press - September 4, 2016 - NBCNews.com", "locations": [], "entities": {"persons": [{"name": "bernie sanders", "sentiment": "negative"}, {"name": "chuck tod", "sentiment": "neutral"}, {"name": "trump", "sentiment": "none"}, {"name": "chuck", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "stein", "sentiment": "none"}, {"name": "pope francis", "sentiment": "none"}, {"name": "kristen welker", "sentiment": "none"}, {"name": "mother teresa", "sentiment": "none"}, {"name": "johnson-stein", "sentiment": "none"}, {"name": "gary johnson", "sentiment": "none"}, {"name": "chuck todd", "sentiment": "none"}, {"name": "kristen welker", "sentiment": "none"}, {"name": "sanders", "sentiment": "none"}, {"name": "saint teresa", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "clinton", "sentiment": "none"}, {"name": "johnson", "sentiment": "none"}, {"name": "jill stein", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}], "locations": [{"name": "united states", "sentiment": "none"}, {"name": "burlington", "sentiment": "none"}, {"name": "survey monkey", "sentiment": "none"}, {"name": "vatican", "sentiment": "none"}, {"name": "calcutta", "sentiment": "none"}, {"name": "wisconsin", "sentiment": "none"}, {"name": "vermont", "sentiment": "none"}], "organizations": [{"name": "green party", "sentiment": "none"}, {"name": "nbc news", "sentiment": "none"}, {"name": "national monmouth university poll", "sentiment": "none"}, {"name": "marquette law school", "sentiment": "none"}, {"name": "a.i.d.s.", "sentiment": "none"}, {"name": "clinton foundation", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "You think it should be lower-- \nSEN. BERNIE SANDERS: \nProbably should be lower than that. \nCHUCK TODD: \nOkay. Let me ask you, let me play for you perhaps one of the more famous sound bites from your primary campaign. Here it is. \n(BEGIN TAPE) \nSEN. BERNIE SANDERS ON VIDEO: \nThe American people are sick and tired of hearing about your damn emails. \nHILLARY CLINTON: \nThank you. Me too! Me too! \n(END TAPE) \nCHUCK TODD: \nWell, Senator Sanders, that happened almost a year ago. That was an October, 2015 debate. Here we are in September of 2016. you may not care about them, but a lot of people do. Do you have any advice for Hillary Clinton on how she should handle this? Could she handle it better? \nSEN. BERNIE SANDERS: \nYou know-- \nCHUCK TODD: \nYou've struggled with the foundation. You thought the foundation was problematic. Do you think she should shut the foundation down? \nSEN. BERNIE SANDERS: \nChuck, you know, the latter part of my statement, which doesn't get recorded very much, is, \"What the American people want to hear about are the real issues impacting their lives, why the middle class is declining, income and wealth inequality, why we are the only major country not to guarantee health care to all people.\" That's what I believed then. That's what I believe now. Chuck, every other major country on earth, 50 miles away from where I am right now in Burlington, Vermont, guarantees health care to all people as a right. \nCHUCK TODD: \nYeah. \nSEN. BERNIE SANDERS: \nThe top one tenth of 1 percent now owns as much wealth as the bottom 90 percent Those are the issues I believe we need to focus on, politicians and the media. Let the American get involved in that debate. And I think at the end of the discussion, people will see Clinton as the superior candidate. \nCHUCK TODD: \nI understand that. But you can't govern if you don't have trust. So can she rebuild trust by pledging something to do that? Is it shutting down the foundation? What would you tell her to do? \nSEN. BERNIE SANDERS: \nWell, I would certainly suggest that, as president of the United States, she should cease all operations, all contact with the Clinton Foundation. \nCHUCK TODD: \nDoes that mean shutting it down, or just not being involved? Can you-- \nSEN. BERNIE SANDERS: \nAt the very least, she should not be involved, at the very least. \nCHUCK TODD: \nAnd would you feel more comfortable if it just didn't exist during her time as president? \nSEN. BERNIE SANDERS: \nI don't know enough. They do a lot of good things with A.I.D.S. and so forth. I can't, you know, definitively answer that. But I think, Chuck, what we have got to do as a nation, is have a very serious debate on the enormous crises facing this country. That is where our focus has got to be. \nCHUCK TODD: \nAll right, Senator Bernie Sanders on the campaign trail again tomorrow. We'll be watching. Enjoy Labor Day and enjoy the campaign trail. Stay safe, sir. Good to see you. \nSEN. BERNIE SANDERS: \nThank you very much, take care. \nCHUCK TODD: \nWhen we come back, why the recent tightening of the polls may not be exactly what it seems to be. Before we go to break, you've got to see this scene from The Vatican earlier this morning. This is where Pope Francis officially elevated Mother Teresa to sainthood. She will now be known as Saint Teresa of Calcutta. We'll be back in a moment. \n***COMMERCIAL BREAK*** \nCHUCK TODD: \nAnd we are back. It's data download time. You may have noticed that Donald Trump has been closing the gap with Hillary Clinton in recent polls. Her post-convention bounce is clearly gone. But it hasn't gone to the direct benefit of Trump. So where has it gone? \nWell, we're going to take a look at polls that were released right after the conventions and then re-released again in the last week. We're going to start with our own poll, NBC News Survey Monkey, that had Clinton at 41 percent this past week. That was down three points immediately from the post-convention in early August. Trump sits at 37 percent. He's down a point from early August. Libertarian Gary Johnson gained a point, Green Party candidate Jill Stein gained a point. And \"no answer\" gained two points. So collectively, Clinton and Trump lost four from the convention bounces, while Johnson and Stein and \"no answer\" gained four. \nNow let's look at the National Monmouth University Poll. That had Clinton down three points from early August. Trump is actually up two from early August. Meanwhile, the combination of Johnson-Stein and all others, that also went up two points. So while Trump has gained in this poll, he doesn't go up as much as Clinton drops. \nNow let's go to the states. We're going to look at Wisconsin, in a new poll from Marquette Law School. Remember, it's a state both candidates lost in the primary. Well, Clinton is down five points from her post-convention lead in this poll in August. Trump is down a point. At the same time, Johnson is up a point, Stein is up three, and \"no preference\" is up two. So again, Clinton and Trump are down six collectively while Johnson, Stein and \"no preference\" are up six. \nAn election where voters are casting their eye toward anyone other than the two major party nominees, Johnson and Stein are having more of an impact on Clinton support than Trump's. It's going to be very interesting over the next few weeks. Number one, does Clinton get these voters back? Number two, are these voters at all in play for Trump? If they didn't go to Trump now, will they ever go to Trump? Or are these voters that are vacillating between Clinton, third party candidates, or not voting at all? \nComing up, if you've been getting emails from someone saying they're desperate for you, they've lost all hope, they need you and they need you now, worry not. It's probably not from a jilted ex-lover. But it is from somebody else. We'll explain. \n***COMMERCIAL BREAK*** \nCHUCK TODD: \nBack now with the panel. We talked about Trump and immigration. Kristen Welker, the emails. Isaid, you know, nobody cares about the damn emails. That's what Bernie Sanders famously said. I couldn't believe when I looked at the time stamp, October of 2015. \nKRISTEN WELKER:", "external_links": [], "published": "2016-09-04T23:52:00.000+03:00", "crawled": "2016-09-04T19:02:07.671+03:00", "highlightTitle": ""}