{"organizations": [], "uuid": "05b8fd26f0be5b0790a8988dc1d523d758c7f056", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.buzzfeed.com", "main_image": "https://img.buzzfeed.com/buzzfeed-static/static/2016-09/20/19/campaign_images/buzzfeed-prod-web11/tim-farron-gets-emotional-as-he-calls-on-britain--2-528-1474414019-0_dblbig.jpg", "site_section": "", "section_title": "", "url": "https://www.buzzfeed.com/emilyashton/those-children-could-be-our-children", "country": "US", "domain_rank": 137, "title": "Tim Farron Gets Emotional As He Calls On Britain To Take In Child Refugees", "performance_score": 0, "site": "buzzfeed.com", "participants_count": 0, "title_full": "Tim Farron Gets Emotional As He Calls On Britain To Take In Child Refugees", "spam_score": 0.025, "site_type": "news", "published": "2016-09-20T08:00:00.000+03:00", "replies_count": 0, "uuid": "05b8fd26f0be5b0790a8988dc1d523d758c7f056"}, "author": "Emily Ashton Buzzfeed News Reporter", "url": "https://www.buzzfeed.com/emilyashton/those-children-could-be-our-children", "ord_in_thread": 0, "title": "Tim Farron Gets Emotional As He Calls On Britain To Take In Child Refugees", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Facebook: video.php ID: 9650073 \nLiberal Democrat leader Tim Farron became visibly emotional as he called for Britain to take in more child refugees, warning that the country is being seen as “mean”. \nAddressing his party’s conference in Brighton on Tuesday, he recalled a trip to the Greek island of Lesbos last year when he helped refugees from a flimsy boat. \nHe told how an aid worker from New Zealand had shouted to him: “Stop handing out bottles of water and take some effing refugees.” \n“Because that is how Britain is seen,” Farron said. “Mean and not pulling its weight. And maybe that doesn’t bother some people, but it bothers me. \n“Because I am proud of who we are – always a sanctuary for the desperate, the abused, and the persecuted. And I will not stand by and watch my country become smaller, meaner, and more selfish. That is not Britain. We are better than that.” Gareth Fuller / PA ID: 9650095 \nFarron said the government had “barely lifted a finger” to help tackle the refugee crisis since the newspapers had moved on from the death of 3-year-old Alan Kurdi last year. \nAnd yet the crisis was getting “worse not better”, he warned. “Much to the government’s delight, compassion fatigue has set in, the news has moved on,” he said. \n“We’ve had Brexit, a new prime minister, a Labour leadership contest. And none of that makes a blind bit of difference to a 9-year-old kid stuck alone and hungry and cold in a camp in northern Greece.“Or to the family this morning fleeing their burning camp in Moria. This government wants us to forget this crisis – it’s too difficult to solve, too risky to take a lead. \n“But we have not forgotten, we will not forget. Those children could be our children. How dare the government abandon them.” \nFarron’s passionate speech was given a standing ovation by party activists. Tim Farron (right) helping refugees as they arrive in Lesbos in October 2015. Facebook / Liberal Democrats ID: 9650185 Emily Ashton is a senior political correspondent for BuzzFeed News and is based in London. Contact Emily Ashton at . ", "external_links": [], "published": "2016-09-20T08:00:00.000+03:00", "crawled": "2016-09-22T23:54:15.408+03:00", "highlightTitle": ""}