{"organizations": [], "uuid": "b134ff91216898a5fd71c8b6fdca387a87680e61", "thread": {"social": {"gplus": {"shares": 1}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 78, "shares": 78, "comments": 7}, "stumbledupon": {"shares": 0}}, "site_full": "www.buzzfeed.com", "main_image": "https://img.buzzfeed.com/buzzfeed-static/static/2016-09/6/20/campaign_images/buzzfeed-prod-web13/republicans-arent-sure-what-trumps-immigration-po-2-20737-1473209955-1_dblbig.jpg", "site_section": "https://www.buzzfeed.com/index.xml", "section_title": "BuzzFeed Index - Latest", "url": "https://www.buzzfeed.com/tariniparti/republicans-arent-sure-what-trumps-immigration-policy-is-eit", "country": "US", "domain_rank": 137, "title": "Republicans Aren’t Sure What Trump’s Immigration Policy Is Either", "performance_score": 0, "site": "buzzfeed.com", "participants_count": 1, "title_full": "Republicans Aren’t Sure What Trump’s Immigration Policy Is Either", "spam_score": 0.0, "site_type": "news", "published": "2016-09-07T09:52:00.000+03:00", "replies_count": 0, "uuid": "b134ff91216898a5fd71c8b6fdca387a87680e61"}, "author": "Tarini Parti", "url": "https://www.buzzfeed.com/tariniparti/republicans-arent-sure-what-trumps-immigration-policy-is-eit", "ord_in_thread": 0, "title": "Republicans Aren’t Sure What Trump’s Immigration Policy Is Either", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "negative"}, {"name": "alex wong", "sentiment": "negative"}, {"name": "bill cassidy", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "fleming", "sentiment": "none"}, {"name": "gardner", "sentiment": "none"}, {"name": "emma loop", "sentiment": "none"}, {"name": "tim scott", "sentiment": "none"}, {"name": "jim inhofe", "sentiment": "none"}, {"name": "john fleming", "sentiment": "none"}, {"name": "lindsey graham", "sentiment": "none"}, {"name": "cory gardner", "sentiment": "none"}, {"name": "shelby", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "david jolly", "sentiment": "none"}, {"name": "richard shelby", "sentiment": "none"}, {"name": "dan sullivan", "sentiment": "none"}, {"name": "graham", "sentiment": "none"}, {"name": "paul mcleod", "sentiment": "none"}, {"name": "johnny isakson", "sentiment": "none"}, {"name": "scott", "sentiment": "none"}], "locations": [{"name": "washington", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "south carolina", "sentiment": "none"}, {"name": "capitol hill", "sentiment": "none"}, {"name": "alabama", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}, {"name": "d.c.", "sentiment": "none"}, {"name": "oklahoma", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "alaska", "sentiment": "none"}, {"name": "ottawa", "sentiment": "none"}, {"name": "georgia", "sentiment": "none"}, {"name": "louisiana", "sentiment": "none"}, {"name": "colorado", "sentiment": "none"}], "organizations": [{"name": "trump", "sentiment": "negative"}, {"name": "gop", "sentiment": "none"}, {"name": "buzzfeed news", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Republican presidential nominee Donald Trump . Alex Wong / Getty Images ID: 9572575 \nWASHINGTON — What exactly is Donald Trump’s immigration policy? \nCongressional Republicans are still unsure, or outright don’t want to discuss their nominee’s policy, days after Trump’s major speech on the issue and weeks of uncertainty. \n“Ask Trump about that,” said Sen. Richard Shelby of Alabama when asked about his understanding of Trump’s position. Asked again, Shelby responded: “I’m supporting the ticket.” \nIn recent weeks, Trump has toyed with taking a softer approach toward undocumented immigrants, taken a trip to Mexico, delivered a roaring immigration speech that matched the tone and substance of his campaign, and given a somewhat vague series of answers about what to do with the majority of undocumented immigrants inside the country. \nIt’s left a degree of confusion about what the nominee’s position really is on his signature issue. And, returning to Washington after a seven-week break, several GOP senators and representatives — those who have endorsed Trump and those who have not — gave varying responses when asked what their nominee’s immigration position was. \nAlaska Sen. Dan Sullivan deferred to another topic. “If you want to ask me about my recess in Alaska, I was just home for seven weeks.” \nA second question about immigration got the same response: “Ask me about my recess in Alaska.” \nColorado Sen. Cory Gardner, who recently said he was backing Trump after months of silence, talked about Hillary Clinton instead when asked about Trump’s immigration plan. \n“We’ve got a long ways between now and the election. I look forward to Hillary Clinton continuing to implode in front of the American people,” he said. \nBut what did he make of Trump’s immigration speech? Gardner referred further questions to his office. \nGeorgia Sen. Johnny Isakson said he shouldn’t editorialize on Trump’s immigration policy because he hasn’t been paying too much attention to it. \n“I’ve been running my own race so I haven’t been paying a lot of attention to his race,” he said. \nSen. Tim Scott of South Carolina responded with a question. “Did you ask Trump?” \nWhen asked about his understanding of Trump’s position, Scott said: “I think the fact of the matter is that we have to have tighter enforcement overall and his plan’s better than hers.” \n“I understand what’s been published on his policy, I haven’t done any…a deeper dive into it.” \nFlorida Rep. David Jolly, who isn’t backing Trump, said: “I have no idea. I haven’t endorsed him, so I don’t have to defend his position. But I have no idea what his position on immigration even is.” \nSen. Lindsey Graham, who is also not supporting Trump, said at least one aspect of Trump’s immigration plan was clear, although the details are still murky. “I think he wants to build a wall — I got that part well,” said Graham. \n“I think he’s having a hard time… I think it’s an evolving position focused on border security, which I get. I think most Republicans want a plan for the 11 million. They don’t want the crooks to stay but they don’t want to break up the families. If Mr. Trump could articulate that that would help him.” \nA few tried their best to sum up Trump’s position. \n“He wants to take folks who’ve committed a crime, ask them to leave or force them to leave, then he wants to secure the border. Once he’s secured the border those who are still there would have some sort of, he implies, pathway to legal standing,” said Sen. Bill Cassidy of Louisiana. \n“That’s in summary, I can’t say I’ve studied it that much.” \n“He wants legal immigration,” said Sen. Jim Inhofe of Oklahoma. “He wants to be sure that if there are any who are here illegally that have any kind of a record or were accused of anything, that they should be expatriated and taken out, but he’s still open to negotiating the families who’ve been here for a long time [who] are gainfully employed. \n“And so that part of his program…doesn’t really go beyond that that I know of.” \n“I can’t speak for him,” said Rep. John Fleming of Louisiana. “I think what’s clear is that he believes that those who are here illegally and those who break our laws additionally, that we’re in this endless circle of sending those people who commit crimes to prison, we send them to their home country. And then they slip back through…so he believes, and I agree with him, that we gotta stop doing that. And I agree that we need to have some sort of wall — whether it is a virtual wall.” \nWhen pressed about how Trump would handle the 11 million undocumented immigrants in this country, Fleming responded: “Again, I don’t speak for him. I’m just telling you what I think is the problem, and what my position is. I’m not a surrogate for him.” Tarini Parti is a Capitol Hill reporter for BuzzFeed News and is based in Washington, D.C. Contact Tarini Parti at . Paul McLeod is the Canada political editor for BuzzFeed News and is based in Ottawa, Canada. Contact Paul McLeod at . Emma Loop is a Canada political reporter for BuzzFeed News and is based in Ottawa, Canada. Contact Emma Loop at .", "external_links": [], "published": "2016-09-07T09:52:00.000+03:00", "crawled": "2016-09-07T09:36:14.690+03:00", "highlightTitle": ""}