{"organizations": [], "uuid": "3fc9806c8255e32bc1c50166e3a31b2c697af292", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.buzzfeed.com", "main_image": "https://img.buzzfeed.com/buzzfeed-static/static/2016-09/15/2/social_promotion/buzzfeed-prod-cron01/facebook-social-promotion-12310-1473919512-1.jpg", "site_section": "", "section_title": "", "url": "https://www.buzzfeed.com/hannahjewell/simply-stroking-her-arm", "country": "US", "domain_rank": 137, "title": "How To Tell All The White Men In Theresa May's Cabinet Apart", "performance_score": 0, "site": "buzzfeed.com", "participants_count": 0, "title_full": "How To Tell All The White Men In Theresa May's Cabinet Apart", "spam_score": 0.25, "site_type": "news", "published": "2016-09-15T08:00:00.000+03:00", "replies_count": 0, "uuid": "3fc9806c8255e32bc1c50166e3a31b2c697af292"}, "author": "Hannah Jewell Buzzfeed Staff", "url": "https://www.buzzfeed.com/hannahjewell/simply-stroking-her-arm", "ord_in_thread": 0, "title": "How To Tell All The White Men In Theresa May's Cabinet Apart", "locations": [], "entities": {"persons": [{"name": "facebo", "sentiment": "neutral"}, {"name": "james brokenshire", "sentiment": "none"}, {"name": "chris grayling", "sentiment": "none"}, {"name": "david mundell", "sentiment": "none"}, {"name": "michael fallon", "sentiment": "none"}, {"name": "hannah jewell", "sentiment": "none"}, {"name": "philip hammond", "sentiment": "none"}, {"name": "jeremy heywood", "sentiment": "none"}, {"name": "david lidington", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "jeremy hunt", "sentiment": "none"}, {"name": "felix", "sentiment": "none"}, {"name": "damian green", "sentiment": "none"}, {"name": "liam fox", "sentiment": "none"}, {"name": "gavin williamson", "sentiment": "none"}, {"name": "greg clark", "sentiment": "none"}, {"name": "phillip hammond", "sentiment": "none"}, {"name": "tarquin", "sentiment": "none"}, {"name": "jeremy wright", "sentiment": "none"}, {"name": "nigel", "sentiment": "none"}, {"name": "superman", "sentiment": "none"}, {"name": "hugh", "sentiment": "none"}, {"name": "patrick mcloughlin", "sentiment": "none"}], "locations": [{"name": "scotland", "sentiment": "none"}, {"name": "northern ireland", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "zoe norfolk / press association", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Your Post Has Been Launched! Fabulous! Don't forget to share with your friends on Twitter and Facebook. How To Tell All The White Men In Theresa May’s Cabinet Apart Not all middle-aged white men look the same! Hannah Jewell BuzzFeed Staff, UK 1. Downing Street has just released a photo of prime minister Theresa May’s new cabinet, so we’re here to help you figure out how to differentiate between all the middle-aged white men in this picture. Zoe Norfolk / Press Association Images It’s not as hard as it seems! ID: 9614201 2. Let’s start with business secretary Greg Clark. To find him, imagine the look of a man watching the woman he’s always loved marry his best friend. Zoe Norfolk / Press Association Images ID: 9614180 3. Now, let’s find chief whip Gavin Williamson. To find him, imagine a combination of every young Tory you went to university with. Zoe Norfolk / Press Association Images He’s Nigel, Hugh, Tarquin, Piers, and Felix all mashed into one. ID: 9614168 4. To find Jeremy Hunt, look out for the man who wants nothing more than the relief of crying, but is keeping a brave face till he makes it to the broom cupboard. Zoe Norfolk / Press Association Images ID: 9614163 5. This is international trade secretary Liam Fox. Spot him by his intense pleasure in existing, like a man who’s had a health scare and come out the other side. Zoe Norfolk / Press Association Images His entire body is ablaze with pleasure and gratitude, and sometimes he laughs for no reason. ID: 9614164 6. Close your eyes and imagine your most humourless uncle, at Christmas, right after he’s given you a terrible present, as he waits for your reaction. There’s Scotland secretary David Mundell. Zoe Norfolk / Press Association Images ID: 9614252 7. Spot work and pensions secretary Damian Green by his slightly pained smile, as if he hasn’t smiled since childhood, and the muscles have grown weak with time. Zoe Norfolk / Press Association Images ID: 9614158 8. Now imagine Damian Green if Damian Green had a villainous plot. That’s what transport secretary Chris Grayling is giving us here. Zoe Norfolk / Press Association Images ID: 9614156 9. (If you’re still having trouble telling these two apart, have them stand next to each other to compare who appears more villainous.) Zoe Norfolk / Press Association Images ID: 9614152 10. You can recognise leader of the Commons David Lidington by remembering what your dad looked like when you invited him to a meal with some of your friends and it made him feel young again. Zoe Norfolk / Press Association Images He even picked up the whole bill so that you’d invite him again next time. ID: 9614165 11. To find Northern Ireland secretary James Brokenshire, imagine a 16-year-old boy who regularly dresses up as Superman and imagines himself on daring missions to save the Earth from alien invasion. Zoe Norfolk / Press Association Images ID: 9614159 12. Don’t try to remember what cabinet secretary Jeremy Heywood looks like. It’s not possible. Instead, remember what all the others look like and then use the process of elimination. Zoe Norfolk / Press Association Images Anyway he’s not even technically in the cabinet. ID: 9614160 13. Recognise attorney general Jeremy Wright by his look of quiet pride in a well-diversified stock portfolio. Zoe Norfolk / Press Association Images He’s got a solid plan for retirement, and he doesn’t care who knows it. ID: 9614154 14. To find chancellor Philip Hammond, imagine the expression of a man who would consider suing a homeless person for standing too close to his limousine. Zoe Norfolk / Press Association Images Of course, he wouldn’t really do that. ID: 9614170 15. To find defence secretary Michael Fallon, imagine a man who looks like Phillip Hammond if Phillip Hammond wore glasses and forgot to do a wee before sitting for the group photo. Zoe Norfolk / Press Association Images ID: 9614153 16. Spot chancellor of the Duchy of Lancaster Patrick McLoughlin by his look of extreme disappointment in your life decisions. Zoe Norfolk / Press Association Images You could have been a scion of business, but no, you had to study literature. ID: 9614151 ", "external_links": [], "published": "2016-09-15T08:00:00.000+03:00", "crawled": "2016-09-15T12:43:36.763+03:00", "highlightTitle": ""}