{"organizations": [], "uuid": "93193725072810560856920499f7a0dd768feedd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 15}, "facebook": {"likes": 160, "shares": 160, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/politics/0/0/Clinton%20Hispanic%20Outreach.jpg", "site_section": "http://feeds.latino.foxnews.com/home/feed", "section_title": "FOX News", "url": "http://latino.foxnews.com/latino/politics/2016/09/20/hispanic-leaders-say-clintons-outreach-ignores-vast-majority-latinos/", "country": "US", "domain_rank": 185, "title": "Hispanic leaders say Clinton’s outreach ignores ‘vast majority of Latinos’", "performance_score": 1, "site": "foxnews.com", "participants_count": 1, "title_full": "Hispanic leaders say Clinton’s outreach ignores ‘vast majority of Latinos’ | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2016-09-20T03:00:00.000+03:00", "replies_count": 0, "uuid": "93193725072810560856920499f7a0dd768feedd"}, "author": "Andrew O\\u0027Reilly", "url": "http://latino.foxnews.com/latino/politics/2016/09/20/hispanic-leaders-say-clintons-outreach-ignores-vast-majority-latinos/", "ord_in_thread": 0, "title": "Hispanic leaders say Clinton’s outreach ignores ‘vast majority of Latinos’", "locations": [], "entities": {"persons": [{"name": "justin", "sentiment": "neutral"}, {"name": "andrew o'reilly", "sentiment": "neutral"}, {"name": "clinton", "sentiment": "neutral"}, {"name": "fernand amandi", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "joseph j. heck", "sentiment": "none"}, {"name": "catherine cortez masto", "sentiment": "none"}, {"name": "patrick murphy", "sentiment": "none"}, {"name": "arturo vargas", "sentiment": "none"}, {"name": "cortez masto", "sentiment": "none"}, {"name": "obama", "sentiment": "none"}, {"name": "maria cardona", "sentiment": "none"}, {"name": "john mccain", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "vargas", "sentiment": "none"}, {"name": "marco rubio", "sentiment": "none"}, {"name": "kirkpatrick", "sentiment": "none"}, {"name": "ann kirkpatrick", "sentiment": "none"}, {"name": "murphy", "sentiment": "none"}, {"name": "harry reid", "sentiment": "none"}, {"name": "rubio", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "arizona", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}, {"name": "nevada", "sentiment": "none"}], "organizations": [{"name": "fox news latino", "sentiment": "neutral"}, {"name": "naleo educational fund", "sentiment": "none"}, {"name": "post", "sentiment": "none"}, {"name": "pew research", "sentiment": "none"}, {"name": "dnc", "sentiment": "none"}, {"name": "gop", "sentiment": "none"}, {"name": "naleo", "sentiment": "none"}, {"name": "washington post", "sentiment": "none"}, {"name": "u.s. senate", "sentiment": "none"}, {"name": "democratic senatorial campaign committee", "sentiment": "none"}, {"name": "democratic party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Andrew O'Reilly \n  Fox News Latino (Photo by Justin Sullivan/Getty Images) \nThere has been much talk this election season about how Republican presidential nominee Donald Trump’s rhetoric on immigration and border security has driven Latino voters away from the GOP.\nBut there is also a growing concern, among both Democrats and Hispanics leaders, that Democratic presidential nominee Hillary Clinton’s campaign is ignoring or taking the Hispanic vote for granted.\n“Every single Latino knows there is an election going on,” Arturo Vargas, the executive director of the NALEO Educational Fund, told Fox News Latino. “Clinton’s outreach is very surgical and focuses on only certain states and ignores the vast majority of Latinos in the country.”\nVargas added that a recent poll conducted by NALEO and Latino Decisions found that while a far larger share of registered Hispanic voters than normal have been reached out to this election season, 60 percent of those polled said that they haven’t heard from anyone.\nClinton’s strategy of focusing on specific Latino-heavy states – like Nevada and Florida – and on coaxing the growing population of Hispanic millennials to the polls is not broad enough, critics say, complaining that her campaign is late in launching a more traditional, Spanish-language ad campaign in key markets. The Democratic nominee has missed an opportunity, the thinking goes, that was seized on by President Obama's campaign four years ago.\n“This approach may end up being vindicated on Election Day,” Fernand Amandi, a veteran strategist who led Obama’s media operation for the Hispanic vote in 2012, told the Washington Post . “I just find it to be more risky than replicating what we know worked – which is the sustained approach that the Obama campaign put in place.”\nClinton’s aides and supporters, however, argue that as the Latino population continues to get younger – the median age of Hispanics in the U.S. is 27, according to a Pew Research report – it’s important to use more non-traditional, social media-based ways of communicating with the group beyond knocking on doors and airing TV and radio ads.\n“A lot of it has evolved to include outreach that isn’t obvious to people who are used to doing it old school,” strategist Maria Cardona told the Post. “The Clinton campaign and the DNC are very strategically focused on Latino millennials.”\nBesides the concern about how this will play out on Election Day for Clinton, Democrats are also worried about the strategy's effect on races down-ballot.\nIn the battle for the U.S. Senate in Florida, incumbent Republican Marco Rubio holds a sizeable lead over Democratic Rep. Patrick Murphy among Latino voters. \nWhile Rubio’s Cuban-American heritage surely gives him a boost among Hispanics, a recent poll found that 6 out 10 Latino Floridians feel they don’t know enough about Murphy to hold an opinion of him. Surely, a cause for concern among Democratic leaders in the state.\nIn Arizona, Democratic Rep. Ann Kirkpatrick is an unknown to 4 out of 10 Latinos as she vies to unseat Sen. John McCain. \nIn the battle for Sen. Harry Reid’s soon to be vacated Nevada seat, former Democratic Attorney General Catherine Cortez Masto leads Rep. Joseph J. Heck among Hispanics by a 58 percent to 24 percent margin. Even so, 38 percent of Latinos say they don’t know enough about her to have an opinion.\nA spokesperson for the Democratic Senatorial Campaign Committee told the Washington Post that the group is working on a streamlined approach in the closing weeks of the campaign season and pointed out that both Cortez Masto and Kirkpatrick are already airing Spanish TV ads.\nDespite the assertions from Democratic leaders that they are making concerted efforts to reach all Latino voters, critics like Vargas say that they have heard that story before.\n“This is the historical pattern of the Democratic Party,” he said. “In the national elections, the vast majority [of Latinos are] ignored because they focus on battleground states.”\nHe added, “We’re not a three-state community, we’re a 50-state community. Latinos are ignored, and there is no real outreach.”\n\nFollow Andrew O'Reilly on Twitter @aoreilly84. \nFollow us on twitter.com/foxnewslatino \nLike us at facebook.com/foxnewslatino", "external_links": [], "published": "2016-09-20T03:00:00.000+03:00", "crawled": "2016-09-20T22:38:18.138+03:00", "highlightTitle": ""}