{"organizations": [], "uuid": "3fb47b66971be68cb23237e0f605d9d66f2ec072", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "drugpolicycentral.com", "main_image": "", "site_section": "http://drugpolicycentral.com/bot/rss", "section_title": "breaking drug news latest 25", "url": "http://drugpolicycentral.com/bot/xarticle/cbsnews8650.htm", "country": "CA", "title": "Florida braces for \"life-threatening\" Hermine - CBS News", "performance_score": 0, "site": "drugpolicycentral.com", "participants_count": 1, "title_full": "[BOT] Florida braces for \"life-threatening\" Hermine - CBS News", "spam_score": 0.0, "site_type": "news", "published": "2016-09-01T03:00:00.000+03:00", "replies_count": 0, "uuid": "3fb47b66971be68cb23237e0f605d9d66f2ec072"}, "author": "drugpolicycentral.com", "url": "http://drugpolicycentral.com/bot/xarticle/cbsnews8650.htm", "ord_in_thread": 0, "title": "Florida braces for \"life-threatening\" Hermine - CBS News", "locations": [], "entities": {"persons": [{"name": "hermine", "sentiment": "none"}, {"name": "greaves", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "eric fisher", "sentiment": "none"}, {"name": "kerri walsh jennings", "sentiment": "none"}, {"name": "chris greaves", "sentiment": "none"}, {"name": "rick scott", "sentiment": "none"}, {"name": "omar villafranca", "sentiment": "none"}, {"name": "joe allen", "sentiment": "none"}, {"name": "lori jaress", "sentiment": "none"}, {"name": "lindsay lohan", "sentiment": "none"}, {"name": "scott", "sentiment": "none"}], "locations": [{"name": "florida", "sentiment": "none"}, {"name": "sarasota", "sentiment": "none"}, {"name": "charleston county", "sentiment": "none"}, {"name": "gainesville", "sentiment": "none"}, {"name": "south carolina", "sentiment": "none"}, {"name": "big bend", "sentiment": "none"}, {"name": "tampa", "sentiment": "none"}, {"name": "chicago", "sentiment": "none"}, {"name": "italy", "sentiment": "none"}, {"name": "gulf of mexico", "sentiment": "none"}, {"name": "south santee river", "sentiment": "none"}, {"name": "gulf  u.s.  georgetown", "sentiment": "none"}, {"name": "east coast", "sentiment": "none"}, {"name": "charleston", "sentiment": "none"}, {"name": "tallahassee", "sentiment": "none"}, {"name": "cedar key area", "sentiment": "none"}, {"name": "south florida", "sentiment": "none"}, {"name": "mexico beach", "sentiment": "none"}, {"name": "gulf coast", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "everglades", "sentiment": "none"}, {"name": "mexico city", "sentiment": "none"}, {"name": "mississippi", "sentiment": "none"}, {"name": "hawaii", "sentiment": "none"}, {"name": "dog island", "sentiment": "none"}, {"name": "la.", "sentiment": "none"}, {"name": "cedar key", "sentiment": "none"}, {"name": "fla.", "sentiment": "none"}, {"name": "marineland", "sentiment": "none"}, {"name": "st. george island", "sentiment": "none"}, {"name": "apalachicola river", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "franklin county", "sentiment": "none"}, {"name": "suwannee river", "sentiment": "none"}, {"name": "georgia", "sentiment": "none"}, {"name": "norway", "sentiment": "none"}, {"name": "los angeles", "sentiment": "none"}, {"name": "u.s.  florida", "sentiment": "none"}], "organizations": [{"name": "cbs news", "sentiment": "none"}, {"name": "florida  tropical storm hermine", "sentiment": "none"}, {"name": "cbs evening news", "sentiment": "none"}, {"name": "rolling stone magazine", "sentiment": "none"}, {"name": "interstate 75", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "cbs evening news  forecasting", "sentiment": "none"}, {"name": "fsu", "sentiment": "none"}, {"name": "reuters  scott", "sentiment": "none"}, {"name": "u.s. national hurricane center", "sentiment": "none"}, {"name": "wbz", "sentiment": "none"}, {"name": "cbs n", "sentiment": "none"}, {"name": "cbs boston", "sentiment": "none"}, {"name": "jetblue", "sentiment": "none"}, {"name": "national guard", "sentiment": "none"}, {"name": "associated press", "sentiment": "none"}, {"name": "cbs / ap", "sentiment": "none"}, {"name": "cbs interactive inc", "sentiment": "none"}, {"name": "national oceanic and atmospheric administration", "sentiment": "none"}, {"name": "cbs news app", "sentiment": "none"}, {"name": "cbs", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "This newsbot site, while automated (true!) has always depended on the generosity of volunteers and visitors to keep it up and running. If this site has helped you, and you can afford to help us , then we ask you to give generously. And to those who have been helping to keep us running, a heartfelt  THANK YOU!       Donate online: click here and help us out! \nUS: Florida braces for \"life-threatening\" Hermine - CBS News \nFound: Thu Sep 01 18:33:38 2016 PDT\nWebpage: http://www.cbsnews.com/news/hermine-could-... [translate] \nNewshawk: http://drugpolicycentral.com/bot/ \n\n\ntopical analysis prison was NOT mentioned \npropaganda analysis \nFlorida braces for \"life- threatening \" Hermine - CBS News Florida braces for \"life- threatening \" Hermine - CBS News \nThe all new \nCBS News App for Android. for iPad. for iPhone. \nFully redesigned. Featuring CBS N, 24/7 live news. Get the App ╳ \n* CBS News \n* CBS Evening News \n* CBS This Morning \nSpaceX explosion \nU.S. \nJudge denies Rolling Stone magazine's attempt to kill UVA frat's lawsuit \nU.S. \n3rd person dies after La. crash involving bus carrying flood relief volunteers \nU.S. \nInternet falls in love with baby 's \" evil laugh\" \n\"Life- threatening \" Hermine gains more strength in Gulf \nU.S. \nGeorgetown takes action to confront its history with slavery \nU.S. \nExplosion rocks SpaceX launch site in Florida during test \nU.S. \nCourt makes decision on Lindsay Lohan suit against \"Grand Theft Auto\" \nU.S. \nDrugmakers may face more legal action over opioid epidemic \nU.S. \nAugust deadliest month for Chicago in two decades \nU.S. \n5-year-old NYC boy ends up in wrong city after JetBlue mix-up \nU.S. \nFlorida gov.: Hermine \"a life- threatening situation\" \nCBS / AP September 1, 2016, 6:07 AM \n* Email \nLast Updated Sep 1, 2016 4:48 PM EDT \nUpdate: Hermine has strengthened into a hurricane. \nCEDAR KEY, Fla. -- People on Florida's Gulf Coast put up shutters, nailed plywood across storefronts and braced Thursday for Tropical Storm Hermine, which the state's governor called potentially life- threatening as forecasters said it could strike land as a hurricane. \nPlay Video CBS This Morning \nHermine likely to become a hurricane when it hits Florida \nTropical Storm Hermine is gaining strength in the Gulf of Mexico and could become the first hurricane to hit Florida in 11 years. It is expected ... \nA hurricane warning was in effect for Florida's Big Bend from the Suwannee River to Mexico Beach. And on the East Coast, a tropical storm warning was issued for an area extending from Marineland, Florida, northward to the South Santee River in South Carolina. \nOvernight in Sarasota, voluntary evacuations were underway, CBS News correspondent Omar Villafranca reports. Emergency crews navigated through waist-deep water looking for anyone possibly trapped. \n\"Officers were actually, they were coming up to me and their gun belts are underwater,\" Sarasota Police Lt. Lori Jaress said before gesturing to her stomach. \"They are actually up to here in water.\" \nPlay Video CBS Evening News \nForecasting three major storms in Hawaii, Florida \nChief meteorologist Eric Fisher of CBS Boston station WBZ is tracking Tropical Storm Hermine, as well as two hurricanes nearing Hawaii. \nGeorgia's governor declared a state of emergency for 56 counties through Saturday, in anticipation of high water and strong winds. \nIn Florida, Gov. Rick Scott said at a news conference that authorities expect strong storm surge, high winds, downed trees and power outages when Hermine comes ashore either later Thursday or early Friday. He urged residents to take precautions immediately - moving to inland shelters if necessary - and ensuring they have sufficient food, water and medicine. \n\"This is a life- threatening situation,\" Scott said. \"It's going to be a lot of risk. Right now, I want everybody to be safe.\" \nPlay Video CBS Evening News \nTropical Storm Hermine hits Florida's coast \nGusting winds were the first sign of Tropical Storm Hermine's approach to the west coast of Florida Wednesday. The storm is expected to make land... \nScott added that 6,000 National Guard members in Florida are ready to mobilize after the storm passes. \nHermine's maximum sustained winds Thursday afternoon were near 70 mph. The U.S. National Hurricane Center said Hermine was likely to strengthen into a Category 1 hurricane by the time it lands in Florida on Thursday night or early Friday. \nAs of 1 p.m. EDT Thursday, Hermine was centered about 190 miles west of Tampa, Florida, and was moving north-northeast near 14 mph. \nResidents in some low-lying Florida communities were being asked to evacuate Thursday as the storm approached. The Tallahassee Democrat reported that emergency management officials in Franklin County have issued a mandatory evacuation notice for people living on St. George Island, Dog Island, Alligator Point and Bald Point. Residents in other low-lying, flood-prone areas were also being asked to evacuate. \nTropical Storm Hermine is shown over the Gulf of Mexico in this GOES East satellite image captured Sept. 1, 2016. \nNASA/Handout via Reuters \nScott ordered state government offices in 51 counties to close at noon Thursday. The order included the state capital of Tallahassee, home to tens of thousands of state workers. The city, roughly 35 miles from the coast, has not had a direct hit by hurricane in 30 years. \nThe last hurricane to strike Florida was Hurricane Wilma, which entered the state from along the southwest Gulf Coast as a major Category 3 storm on Oct. 24, 2005. It swept across the Everglades and struck highly-populated south Florida, causing five deaths in the state and an estimated $23 billion in damage , according to the National Oceanic and Atmospheric Administration. \nResidents were out in force Thursday morning preparing for the storm and stores were already running low on bottled water and flashlights. City crews were struggling to keep up with demand for sand with sandbags. \nFlooding is expected across a wide swath of the Big Bend area, which has a mostly marshy coastline. Florida's Big Bend area extends from just east of the Apalachicola River in the Panhandle to roughly the Cedar Key area, west of Gainesville. It's made up of mostly rural communities and smaller cities away from Interstate 10 and Interstate 75. \nOn Cedar Key, a small island, about a dozen people were going from storefront to storefront putting up shutters and nailing pieces of plywood to protect businesses from the wind. \nOne of them, Joe Allen, spray painted on plywood in large black letters: \"Bring it on, Hermine.\" Despite the bravado, he said, \"I'm worried. You can never fully protect yourself from nature.\" \nChris Greaves and family members stopped in Tallahassee to pick up sandbags for his garage and the church they attend. \nGreaves said he lived in South Florida when Hurricane Andrew devastated the region in 1992. While he doesn't expect the same kind of widespread damage , he isn't taking any chances. \nHe said tropical weather is \"nothing to mess with,\" adding \"you still take precautions.\" \nIn South Carolina, news outlets reported that high school football games in many areas will be played Thursday night because Hermine was expected to bring heavy rains to the state Friday. \nIn Charleston County, emergency officials have a message for residents: Stay home on Friday. The storm is expected to flood streets in the Charleston area which can see high tide flooding even on sunny days. \n(c) 2016 CBS Interactive Inc. All Rights Reserved. This material may not be published, broadcast, rewritten, or redistributed. The Associated Press contributed to this report. \n* Comment \n* Share \n* Tweet \n* Stumble \nFeatured in U.S. \nPolice make arrest in killings of 2 Mississippi nuns \nNuns were nurse practitioners who dedicated their lives to providing health care to people in state's poorest county \nIn wake of Italy quake, how ready is Los Angeles? \nThe Los Angeles skyline may look drastically different than the centuries-old villages pulverized in massive earthquake, but looks can be deceiving \nPopular \nMost Popular \nOlympian Kerri Walsh Jennings boycotting beach volleyball event in Chicago \n358973 views \nCreepy details released in SC clown sightings \n167412 views \nVideo shows boy thrown from rail bridge into river \n122969 views \nMore than 300 reindeer killed \"in one moment\" in Norway \n117757 views \nMother brought to tears by FSU player's sweet gesture toward son with autism \n111917 views \nWatch CBS N Live \nTeenager Dies From Hickey Girlfriend Gave Him \nPrevious Next \nMost Discussed \nHow immigration hardliners are reacting to confusion over Trump's stance \nTrump, Mexican President discuss border wall in Mexico City", "external_links": [], "published": "2016-09-01T03:00:00.000+03:00", "crawled": "2016-09-02T05:25:09.287+03:00", "highlightTitle": ""}