{"organizations": [], "uuid": "f3db90961edc2f59b24448932e651019b5f03ed2", "thread": {"social": {"gplus": {"shares": 1}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/news/0/0/Arpaio%20peace%20sign.jpg", "site_section": "http://feeds.latino.foxnews.com/home/feed", "section_title": "FOX News", "url": "http://latino.foxnews.com/latino/news/2016/09/22/sheriff-arpaio-political-rival-blames-him-for-72m-cost-in-racial-profiling-case/", "country": "US", "domain_rank": 185, "title": "Sheriff Arpaio's political rival blames him for $72M cost in racial profiling case", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "Sheriff Arpaio's political rival blames him for $72M cost in racial profiling case | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2016-09-22T03:00:00.000+03:00", "replies_count": 0, "uuid": "f3db90961edc2f59b24448932e651019b5f03ed2"}, "author": "Fox News Latino", "url": "http://latino.foxnews.com/latino/news/2016/09/22/sheriff-arpaio-political-rival-blames-him-for-72m-cost-in-racial-profiling-case/", "ord_in_thread": 0, "title": "Sheriff Arpaio's political rival blames him for $72M cost in racial profiling case", "locations": [], "entities": {"persons": [{"name": "joe arpaio", "sentiment": "negative"}, {"name": "arpaio", "sentiment": "negative"}, {"name": "penzone", "sentiment": "none"}, {"name": "wang", "sentiment": "none"}, {"name": "cecillia wang", "sentiment": "none"}, {"name": "willems", "sentiment": "none"}, {"name": "chad willems", "sentiment": "none"}, {"name": "jerry sheridan", "sentiment": "none"}, {"name": "sheridan", "sentiment": "none"}, {"name": "paul penzone", "sentiment": "none"}], "locations": [{"name": "arizona", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "tent city", "sentiment": "none"}, {"name": "phoenix", "sentiment": "none"}], "organizations": [{"name": "ap", "sentiment": "negative"}, {"name": "american civil liberties union", "sentiment": "none"}, {"name": "democratic", "sentiment": "none"}, {"name": "aclu", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "  Sheriff Joe Arpaio of Arizona in a July 21, 2016 file photo. ap \nPHOENIX (AP) –   The sheriff of metro Phoenix is facing stinging criticism from his political rival over the financial impact of a racial profiling case that targeted his trademark immigration patrols and is expected to cost taxpayers $72 million by next summer.\nCounty officials voted Wednesday to pay $4.4 million in legal fees to lawyers who won the case against Sheriff Joe Arpaio. Most of the fees are attributed to Arpaio's contempt-of-court violations for ignoring a court order to stop his immigration patrols.\nPaul Penzone, the sheriff's Democratic challenger, rejected claims by Arpaio's office that the lawyers who filed the case were responsible for the costs.\n\"There is no room for them to try to portray themselves as victims when they created a problem that we are paying for,\" Penzone said.\nArpaio campaign manager Chad Willems issued a statement saying the American Civil Liberties Union refused to settle the contempt case and instead drove up the taxpayer tab by letting the contempt hearings drag on.\n\"If Penzone wants to side with the ACLU on this issue, he can be our guest,\" Willems said.\nFederal law lets the winners of civil rights cases seek reimbursement for legal costs. County officials bemoaned having to pay the fees, but they said the law required them to do so.\nThe racial profiling lawsuit that Arpaio lost more than three years ago marks the worst legal defeat in his 23 years as sheriff. It morphed into a contempt case after U.S. District Judge Murray Snow accused Arpaio of violating court orders.\nIt also revealed flaws in the agency's internal investigations, which the judge said had been manipulated to shield sheriff's officials from accountability.\nArpaio and Jerry Sheridan, the sheriff's second in command, have been found in civil contempt, and federal prosecutors are considering whether to bring a criminal contempt case that could expose them to jail time.\nThe 84-year-old lawman is seeking his seventh term in office in November.\nSo far, the county has been on the hook for $48.2 million in the profiling case. Estimates on the costs of the case skyrocketed this summer after the judge imposed expensive punishments in response to his civil contempt finding against Arpaio.\nThe future costs include $9.8 million for a court-ordered overhaul of the sheriff's internal affairs operations. Another new cost was $1 million for setting up a county-funded system for compensating Latinos who were illegally detained when Arpaio ignored the immigration patrol order.\nThe sheriff's office was forced to make $8 million in cuts from its budget after the judge ordered the punishments.\nThe agency considered but ultimately rejected a suggestion to shut down \"Tent City,\" a complex of canvas jail tents that helped make Arpaio a national political figure and that the sheriff touted in a recent campaign ad.\nInstead, other cuts were made, including the elimination of a $2.4 million pilot project that would have given a one-time pay increase to some jail officers in a bid to discourage them from seeking jobs elsewhere.\n\"I would definitely choose the detention officers over the tents,\" Penzone said.\nAccording to Sheridan, closing Tent City wouldn't have been as easy as critics claimed, nor would it have produced the savings that the sheriff's detractors were expecting.\n\"It's been spun and misrepresented as the sheriff choosing his tents over his employees, and that's not accurate,\" Sheridan said.\nCecillia Wang, an ACLU attorney who helped press the profiling case against Arpaio, said the rising costs can be traced directly back to the sheriff's contempt violations, which included withholding records at the 2012 profiling trial.\n\"If he hadn't violated court orders, and if he hadn't fought tooth and nail and evaded his legal obligations to turn over documents during the contempt hearing and before the original trial, we never would have had to go to this expense — on either side,\" Wang said.\nThe vote Wednesday marked the second time that Arpaio's legal foes in the case have sought fees. Two years ago, the attorneys were awarded nearly $4.5 million for the costs of bringing the case to trial.\nArpaio, who earns $100,000 annually as sheriff and owns commercial real estate worth more than $2 million, hasn't had to pay for legal bills directly tied to his official duties in any lawsuits filed against him in his six terms as sheriff.\nIn a bid to get his contempt hearings called off, Arpaio acknowledged the civil violations, offered to make a public apology and proposed a $100,000 donation from his own pocket to a Latino civil rights group.\nSnow had said the donation was an adequate penalty, but he rejected Arpaio's requests to cancel the hearings because the proposal didn't comprehensively resolve the case.\n ", "external_links": [], "published": "2016-09-22T03:00:00.000+03:00", "crawled": "2016-09-22T16:06:35.830+03:00", "highlightTitle": ""}