{"organizations": [], "uuid": "ce2e66c857a12910878620a0fe9c6769fe46cbc4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 215, "shares": 215, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.foxnews.com", "main_image": "http://www.foxnews.com/content/dam/fox-news/logo/og-fn-foxnews.jpg", "site_section": "http://www.foxnews.com/about/rss/feedburner/foxnews/politics", "section_title": "FOX News", "url": "http://www.foxnews.com/politics/2016/09/04/more-syrians-into-indiana-after-court-rejects-gov-pences-try-to-limit-states-refugee-resettlements.html", "country": "EU", "domain_rank": 185, "title": "More Syrians into Indiana, after court rejects Gov. Pence's try to limit state's refugee resettlements", "performance_score": 2, "site": "foxnews.com", "participants_count": 1, "title_full": "More Syrians into Indiana, after court rejects Gov. Pence's try to limit state's refugee resettlements | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2016-09-04T03:00:00.000+03:00", "replies_count": 0, "uuid": "ce2e66c857a12910878620a0fe9c6769fe46cbc4"}, "author": "Associated Press", "url": "http://www.foxnews.com/politics/2016/09/04/more-syrians-into-indiana-after-court-rejects-gov-pences-try-to-limit-states-refugee-resettlements.html", "ord_in_thread": 0, "title": "More Syrians into Indiana, after court rejects Gov. Pence's try to limit state's refugee resettlements", "locations": [], "entities": {"persons": [{"name": "pence", "sentiment": "negative"}, {"name": "greg otolski", "sentiment": "none"}, {"name": "joseph tobin", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "mike pence", "sentiment": "none"}, {"name": "varga", "sentiment": "none"}, {"name": "tonya walton pratt", "sentiment": "none"}, {"name": "cole varga", "sentiment": "none"}, {"name": "kara brooks", "sentiment": "none"}, {"name": "obama", "sentiment": "none"}], "locations": [{"name": "indiana", "sentiment": "none"}, {"name": "indianapolis", "sentiment": "none"}, {"name": "myanmar", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "syria", "sentiment": "none"}, {"name": "chicago", "sentiment": "none"}, {"name": "connecticut", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "refugee processing center", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "belgium", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}, {"name": "erie", "sentiment": "none"}, {"name": "indianapolis", "sentiment": "none"}, {"name": "pennsylvania", "sentiment": "none"}], "organizations": [{"name": "associated press", "sentiment": "negative"}, {"name": "catholic charities of indianapolis", "sentiment": "none"}, {"name": "catholic charities", "sentiment": "none"}, {"name": "u.s. state department", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Published September 04, 2016 Associated Press   INDIANAPOLIS –   About 150 Syrian refugees have arrived in Indiana in the months since a federal judge scuttled Republican Gov. Mike Pence's order blocking state agencies from helping their resettlement.\nRefugee assistance groups expect more this year, even as lawyers for the state go before a federal appeals court Sept. 14 to try to have the judge's decision overturned. The judge said Pence's directive \"clearly discriminates\" against refugees from the war-torn country.\nSyrians make up less than 10 percent of the refugees who've been resettled in Indiana since October, according to federal records. They also represent only tiny fraction of the 10,000 Syrian refugees that the Obama administration said Aug. 29 had been taken in by the United States under a year-old resettlement program.\nPence tried to halt Indiana's participation in that effort with his November order after the deadly terrorist attacks in Paris, saying he didn't believe the federal government was adequately screening Syrian refugees; the attackers primarily were from France and Belgium.\nHis position on the issue hasn't changed, governor's office spokeswoman Kara Brooks said of Donald Trump's vice presidential running mate. And Trump said Wednesday that he would suspend arrivals from Syria, portraying them as a potential security threat.\nIndianapolis-based Exodus Refugee Immigration diverted one Syrian refugee family to Connecticut days after Pence's order, but says it hasn't encountered any troubles as it has brought nearly 100 Syrians to the state since the federal ruling in February.\n\"It has been overwhelming supportive from the Indianapolis community despite Governor Pence's directive,\" said Cole Varga, executive director of the group.\nThe Pence administration has sought to withhold money to resettlement groups for services such as job training, but hasn't denied a greater amount of federal assistance such as food stamps and health care benefits.\nPence issued a statement after U.S. District Judge Tonya Walton Pratt's Feb. 29 ruling, saying: \"My administration will continue to use every legal means available to suspend this program in Indiana unless and until federal officials take steps to ensure the safety and security of our citizens.\"\nExodus argues that Pence's stance would interfere with its mission of helping refugees.\n\"A state cannot pick and choose -- they are either helping refugees or they're not,\" Varga said.\nAll of the Syrian refugees that Exodus has resettled, along with 40 more handled by Catholic Charities of Indianapolis, are living in Indianapolis or its suburbs. In comparison, about two-thirds more have settled in Chicago, and there are 205 in Erie, Pennsylvania, according to the U.S. State Department's Refugee Processing Center.\nOf the 1,447 total refugees who arrived in Indiana from Oct. 1 to July 31, more than 75 percent were from Myanmar. Refugees from that country have been the most common in Indiana for several years.\nPence specifically asked Indianapolis Archbishop Joseph Tobin in December not to have Catholic Charities resettle a Syrian family in Indianapolis. Catholic Charities went ahead, however, and will do so even without state or federal money, archdiocese spokesman Greg Otolski said, noting that families wait two years or more to come to the U.S.\n\"It is one of the critical pieces of what we do to be welcoming to people from across the world who need a safe refuge,\" he said. \"We're going to keep providing that service for families who are really fleeing horrible violence in various parts of the world, not just Syria.\"", "external_links": [], "published": "2016-09-04T03:00:00.000+03:00", "crawled": "2016-09-04T18:16:14.713+03:00", "highlightTitle": ""}