{"organizations": [], "uuid": "ee04b7100b6020535140b9d6b525013d017084fe", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 453, "shares": 453, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/politics/0/0/Pena%20pissed%20Latino.jpg", "site_section": "http://feeds.latino.foxnews.com/home/feed", "section_title": "FOX News", "url": "http://latino.foxnews.com/latino/politics/2016/09/01/hours-after-cordial-meeting-angry-mexican-president-unleashes-tirade-against/", "country": "US", "domain_rank": 185, "title": "Hours after cordial meeting, angry Mexican president unleashes tirade against Trump", "performance_score": 4, "site": "foxnews.com", "participants_count": 1, "title_full": "Hours after cordial meeting, angry Mexican president unleashes tirade against Trump | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2016-09-01T03:00:00.000+03:00", "replies_count": 0, "uuid": "ee04b7100b6020535140b9d6b525013d017084fe"}, "author": "Fox News Latino", "url": "http://latino.foxnews.com/latino/politics/2016/09/01/hours-after-cordial-meeting-angry-mexican-president-unleashes-tirade-against/", "ord_in_thread": 0, "title": "Hours after cordial meeting, angry Mexican president unleashes tirade against Trump", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "negative"}, {"name": "enrique pena nieto", "sentiment": "negative"}, {"name": "ricardo anaya", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "nieto", "sentiment": "none"}, {"name": "anaya", "sentiment": "none"}, {"name": "peña nieto", "sentiment": "none"}, {"name": "enrique peña nieto", "sentiment": "none"}], "locations": [{"name": "mexico", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "los pinos", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "arizona", "sentiment": "none"}, {"name": "mexico city", "sentiment": "none"}, {"name": "phoenix", "sentiment": "none"}], "organizations": [{"name": "trump   republican", "sentiment": "neutral"}, {"name": "trump", "sentiment": "none"}, {"name": "associated press", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "national action party", "sentiment": "none"}, {"name": "ap", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "  Republican presidential nominee Donald Trump walks with Mexico President Enrique Pena Nieto at the end of their joint statement at Los Pinos, the presidential official residence, in Mexico City, Wednesday, Aug. 31, 2016. Trump is calling his surprise visit to Mexico City Wednesday a 'great honor.' The Republican presidential nominee said after meeting with PeÃÂ±a Nieto that the pair had a substantive, direct and constructive exchange of ideas.(AP Photo/Dario Lopez-Mills) Copyright 2016 The Associated Press. All rights reserved. \nJust a few hours after Republican presidential nominee Donald Trump stood at a podium next to Mexico’s President Enrique Peña Nieto, praising the character and work ethics of Mexicans and Mexican-Americans, he delivered one of his most hardline immigration addresses miles away in Arizona.\nMexico’s president, it seems, felt a bit played.\nThe Wednesday afternoon meeting between Peña Nieto and Trump was organized at the last minute, and was characterized by the Mexican president – whose popularity rating at home is at an all-time low of 23 percent – as “open and constructive.”\nTrump, who on the campaign trail has said Mexico sends its “rapists” and “criminals” to U.S., discussed instead the hard work and sacrifices of Mexican-Americans. The two had a cordial press conference in Mexico City where they basically said they agreed to disagree on the issue of immigration.\nBut after Trump’s hardline immigration keynote speech, in a tense interview on Mexican television, Peña Nieto struck a different note, Reuters reported .\n\"His policy stances could represent a huge threat to Mexico, and I am not prepared to keep my arms crossed and do nothing,\" Peña Nieto said after enduring criticism from opposition politicians who suggested that he had done just that during Trump’s visit. \"That risk, that threat, must be confronted. I told him that is not the way to build a mutually beneficial relationship for both nations.\"\nIn the days leading up to his Mexico trip and immigration address, Trump had appeared to back down from some of the key proposals of his immigration policy, like the creation of an armed force dedicated to deporting undocumented migrants and suggesting that some would be allowed a path to legal status.\nBut his Phoenix speech showed he wasn’t softening his immigration stance.\n“Our message to the world will be this: You cannot obtain legal status or become a citizen of the United States by illegally entering our country,” Trump said. “Can’t do it. This declaration alone will stop the crisis of illegal crossing. You can’t just smuggle in, hunker down and wait to be legalized. Those days are over.”\nRicardo Anaya, the head of the conservative National Action Party (PAN), criticized Peña Nieto before Trump’s visit, as well as after the candidate’s speech in Arizona.\n\"Instead of making [Trump] apologize, the government allowed him to complete the humiliation of the Mexicans,\" Anaya wrote on Twitter.\nA government official who requested anonymity told Reuters that the two politicians spoke English during their meeting, and that Peña Nieto clearly expressed to Trump that he had offended a lot of people in Mexico with his campaign speeches.\n\"He's a candidate who has offended a lot of Mexicans, so that's the chemistry there was [between them],\" the official said.\nIn the interview, Peña Nieto also contradicted one point that Trump made during their joint press conference. Trump told reporters that while the two men had discussed his proposal to build a wall along the U.S.-Mexico border, they had not discussed who would pay for it. Peña Nieto insisted on TV that he had reiterated his unwillingness to pay for the wall to Trump during their closed door meeting.\n ", "external_links": [], "published": "2016-09-01T03:00:00.000+03:00", "crawled": "2016-09-01T19:10:00.246+03:00", "highlightTitle": ""}