{"organizations": [], "uuid": "f50ca9971f290dd0c733bb6f298ace5c051f4aac", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/images.foxnews.com/content/fox-news/world/2016/09/22/like-killing-chicken-trauma-expert-on-mission-to-record-isis-horror-stories/_jcr_content/par/featured-media/media-0.img.jpg/0/0/1474551470158.jpg?ve=1", "site_section": "http://feeds.foxnews.com/foxnews/latest", "section_title": "FOXNews.com", "url": "http://www.foxnews.com/world/2016/09/22/like-killing-chicken-trauma-expert-on-mission-to-record-isis-horror-stories.html", "country": "CH", "domain_rank": 185, "title": "'LIKE KILLING A CHICKEN' Trauma expert records tales of ISIS rape, attacks", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "'LIKE KILLING A CHICKEN' Trauma expert records tales of ISIS rape, attacks", "spam_score": 0.0, "site_type": "news", "published": "2016-09-22T23:08:00.000+03:00", "replies_count": 0, "uuid": "f50ca9971f290dd0c733bb6f298ace5c051f4aac"}, "author": "foxnewsonline@foxnews.com (Fox News Online)", "url": "http://www.foxnews.com/world/2016/09/22/like-killing-chicken-trauma-expert-on-mission-to-record-isis-horror-stories.html", "ord_in_thread": 0, "title": "'LIKE KILLING A CHICKEN' Trauma expert records tales of ISIS rape, attacks", "locations": [], "entities": {"persons": [{"name": "yasmin", "sentiment": "negative"}, {"name": "kizilhans", "sentiment": "none"}, {"name": "blume", "sentiment": "none"}, {"name": "kizilhan", "sentiment": "none"}, {"name": "chiad", "sentiment": "none"}, {"name": "jan kizihan", "sentiment": "none"}, {"name": "abu chiad", "sentiment": "none"}, {"name": "jan kizilhan", "sentiment": "none"}, {"name": "tekkal", "sentiment": "none"}, {"name": "donald snyder", "sentiment": "none"}, {"name": "duzen tekkal", "sentiment": "none"}, {"name": "rinda", "sentiment": "none"}, {"name": "michael blume", "sentiment": "none"}, {"name": "jan kizihan)  chiad", "sentiment": "none"}], "locations": [{"name": "kirkuk", "sentiment": "none"}, {"name": "baden-wurttemberg", "sentiment": "none"}, {"name": "syria", "sentiment": "none"}, {"name": "chiad", "sentiment": "none"}, {"name": "baden-wurttenberg", "sentiment": "none"}, {"name": "eastern europe", "sentiment": "none"}, {"name": "iraq", "sentiment": "none"}, {"name": "rwanda", "sentiment": "none"}, {"name": "sinjar", "sentiment": "none"}, {"name": "kosovo", "sentiment": "none"}, {"name": "stuttgart", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}, {"name": "raqqa", "sentiment": "none"}], "organizations": [{"name": "twitter", "sentiment": "negative"}, {"name": "isis", "sentiment": "negative"}, {"name": "facebook", "sentiment": "negative"}, {"name": "nazis", "sentiment": "none"}, {"name": "nbc", "sentiment": "none"}, {"name": "united nations", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Facebook 0 Twitter 0 livefyre Email Print Yasmin, who set herself on fire to avoid a brutal attack by ISIS, is shown with Dr. Jan Kizihan. (Courtesy: Jan Kizihan) \nAbu Chiad boasted about beheading infidels, raping women and children and slaughtering in the name of Islam. Speaking from a prison in the city of Kirkuk, in northern Iraq, he told Dr. Jan Kizilhan that these acts would get him to heaven. \nKizilhan, 49, a German of Kurdish background, is a psychology professor and trauma expert who has worked with trauma victims in Rwanda and Kosovo. He went to Iraq with Michael Blume, minority affairs expert for the German state of Baden-Wurttemberg, to help the victims of ISIS. Their mission was to bring traumatized women and children back to Germany for treatment. Related Image Expand / Contract The photos taken in a refugee camp in northern Iraq show the desperation of children and women who have been victimized by ISIS. (Courtesy: Duzen Tekkal) \nIn a telephone interview, Blume said he eagerly took advantage of an opportunity to save a thousand lives. \nBaden-Wurttemberg has authorized $107 million over three years for this humanitarian work in response to an appeal from the 100,000-member German-Yazidi community following the ISIS massacre two years ago of Yazidis in the Sinjar region of northern Iraq. The Yazidis are an ancient non-Muslim minority in Iraq. They’ve lived in the Sinjar region for centuries. Related Image Expand / Contract Rinda, 10, a Yazidi girl, was taken prisoner by ISIS and sold eight times to ISIS fighters. (Courtesy: Jan Kizihan) \nChiad, a 26-year old Chechen, had moved his wife and three children to Raqqa, Syria, to join the fight to create an Islamic State across Syria and Iraq. He embraced the ethnic cleansing that was intended to rid the region of Christians, Jews, non-Sunni Muslims and Yazidis. \n“I asked Abu Chiad how he could show love for his wife and children and murder people the same day,” Kizilhan said in a phone interview from Stuttgart. \nHe said Chiad showed no remorse as he spoke about making daily trips to a marketplace to behead people and rape Yazidi women, after which he would return home as a loving father and husband. \n“Killing them was like killing a chicken,” Chiad told Kizilhan. \nIn Chiad’s mind, Kizilhan said, the victims were not human. He said ISIS killers and rapists rationalize their behavior by dehumanizing their victims, much as the Nazis justified their mass slaughter of Jews in the Holocaust. He has written a book, “The Psychology of ISIS,” in which he analyzes this savage behavior. It will be published in Germany in October. \nKizilhan had horrifying stories to tell about the 1,100 women and children, former ISIS captives, who are now being treated in Germany, most of them at a facility near Stuttgart in Baden-Wurttenberg. \nRinda, 10, and her mother were abducted on Aug. 3, 2014, when ISIS invaded the Sinjar region. They were taken to Raqqa. Rinda was sold eight times to ISIS fighters, who beat and raped her. Her parents’ fate is not known. \nYasmin, 16, who feared another rape, wanted to make herself undesirable, so she doused herself with gasoline and lit a match. Badly burned, she is in a German hospital facing more than 20 surgeries. \n“Now she looks like a zombie, and children cry when they see her,” Kizilhan said. “It is so difficult to see what the fire did to her.” \nMost of the 400,000 Yazidis who lived in Sinjar have been displaced, captured or killed. According to a United Nations report, 5,000 Yazidi civilians were murdered in 2014, and women and children were sold into slavery. Many of the abuse victims have committed suicide. \nDuzen Tekkal, a German-Yazidi journalist, went to Iraq to make a documentary — “Hawar” — about the plight of the Yazidi people. She went because people told her: “You are a Yazidi and a journalist and must come here and tell the world our story.” \n“I knew it was very dangerous,” Tekkal said in a phone interview. “But I knew I had to go there.” \nLike Kizilhan, she has difficult stories to tell. She speaks of children who are no longer children. “In one case,” she said, “A 9-year-old said, ‘Take me to be raped, not my little sister, please don’t touch her, take me,’ So they took the 6-year-old down the mountain, and they raped her.” \nTekkal said that many of the children repressed their rapes as a defense mechanism. “One 12-year-old said she wasn’t raped. But she was pregnant.” \nTekkal praised the work Kizilhan is doing. “We need hundreds of Dr. Kizilhans to deal with all the wounds inflicted by ISIS,” she said. \nKizilhan said Rinda often asks how ISIS can do such terrible things, how people can be so evil. \n“I ask the same question,” he said. “Why is humanity still so evil in the 21st century?” \nDonald Snyder was a news producer at NBC for 27 years and has been a freelance writer since his retirement. He specializes in Germany and Eastern Europe. Advertisement", "external_links": [], "published": "2016-09-22T23:08:00.000+03:00", "crawled": "2016-09-22T18:27:51.684+03:00", "highlightTitle": ""}