{"organizations": [], "uuid": "643f627e2327b0eaa96e16b9b86278789e056c5e", "thread": {"social": {"gplus": {"shares": 2}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 296, "shares": 296, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/images.foxnews.com/content/fox-news/world/2016/09/09/greece-rejects-return-eu-rule-on-reverse-migration-flow/_jcr_content/par/featured-media/media-0.img.jpg/0/0/1473407263577.jpg?ve=1", "site_section": "http://feeds.foxnews.com/foxnews/world", "section_title": "FOX News", "url": "http://www.foxnews.com/world/2016/09/09/greece-rejects-return-eu-rule-on-reverse-migration-flow.html", "country": "IT", "domain_rank": 185, "title": "Greece rejects return of EU rule on reverse migration flow", "performance_score": 2, "site": "foxnews.com", "participants_count": 1, "title_full": "Greece rejects return of EU rule on reverse migration flow | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2016-09-09T03:00:00.000+03:00", "replies_count": 0, "uuid": "643f627e2327b0eaa96e16b9b86278789e056c5e"}, "author": "Associated Press", "url": "http://www.foxnews.com/world/2016/09/09/greece-rejects-return-eu-rule-on-reverse-migration-flow.html", "ord_in_thread": 0, "title": "Greece rejects return of EU rule on reverse migration flow", "locations": [], "entities": {"persons": [{"name": "matteo renzi", "sentiment": "none"}, {"name": "renzi", "sentiment": "none"}, {"name": "francois hollande", "sentiment": "none"}, {"name": "brad blitz", "sentiment": "none"}, {"name": "giorgos kyritsis", "sentiment": "none"}, {"name": "blitz", "sentiment": "none"}, {"name": "kyritsis", "sentiment": "none"}, {"name": "alexis tsipras", "sentiment": "none"}, {"name": "mona", "sentiment": "none"}], "locations": [{"name": "greece", "sentiment": "none"}, {"name": "athens", "sentiment": "none"}, {"name": "ritsona", "sentiment": "none"}, {"name": "portugal", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "ritsona refugee camp", "sentiment": "none"}, {"name": "spain", "sentiment": "none"}, {"name": "turkey", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "malta", "sentiment": "none"}, {"name": "italy", "sentiment": "none"}, {"name": "mediterranean", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "athens", "sentiment": "none"}, {"name": "cyprus", "sentiment": "none"}, {"name": "dublin", "sentiment": "none"}, {"name": "bratislava", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "negative"}, {"name": "european union", "sentiment": "none"}, {"name": "middlesex university", "sentiment": "none"}, {"name": "associated press", "sentiment": "none"}, {"name": "ap photo/petros giannakouris", "sentiment": "none"}, {"name": "ap", "sentiment": "none"}, {"name": "unhcr", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "  A Syrian woman carries a plastic bag with garbage at Ritsona refugee camp north of Athens, which hosts about 600 refugees and migrants on Thursday, Sept. 8, 2016. The refugee crisis is expected to be a central issue in discussions Friday at a meeting in Athens of leaders from Mediterranean countries in the European Union. (AP Photo/Petros Giannakouris)   \nA Syrian man feeds his child behind a UNHCR plastic sheet at Ritsona refugee camp, north of Athens, which hosts about 600 refugees and migrants on Thursday, Sept. 8, 2016. The refugee crisis is expected to be a central issue in discussions Friday at a meeting in Athens of leaders from Mediterranean countries in the European Union. (AP Photo/Petros Giannakouris)   \nSiha, a 35-year-old Syrian mother tends to her month-old daughter Mona inside their tent at Ritsona refugee camp, north of Athens, which hosts about 600 refugees and migrants on Thursday, Sept. 8, 2016. The refugee crisis is expected to be a central issue in discussions Friday at a meeting in Athens of leaders from Mediterranean countries in the European Union. (AP Photo/Petros Giannakouris)   ATHENS, Greece –   The Greek government is adamantly opposing the revival of a European Union rule that would allow the forcible return to its territory of asylum-seekers who entered the bloc via Greece — a path followed by more than a million people in the past two years.\nImmigration is high on the agenda of a meeting Friday in Athens of southern European leaders. The group includes Italian Prime Minister Matteo Renzi, whose country, with Greece, is Europe's main immigration gateway.\nAhead of the talks, a government spokesman on immigration said Athens rejects reactivation of the so-called Dublin Regulation, which would allow other EU members to send asylum-seekers back to Greece.\n\"A country such as Greece which receives a large number of refugees from Turkey, and also hosts a large number of refugees — practically without any outside help — cannot be asked to receive refugees from other European countries,\" Giorgos Kyritsis told The Associated Press. \"That would be outrageous.\"\nThe Dublin Regulation that governs the Schengen passport-free area stipulates that people wishing to apply for asylum must do so in the first member country they arrive in. In most cases that was Greece, whose eastern islands were overwhelmed last year by migrants packed into smugglers boats from Turkey. But even before last year's migration crisis, many of its EU partners had stopped enforcing the rule because Greece's asylum and migrant reception systems were below standard.\nNow, however, both Germany and the EU executive are pressing for the rule to be restored, with EU officials saying that Greece must meet the Dublin standards by the end of this year.\nBrad Blitz, migration expert and professor of international politics at Middlesex University in Britain, said sending large numbers of asylum-seekers back to Greece would apply an ever greater strain on the country's asylum system and reception capacity.\n\"Unless there is an effective means of redistribution across the EU, a revised Dublin system will force refugees upon receiving states closest to the external border, above all Greece, Italy and to a lesser extent Spain,\" he said.\n\"It will do so by insisting they apply for asylum in Greece, and potentially by returning them from other EU states to Greece. In sum, this will enable returns and discourage EU states from accepting more refugees, including Greece,\" Blitz said.\nKyritsis, the government official, said Greece considers the Dublin rule to be \"practically dead\" because it does not address current migratory pressures and should be drastically overhauled. He added that calls for its reintroduction are to a degree linked with domestic political concerns in Germany, and he argued that EU members are lagging in implementing commitments to take in refugees from Greece — part of an EU-Turkey deal this year to stem the migratory flow.\nKyritsis said the migrant relocation deal ought to have seen 33,000 people transferred to other EU countries from Greece so far. Instead, only 3,000 have made the journey.\n\"There are 7,000 people ready and waiting to be relocated, so in this field other European countries and the European Union do not appear to ... have done what they ought to have done,\" he said.\nAbout 60,000 refugees and other migrants remain trapped in Greece since a series of Balkan border closures in March, which were closely followed by a March EU-Turkey deal that provides for the return to Turkey of all migrants who get across to Greece.\nHuman rights groups have criticized the agreement, saying it condemns refugees to an uncertain future in Turkey, and implementation has proved problematic as Greek authorities struggle to process asylum bids by people arguing that they shouldn't be sent back.\nThe agreement is also looking increasingly shaky following disagreements over visa-free entry to the EU for Turks and simmering tensions between individual bloc members and Turkey.\nKyritsis, however, said Athens has no indication that the deal will not hold.\n\"There are problems, a negotiation is under way ... we hope for the best,\" he said.\nFriday's talks are in preparation for next week's informal EU summit in Bratislava, although Greek organizers insist it's not an attempt to heighten division between Europe's prosperous north and financially beleaguered south.\nGreece's left-wing Prime Minister Alexis Tsipras, together with Italy's Renzi, French President Francois Hollande and the leaders of Portugal, Cyprus and Malta, will also be discussing investment and job creation, as well as security. Spain's prime minister was unable to attend.", "external_links": [], "published": "2016-09-09T03:00:00.000+03:00", "crawled": "2016-09-09T11:05:06.832+03:00", "highlightTitle": ""}