{"organizations": [], "uuid": "b6ce016c2a34b2244479919230e15a6dc561e925", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 233, "shares": 233, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nbcnews.com", "main_image": "http://media4.s-nbcnews.com/j/newscms/2015_46/1303646/151115-abdeslam-salah-mug-1223p_091b5b34df5d0da8a849e65477a1b412.nbcnews-fp-1200-800.jpg", "site_section": "", "section_title": "", "url": "http://www.nbcnews.com/storyline/paris-terror-attacks/salah-abdeslam-paris-attacks-suspect-refuses-answer-judge-s-questions-n644871", "country": "US", "domain_rank": 478, "title": "Salah Abdeslam, Paris Attacks Suspect, Refuses to Answer Judge's Questions - NBC News", "performance_score": 2, "site": "nbcnews.com", "participants_count": 0, "title_full": "Salah Abdeslam, Paris Attacks Suspect, Refuses to Answer Judge's Questions - NBC News", "spam_score": 0.021, "site_type": "news", "published": "2016-09-08T08:00:00.000+03:00", "replies_count": 0, "uuid": "b6ce016c2a34b2244479919230e15a6dc561e925"}, "author": "The Associated Press", "url": "http://www.nbcnews.com/storyline/paris-terror-attacks/salah-abdeslam-paris-attacks-suspect-refuses-answer-judge-s-questions-n644871", "ord_in_thread": 0, "title": "Salah Abdeslam, Paris Attacks Suspect, Refuses to Answer Judge's Questions - NBC News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Sep 8 2016, 11:41 am ET Salah Abdeslam, Paris Attacks Suspect, Refuses to Answer Judge's Questions by The Associated Press FROM MAY 20: Paris Attacks Suspect Salah Abdeslam Taken to Court 0:37 autoplay autoplay Copy this code to your website or blog <iframe src=\"http://www.nbcnews.com/widget/video-embed/689465923549\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen></iframe> \nPARIS — The only surviving suspect in last November's attack on Paris refused to speak to a judge Thursday for a third time, in frustration at 24-hour video surveillance of his prison cell. \nSalah Abdeslam's lawyer, Frank Berton, said the judge repeatedly asked questions to no avail on Thursday. \nBerton said Abdeslam wasn't obligated to explain his silence but \"obviously\" it's linked to the constant surveillance. \nAuthorities hope Abdeslam can provide information about ISIS' strategies and networks , and identify others who might have had a connection to the Nov. 13 attacks, which killed 130 people . The same network that attacked Paris struck again in Abdeslam's hometown of Brussels in March , days after he was tracked down in his hideout and arrested. French National Police released a photo of suspect Salah Abdeslam. French National Police \nHis Brussels lawyer was present at Thursday's hearing in Paris. \nWhile Abdeslam is the only person suspected of directly participating in the attacks, others believed linked to it also are being identified as French and other European authorities continue their investigations. \nAustrian prosecutors, meanwhile, announced Thursday that two men who spent time in a Salzburg refugee camp with other suspects in connection to the attacks have been charged with being part of ISIS. \nRelated: French Defend Not Warning Bataclan Despite Threats \nA statement from the Salzburg prosecutor's office said the two are suspected of helping two other suspects who Austria extradited to France earlier this year through \"logistics as well as through gathering information and arranging contacts.\" \nThose extradited had been charged with \"the preparation of ... attacks in Paris as members of ISIS,\" according to the statement. Play ", "external_links": [], "published": "2016-09-08T08:00:00.000+03:00", "crawled": "2016-09-08T20:19:14.087+03:00", "highlightTitle": ""}