{"organizations": [], "uuid": "124f7203361621c118f79e0c36a7c66f9a623a43", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 7, "shares": 7, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/694940094001_5110614944001_d687fa65-4020-46cb-bf49-cd03dc9b8e5d.jpg", "site_section": "http://www.foxnews.com/hannity/", "section_title": "Hannity | Sean Hannity | Fox News", "url": "http://www.foxnews.com/transcript/2016/09/02/mike-huckabee-and-ben-carson-react-to-fbi-report-on-clinton/", "country": "IT", "domain_rank": 185, "title": "Mike Huckabee and Ben Carson react to FBI report on Clinton", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "Mike Huckabee and Ben Carson react to FBI report on Clinton | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2016-09-02T03:00:00.000+03:00", "replies_count": 0, "uuid": "124f7203361621c118f79e0c36a7c66f9a623a43"}, "author": "FoxNews.com", "url": "http://www.foxnews.com/transcript/2016/09/02/mike-huckabee-and-ben-carson-react-to-fbi-report-on-clinton/", "ord_in_thread": 0, "title": "Mike Huckabee and Ben Carson react to FBI report on Clinton", "locations": [], "entities": {"persons": [{"name": "ben carson", "sentiment": "negative"}, {"name": "tucker carlson", "sentiment": "negative"}, {"name": "mike huckabee", "sentiment": "negative"}, {"name": "clinton", "sentiment": "negative"}, {"name": "trey gowdy", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "eric guster", "sentiment": "none"}, {"name": "pat caddell", "sentiment": "none"}, {"name": "bill clinton", "sentiment": "none"}, {"name": "david webb", "sentiment": "none"}, {"name": "noelle nikpour", "sentiment": "none"}, {"name": "noelle nikpour", "sentiment": "none"}, {"name": "jason bourne", "sentiment": "none"}, {"name": "carson", "sentiment": "none"}, {"name": "matt schlapp", "sentiment": "none"}, {"name": "matt", "sentiment": "none"}, {"name": "fox", "sentiment": "none"}, {"name": "lee carter", "sentiment": "none"}, {"name": "jessica tarlov", "sentiment": "none"}, {"name": "clintons", "sentiment": "none"}, {"name": "noelle", "sentiment": "none"}, {"name": "david webb", "sentiment": "none"}, {"name": "doug schoen", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "eric guster", "sentiment": "none"}, {"name": "catherine herridge", "sentiment": "none"}, {"name": "bernie sanders", "sentiment": "none"}, {"name": "huckabee", "sentiment": "none"}, {"name": "catherine herridge", "sentiment": "none"}, {"name": "obama", "sentiment": "none"}, {"name": "tucker", "sentiment": "none"}, {"name": "tarlov", "sentiment": "none"}, {"name": "lee", "sentiment": "none"}, {"name": "schoen", "sentiment": "none"}, {"name": "carter", "sentiment": "none"}, {"name": "jill stein", "sentiment": "none"}, {"name": "catherine", "sentiment": "none"}, {"name": "doug schoen", "sentiment": "none"}, {"name": "hillary", "sentiment": "none"}, {"name": "lee carter", "sentiment": "none"}, {"name": "gina", "sentiment": "none"}, {"name": "omar mateen", "sentiment": "none"}, {"name": "barack obama", "sentiment": "none"}, {"name": "huckabee", "sentiment": "none"}, {"name": "herridge", "sentiment": "none"}, {"name": "joe", "sentiment": "none"}, {"name": "gina", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "matt schlapp", "sentiment": "none"}, {"name": "pat caddell", "sentiment": "none"}, {"name": "eric", "sentiment": "none"}, {"name": "guster", "sentiment": "none"}, {"name": "tarlov", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "john kennedy", "sentiment": "none"}, {"name": "fox contributor", "sentiment": "none"}, {"name": "caddell", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "doug", "sentiment": "none"}, {"name": "pat", "sentiment": "none"}, {"name": "carson", "sentiment": "none"}, {"name": "carlson", "sentiment": "none"}, {"name": "jessica", "sentiment": "none"}, {"name": "sean", "sentiment": "none"}, {"name": "christopher farrell", "sentiment": "none"}, {"name": "james comey", "sentiment": "none"}, {"name": "lady justice", "sentiment": "none"}, {"name": "schlapp", "sentiment": "none"}, {"name": "jessica tarlov", "sentiment": "none"}, {"name": "gina loudon", "sentiment": "none"}, {"name": "webb", "sentiment": "none"}], "locations": [{"name": "united states", "sentiment": "none"}, {"name": "cleveland", "sentiment": "none"}, {"name": "chicago", "sentiment": "none"}, {"name": "phoenix", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "detroit", "sentiment": "none"}, {"name": "loudon", "sentiment": "none"}, {"name": "indiana", "sentiment": "none"}, {"name": "united states of america", "sentiment": "none"}, {"name": "chappaqua", "sentiment": "none"}, {"name": "newark", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "houston", "sentiment": "none"}, {"name": "philadelphia", "sentiment": "none"}, {"name": "mississippi delta", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "south carolina", "sentiment": "none"}, {"name": "gary", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "new jersey", "sentiment": "none"}, {"name": "east la", "sentiment": "none"}, {"name": "arkansas", "sentiment": "none"}], "organizations": [{"name": "fbi", "sentiment": "negative"}, {"name": "obama justice department", "sentiment": "none"}, {"name": "fox news", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "fox news", "sentiment": "none"}, {"name": "justice department", "sentiment": "none"}, {"name": "cia", "sentiment": "none"}, {"name": "new york times", "sentiment": "none"}, {"name": "clinton foundation", "sentiment": "none"}, {"name": "abc news", "sentiment": "none"}, {"name": "gop", "sentiment": "none"}, {"name": "sirius", "sentiment": "none"}, {"name": "american conservative union", "sentiment": "none"}, {"name": "american conservative union", "sentiment": "none"}, {"name": "politico", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "congressional black caucus", "sentiment": "none"}, {"name": "washington post", "sentiment": "none"}, {"name": "democratic", "sentiment": "none"}, {"name": "state department", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Published September 02, September 2,\nTUCKER CARLSON, GUEST HOST: Welcome to the \"Hannity\" TV program. It's the Clinton scandal that just won't go away.\nI'm Tucker Carlson, in tonight for Sean.\nNew revelations this afternoon about Hillary Clinton's lingering e-mail controversy, this after the FBI published brand-new documents related to its now closed investigation into the former secretary of state.\nJoining us now with the very latest on this is our own Catherine Herridge -- Catherine.\nCATHERINE HERRIDGE, FOX CORRESPONDENT (voice-over): This 11-page FBI summary of Hillary Clinton's July 2nd interview shows the former secretary of state could not remember key details about her e-mails more than two dozen times.\nCritics aren't buying it.\nCHRISTOPHER FARRELL, JUDICIAL WATCH: What is implausible, not someone of her background, experience, training -- she's an attorney, 25 years in government, and suddenly, she has selective amnesia? It's not plausible. It's not believable.\nHERRIDGE: Clinton told FBI agents she could not recall where she got a security clearance. Clinton could not recall briefings or training on the handling of classified information. And Clinton could not recall specialize training for the U.S. government's most closely held secrets, known as Special Access Programs.\nBut the same week Clinton became secretary of state, she signed two non- disclosure agreements, where she said she knew the rules and that violating these agreements could result in criminal charges.\nClinton also told the FBI that she could not recall the details surrounding the 2009 setup of the Clintonemail.com domain, whose servers were housed at the Chappaqua, New York, home. Clinton said the personal e-mail account was a matter of convenience. FBI agents do not appear to press Clinton on the issue, further reinforcing Republican criticism of the FBI director and the investigation.\nREP. TREY GOWDY (R), SOUTH CAROLINA: Remember, James Comey said she was not indicted because he didn't have sufficient evidence on the issue of intent. She said she did it for convenience, but -- but I didn't see the follow-up questions in the interview I read!\nHERRIDGE: The heavily redacted FBI summary also shows Clinton was questioned about the 22 top secret e-mails too damaging to release for national security reasons, and that questioning included the drone campaign, as well as human spying for CIA programs -- Tucker.\nCARLSON: Catherine Herridge, thanks a lot, Catherine.\nHere with reaction, former Republican presidential candidates Governor Mike Huckabee of Arkansas and Dr. Ben Carson. It is great to see you both.\nDr. Carson, first to you. This is kind of definitive, then. Hillary Clinton says, I didn't know the rules. That's not a plausible explanation, is it?\nDR. BEN CARSON, R-FORMER PRESIDENTIAL CANDIDATE: It's not a plausible explanation, and her failure to remember anything certainly is not a quality that you would want to see in a president.\nCARLSON: So I'm assuming you buy it, then. Do you think she wasn't capable of remembering the most basic rules in handling classified material?\nCARSON: Well, it doesn't particularly matter. If she wasn't capable of remembering that, she definitely would not be capable of performing the duties of the president, and if she is lying about it, then that disqualifies her, too. I think she's disqualified, either way you look at it.\nCARLSON: So Governor Huckabee, just take three steps back. We're finding out about this from the FBI on the afternoon of Labor Day weekend, on a Friday on a holiday weekend. This is a classic way to bury news that you think is going to be damaging to the principal. The FBI is not a political organization, but this move suggests they're acting for political reasons.\nDo you think that's true? And if so, how discouraging is that, for a law enforcement agency to help a political campaign?\nMIKE HUCKABEE, R-FORMER PRES. CANDIDATE: Well, the FBI has always been above and beyond the political ramifications. It's one of the reasons that most Americans have an incredibly high respect for the FBI.\nThis hurts the FBI's reputation. It hurts James Comey's reputation. But most of all, it damages Hillary Clinton.\nI mean, for her to claim that she has less memory about what she was briefed on than Jason Bourne knew about his past identity is just not realistic. And I agree with Ben Carson. If she really doesn't remember fundamental facts of national security like this, then she has no business being sworn in as president, and we need to make sure the American people don't make what could be an incredibly irrevocable mistake.\nCARLSON: So Dr. Carson, these 60 pages suggest more stories to come, in this way. You have Hillary Clinton in the FBI's account losing somehow 13 different PDAs, cell phones. You have her using her device in foreign countries. You have her with a skiff (ph), which is supposed to be a bug- proof room in her house and office, that is not secure. This suggests that she was more vulnerable even than we knew to attacks by foreign intelligence agencies.\nDo you think we're going to be hearing that story before Election Day?\nCARSON: I hope so. But here's the other thing that we have to consider. Because she had such vital information in such insecure places, I think probably the Chinese, the Russians and some others probably have some of that information.\nNow, what would it be like to have a president who could be blackmailed by other nations because they have information that she doesn't want to come out?\nCARLSON: Well, that is the question. That is absolutely the question. And I think it's a major concern for the intelligence agencies in this country.\nGovernor Huckabee, tell us -- I mean you, of course, are from Arkansas. You were a three-term governor of Arkansas. You know the Clintons very well. They're smart people. They try to cover all the bases. They're paranoid. They're aware of their public perception.\nWhy would Mrs. Clinton behave in a manner this reckless? What would motivate her to do that?\nHUCKABEE: Because for so long, Tucker, she and her husband have gotten away with living by a different set of rules than everybody else. You know, we remember back in 2008, the big banks were protected because they were too big to fail. And I think what we have is a Hillary Clinton who thinks she's too big to jail. She thinks that these rules that apply to everybody else in government are for them, for the little people, but not for her. And that's very troubling.\nAnd this is not a political issue. I know it's going to sound like it, and coming from me -- look, I don't pretend that I'm non-partisan. I'm very partisan. I have a very particular point of view. But try to look at this objectively. And let's remember that she said, well, she only had one device. Now we know she got rid of 13 different devices.\nSo there are so many things that have just been said that are fundamentally not true, and she can't possibly say that she just didn't remember how many devices that she had when there were 13 of them.\nCARLSON: So Dr. Carson, the whole point of America, the whole reason people come here from other countries, who yearn to be Americans, is because we're equal under the law, all of us. And this puts a lie to that. What do you say to the numerous Americans who are now doing jail time or have felony records for mishandling, in some cases they claim unintentionally, classified information.\nCARSON: Well, I say I'm sorry that you are the victims of an unfair system. And you know, as Governor Huckabee alluded to, this kind of issue, it's really not a Democrat or Republican issue. This goes to the very heart of who we are as a nation, who we are as people.\nWhat do we accept? What kinds of leaders do we want to put up in front of our children as examples? If we put somebody up who lies as easily as they breathe, and this is our greatest role model, what can we expect from the next generation of Americans?\nCARLSON: That's a deep question. I mean, Governor Huckabee, I don't think Hillary Clinton is the worst person in the world at all, but I think that this behavior is clearly unacceptable. There's no defending it at all, and yet Democrats are defending it.\nDonald Trump has said things that are hard to defend, and a lot of Republicans said, You know, I'm not going to defend it. That's wrong. And they've walked away from him. You haven't seen anything like that on the Democratic side. It's been lockstep robotic support for their candidate.\nDo you think you're going to see any Democrats of conscience say, I'm sorry, I'm not going to defend this behavior?\nHUCKABEE: Publicly, probably not. I've always admired the Democrats for circling the wagons around the people that they're trying to protect, no matter how ridiculous it is. And we've seen that not only with Hillary Clinton and Bill Clinton, but with Barack Obama. I mean, they just always sort of say, No, our side does nothing wrong.\nBut this is troubling, and it needs to be to independent voters, people who really want America to be a place where everybody gets treated the same, where Lady Justice is blindfolded and presiding over scales that balance justice and mercy, not campaign and contributions to the Clinton Foundation on one side of the scale and favors on the other. And that's the kind of White House we would have with Hillary Clinton.\nCARLSON: Yes, boy, I don't admire that lockstep at all because I think it betrays the real point of Democratic politics, which is not so sort of act on behalf of some principle, but to acquire power and use power. And I don't think that's a good reason to get into politics.\nCARSON: But at so me point, we have to ask ourselves, Who are we?\nCARLSON: Yes.\nCARSON: What kind of people are we, and what do we represent, and not what is politically expedient and what will help our party to do better. And if that's the road we're going to go down, we're doomed.\nCARLSON: Man, I hope if Trump ever did something like this -- or you know, whatever Trump does, I'm not going to be there robotically defending it. You got to stick to your principles. (INAUDIBLE)\nHey, thank you, gentlemen. It's great to see you both. Thanks for putting it all into context. I appreciate it. Governor Huckabee...\nHUCKABEE: You bet.\nCARLSON: ... thanks.\nCARSON: Absolutely.\nCARLSON: Coming up right here on \"Hannity\" next...\n(BEGIN VIDEO CLIP)\nHILLARY CLINTON, D-PRESIDENTIAL NOMINEE: I believe and have said many times that I take classified material seriously, and there were no materials that were marked classified.\n(END VIDEO CLIP)\nCARLSON: We've got more reaction to the FBI's new report on Hillary's e- mail server. How damaging will these revelations be to her campaign?\nAnd then watch.\n(BEGIN VIDEO CLIP)\nDONALD TRUMP, R-PRESIDENTIAL NOMINEE: To those suffering, I say what do you have to lose in trying Trump!\n(END VIDEO CLIP)\nCARLSON: Donald Trump has been reaching out to black voters. Tomorrow, he's set to speak at a black church in the city of Detroit. David Webb, Eric Guster here to react to that and a whole lot more straight ahead on \"Hannity.\" Don't go away.\n(COMMERCIAL BREAK)\n(BEGIN VIDEO CLIP)\nCLINTON: I did not e-mail any classified material to anyone on my e-mail. There is no classified material. So I'm certainly well aware of the classification requirements,\n-- and I had not sent classified material nor received anything marked classified.\nI did not send classified material, and I did not receive any material that was marked or designated classified.\nI believe and have said many times that I take classified material seriously, and there were no materials that were marked classified.\n(END VIDEO CLIP)\nCARLSON: Boy, you can just pick her statements at random, and the FBI has proved them false.\nWelcome back to the \"Hannity\" TV program.\nThat was, of course, the former secretary of state denying over and over again that there was classified material on her private e-mail account. Of course, we now know that's not true at all.\nThere are multiple instances of classified material housed in her private e-mail system, for those who care, and according to documents released this afternoon by the FBI, new questions are now being raised about her careless handling of state secrets that have put this country at risk, and it's not an overstatement. It actually happened.\nJoining us now with analysis, Fox News contributor, former Clinton pollster Doug Schoen and Republican strategist Noelle Nikpour. It's great to see you both.\nDoug, look, I'm not arguing that Hillary Clinton, you know, gave the hydrogen bomb to the Soviets, but I am arguing what's obvious, which is if a normal citizen had done this, he'd be indicted. And you know that's true. So how can you look at what Hillary did and the response from the Justice Department and not conclude the system is actually rigged in favor of people with power?\nDOUG SCHOEN, FOX CONTRIBUTOR: Here's what I would tell you. Secretary Clinton, as a Democrat of conscience, clearly made profound errors. The FBI said it was extremely careless, not gross negligence.\nTucker, this is politics. And you know what? I don't defend it. I was troubled, deeply troubled, by what I saw today. That being said, as a Democrat, I still support Secretary Clinton. But these are troubling, troubling revelations, rest assured.\nCARLSON: Look, I'm not even attacking Hillary Clinton. I think this is what Hillary Clinton does. I think it's what she's always done, no more than you can attack a scorpion for stinging you. That's what they do.\nI'm attacking the Obama Justice Department for subverting justice on behalf of the Democratic nominee because I think it hurts the entire country and the system itself.\nNOELLE NIKPOUR, REPUBLICAN STRATEGIST: Right. You know, and if you look at everything that she's done and you go back and look, some of the problem that she said is she was, like, I don't recall, 39 times, I don't recall. And if you look back in 2012, you remember when she had the concussion, and the doctor had cleared her.\nCARLSON: Right.\nNIKPOUR: The doctor had cleared her for two hours a day to be working at the State Department, OK?\nNow, here's where I lay (ph), or you want to look at something else. Where was the Obama administration? Where were the higher-ups that allowed her to go back and be briefed on our national security and things going on with the State Department when she didn't get the 100 percent, when she couldn't put in a full day's work?\nI mean, this is -- somewhere, there is more fault than also just Hillary Clinton and her \"I don't know, I don't know.\"\nCARLSON: Well, that's a fair question. So Doug, look, all the Hillary toadies in the press -- and that's basically everybody, Politico, The Washington Post -- are saying that anyone who raises questions about her health is engaged in a conspiracy theory. And I'm not, actually. But after reading these 60 pages where she repeatedly says, I have no memory, of things that a normal person would remember, why shouldn't I be kind of concerned about her memory, honestly?\nSCHOEN: I think those are fair questions, Tucker, but you talk about the Obama Justice Department. Last I checked, James Comey is an independent operator, a Republican who has a reputation for probity and integrity. So I would look at him, as well as the Justice Department.\nCARLSON: Well, but I agree with you...\n(CROSSTALK)\nCARLSON: I agree with you. Seriously, look, you've run -- you're a sophisticated political guy. You don't drop 60 pages of controversial material on the Friday afternoon before Labor Day weekend unless you're doing it for political reasons. James Comey is not supposed to be a political actor. He's the head of the FBI. Why is he...\n(CROSSTALK)\nSCHOEN: Why don't you ask him?\nCARLSON: It's a great question!\nSCHOEN: Ask the FBI.\nCARLSON: Like, what is going on...\nSCHOEN: You know, I think those are fair questions.\n(CROSSTALK)\nCARLSON: It's absolutely ridiculous!\nSCHOEN: Well, this isn't a third world. It's the United States of America...\nCARLSON: I know!\nSCHOEN: ... where a government of rule of law -- and you should ask them those questions, rather than just fulminating about it.\nCARLSON: Well, you know what? I don't have access to them, just to you. So tonight, you're their surrogate, and I'm going to fulminate because I can't control myself!\nSCHOEN: Well, fulminate all you want.\nCARLSON: I'm fulminating away!\nSCHOEN: You know what? This is politics. This is politics. Secretary Clinton dodged a bullet literally and metaphorically, remains slightly ahead, and that's what this is all about in her terms and the American people's terms.\nCARLSON: I don't know if she did it literally, but we can talk off air. So I already said I'm not surprised by anything Hillary does. But I just -- you know, you got to kind of take this information as it comes, and I just can't resist playing this following clip. It's one of a thousand we could have picked against which we are comparing reality. Here's Hillary Clinton on the number of devices she used as secretary of state.\n(BEGIN VIDEO CLIP)\nCLINTON: I thought it would be easier to carry just one device for my work and for my personal e-mails instead of two. I think that it might have been smarter to have those two devices from the very beginning.\nQUESTION: IPhone or Android?\n(LAUGHTER)\nCLINTON: IPhone, OK, in full disclosure...\nQUESTION: Blackberry.\nCLINTON: ... and a blackberry. I have a -- you know, an iPad, a mini- iPad, an iPhone and a Blackberry.\n(END VIDEO CLIP)\nCARLSON: Turns out she had 13 Blackberries. And by the way, who asks a question like that? Talk about the endless sucking up by celebrity news figures to Hillary Clinton (INAUDIBLE) stomach-turning. But it turns out she had 13, and she doesn't know where they are!\nNIKPOUR: She had 13. She has iPads. She has Blackberries. She has every device in the world, and that's great, and she still can't remember anything with all the backup of all the devices she has, number one!\nAnd number two, an aide even said that he saw them smashing a couple of them with a hammer! I mean, you've got to look at this! This is insane! And this is somebody that's running for president of the United States with this investigation that she was found clean, and she is -- she's running for our -- the highest office in the United States?\nCARLSON: (INAUDIBLE) I think. So Doug, you spent a lot of time around government, obviously, and in Washington, and you know how unbelievably uptight the executive branch is about security. I mean, they really are. We got the skiffs. They don't allow personal e-mail in the White House.\nYou know all this because you've lived it.\nWhy didn't someone in the building say, Whoa, whoa, whoa. You know, We don't do that around here. Like, your skiff, your secure communications room, has to be secure, and yours isn't. Like, why didn't someone raise an alarm?\nSCHOEN: You know, I think these are again fair questions. The problem is the Obama Justice Department, the Obama White House clearly let Secretary Clinton do what she did. She's been shown by the FBI to have been extremely careless, not to have committed indictable offenses. That's the way it'll be. There'll be more revelations.\nI'll say one thing. Free advice. She should get out of the Clinton Foundation right now. It will only help her chances of being elected.\nCARLSON: Yes, I don't think they will. They're very money-centered, the Clintons, as you know, very...\n(CROSSTALK)\nCARLSON: They're greedier than any finance guy I've ever met!\nSCHOEN: Money is money. Winning is winning. And this is about elections.\nCARLSON: It's so gross! Oh!\n(CROSSTALK)\nCARLSON: Thank you for coming on, Doug. I appreciate it. You too, Noelle. Thanks a lot, both of you.\nSCHOEN: Thank you.\nCARLSON: Coming up next right here on the \"Hannity\" program...\n(BEGIN VIDEO CLIP)\nDONALD TRUMP, R-PRESIDENTIAL NOMINEE: To those suffering, I say what do you have to lose in trying Trump!\n(END VIDEO CLIP)\nCARLSON: That's the pitch. What do you have to lose? That's what he's saying to African-American voters on the campaign trail. That's what he'll be saying tomorrow at a black church in Detroit. David Webb and Eric Guster react to all of it coming up next.\nAnd then later on the show...\n(BEGIN VIDEO CLIP)\nTRUMP: We will build a great wall along the southern border.\n(CHEERS AND APPLAUSE)\nTRUMP: And Mexico will pay for the wall, believe me.\n(CHEERS AND APPLAUSE)\n(END VIDEO CLIP)\nCARLSON: The great wall of Trump. The elites scoff knowingly, but actually most people kind of like it. Why wouldn't they? This week, Trump unveiled his immigration plan. How does it compare to Hillary Clinton's? That's the question. What would she do if elected? We'll tell you, next.\n(COMMERCIAL BREAK)\n(BEGIN VIDEO CLIP)\nTRUMP: This is the legacy of President Obama and Hillary Clinton. It can't get any worse! To those suffering, I say what do you have to lose in trying Trump! What do you have to lose!\n(END VIDEO CLIP)\nCARLSON: That was, of course, Donald Trump on the campaign trail, making his pitch to black voters. Tomorrow, he's headed to Detroit, where he's going to address a black church and tour parts of the city with Dr. Ben Carson.\nHere with reaction, FOX News contributor and Sirius XM Patriot host David Webb and trial attorney and political commentator, our old friend, Eric Guster. Welcome to you both.\nSo Eric, Hillary Clinton said the other day that Trump was racist for bringing this message before a white audience. Now he's going before a black audience tomorrow and he's going to bring the same message. She'll probably call him a racist again. He's probably not going to win a huge percentage of the black vote.\nBut what's wrong with his message? Pretty great message, isn't it? Like, it's not working, let's try something new. Why is that bad?\nERIC GUSTER, FOX CONTRIBUTOR: What he's saying was the equivalent of the drunk guy at last call saying, Hey, you have nothing to lose, so go home with me. That is what Trump was telling these voters.\n(CROSSTALK)\nDAVID WEBB, FOX CONTRIBUTOR: Did you just call the black community at the drunk guy at the bar?\nGUSTER: No, he's the drunk guy at the bar trying to get the girl to go home with him because he's saying, I'm the last resort. You know, you all are in bad shape.\n(CROSSTALK)\nGUSTER: Yes, he is!\nWEBB: No, he's not.\nGUSTER: That's what he said! That is exactly what he said.\n(CROSSTALK)\nCARLSON: Can I ask you a really quick question?\nGUSTER: Sure.\nCARLSON: Do you think it is working in Detroit and Chicago?\n(CROSSTALK)\nGUSTER: Trump's message to black people?\nCARLSON: No, no, the urban policy we've had for 50 years. Kind of working pretty well, do you think?\nGUSTER: No. Are we talking about Trump?\n(CROSSTALK)\nGUSTER: I want him to say exactly what he said right there again.\nWEBB: So let's go to the issue and answer your question because I was in Detroit just a week ago, and I took a drive through some of these neighborhoods that are blighted and some of these, you know, beautiful old neighborhoods that have been razed, some of them, buildings, closed-up business, closed up.\nI look at some of the cities that have failed since the '60s like Newark, New Jersey, fifth ward in Houston, parts of East LA. All across this country, we have seen failure by these so-called promises from the Democrats to the black community, and frankly, the new -- by one -- let's call it what it is -- masters of the black community with the Congressional Black Caucus.\nYou look at the policies, you look at the failures, the failure in education, the failure in economy. You talk about urban flight, where companies have fled from high-crime zones. Chicago just...\n(CROSSTALK)\nWEBB: Let me finish.\nGUSTER: ... an auto town and a lot of the shift in the auto industry is what caused the downfall of Detroit. That wasn't a Democratic policy.\nWEBB: Let me get the facts behind this.\n(CROSSTALK)\nGUSTER: You all are trying to shift it...\n(CROSSTALK)\nWEBB: I deal in facts. The facts...\nGUSTER: That is a fact!\nWEBB: ... behind Detroit...\nGUSTER: So let's talk about it.\nWEBB: The facts -- yes, I will, if you'll let me. The facts behind Detroit is it was predictable failure with the growth of union labor rates, the cost that auto manufacturers could not maintain, the fact that...\n(CROSSTALK)\nWEBB: Where did this come from, to your point? It came from the liberal alignment with a lot of these unions...\nCARLSON: That is all true.\nWEBB: ... that cost the jobs.\n(CROSSTALK)\nCARLSON: But the bottom line is you can't look at Detroit or Chicago or Gary, Indiana, or Cleveland and say, You know what? good job, Democratic leadership.\nBut let me ask you that. So (INAUDIBLE) why does Hillary Clinton think she has an absolute moral claim on all black votes? And she does, and she's basically said that. It turns out Hillary Clinton is from the Mississippi Delta. She grew up poor there. How do I know that? You thought she was from suburban Chicago? No. Listen to her talk, and you'll know her roots. Watch.\n(BEGIN VIDEO CLIP)\nCLINTON: I don't feel no ways tired.\n(CHEERS AND APPLAUSE)\nCLINTON: I come too far from where I started from. Nobody told me that the road would be easy!\nNow, let me tell you I'm aware I may not be the youngest candidate in this race, but I have one big advantage. I've been coloring my hair for years!\n(CHEERS AND APPLAUSE)\n(END VIDEO CLIP)\nCARLSON: Now, I'm sure there's more patronizing tape we could find, but I can't imagine what it would look like. That is the single most patronizing, awkward thing I've ever seen!\nGUSTER: I doubt if you'll find more because those are the only two clips that are being shown.\nCARLSON: But they're unbelievable!\nGUSTER: But that was...\nCARLSON: If Trump had talked that way, I wouldn't defend it! (INAUDIBLE) that's nauseating!\nGUSTER: Well, that's not a good tape. That's a bad clip.\n(LAUGHTER)\nGUSTER: I'll give you that. I'll give you that.\n(CROSSTALK)\nGUSTER: I always shoot straight. But when you -- we're talking about two candidates, where Trump has 43 percent of white people think he's a racist. That is a problem for him. So if 43 percent of white people think you're racist, you have a...\n(CROSSTALK)\nCARLSON: ... doesn't mean you are racist.\n(CROSSTALK)\nCARLSON: ... debating the core issues, I think.\nWEBB: Let's get back to the core issue of what we're here to talk about.\n(CROSSTALK)\nWEBB: Eric, I'd love to spend time on this election (ph), but I want to go to the issue here, which is the black community. We have gone from a community back in the days of Civil Rights that had strong family structure, a growing middle class, fastest-growing middle class in the early '90s because of college graduation with black males.\nWe have gone to a community that has got a higher unemployment rate, a lower education rate, and the young millennials...\n(CROSSTALK)\nWEBB: No, let me finish.\nGUSTER: I'm asking you.\nWEBB: Stop interrupting my point...\n(CROSSTALK)\nWEBB: When all those factors and more combine, you have failure in a community. And what Donald Trump is saying, shouldn't you consider another choice? And it's this simple reason. Blacks have given their unyielding support to the Democrats for 50 years, and there's a split. It's not a monolithic block, but look at the urban blacks and where they are economically (INAUDIBLE)\nCARLSON: I want to ask you one last question, and it's this. When you listen to Hillary talk and you listen to Obama talk, I'm listening to you, and you really get the impression that the Democrats believe the single biggest impediment to success in the inner city is white racism from conservatives. Do you believe that? Do you really believe that?\nGUSTER: No, that's not the single largest impediment.\nCARLSON: What is? What is the single biggest impediment?\nGUSTER: Proper funding for education, among other issues, job creation...\n(CROSSTALK)\nGUSTER: But let me finish. In reference to Trump versus Hillary, Hillary wasn't my first choice. But looking at Trump versus Hillary, she is clearly the choice in this race.\nWEBB: Can we just use the point Eric Guster made, which is completely wrong? The cost of education, which I have been reporting on for years now, has increased to some averages of $24,000 to $28,000 per student in these urban environments where...\n(CROSSTALK)\nWEBB: Let me finish. Let me finish -- where the money going into the education system has not been applied to education but the growth of the administration.\nCARLSON: There's clearly not a direct correlation between the amount we spend and the results. It's not that simple, obviously.\nGUSTER: One last point. This was the election that the GOP could have attracted the black vote, but Trump is definitely not the candidate (INAUDIBLE)\nCARLSON: Look, anyone who runs is going to be racist because he has to be!\n(CROSSTALK)\nCARLSON: They have to call you a racist, period.\nGUSTER: On my radio show, I've encouraged people to split their ticket for years. Trump is not the candidate to do that.\nCARLSON: But that's why you're sitting here because you're a beacon reasonableness in a sea of nuttiness. But I mean, like, it's true...\n(CROSSTALK)\nWEBB: Let me say this to the black community. Stop giving away your political power to any party, and in this case, the Democrats, because they have nothing to gain and nothing they want but your vote.\n(CROSSTALK)\nCARLSON: All right, gentlemen, I'm being told that we're out of time.\nWEBB: Don't vote for the liar, Hillary Clinton.\nCARLSON: Thank you.\nGUSTER: And Mr. Trump.\nCARLSON: Coming up next right here on the \"Hannity\" TV show...\n(BEGIN VIDEO CLIP)\nTRUMP: We will build a great wall along the southern border, and Mexico will pay for the wall.\n(END VIDEO CLIP)\nCARLSON: He's going to build a wall. You can hear \"Morning Joe\" scoffing, but it turns out people kind of want a wall actually. How does his plan compare to Hillary Clinton's? She's against a wall, except when it's around the White House. We're going to break down her plan coming up next.\n(BEGIN VIDEO CLIP)\nUNIDENTIFIED FEMALE: Secretary Clinton, any comment on your husband --\n(END VIDEO CLIP)\nCARLSON: She's not really in the mood to answer questions. She hasn't really been in the mood for 273 days because she's just busy. According to a new report, Clinton will begin letting members of the press fly on her campaign plane. They are going to be so grateful. The question is will they be given access? Do they need access? Will it affect their continuous suck-up to Hillary Clinton? It's nauseating and we're going to chronicle it in excruciating detail here on the \"Hannity\" program. Stay tuned.\n(COMMERCIAL BREAK)\nCARLSON: Welcome back to \"Hannity.\" Donald Trump delivered a major immigration policy speech earlier this week in Phoenix. Here's some of the highlights in case you missed it. Watch.\n(BEGIN VIDEO CLIP)\nTRUMP: We will build a great wall along the southern border, and Mexico will pay for the wall.\n(APPLAUSE)\nTRUMP: We are going to suspend the issuance of visas to anyplace where adequate screening cannot occur.\nWithin ICE I am going to create a new special deportation taskforce focused on identifying and quickly removing the most dangerous criminal illegal immigrants in America who have evaded justice, just like Hillary Clinton has evaded justice, OK?\n(APPLAUSE)\n(END VIDEO CLIP)\nCARLSON: So the speech went on for over an hour, but the core promise was this. Trump said he's going to put Americans first with his immigration policy. He's not going to do anything except to the extent it benefits Americans. Does Hillary have the same guiding spirit in her immigration plan? Here to tell us, American Conservative Union chairman Matt Schlapp, psychology expert and radio host Dr. Gina Loudon, and Democratic strategist Dr. Jessica Tarlov. She's not actually a doctor, but for the purposes of tonight's show. Oh, you are a doctor?\nJESSICA TARLOV, DEMOCRATIC POLLSTER AND STRATEGIST: It's a little fake, but it's a thing.\nCARLSON: Good enough for cable.\n(LAUGHTER)\nCARLSON: So here's my question to you, Jessica Tarlov. So Trump said I'm putting Americans first. I've heard Hillary Clinton say an awful lot about immigration. I sat through the entire Democratic convention in Philadelphia. I didn't hear her say one thing, not one thing ever about the effects of immigration, legal or illegal, on American citizens, people who live here. Why?\nTARLOV: Well, it's a different focus of the message. Obviously the core of her plan is that there's a pathway to citizenship for the 11 million undocumented immigrants who are in the country right now, which actually seems like it's Donald Trump's plan as well if you look at what he said the morning after his speech. He's waffling a bit at this.\nCARLSON: It's certainly not the core of his plan or his main concern. The main concern of \"Morning Joe,\" but --\nTARLOV: He didn't say it to \"Morning Joe.\" Yes, amnesty is \"Morning Joe's\" thing, but the truth of the matter is that what he said on Wednesday night is not what he said on Thursday morning, which is a problem. We still don't know what his speech is.\nBut what Hillary Clinton talks about is American exceptionalism, she talks about what America is founded on, which is being a melting pot of people from all over the world. Her core argument is that immigrants make us better as a nation. They're not here just to take our jobs, to kill our children.\nCARLSON: OK, but that's a bumper sticker, not a policy. It's a nice spirit. I mean, I like immigrants. Every American, I mean it, does like immigrants. They work super hard. They're really nice. I think most of them are great, actually. But doesn't a president have to take into account the effects of immigration on people who were born here, who live here, who are American citizens? I don't get a sense Hillary Clinton cares at all, and if she does, I'll stand corrected, but show me the evidence.\nMATT SCHLAPP, CHAIRMAN, AMERICAN CONSERVATIVE UNION: Look, it's all politics, right? She was against illegals getting drive licenses, and now she's for it. She's not criticizing Barack Obama for actually aggressively, more aggressively than at the beginning of his administration, deporting illegal aliens, you know, taking on her own president. She voted for a fence, what she calls a fence, not a wall. I don't know whether it's a wall or a fence, Tucker, or just a barrier. But she voted for that when she thought it was good for her politically. She's all over the map.\nBut it comes down to this. At the end of the day for Hillary Clinton, she's going to do or say anything to the left flank of her party in order to have the cohesion she needs to keep the Bernie Sanders and hopefully the Jill Stein people at bay.\nAnd at the end of the day, Donald Trump has this right, which is when 75 percent of the American public thinks -- and that's Democrats and Republicans by the way -- thinks we're on the wrong track, and when our economy is as weak and soft as it is where people haven't seen increases in their take-home pay, it's right to put American citizens first.\nCARLSON: I want to get Gina Loudon in here. So, Gina, last year, 2015, fully one-half of all driver licenses issued in the state of California went to illegal aliens. Hillary Clinton supports that. Why would she support that? It seems pretty clear that Democrats are intent on erasing the distinction between citizen and non-citizen in the expectation that non-citizens will vote. I mean there's a political --\nTARLOV: There's no evidence of that.\nCARLSON: Really?\nTARLOV: That illegals are voting?\nCARLSON: Gina, let me ask you this. Why wouldn't they vote in states with no requirement for I.D., why wouldn't illegal aliens vote?\nDR. GINA LOUDON, PSYCHOLOGY EXPERT AND RADIO HOST: Of course they vote, and that honestly is my biggest fear about the next election. It isn't that Mr. Trump will lose. Tucker, I live right on the Mexican border, and I can tell you my friends and neighbors by and large, Hispanic immigrants will be voting for Mr. Trump because they don't like what's happening in their own neighborhoods.\nI love Jessica, but I cannot understand how anyone can sit there with a straight face and defend what Hillary is proposing. She's essentially saying, hey, Jessica, tonight when you go to bed, leave your doors open, set a pot of cash out on your sidewalk because that's what she wants us to do with our country. Most Americans can see right through this. They know it's all about votes, Tucker, and that's why they like Mr. Trump's plan, that is actually a plan.\nTARLOV: Well, they don't like Trump's plan.\nCARLSON: Gina, you're game to answer any question. I ask you sincerely, Hillary Clinton is saying my campaign is about wages, middle class wages. How can you simultaneously say that and encourage a continuation of a massive importation of low-end labor into the labor pool which depresses wages?\nTARLOV: Well, we have a net outflow of immigrants from Mexico.\nCARLSON: No.\nTARLOV: Yes we do.\nCARLSON: From Mexico, but not net. We are approaching the highest levels of foreign born people in this country we've ever had ever. You can't look me in the eye and tells any that raises wages. It does the opposite.\nTARLOV: We've talked about this.\nCARLSON: So how can she say both?\nTARLOV: Her main argument is about these 11 million people who are here. Yes, there's a visa program, but it's about the 11 million, the good people who Donald Trump talks about, have been here 20, 30, 40 years working for their families. And that's the point about the direction of the country, 75 percent wrong track, that's a little bit high. But what about the 65 percent that favor a pathway to citizenship? Over 50 percent of the GOP is now behind it, 77 percent for legalization.\nCARLSON: What about Americans, Matt?\nTARLOV: What's so bad about your life?\nCARLSON: Whatever the number is of illegals in this country, I'm sure a lot of them are really nice people.\nTARLOV: It's 11 million.\nCARLSON: We don't know that. That's not a real number.\nTARLOV: It is a --\nCARLSON: It's a census number. We don't know what the number is. Here's the point. What about the effect on Americans? Whatever Trump's faults, he's the only person I've ever heard ask that question.\nSCHLAPP: They talk about the fact we're having illegal Mexican immigrants go back to Mexico. Even they're indicting the Obama economy. Even they can't find what they need with the wages they've been able to get in the past.\nCARLSON: That's a hilarious point.\n(CROSSTALK)\nSCHLAPP: Let me try here. Let me try. The fact is that putting America first, people say it's racist. They say it's nativist. No, it's not. It just makes sense. By the way, it's connecting to people, be they Republican, Democrat, independent, whatever they are. They're like, why shouldn't I be first?\nCARLSON: That's a great question. Gina Loudon, we're almost out of time. Just sum it up for me, would you.\nLOUDON: Tucker, when you put all the noise aside, all Americans care about in this election is being able to provide for their families and to be able to keep them safe. Mr. Trump's ten-point plan addresses that. Hillary hasn't even addressed the debt, her incompetence as secretary of state or any of the mistakes she's made so far.\nCARLSON: She's going to do that in her next press conference, so stay tuned. Gina, Matt, Dr. Tarlov, it's great to see you all.\nComing up next, there is still more on the \"Hannity,\" program, including this.\n(BEGIN VIDEO CLIP)\nUNIDENTIFIED FEMALE: Secretary Clinton, any comment on your --\nCLINTON: You'll love this.\nUNIDENTIFIED FEMALE: Secretary Clinton, any comment on your husband leaving --\n(END VIDEO CLIP)\nCARLSON: She's got no comment. She's not interested in talking to you. But that hasn't diminished the love that the press brings to Hillary Clinton. They're in awe of her. She's a great person. Will they ever get to ask a question, though? That is the meta-question, and we're going to have reaction to that and more as \"Hannity\" continues.\n(COMMERCIAL BREAK)\nCARLSON: Welcome back to \"Hannity.\" It has been, and we are counting here, 273 days since Hillary Clinton last held a legitimate press conference. After pressure from the press, ABC News is reporting that Clinton will start using a larger campaign plane to allow the press to travel with her. The question is, will she let them up front to ask questions, or will she treat them like this?\n(BEGIN VIDEO CLIP)\nUNIDENTIFIED FEMALE: Secretary Clinton, any comment on your --\nCLINTON: You'll love this.\nUNIDENTIFIED FEMALE: Secretary Clinton, any comment on your husband leaving --\nCLINTON: Everybody try one.\nUNIDENTIFIED FEMALE: Secretary Clinton, should your campaign have known that Omar Mateen's father was at your campaign rally yesterday? Secretary Clinton, a few questions?\nCLINTON: Thank you all very much.\nUNIDENTIFIED MALE: -- that the Clinton cabinet was a distraction. Can you comment on the specific allegations, though?\n(END VIDEO CLIP)\nCARLSON: As in a bad marriage, she's not even hearing them. She stopped listening. What, were you talking?\nJoining us now, two of our old friends, Lee Carter, she's the famous pollster, and Fox News contributor and political legend, Pat Caddell. Great to see you both. Pat, to you, this is a middle finger in the face of the press obviously, and yet they continue to love her, to worship her to carry her water, to lick her boots. Is there anything Hillary Clinton could do, could she spit in the face of a New York Times reporter, is there anything she can do, could you murder one of them to have them turn against her?\nPAT CADDELL, No. I think they'd have a festival if she did. No. This is in my lifetime the greatest bias I have ever seen, the jihad, I call it. I have never seen anything like it. And here is the problem with it. What's happening when they're not calling her out on it, and she's smart not to do it, I guess, politically, although now I believe it will start working against her badly because of the stories that are coming out. But she is doing this in a way that is so contemptuous of the American people. And the press behavior, see, I think politicians shouldn't complain about the press, lying about the press. What they should be discussing is the institutional abuse of an institution whose job it is to protect the American people from power, not to get in bed and promote power.\nCARLSON: That's exactly it. I'm so glad you said that. They are working on behalf of the establishment, which is not what they're supposed to be doing.\nLee Carter, I get the strategy, and I think Hillary's hide strategy works if the campaign is all about Donald Trump's personality. She doesn't want to get involved in that. It helps her. But if the campaign is about issues like immigration, for example, or trade, does it help her to hide?\nLEE CARTER, POLLSTER: It doesn't help her to hide. I think she's taking a strategist right now where she feels the best thing to do is ride it out, put her head down and not really say anything except to try to use Donald Trump's words against him.\nThe problem is that it's way too long. We've got 70 or 80 days until the election. This is too long for her to just ride it out. And People are seeing through what she's trying to do. When we see this, it's just to invite the press in, and it doesn't seem authentic. People are calling her out on it and saying this isn't authentic. This isn't real. And she doesn't really open herself up, then people are going to say we see you're being calculated. And a lot of the decisions that are made about the election this year are all about authenticity and can I relate to you, can I trust. And I think people are really having a hard time with Hillary Clinton.\nCARLSON: So this campaign is going to end, Pat, and as you just wisely noted the press has decided to defend entrenched power. They're on the side of Hillary Clinton and the hedge fund managers against middle America.\nCADDELL: The American people understand that.\nCARLSON: They do. And that raises the question, what is going to happen when this ends, when the election is over? We will be credibly covering the government after this?\nCADDELL: They won't be credibly covering it any more than they credibly covered the last four years. You know, this is frightening. Barack Obama ironically doesn't like the press, despises them. And yet they have protected him on more things. No president ever had lapdogs like them in the modern era. You know, it is when John Kennedy had a friendly press corps, he had very negative editors. He had very hostile editors and many columnists, if you want to take an example of someone who was a darling of the press.\nThis is different though. This is from top to bottom. And their decision, what is going to happen with her, I believe, is when all of the revelations like today's, which is criminal behavior in my opinion of the highest sort while people that your raised earlier in the program are in jail for doing much less. The -- what she's doing is she's thumbing her nose not at the press but at the American people. And when they get that point, if that point starts being made, and the press comes under what I call institutional attack, they should be, they will panic to cover.\nCARLSON: I hope so. Lee, I'm sorry to get to back. I will see you on \"Fox & Friends.\" You're our favorite guest.\nCARTER: Yes. Great to see you.\nCARLSON: Thank you. Thanks, Pat.\nComing back, we will be back after the break. There is a lot more, so stay with us.\n(COMMERCIAL BREAK)\nCARLSON: Welcome back to the \"Hannity\" program. Unfortunately, and I mean that, it is unfortunate, we are out of time. Don't forget to set your alarm. I'll be on \"Fox & Friends\" in just a few hours, 6:00 a.m. eastern. Have the best Labor Day weekend and a great night.\nEND\n ", "external_links": [], "published": "2016-09-02T03:00:00.000+03:00", "crawled": "2016-09-04T01:06:58.207+03:00", "highlightTitle": ""}