{"organizations": [], "uuid": "2156092c087d226c943fd94c80a2b4eab40f682d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 265, "shares": 265, "comments": 49}, "stumbledupon": {"shares": 0}}, "site_full": "www.buzzfeed.com", "main_image": "https://img.buzzfeed.com/buzzfeed-static/static/2016-08/31/23/campaign_images/buzzfeed-prod-fastlane03/donald-trump-gives-highly-anticipated-immigration-2-4702-1472700192-1_dblbig.jpg", "site_section": "", "section_title": "", "url": "https://www.buzzfeed.com/salvadorhernandez/donald-trump-to-give-highly-anticipated-immigration-speech-i", "country": "US", "domain_rank": 137, "title": "Donald Trump Gives Highly-Anticipated Immigration Speech In Arizona - BuzzFeed News", "performance_score": 2, "site": "buzzfeed.com", "participants_count": 0, "title_full": "Donald Trump Gives Highly-Anticipated Immigration Speech In Arizona - BuzzFeed News", "spam_score": 0.149, "site_type": "news", "published": "2016-08-31T08:00:00.000+03:00", "replies_count": 0, "uuid": "2156092c087d226c943fd94c80a2b4eab40f682d"}, "author": "Salvador Hernandez Buzzfeed News Reporter", "url": "https://www.buzzfeed.com/salvadorhernandez/donald-trump-to-give-highly-anticipated-immigration-speech-i", "ord_in_thread": 0, "title": "Donald Trump Gives Highly-Anticipated Immigration Speech In Arizona - BuzzFeed News", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "negative"}, {"name": "evan vucci", "sentiment": "negative"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "peña nieto", "sentiment": "none"}, {"name": "enrique peña nieto", "sentiment": "none"}], "locations": [{"name": "arizona", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}, {"name": "trump mexico", "sentiment": "none"}, {"name": "phoenix", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Evan Vucci / AP ID: 9544916 \nDonald Trump rolled out his highly-anticipated speech on immigration policy Wednesday in Phoenix, which was focused on tripling manpower to deport undocumented immigrants and rolling back protections for immigrants who were brought by their parents as young children. \n“There will be no amnesty,” Trump said, outlining a 10-point policy that appeared to be focused on deportations, increasing manpower at the border and tightening visa regulations. \nDonald Trump rolled out the plan Wednesday at a rally in Phoenix, saying the US should take “our forgotten working people” into consideration. \nThe speech came just hours after Trump met with Mexican President Enrique Peña Nieto south of the border, where the two said they had a direct and constructive talk about immigration and their contributions to both sides of the border. \nBut Trump took on a different tone in his speech in Arizona Wednesday night, linking crime and immigration and stating that his focus would be on criminal immigrants. \n“My first hour in office, those people are gone. You can call it whatever the hell you want, they’re gone,” Trump said. “The crime will stop - they are going home.” \nIf his Hillary Clinton is elected, Trump warned the crowd, “the result will be millions of more illegal immigrants, thousands of more violent crimes and total chaos and lawlessness.” \nHe also suggested his opponent, Hillary Clinton, would be among the deportees. \n“Maybe they’ll be able to deport her,” he said. \nAt the rally, Trump said previous attempts at immigration reform have failed because of self-interested politicians and special interests. \n“When politicians talk about immigration reform, the usually mean the following, amnesty, open borders, lower wages,” Trump said. “Immigration reform should mean something else entirely.” \nLike he’s done at previous rallies, Trump also listed crimes committed by undocumented immigrants in the US, and at the end of his speech inviting the relatives of victims of undocumented immigrants. \nThe speech has been a highly anticipated after the Republican nominee indicated he might be open to “softening” his stance on immigration controls. He then later said he had not changed his mind on the strict proposals he promoted during his campaign. \nInstead, Trump said the estimated 11 million undocumented immigrants in the country would not be allowed to stay in the country legally unless they returned to their country of origin and begin the process legally. \n“People will know that you can’t just smuggle in, hunker down and wait to be legalized,” he said. “Those days are over.” \nThe policy introduced by Trump Wednesday night was based on 10 points, which he outlined as building a border wall, detaining and deporting anyone trying to illegally cross the border, deporting undocumented criminal immigrants, blocking funding of “sanctuary cities,” rolling back protections offered to the children of immigrants brought at a young age, and vetting people trying to come to the US. \n“It’s going to be so tough, and if someone comes in that’s fine, but they’re going to be good,” Trump said. “Very few will slip through the cracks, hopefully none.” \nTrump has said he wants to build a force to deport the estimated 11 million undocumented immigrants in the US. And a hallmark of his campaign has been his proposal to build a wall along the border and force Mexico to pay for it. \nAfter meeting with Peña Nieto on Wednesday, Trump said the two discussed the wall, but not the issue of who would pay for it. \n“We didn’t discuss that,” Trump told reporters after the meeing. \nHowever, Peña Nieto tweeted that the issue was indeed discussed at the beginning of the hour-long meeting, and that he told Trump Mexico would not pay for it. \nTrump’s campaign then issued a statement saying the two men “hold two different views on this issue.” \nTrump also adopted a different tone in Phoenix than he did after meeting with Peña Nieto, telling a rowdy crowd of supporters in Phoenix that Mexico would pay for the wall. \n“They don’t know it yet, but they’re going to pay for the wall,” Trump said. \nDespite past suggestions that Trump might consider some sort of immigration reform that would address millions of people living in the US, Trump appeared to put an end to that speculation. \n“All energies of the federal government and legislative process must be focused on immigration security,” he said. “That is the only conversation we should be having at this time.” 4. ", "external_links": [], "published": "2016-08-31T08:00:00.000+03:00", "crawled": "2016-09-01T06:23:57.360+03:00", "highlightTitle": ""}