{"organizations": [], "uuid": "36671524571e9362d6c54f4883008e58ed7c2b1e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.msnbc.com", "main_image": "http://www.msnbc.com/sites/msnbc/files/styles/ratio--1_91-1--1200x630/public/2013/03/147358281_0.jpg?itok=Tp2E-Jac", "site_section": "http://www.newsvine.com/_feeds/rss2/index#", "section_title": "Newsvine - Get Smarter Here", "url": "http://www.msnbc.com/the-daily-rundown/health-care-laws-unpopularity-reaches-new-hi", "country": "US", "domain_rank": 1332, "title": "Health care law's unpopularity reaches new...", "performance_score": 0, "site": "msnbc.com", "participants_count": 1, "title_full": "Health care law's unpopularity reaches new...", "spam_score": 0.0, "site_type": "news", "published": "2016-09-18T23:59:00.000+03:00", "replies_count": 0, "uuid": "36671524571e9362d6c54f4883008e58ed7c2b1e"}, "author": "MSNBC", "url": "http://www.msnbc.com/the-daily-rundown/health-care-laws-unpopularity-reaches-new-hi", "ord_in_thread": 0, "title": "Health care law's unpopularity reaches new...", "locations": [], "entities": {"persons": [{"name": "mitch mcconnell", "sentiment": "none"}, {"name": "barack obama", "sentiment": "none"}, {"name": "george w. bush", "sentiment": "none"}, {"name": "obama", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "kentucky", "sentiment": "none"}, {"name": "r-ky.", "sentiment": "none"}, {"name": "obamacare", "sentiment": "none"}], "organizations": [{"name": "supreme", "sentiment": "negative"}, {"name": "senate", "sentiment": "none"}, {"name": "congress", "sentiment": "none"}, {"name": "gop", "sentiment": "none"}, {"name": "u.s. supreme court", "sentiment": "none"}, {"name": "nbc news/wall street journal", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "File Photo: Opponents of the Affordable Care Act rally before the Supreme announces its decision about the constitutionality of the president's efforts on... Chris Maddaloni/CQ Roll Call, File \nThis story was originally published on NBCNews.com . \nPresident Barack Obama’s signature health care reform law remains unpopular with the American public just months before it fully goes into effect, according to the new NBC News/Wall Street Journal poll. \nThe poll shows 49 percent of Americans say they believe the Affordable Care Act is a bad idea. That’s the highest number recorded on this question since the poll began measuring it in 2009. Just 37 percent say the plan is a good idea. \nAs the political battle over implementation of the law heats up in Washington, the numbers mark an increase in unpopularity since July 2012, right after the U.S. Supreme Court upheld Obama’s overhaul. Back then, 44 percent of NBC/WSJ poll respondents called it a bad idea, vs. 40 percent who called it a good one. \nGOP leaders have been unrelenting in their calls to reverse the law. “For the sake of my constituents in Kentucky and for the sake of Americans across the country, I urge my friends on the other side to join with Republicans and stop this ‘train wreck’ before things get even worse,” Senate Minority Leader Mitch McConnell, R-Ky., said on the Senate floor in April. \nObama countered earlier this year, “Despite all the hue and cry and ‘sky is falling’ predictions about this stuff, if you’ve already got health insurance, then that part of Obamacare that affects you, it’s pretty much already in place. And that’s about 85 percent of the country.” \n“What is left to be implemented is those provisions to help the 10 to 15 percent of the American public that is unlucky enough that they don’t have health insurance,” he added. \nFor individuals, the current poll also finds 38 percent of respondents saying that they (and their families) will be worse off under the health care law. That’s the highest percentage of respondents to express a negative outlook toward “Obamacare” since 2010, when the president signed this signature piece of legislation into law following an extended, bruising battle in Congress. \nBy comparison, 19 percent say they’ll be better off, and 39 percent say the law won’t make much of a difference. \nThe poll, however, shows deep divisions by political party and health insurance status. \nBy a 35 percent-to-11 percent margin, Democrats say they’ll be better off under the health care law. But Republicans say they’ll be worse off, 67 percent to 4 percent. \nWhat’s more, those who currently don’t have health insurance have a more positive view of the health-care law than those who have insurance – either through individual purchase or through their employer. \nMajority backs pathway to citizenship for undocumented immigrants \nMeanwhile, with bipartisan immigration reform legislation expected to hit the Senate floor next week, the NBC/WSJ poll shows a slight majority – 52 percent – saying they support a proposed pathway to allow undocumented immigrants to become U.S. citizens. \nWhen told that the proposed pathway to citizenship under the legislation includes requirements to pay fines, back taxes and pass a background security check, the percentage favoring it jumps up to 65 percent, including 58 percent of Republicans. \nBut respondents are divided over whether Congress should pass an immigration bill by the end of the current Congress: 47 percent say they would be upset if Congress doesn’t pass a bill, and that includes a majority of Democrats (54 percent). \nBut an equal 47 percent say they wouldn’t be upset if Congress doesn’t pass immigration legislation, and that includes a majority of Republicans (53 percent). \nStrikingly, the partisan divisions have flipped since this question was last asked in 2006, when former President George W. Bush was supporting comprehensive immigration reform. \nBack then, more than six-in-10 Republicans said they would be upset if immigration reform didn’t pass, and an almost equal percentage of Democrats – who were out of power in the White House – said they wouldn’t be upset. \nThe NBC/WSJ poll was conducted May 30-June 2 of 1,000 adults (including 300 cell phone-only respondents), and it has an overall margin of error of plus-minus 3.1 percentage points. Explore:", "external_links": [], "published": "2016-09-18T23:59:00.000+03:00", "crawled": "2016-09-18T19:14:07.632+03:00", "highlightTitle": ""}