{"organizations": [], "uuid": "3c36374bb2203edc12a0dcdb6984e199bba2a90f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 2, "shares": 2, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/images.foxnews.com/content/fox-news/world/2016/09/11/french-presidential-primary-pits-sarkozy-against-rival-juppe/_jcr_content/par/featured-media/media-0.img.jpg/0/0/1473588097910.jpg?ve=1", "site_section": "http://feeds.foxnews.com/foxnews/world", "section_title": "FOX News", "url": "http://www.foxnews.com/world/2016/09/11/french-presidential-primary-pits-sarkozy-against-rival-juppe.html", "country": "IT", "domain_rank": 185, "title": "French presidential primary pits Sarkozy against rival Juppe", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "French presidential primary pits Sarkozy against rival Juppe | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2016-09-11T03:00:00.000+03:00", "replies_count": 0, "uuid": "3c36374bb2203edc12a0dcdb6984e199bba2a90f"}, "author": "Associated Press", "url": "http://www.foxnews.com/world/2016/09/11/french-presidential-primary-pits-sarkozy-against-rival-juppe.html", "ord_in_thread": 0, "title": "French presidential primary pits Sarkozy against rival Juppe", "locations": [], "entities": {"persons": [{"name": "juppe", "sentiment": "negative"}, {"name": "sarkozy", "sentiment": "negative"}, {"name": "nicolas sarkozy", "sentiment": "negative"}, {"name": "carla bruni-sarkozy", "sentiment": "none"}, {"name": "jacques chirac", "sentiment": "none"}, {"name": "francois hollande", "sentiment": "none"}, {"name": "alain juppe", "sentiment": "none"}, {"name": "le pen", "sentiment": "none"}], "locations": [{"name": "france", "sentiment": "none"}, {"name": "jouy-en-josas", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "aubervilliers", "sentiment": "none"}, {"name": "bordeaux", "sentiment": "none"}], "organizations": [{"name": "associated press", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "national front", "sentiment": "none"}, {"name": "chinese fashion center", "sentiment": "none"}, {"name": "ap", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "  FILE - In this Aug. 31, 2016 file photo, former French President Nicolas Sarkozy speaks during the French employers' association Medef summer conference in Jouy-en-Josas, south of Paris. Nine contenders formally declared their candidatures for France’s conservative presidential primary Friday, Sept. 9 2016, but the race is expected to come down to a tight battle between former president Nicolas Sarkozy and former prime minister Alain Juppe. (AP Photo/Francois Mori, File) (The Associated Press) \nFILE - In this Sept. 8, 2016 file photo, Alain Juppe, former French Prime Minister and mayor of Bordeaux, walks in a fashion shop as he visits the Chinese Fashion Center at Aubervilliers, in the outskirts of Paris. Nine contenders formally declared their candidatures for France’s conservative presidential primary Friday, Sept. 9 2016, but the race is expected to come down to a tight battle between former president Nicolas Sarkozy and former prime minister Alain Juppe. (AP Photo/Francois Mori, File) (The Associated Press) \nPrevious Next PARIS –   Nine contenders formally declared their candidatures for France's conservative presidential primary Friday, but the race is expected to come down to a tight battle between former president Nicolas Sarkozy and former prime minister Alain Juppe. The winner will have a strong shot at the presidency in elections expected to hinge on security and the economy. Here's a look at the two men and their rivalry:\nHIGH PROFILE POLITICIANS\nNicolas Sarkozy, 61, was France's president from 2007 until 2012, when he lost to Francois Hollande. He has four children from three marriages, the latest with former top model Carla Bruni-Sarkozy. He's counting on his image as a staunch advocate of authority, security and strict immigration policy.\nAlain Juppe, 71, was prime minister from 1995 to 1997 under then-President Jacques Chirac, and foreign minister under Sarkozy between 2011 and 2012. He has three children from two marriages. Juppe emphasizes his experience to present himself as the wise politician France needs when the country is under threat of terror attacks.\nPolls show Juppe is currently enjoying high popularity but Sarkozy, his main competitor out of seven other contenders, is getting closer.\n___\nRELIGION\nSarkozy wants a national law banning the burkini swimwear, arguing he's advocating for gender equality and the country's secular values. He also wants to ban the Islamic headscarf from universities, companies and public buildings. He opposes specific pork-free menus for Muslim and Jewish children to be offered in schools.\nIn France, the Islamic headscarf and all other visible religious signs are already banned in schools and for public servants.\nJuppe is also strictly advocating for France's secular values, yet he is campaigning on the concept of a \"happy identity\" and respect for religious freedom, saying the French should cherish the \"joy of living together.\" He's in favor of the freedom to choose between different menus in schools — including meat, fish or vegetarian — with no religious connotations.\nThe debate about the relation between religion and the state, in particular Islam — the second largest faith in the country — has been prominent following recent attacks by Islamic extremists in the country.\n___\nIMMIGRATION\nImmigration is considered a key issue in the upcoming election amid the major migrant crisis in Europe and the conservative presidential candidate will compete against far right National Front's Marine Le Pen, who is expected to score high.\nSarkozy calls for a new European immigration policy. He is opposed to grant French citizenship to children born from foreign parents, if they have a criminal record or if their family entered illegally in the country. He proposes to remove the emergency health care that enables migrants to get medical treatment for free.\nJuppe proposes a cap on legal immigration to France, to be decided every year by Parliament.\n___\nLESS PUBLIC SPENDING AND LOWER TAXES\nSarkozy and Juppe have quite similar economic proposals. They both want to substantially reduce public spending, diminish the number of public servants and put an end to France's 35-hour workweek — a measure they believe has held back France's economic growth since it was adopted in 2000.\nThey also propose a pension reform to gradually delay the age of retirement from 62 to 64, according to Sarkozy, or to 65 according to Juppe. They vow to decrease taxes, especially those paid by businesses.\n___\nLEGAL ISSUES\nA French prosecutor has requested this week that Sarkozy be sent to trial over suspected illegal overspending on his failed 2012 re-election campaign. In a separate case, Sarkozy was handed preliminary charges of corruption and influence-peddling based on information gleaned from phone taps about an alleged bid to get information from a judge ahead of a decision.\nSarkozy has not been convicted of any wrongdoing or gone to trial and legally, nothing prevents him from seeking office.\nJuppe was convicted in 2004 of having taken illegal advantage of public funds — for the benefit of his party — while he was head of the conservative party in the 1990s. He served a 14-month suspended jail sentence and was deprived of the right to run for political office for one year.", "external_links": [], "published": "2016-09-11T03:00:00.000+03:00", "crawled": "2016-09-11T13:33:30.258+03:00", "highlightTitle": ""}