{"organizations": [], "uuid": "97b7d31ea9931cd5f5e456f9bf6fe2ad85ee102c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 59, "shares": 59, "comments": 1}, "stumbledupon": {"shares": 0}}, "site_full": "www.buzzfeed.com", "main_image": "https://img.buzzfeed.com/buzzfeed-static/static/2016-09/15/15/campaign_images/buzzfeed-prod-web08/clinton-aims-to-use-dreamer-program-model-to-get--2-13999-1473968666-5_dblbig.jpg", "site_section": "", "section_title": "", "url": "https://www.buzzfeed.com/adriancarrasquillo/clinton-aims-to-use-dreamer-program-model-to-get-florida-pue", "country": "US", "domain_rank": 137, "title": "Clinton Aims To Use DREAMer Program Model To Get Florida Puerto Ricans Out To Vote - BuzzFeed News", "performance_score": 0, "site": "buzzfeed.com", "participants_count": 0, "title_full": "Clinton Aims To Use DREAMer Program Model To Get Florida Puerto Ricans Out To Vote - BuzzFeed News", "spam_score": 0.001, "site_type": "news", "published": "2016-09-16T04:25:00.000+03:00", "replies_count": 0, "uuid": "97b7d31ea9931cd5f5e456f9bf6fe2ad85ee102c"}, "author": "Adrian Carrasquillo Buzzfeed News Reporter", "url": "https://www.buzzfeed.com/adriancarrasquillo/clinton-aims-to-use-dreamer-program-model-to-get-florida-pue", "ord_in_thread": 0, "title": "Clinton Aims To Use DREAMer Program Model To Get Florida Puerto Ricans Out To Vote - BuzzFeed News", "locations": [], "entities": {"persons": [{"name": "joanne carole", "sentiment": "negative"}, {"name": "hillary clinton", "sentiment": "negative"}, {"name": "clinton", "sentiment": "negative"}, {"name": "renteria", "sentiment": "none"}, {"name": "amanda renteria", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "praeli", "sentiment": "none"}, {"name": "adrian carrasquillo", "sentiment": "none"}, {"name": "parra", "sentiment": "none"}, {"name": "lorella praeli", "sentiment": "none"}, {"name": "jose parra", "sentiment": "none"}, {"name": "zika", "sentiment": "none"}], "locations": [{"name": "washington", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "puerto rico", "sentiment": "none"}, {"name": "tampa", "sentiment": "none"}, {"name": "pennsylvania", "sentiment": "none"}, {"name": "deltona", "sentiment": "none"}, {"name": "orlando", "sentiment": "none"}, {"name": "kissimmee", "sentiment": "none"}, {"name": "central florida", "sentiment": "none"}], "organizations": [{"name": "congress", "sentiment": "none"}, {"name": "buzzfeed news", "sentiment": "none"}, {"name": "orlando sentinel", "sentiment": "none"}, {"name": "congressional hispanic caucus institute", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Joanne Carole / ASSOCIATED PRESS ID: 9625038 \nWASHINGTON — When Hillary Clinton’s campaign launched their DREAMer voter initiative titled “Mi Sueño, Tu Voto” (“My Dream, Your Vote”), the lynchpin of the program was to mobilize undocumented youth who have often served as the face of the immigration movement, and use them to persuade neighbors and friends to vote because the DREAMers cannot. \nNow the campaign is looking to retrofit that idea for a crucial group of voters: Puerto Ricans in Orlando and along the I-4 corridor in the true swing state of Florida. The idea is to use residents on the island to connect with Floridians to impress upon them why they should vote, amid Puerto Rico’s struggles with Zika and a financial crisis. \n“We’ve heard from Puerto Ricans that people on the island are dependent on those in Florida,” said Latino vote director Lorella Praeli at a briefing ahead of Clinton’s return to the trail after a case of pneumonia and a speech Thursday to the Congressional Hispanic Caucus Institute. She said the campaign is working on identifying leaders to help creating the initiative now for mobilization efforts. \nThe fight for Florida is intense, with polls showing the state as a toss up. There are more than a million Puerto Ricans in Florida; 1,000 relocate to the state from the island every month, U.S. citizenship in hand. The Clinton campaign has five offices in the Orlando area and three in areas with large Puerto Rican populations, in Kissimmee, Deltona, and south Orlando. On Sept. 24, the campaign will host its first caravana, a staple of Puerto Rican politics, featuring a procession of trucks, music, and bullhorns. \nBut there are challenges. While the campaign leans on the fact that Puerto Ricans on the island have high voter-participation rates, there is also a culture of voting in person, so the campaign not only has to get them to vote, but is also emphasizing early voting, which boosted Clinton during the primary. And as the Orlando Sentinel detailed in a recent report , 30% of Latinos in Orlando, Tampa and Central Florida reject party affiliation, “with only 68 percent of Latino adults in Central Florida registered to vote in their district, compared with 80 percent across the general, statewide population.” \nDemocratic strategist Jose Parra, who is from Florida, said the key to the campaign’s program to reach Puerto Ricans will be in the implementation because of every day realities that may take precedence over voting, presenting a challenge for the Clinton campaign trying to squeeze every drop of Latino votes out of the Sunshine state. \n“You have all these things Puerto Ricans are dealing with — there’s a shortage of housing in central Florida because of the influx of people, rents are extremely high,” Parra said. “They’re living the immigrant experience, housing is expensive and it may not be close to work.” \nBut the Clinton campaign won’t be alone. Voto Latino, which is in the midst of a Hispanic Heritage Month voter registration push, recently launched a similar program to have celebrities and influencers in Puerto Rico call Florida residents to get them to vote. \nPraeli said the campaign will also be sending Puerto Rican supporters in New York to Pennsylvania to volunteer in the key state. \nClinton went to Puerto Rico in the Fall of 2015 for a roundtable on the island’s health crisis — before Zika exploded in the national consciousness and recent reports that one in four residents will contract the disease, which can be deadly and is dangerous for pregnant women. \nShe recently went to Florida to address the issue, as the campaign’s national political director Amanda Renteria has, when she visited the island to meet with officials to discuss the disease. Puerto Rico is also struggling through a financial crisis related to its debt and lobbied for bankruptcy protection before a financial control board was instituted by Congress. \n“Folks know she has been with Puerto Rico in the crisis,” Renteria said. “While Trump believes in bankruptcies for himself — he has a hard time talking about how to help Puerto Ricans.” Adrian Carrasquillo is a political reporter for BuzzFeed News and is based in New York. Contact Adrian Carrasquillo at . ", "external_links": [], "published": "2016-09-16T04:25:00.000+03:00", "crawled": "2016-09-15T23:27:22.093+03:00", "highlightTitle": ""}