{"organizations": [], "uuid": "1f5cf8a36852f670b785101aa8c9fb59639e197e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.foxnews.com", "main_image": "http://global.fncstatic.com/static/v/all/img/og/og-fn-foxnews.jpg", "site_section": "http://www.foxnews.com/hannity/", "section_title": "Hannity | Sean Hannity | Fox News", "url": "http://www.foxnews.com/transcript/2016/09/28/gingrich-miss-universe-attack-may-blow-up-in-clinton-face-gorka-comey-correct/", "country": "IT", "domain_rank": 185, "title": "Gingrich: Miss Universe attack may blow up in Clinton's face; Gorka: Comey correct about 'terrorist diaspora'", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "Gingrich: Miss Universe attack may blow up in Clinton's face; Gorka: Comey correct about 'terrorist diaspora' | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2016-09-28T03:00:00.000+03:00", "replies_count": 0, "uuid": "1f5cf8a36852f670b785101aa8c9fb59639e197e"}, "author": "FoxNews.com", "url": "http://www.foxnews.com/transcript/2016/09/28/gingrich-miss-universe-attack-may-blow-up-in-clinton-face-gorka-comey-correct/", "ord_in_thread": 0, "title": "Gingrich: Miss Universe attack may blow up in Clinton's face; Gorka: Comey correct about 'terrorist diaspora'", "locations": [], "entities": {"persons": [{"name": "gingrich", "sentiment": "negative"}, {"name": "comey", "sentiment": "negative"}, {"name": "gorka", "sentiment": "negative"}, {"name": "clinton", "sentiment": "negative"}, {"name": "mccaul", "sentiment": "none"}, {"name": "james comey", "sentiment": "none"}, {"name": "steinbeck", "sentiment": "none"}, {"name": "christ", "sentiment": "none"}, {"name": "ferguson", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "bill clinton", "sentiment": "none"}, {"name": "brennan", "sentiment": "none"}, {"name": "darrell scott", "sentiment": "none"}, {"name": "bryant", "sentiment": "none"}, {"name": "clinton foundation", "sentiment": "none"}, {"name": "obamacare", "sentiment": "none"}, {"name": "kathleen", "sentiment": "none"}, {"name": "a.j.", "sentiment": "none"}, {"name": "clintons", "sentiment": "none"}, {"name": "mark penn", "sentiment": "none"}, {"name": "sidney blumenthal", "sentiment": "none"}, {"name": "juanita", "sentiment": "none"}, {"name": "nate silver", "sentiment": "none"}, {"name": "sebastian gorka", "sentiment": "none"}, {"name": "scott", "sentiment": "none"}, {"name": "clapper", "sentiment": "none"}, {"name": "monica lewinski", "sentiment": "none"}, {"name": "chris wallace", "sentiment": "none"}, {"name": "obama", "sentiment": "none"}, {"name": "a.j. delgado", "sentiment": "none"}, {"name": "dolly", "sentiment": "none"}, {"name": "holt", "sentiment": "none"}, {"name": "robert byrd", "sentiment": "none"}, {"name": "monica", "sentiment": "none"}, {"name": "lester holt", "sentiment": "none"}, {"name": "hillary", "sentiment": "none"}, {"name": "gennifer", "sentiment": "none"}, {"name": "darrell", "sentiment": "none"}, {"name": "c.l. bryant", "sentiment": "none"}, {"name": "a.j. delgado", "sentiment": "none"}, {"name": "monica lewinsky", "sentiment": "none"}, {"name": "darrell scott", "sentiment": "none"}, {"name": "paula", "sentiment": "none"}, {"name": "lewinsky", "sentiment": "none"}, {"name": "joe concha", "sentiment": "none"}, {"name": "hannity", "sentiment": "none"}, {"name": "lester", "sentiment": "none"}, {"name": "joe", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "bob woodward", "sentiment": "none"}, {"name": "hume", "sentiment": "none"}, {"name": "candy crowley", "sentiment": "none"}, {"name": "diane blair", "sentiment": "none"}, {"name": "alicia machado", "sentiment": "none"}, {"name": "joe concha", "sentiment": "none"}, {"name": "c.l. bryant", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "james carville", "sentiment": "none"}, {"name": "hannity", "sentiment": "none"}, {"name": "scott", "sentiment": "none"}, {"name": "newt gingrich", "sentiment": "none"}, {"name": "newt gingrich", "sentiment": "none"}, {"name": "gennifer flowers", "sentiment": "none"}, {"name": "rubio", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "sebastian gorka", "sentiment": "none"}, {"name": "pastor bryant", "sentiment": "none"}, {"name": "delgado", "sentiment": "none"}, {"name": "christopher hitchins", "sentiment": "none"}, {"name": "sean", "sentiment": "none"}, {"name": "bill", "sentiment": "none"}, {"name": "james comey", "sentiment": "none"}, {"name": "c.l.", "sentiment": "none"}, {"name": "machado", "sentiment": "none"}, {"name": "speaker", "sentiment": "none"}, {"name": "allen", "sentiment": "none"}], "locations": [{"name": "mumbai", "sentiment": "none"}, {"name": "newsbreak", "sentiment": "none"}, {"name": "saudi arabia", "sentiment": "none"}, {"name": "whitewater", "sentiment": "none"}, {"name": "tanzania", "sentiment": "none"}, {"name": "syria", "sentiment": "none"}, {"name": "capitol hill", "sentiment": "none"}, {"name": "chicago", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}, {"name": "orlando", "sentiment": "none"}, {"name": "iowa", "sentiment": "none"}, {"name": "charlotte", "sentiment": "none"}, {"name": "iraq", "sentiment": "none"}, {"name": "baltimore", "sentiment": "none"}, {"name": "detroit", "sentiment": "none"}, {"name": "d.c", "sentiment": "none"}, {"name": "kenya", "sentiment": "none"}, {"name": "united states of america", "sentiment": "none"}, {"name": "hannity", "sentiment": "none"}, {"name": "chattanooga", "sentiment": "none"}, {"name": "dodge city", "sentiment": "none"}, {"name": "middle east", "sentiment": "none"}, {"name": "ohio", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "virginia", "sentiment": "none"}, {"name": "western europe", "sentiment": "none"}, {"name": "ft. hood", "sentiment": "none"}, {"name": "mexico city", "sentiment": "none"}, {"name": "atlanta", "sentiment": "none"}, {"name": "oval office", "sentiment": "none"}, {"name": "benghazi", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "north carolina", "sentiment": "none"}, {"name": "venezuela", "sentiment": "none"}, {"name": "san bernardino", "sentiment": "none"}, {"name": "east cleveland", "sentiment": "none"}, {"name": "new jersey", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}, {"name": "arkansas", "sentiment": "none"}], "organizations": [{"name": "goldman sachs", "sentiment": "none"}, {"name": "freedom works", "sentiment": "none"}, {"name": "fox news", "sentiment": "none"}, {"name": "fox news", "sentiment": "none"}, {"name": "the times", "sentiment": "none"}, {"name": "university of arkansas", "sentiment": "none"}, {"name": "the new york times", "sentiment": "none"}, {"name": "cnn", "sentiment": "none"}, {"name": "clinton foundation", "sentiment": "none"}, {"name": "supreme court", "sentiment": "none"}, {"name": "pac", "sentiment": "none"}, {"name": "senate", "sentiment": "none"}, {"name": "the washington post", "sentiment": "none"}, {"name": "guardian", "sentiment": "none"}, {"name": "house", "sentiment": "none"}, {"name": "fmr", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "islam", "sentiment": "none"}, {"name": "lincoln bedroom", "sentiment": "none"}, {"name": "new york times", "sentiment": "none"}, {"name": "ceo for national diversity coalition for trump", "sentiment": "none"}, {"name": "fbi", "sentiment": "none"}, {"name": "new york post", "sentiment": "none"}, {"name": "federal reserve", "sentiment": "none"}, {"name": "isis", "sentiment": "none"}, {"name": "nea", "sentiment": "none"}, {"name": "politico", "sentiment": "none"}, {"name": "washington post", "sentiment": "none"}, {"name": "cbs", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Published September 28, Watch the latest video at video.foxnews.com\n 28, And welcome to \"Hannity.\" And tonight, Donald Trump -- he continues to relentlessly pound the campaign trail by holding rallies in key swing states, including one earlier tonight. And here are some of the highlights.\n(BEGIN VIDEO CLIP)\nTRUMP: This is going to be an interesting 40 days. Look at all these people. Going to be an interesting 40 day. It's going to be a victory for you, the American people. We're going to end the Clinton corruption and restore dignity and honesty to government service. I don't know if you watched today, the hearing. It was disgraceful. It was disgraceful.\nHillary Clinton is an insider who fights only for her donors and for herself. I'm an outsider, I'm fighting for you. Believe me, I am fighting for you.\n(CHEERS AND APPLAUSE)\nTRUMP: How can Hillary Clinton try to lead this country when she has such a low opinion of its citizens? How can she lead this country when she thinks America is full of racists, deplorables, and irredeemables? You're not irredeemable. You're not irredeemable. You're not deplorable.\nBoy, look at this crowd, right into every little corner, even up there.\nWow. This is something.\n(CHEERS AND APPLAUSE)\nTRUMP: And you know what? Folks, it's this way all over the country.\nLook back there, people trying to -- it's this way all over the country because people are disgusted with our government.\nWe are being run by incompetent people. We are being run by people that don't know what they're doing. And in my opinion, Hillary Clinton is the most incompetent of all.\n(CHEERS AND APPLAUSE)\nTRUMP: By smearing tens of millions of hard-working, decent Americans, she's rendered herself unfit to be president. She is unfit to be president.\n Also tonight, Hillary Clinton and her many friends in the mainstream media -- they're launching an all-out assault to falsely paint Donald Trump as sexist and misogynist. But like all their other attempts, this latest one is now falling apart.\nAt the debate, Hillary Clinton brought up the former Miss Universe 1996 winner, Alicia Machado, who's now saying that Donald Trump's treatment of her led to years of eating disorders and mental anguish. But in 1997, a Machado was getting ready to pass on her crown -- well, she told The Washington Post, Quote: , \"I was anorexic and bulimic, but almost all of us were. When I was preparing for Miss Universe, it was an obsession for me to not to gain weight. And by the time I won, I was actually recovering.\nBut the year leading to it, I didn't eat at all, and whatever I ate, I threw up. I weighed 116 pounds when I won. I was skeletal.\"\nSo in 1997, Machado said she already had these issues, but after talking to the Clinton campaign, she changed her story in what appears to be an attempt to smear coordinated against Donald Trump.\nNow, there's also Machado's very questionable past. As FoxNews.com reported earlier today, in the 1990s, after Machado's then boyfriend was indicted for attempted murder in her home country of Venezuela, well, she threatened to ruin the judge's career and even kill the judge. Now, the family of the victim also accused Machado of driving her boyfriend's getaway car, but she was never charged and denied the accusation.\nNow, those, of course, are all the details that Hillary Clinton and her campaign and the left-wing media conveniently kept out, especially at the debate the other night.\nHere with reaction, former speaker of the House, Fox News contributor Newt Gingrich. This is not insignificant, is it, because there appears to be a coordination, doesn't there, between the media and the Clinton campaign about the Machado case as they were telling them and telegraphing, This is what we're going to do.\nYou talked about it today in a Facebook Live session. Tell us about it.\nNEWT GINGRICH, FMR. HOUSE SPEAKER, FOX CONTRIBUTOR: Well, I mean, this is a great case study. First of all, everything Donald Trump said at the very beginning is true. If you did not have the elite media propping her up, protecting her, smearing Donald Trump, distorting the campaign, she'd be gone.\nI mean, if Lester Holt hadn't sided with her -- you know, you had the whole Clinton versus Trump debate, which Holt and Clinton were on the same team, basically. If those things weren't going on, she'd be gone.\nYou had, we now know -- and I give The Washington Post some credit for this. They laid out today all of the different pieces that have been put in place by the Clinton campaign, a Cosmopolitan story, a New York Times story, video already done, a Guardian interview. All of this was done before the debate, setting up...\nHANNITY: So wait, wait. Wait a minute. So the Clinton campaign gave it to all their friends in the media...\n(CROSSTALK)\nHANNITY: ... before the debate, before the attack.\nGINGRICH: Right, and said, Hold onto this because something will happen during the debate. And the reason you get this sudden rush at the very end is Hillary must have had a checklist and realized, We're almost out of time, and I haven't kept my word to my friends in the media.\nSo she drops this in in two or three sentences, that it's not quite clear why she's saying it. It's a 20-year-old story. (INAUDIBLE) that's part one. It clearly is an ambush set up by the elite media.\nPart two, which is frankly funny -- I mean, this could be a situation comedy. The person they pick as a victim -- and you didn't get all of it.\nThere are allegations that she drove the getaway car for her boyfriend after a murder. There are allegations by a prosecutor who said she said to him personally, If you don't leave my boyfriend alone, I will have -- I will get rid of you. I will have you killed. This is the prosecutor's testimony.\nThere are allegations that she ended up as the girlfriend of a major cartel drug dealer, and the woman who reported that was killed in Mexico City.\nThat's a CNN report. That's not me or you.\nAnd I'm just saying to you, all of a sudden, Machado is a very strange victim to rally the left around, and I think this thing may blow up in Hillary's face by the end of the week.\nHANNITY: You know, does it now also open up a door? You actually complimented Donald Trump because he didn't go there at the end of the debate. I'm not sure if I could have done it. You probably have more discipline than me. I give you credit. You're an elder statesman. I'm a bombastic talk show host. I probably would have said it.\n(LAUGHTER)\nHANNITY: I wouldn't have controlled myself. But there's something here -- you know, according to a -- this was a CBS report in 2013. There's a woman by the name of Diane Blair (ph). She's political science professor. Her papers were donated to the University Arkansas special collection, et cetera.\nAnyway, one of Hillary's closest friends -- and Hillary Clinton credited Bill Clinton with trying to break away from Lewinsky. That was her mindset. And she called Monica a narcissistic looney-toon!\nNow, if we're going to now examine these things -- and we could also go a step further because Christopher Hitchins, the late Christopher Hitchins, Quote: d Sidney Blumenthal as saying what people need to understand is Monica Lewinsky was stalker, an unstable minx who's been threatening Clinton and telling that -- that if he didn't have sex with him, he'd (sic) say it anyway.\nSo it's sort of like here we go again. You've got -- just like in the birther case, Sidney Blumenthal involved and Mark Penn's memo involved, and then they deny, you know, plausible deniability, but there really was a smear attempt against Monica, against Gennifer, against Paula, James Carville saying drag a dollar through a trailer park.\nIs this now -- are we going here now because she started this?\nGINGRICH: Well, no, and I don't think we should and I hope Trump doesn't.\nI mean, look, if this campaign stays up here on big issues -- change, no change, rethink the Middle East, keep doing what's failing, do something about crime in the inner cities, have nothing positive to add, create a lot of American jobs, have no experience creating jobs, cut taxes, raise taxes.\nIf Trump wages this campaign at that level, he is going to crush her. I mean, this country's not going to vote for a tax-increasing, left-wing, Washington-based more red tape, bigger bureaucracy, weak foreign policy, radical social values, left-wing Supreme Court candidate. It ain't going to happen!\nHANNITY: How does it...\nGINGRICH: The more they...\nHANNITY: Yes. Go ahead.\nGINGRICH: OK. The more the Clintons can drag this into the gutter, the better off it is for the Clintons. They might win in the gutter. They're not going to win up here.\nHANNITY: So -- so...\nGINGRICH: And they know they're not going to win up here.\nHANNITY: OK, so we can have a debate, 90 minutes uninterrupted air time, and we don't talk about the following -- \"Obama care.\" We don't talk about Saudi Arabia and Clinton taking money from a country that abuses women and gays and lesbians and Christians and Jews and she's getting tens and tens of millions of dollars. We don't talk about Benghazi and her poor decision making there. We don't talk about the real state of the economy.\nListening to Lester Holt's first question, I thought -- we had the greatest recovery in the world! And meanwhile, it was the worst recovery since the '40s!\nGINGRICH: Right.\nHANNITY: We don't talk about pay-to-play. We don't talk about the Clinton Foundation. We don't talk about the e-mail server. We don't talk about immigration, vetting refugees, radical Islam! How do you not talk about all of these things in the course of a 90-minute debate, but they talked about birtherism!\nGINGRICH: Because -- because, Sean, two things here. First of all, the fix was in. I'm sorry to say it. I had a higher opinion of Lester Holt before the debate began and a dramatically lower opinion afterwards.\nLet me give you an example from my own experience. If Lester Holt had opened the debate by saying to me, Look how great the economy is, my first reaction would be to say, Lester, I know you got a big job in New York and you get paid a ton of money and you're surrounded with people who are really doing well. The rest of America isn't. And I would have gone right at him.\nAnd I think Trump's got to be prepared in these next two debates, and I hope Pence is going to be prepared in his debate, when the news media gets out of line, put them back in the box. You know, they're not your peers.\nThey're not running for president.\nHANNITY: All right, so Miss Universe, with all these ethical issues, is brought up. Is it -- you're saying he shouldn't even go there. You think -- if she's going to call him a sexist and racist, he's got to hit back!\nSuperpredator...\n(CROSSTALK)\nGINGRICH: No. No. You know what he should have said? He should have said, You can use all of the vicious personal smears you want to because you've got nothing to offer America. You have no solution for jobs. You have no solution for ISIS. You have no solution for education. You have no solution for murders in Chicago.\nAnd so you've got to get in the gutter because you don't have anything to offer up here, where normal people live, and I'm not joining you in the gutter because I want to solve America's problems. That's what he should have said.\nHANNITY: All right. That's a powerful -- we still have two debates to go.\nHe has a chance coming up.\nGINGRICH: He does.\nHANNITY: All right, we'll have more with Speaker Gingrich right after the break.\nAnd also coming up on this on this busy news night...\n(BEGIN VIDEO CLIP)\nTRUMP: Everything you need to know about Hillary Clinton can be understood with this simple phrase. Follow the money.\n Trump goes after Clinton's long history of corruption. Newt Gingrich is back right after the break.\nAnd also later tonight...\n(BEGIN VIDEO CLIP)\nJAMES COMEY, FBI DIRECTOR: There will be a terrorist diaspora sometime in the next two to five years like we've never seen before. We must prepare ourselves and our allies, especially in Western Europe, to confront that threat.\n And maybe not take in refugees that you say we can't vet? That was the FBI director, James Comey, issuing that very scary warning about ISIS. We'll check in with Dr. Sebastian Gorka later.\nAnd much more straight ahead tonight on \"Hannity.\"\n(COMMERCIAL BREAK)\n(NEWSBREAK)\n(BEGIN VIDEO CLIP)\nDONALD Everything you need to know about Hillary Clinton can be understood with this simple phrase. Follow the money.\nShe even gave up 20 percent of uranium. You know what happens with uranium, don't you, and who controls that 20 percent. Russia. Russia. Russia. She disgraced the office of secretary of state by putting it up for sale. And if she ever got the chance, she would put the Oval Office up for sale, too.\n Donald Trump calling out his Democratic rival. That was earlier today in Iowa. So will these lingering scandals hurt Clinton come November?\nWe continue with the former speaker of the House, FOX News contributor Newt Gingrich. All right, we do have to have a discussion in one of these debates about Benghazi. We do have to talk about \"Obama care,\" right? We have to talk about the real state of the economy, pay-to-play, the Clinton Foundation. That has to come up at some point, right?\nGINGRICH: Well, it should. And let me just say, I don't often, as you know, disagree with Trump, and I have great admiration. But I think he said something just now that I think is an exaggeration.\nI don't think Hillary would sell the Oval Office. I think she would rent it on a nightly basis, but I don't think she'd sell it. And I think it's a little bit much. First of all, she has greater value over eight years renting it one night at a time than if she sold it because only one guy couldn't pay enough.\nHANNITY: Well, they did rent the Lincoln Bedroom the last time they were there. Why...\nGINGRICH: Well, they did see (ph) -- they've already got it down. They rented the Lincoln Bedroom.\nHANNITY: Right.\nGINGRICH: This will just be a bolder, bigger opportunity. And she obviously has dictator friends around the world and rich, weird (ph) people around the world who -- you know, a couple of million dollars per night, Could I come and hang out in the Oval Office? Bill would probably be glad to come back and hang with them, have a couple drinks, tell war stories, look at pictures. You know...\nHANNITY: Pizza party!\nGINGRICH: That's right. So she could say, you know, for $5 million a night, you get Bill, for $20 million, you get me. Or maybe it's the opposite. For $20 million you get Bill. I'm more boring, so it's only 5 for me.\n(LAUGHTER)\nGINGRICH: But I just don't think he should say she's going to sell the office. I think he should say she's going to rent it. I think that's a more...\nHANNITY: All right, what do you say...\nGINGRICH: -accurate and reasonable position.\nHANNITY: ... because if you look at all the on-line polls -- The Hill, Time.com, Slate -- I mean, the list was really long- Trump won the debate in these on-line polls. Everyone's going to say, Hannity, they're not scientific. I hear what you're saying.\nBut this is the question. the punditry class has been wrong about Trump in the previous 12 debates that he had with Republicans. And I thought he did well during the debate. I think he -- he's got a lot of information, a lot of stuff. She dropped the kitchen sink on him. He still has a lot that he could bring up against her.\nWhat do you imagine would be the best pivot for him?\nGINGRICH: Well, I think you're on the right track. I mean, he ought to go to the dig deals. Obamacare is not working. The Democrats in the inner city aren't working. The economy's not working. The Federal Reserve is dangerously not working. Our national security policy in the Middle East isn't working.\nI mean, if he comes in at that level and sticks at that level and makes a simple case, We need change -- she's telling you it's working and we don't need change. I'm telling you it's not working and we do need change. You decide which one you want to be with.\nYou know, I think that there's -- that's more devastating to her than any kind of mud-slinging or getting down in the gutter or fighting. I mean, the Clintons are the best mudders in modern times. They've been living in the gutter, fighting over things from Whitewater and cattle futures and all the way up for the last 30 years. They get how to do that.\nWhat they can't do is get up here where there's a clear choice based on your life and your policies. Do you think you're better off? Do you think you can afford the health care system today?\nHANNITY: Did you hear Comey today? I mean, (INAUDIBLE) safer now? James Comey's saying, Watch out the next two to five years.\nGINGRICH: Look, let me just say, if James Comey had been the director of FBI during Watergate, Watergate would never have occurred. The more we learn about the level of the FBI coverup, the more we learn about all the things they avoided doing and the more we learn about what's clearly, I think, by any reasonable standard, a deliberate effort to cover up by Clinton and her staff -- I am shocked at Comey, who's had a great reputation, clearly has been in the tank covering up for what by any reasonable standard is a horrific scandal of illegality.\nHANNITY: Well, it appears. I mean, can you imagine using BleachBit and not being accused of destroying evidence? If I did it, you would be visiting me in jail, I hope, with a cake with a file in it!\nGINGRICH: You can't lay out the timeline of this whole scandal and not reach the conclusion that she broke the law early on, that they knew she was breaking the law, that when it became obvious they were in trouble, even after they were beginning to get subpoenas and were being told not to destroy anything, they were methodically...\nHANNITY: Yes.\nGINGRICH: ... doing things. It's really, I think, truly...\nHANNITY: Thirty-three thousand...\nGINGRICH: ... horrendous.\nHANNITY: ... e-mails. All the money from Saudi Arabia, a country that abuses women and gays and lesbians and Christians and Jews. And she never criticized them! She was bought and paid for!\nMr. Speaker, good to see you.\nGINGRICH: Good to see you.\nHANNITY: Thank you.\nAnd coming up next tonight on this busy news night...\n(BEGIN VIDEO CLIP)\nCOMEY: There will be a terrorist diaspora sometime in the next two to five years like we've never seen before. We must prepared ourselves and our allies, especially in Western Europe, to confront that threat.\n FBI director Comey, chilling alarm about the growing threat of ISIS. We'll check in with Dr. Sebastian Gorka. He's here next.\nAnd also tonight...\n(BEGIN VIDEO CLIP)\nTRUMP: The single weapon that she's got is the media! Without the mainstream media, she wouldn't be even be here, folks! That I can tell you.\n Trump calling out the liberal mainstream media for bending over backwards to help and contribute to Hillary Clinton. A.J. Delgado, Joe Concha -- they're here to weigh in.\nThat and more straight ahead tonight on \"Hannity.\"\n(COMMERCIAL BREAK)\n(BEGIN VIDEO CLIP)\nHANNITY: And welcome back to \"Hannity.\" So yesterday, while testifying on Capitol Hill, the FBI director, James Comey, issued this dire warning about ISIS. Take a look.\n(BEGIN VIDEO CLIP)\nCOMEY: The so-called caliphate will be crushed. The challenge will be though the fingers of that crush are going to come hundreds of very, very dangerous people. They will not all die on the battlefield in Syria and Iraq. There will be a terrorist diaspora sometime in the next two to five years like we've never seen before.\nWe must prepare ourselves and our allies, especially in Western Europe, to confront that threat because when ISIL is reduced to an insurgency and those killers flow out, they will try to come to Western Europe and try to come here to kill innocent people. We have to keep our eye on it and be ready for it.\n All right, joining us now, the author of \"Defeating Jihad: The Winnable War,\" are (ph) our friend -- Dr. Sebastian Gorka is with us.\ni listen to that, and I'm thinking I'm not looking forward to the next two to five years. What's your assessment of that?\nSEBASTIAN GORKA, \"DEFEATING JIHAD\" AUTHOR: I think Director Comey in this case is absolutely correct. There will be a terrorist diaspora. I'm not so optimistic about how soon we're going to squeeze ISIS in the region. But if you just look at the region, ISIS in just a couple of years has recruited more than 85,000 jihadis. Of those, at least 35,000 aren't even Iraqis or Syrians. They're from outside the battle zone.\nAnd the scariest thing, Sean -- at least 6,000 of the ISIS fighters are Westerners, Americans, Brits, Germans, people who, even if they're not on American passports, are potentially on the visa waiver program and can move freely in and out of America. That is a truly horrific terrorist threat assessment directly from the head of the FBI.\nHANNITY: You know, I come at this from a very interesting point. There was so much that didn't come up in the debate the other night, including vetting refugees. She wants a 550 percent increase. Comey, Clapper, Brennan, Steinbeck (ph), McCaul, General Allen all say ISIS will infiltrate. And I'm thinking, listening to Comey and that dire warning, how does that not come up in a debate?\nGORKA: You'd have to ask Lester Holt. So many things didn't come up on the debate. Think about the fact Donald Trump is the Republican candidate, and he basically became the Republican candidate because of his southern border and immigration platform. It wasn't discussed. We know the bad guys have infiltrated Europe as refugees, as false refugees. And we are a Christian nation, Sean. We help those in trouble. But being a charitable Christian nation...\nHANNITY: Yes, but being charitable...\nGORKA: ... is not a suicide pact.\nHANNITY: ... there were terrible deeds done in the name of Christ -- oh, that's what Obama says. I'm sorry.\n(LAUGHTER)\nHANNITY: You know, as he talks about all the benefits and blessings of Islam and won't talk about radical Islam. But it's not a joke because this\n-- it reminds me of pre-September 11. The embassy bombings in Kenya and Tanzania and the USS Cole and the first Trade Center bombing all led to a\n9/11 commission report, all were a lead-up to what happened on 9/11.\nI'm listening to Comey, and I'm thinking, all right, are we going to have another 9/11-like-style event or bigger on American soil? And then are we going to look back at San Bernardino and Chattanooga and Ft. Hood and New York and New Jersey and Orlando and say, Oh, they were at war with us and we had a president that wouldn't say radical Islam?\nGORKA: Sean, when did America take al Qaeda really seriously. It was on September the 12th, 2001. God forbid it takes another mass casualty attack to get us serious about ISIS.\nThe attacks we've seen -- 112 people arrested in America linked to ISIS.\nThey've all been perpetrated by one person or by two people. Imagine if a hundred come. Imagine if they synchronize their attacks. It's happened before. It's happened in Mumbai. It's and elsewhere.\nWe need to catch these guys before they hit soil in America. And whistling past the graveyard because you believe in, I don't know, kumbaya globalism, will endanger American lives.\nHANNITY: What did you think -- wasn't it a pretty incredible moment today, the House and the Senate overriding the president's veto of the September\n11 bill? You know, that was another issue that didn't come up. Hillary Clinton takes money from the Saudis. The Saudis abuse women, gays, lesbians, Christians and Jews, and she never says anything negative about them, takes millions of dollars from them. I would think the champion of women's rights cares about that.\nGORKA: Look, I'm biased because this is my field, national security. But I truly believe the majority of Americans, when they go into that polling booth in November, the primary question will be, Which one of these candidates is going to make me and my family safer? And if you think it's Hillary after Benghazi, after Syria, after the Russia reset, then I'm sorry, you live in a fantasy land.\nHANNITY: All right. Dr. Gorka, thank you.\nAnd coming up next on this busy news night tonight right here on \"Hannity\"...\n(BEGIN VIDEO CLIP)\nTRUMP: The single weapon that she's got is the media! Without the mainstream media, she wouldn't even be here, folks! That I can tell you.\n Donald Trump trashes the liberal lapdog media for being in the tank for Hillary Clinton. A.J. Delgado, Joe Concha -- they react next.\nAnd later, a new report from Politico says the Clinton campaign is in a panic about possible low African-American voter turnout in the key swing state of Florida. We'll check in with Pastor Darrell Scott and Pastor C.L.\nBryant.\nThat and more on this busy news night tonight on \"Hannity.\"\n(COMMERCIAL BREAK)\n(BEGIN VIDEO CLIP)\nTRUMP: The single weapon that Hillary Clinton has, I mean, she couldn't even pass her bar exam in Washington, D.C. She failed it. The single weapon that she's got is the media. Without the mainstream media, she wouldn't even be here, folks, that I can tell you. She wouldn't even be here. She wouldn't have a chance.\n Donald Trump calling out the mainstream media. Now this comes amid the latest example of liberal bias in the press and how they are covering the former Miss Universe winner Alicia Machado's accusation against Donald Trump.\nJoining us now, Trump campaign senior adviser A.J. Delgado, and from \"The Hill\" Joe Concha. Before I get to that, we discussed earlier in the show, how do you have a debate, Joe, when you don't talk about Obamacare? You don't talk or Hillary taking money from countries that persecute women, gays, lesbians, Christians and Jews, the Saudis, millions of dollars and never criticize them? How do you not talk about Benghazi, the state of the economy, her pay to play scandal, the Clinton Foundation, the e-mail server, the immigration, vetting refugees? How is it possible to go through 90 minutes of uninterrupted air time?\nJOE CONCHA, \"THE HILL\" MEDIA REPORTER: Sean, it is very easy to be fair. And in this case, Donald Trump had three weaknesses going in, birther, tax returns, and temperament, and all those things were broached by Lester Holt. Holt interrupted Donald Trump 41 times to Clinton's six. I'm not very good at math by I believe that's seven times as much. Clinton, as you said, her three biggest weaknesses I saw going in, mishandling of classified information, destruction of evidence, Clinton Foundation, and her health, and all three of those topics were not broached.\nHANNITY: You said it might be the most one-sided debate he moderated in history. In other words you're basically saying that Lester Holt is the most biased moderator in history.\nCONCHA: He somehow eclipsed Candy Crowley. And remember if you saw my stories about Lester Holt going in, I said he is nonpartisan. I said he was one of last old school newsman. I didn't have any preconceived notions about Lester Holt.\nHANNITY: He interviewed me on the Today Show a bunch of times and I found him fair. But I watched this, there were three Candy Crowleys. A.J., starting from the opening, predicated statement about the great economy. And I'm like, hello? What America is he living in with the abusively biased question there? But then he got it wrong on stop and frisk. Then got it wrong, what is the other thing, on Benghazi -- oh, no on Iraq.\nA.J. DELGADO, TRUMP CAMPAIGN SENIOR ADVISER: The Iraq war also.\nHANNITY: And TPP.\nCONCHA: Gold standard.\nHANNITY: Yes. So what are we supposed to do with that when it's two on one?\nDELGADO: Right. Rubio had a great line, if you remember, from the primaries. This always stuck in my mind because it's so true, when he said Hillary Clinton had the ultimate super PAC, and that's the mainstream media. We saw it with Lester Holt who embarrassed himself in this debate and we are seeing it today, the past 24 hours that the media basically taking Hillary's talking point and doing her campaign work for her with this false, fabricated story about this Alicia Machado. Sean, you will notice this woman who has a terrible record, a very dubious character, is someone that a judge said she threatened to have him killed. This is a --\nHANNITY: The judge said she threatened to have him killed. Also she was accused of being an accomplice, a driver in a murder case.\nDELGADO: Driving the get-away car, correct.\nHANNITY: And here's a question of what's worse, because Diane Blair is a friend of Hillary Clinton's, political science professor, papers donated to the University of Arkansas special collection library. She described this at Hillary Clinton's mindset at the time of Monica Lewinski, and she Quote: s her saying that Monica was a narcissistic loony toon. Now, is the media going to report that with the same level of intensity they did this Miss Venezuela story?\nDELGADO: And, Sean, notice the media is running these claims, these ridiculous claims that she makes that he calls her, Quote: , \"Miss Piggy\" and \"Miss Housekeeping.\" They are running it as fact. I thought just last week they were telling us how important fact checking is with the debates. Now they're not fact checking at all and they're reporting what she claims, these ludicrous claims as fact.\nAnd by the way, when she says he called her Miss Housekeeping because of her Latina accent, guess what, Ms. Machado. There is another Latina with a Hispanic accent, yours truly right here working closely with Mr. Trump, and he has shown nothing but respect and honor towards me. So nobody believes you.\nHANNITY: I think it is now fair for the media to talk to Juanita and talk to Kathleen and talk to Paula and talk to Dolly and Gennifer Flowers. Why would that be out of bounds if we go back 20 years here?\nCONCHA: Oh, it is not out of bounds at all. I'm just shaking my head.\nHANNITY: So when I do all the Clinton women and I have them on the set of this show I am going to be treated just like the media is treating Miss\nVenezuela?\nCONCHA: Oh, absolutely not. You know that.\n(LAUGHTER)\nCONCHA: Bottom line, let me ask you a question.\nHUME: Yes. You be the host.\nCONCHA: Sure. Since 1956, how many Republican candidates have The New York Times and Washington Post in a presidential election endorsed combined?\nHANNITY: Probably none.\nCONCHA: You're right. It's a number that when you multiply zero by a number it is basically that.\nModern day example, the executive editor of \"The Times,\" basically means he runs the place. Bob Woodward, associate editor of \"The Washington Post.\"\nThey said they would go to jail if they could get illegally obtain and publish Donald Trump tax records. They never say that, however, about getting Hillary Clinton's 33,000 e-mails, the Goldman Sachs transcripts, her medical records. I'm saying if you're going to make a statement like that and you're running the alleged paper of record, you better make those statements about Hillary Clinton as well. Transparency is your goal.\nHANNITY: If it's their goal, but it certainly is not their goal as referenced by all of these different, you know, topics that didn't come up.\nBut I guess the question is this, do you think -- I opened with the monologue on the program yesterday, and the premise of it, isn't it fascinating that when you look and listen to people in the polls, I know online polls aren't scientific. But when they are all across the board, \"TIME\" magazine and \"Slate\" and local CBS and ail these mainstream media outlets people vote Trump. But then you listen to the punditry class, you know, the overpaid media colleagues of mine, including me, we're all overpaid, true or false?\n(LAUGHTER)\nCONCHA: True.\nHANNITY: And they are out of touch with the people, the 95 million Americans out of work, the 12 million more Americans that are on food stamps, and the 8 million more Americans that live in poverty since Obama's been president. And that's my point. Most people are saying something very different.\nCONCHA: Sure. I'm not sure you could listen to the punditry class. Look at Nate Silver, for instance, gave Donald Trump a two percent chance of getting the nomination, at one point against Clinton had him at three percent. Now he's 45 percent chance to win. Pundits time and again during this campaign ever since -- wrong from the get-go. So don't listen to him.\nAnd by the way, that debate I think Trump will recover from because he'll learn. And I think the third debate when Chris Wallace is asking the questions, I think that is when you're going to see some real, legitimate, fair, tough questions to both sides, and I think that's where Trump will leave the best last impression.\nHANNITY: All right, Joe, good to see you. A.J., good to see you.\nAnd up next tonight right here on HANNITY.\n(BEGIN VIDEO CLIP)\nTRUMP: I say this to African-American communities, what do you have to lose? Donald Trump is going to fix it. We're going to fix it. We're going to make it safe.\n(APPLAUSE)\n Donald Trump continues to reach out to the African-American community as a new report says the Clinton campaign is freaking out about low turnout from African-American voters in Florida. We'll check in with the Reverend Darrell, Reverend C.L. Bryant and much more tonight straight ahead on HANNITY.\n(COMMERCIAL BREAK)\n(BEGIN VIDEO CLIP)\nTRUMP: When I look at these inner cities and I see how bad they are, the crime is through the roof, the education is horrible, there are no jobs.\nBlack youth, it's what's happening. And remember that Hillary Clinton calls them \"super predators,\" right, super predators. I say to people, the poverty is at numbers that you wouldn't believe. And I say, what do you have to lose? I'll fix it. I say this to African-American communities.\nWhat do you have to lose? Donald Trump is going to fix it. We're going to fix it. We're going to make it safe.\n(APPLAUSE)\n Welcome back to \"Hannity.\" So Donald Trump continues his outreach to minority voters. This comes as \"Politico\" is reporting that, Quote: , \"Clinton campaign is in full panic mode over Florida black voters.\"\nJoining us now, the CEO for National Diversity Coalition for Trump the Reverend Darrell Scott as well as the host of the C.L. Bryant Show and senior fellow at Freedom Works, the Reverend C.L. Bryant. Reverend, it's good to see you both. I hope I'm in your prayers. You're the good people.\nI'm the center that needs the salvation. I'm the one that needs forgiveness. All right, Pastor Scott, you look at this, if they're in full panic mode, and then you go back to \"The New York Times\" in March, there was a story in Virginia's third congressional district, which is the heart of the state's African-American community, voted overwhelmingly black turnout, helped Obama in '08 win the state. They were down about 30 percent for Mrs. Clinton. Do you think Donald Trump can get some of the numbers we've seen in some of the polls with nearly 20 percent of the black vote, and why?\nREV. DARRELL SCOTT, NATIONAL DIVERSITY COALITION FOR TRUMP: Absolutely, I really he can. In fact I know a number of people especially in Florida, I've had people that contacted me from Florida months ago that wanted to be active in the campaign, black people that have a great ground game, and they are attracted to the message that Donald Trump has. The message of economics, crime, they can't help but to be attracted to it.\nAnd then looking at him and his track record as a builder, as an employer, as a developer, you can't help but to believe that he's telling the truth when he says I will create jobs and I will try to curb crime, I will redevelop the inner city.\nAnd I had a call yesterday from Atlanta, another call from Charlotte, and they say, listen, we're with Trump, and a lot of us are with Trump. We just aren't able to stand the backlash that will come from our public support. So when we get in that booth and it's just us and that voting booth, Donald Trump is going to get a huge amount of African-American votes and he's going to surprise everybody.\nHANNITY: All right, so black turnout is down 30 percent in some of those districts in Virginia. But it went further. The New York Post, an estimated 40 percent lower in Ohio, 38 percent lower in Florida, 34 percent lower in North Carolina. This seems to be, Pastor Bryant, a trend that's going on.\nCould it be because there's a 58 percent increase of black Americans on food stamps since Obama has been president, a 20 percent increase black Americans out of the labor force since Obama has been president, a doubling of our national debt? Schools have not improved one bit as both Hillary and Obama are beholden to the NEA, top down, Common Core failure and mediocrity?\nREV. C.L. BRYANT, RADIO TALK SHOW HOST: I believe, Sean, that there is going to be a surprising political evolution seen in the black community here in 2016 this political cycle. And one of the things that will lead to that is the need for law and order in the inner city in particular. The people who are law abiding in the inner city, the thousands of law-abiding people in the inner city, they're just as fed up and sick of that condition as those who are not.\nHANNITY: Trump said the other night we've failed black communities. Where are the worst schools in the country, aren't they in inner cities, right?\nWe're going to break this down. We're going to have a real conversation here.\nBRYANT: It's best to tell the truth, you're absolutely right.\n HANNITY: And we are wasting America's great talent by not giving the kids the education they need. How about neighborhoods with drugs, guns? And she doesn't want stop and frisk, which saved many minority lives in New York and elsewhere it has been practiced? Why wouldn't she support those things?\nSCOTT: Sean, Sean, you were just at my church, Sean. Down the hill I could have taken you in the neighborhood that's the number two most depressed city in the United States of America, a city called East Cleveland. Crime is rampant. It's like Dodge City down there. A pregnant girl just got shot last week because gangs feared she was going to testify against them.\nAnd what Hillary doesn't do, she doesn't elicit any excitement or arouse any passion in the black community, so they'll stay home. They'll say, well, I'm not voting for Trump but Hillary is not exciting enough to make me get up and go vote for her, so they'll stay home. And the Democrats are going to be surprised at the results from this election.\nHANNITY: Didn't Trump make a good point, C.L., when he said, hey, every four years they come knocking on our door. What has been done to help people with the economy, drugs, inner city violence? Look at Chicago. I couldn't believe how cavalier Hillary was, 3,000 people in Chicago shot this year. Nearly 4,000 dead since Obama has been president. We don't know the names of those people.\nBRYANT: Sean, Sean, when I visit places like Chicago, Detroit, Baltimore, even Ferguson, Sean, the people that are there are aware at this point in time now that this presidency of Obama is finally over. They're aware that they have been used as political pawns and that they have been taken advantage of, and the untapped potential that is there in those communities.\nI believe someone like Donald Trump will allow a pathway for them to exercise the creative rights that they're given by their creator.\nHANNITY: I hope so. And Hillary, whose mentor was Robert Byrd, and she tries to play the race card? It's pretty disgusting.\nAll right, guys, good to see you.\nAnd coming up, we need your help. A very important \"Question of the Day\"\nis straight ahead.\n(COMMERCIAL BREAK)\nHANNITY: Time for our \"Question of the Day.\" So do you think the media, as I believe, journalism is dead, do you think they're in the tank by Hillary Clinton? We'd like to hear from you. Go to Facebook.com/SeanHannity, @SeanHannity on Twitter, let us know what you think. That's all the time we have left this evening. As always, thanks for being with us. We will see you back here 40 days to go, tomorrow night.\n ", "external_links": [], "published": "2016-09-28T03:00:00.000+03:00", "crawled": "2016-09-29T22:25:24.724+03:00", "highlightTitle": ""}