{"organizations": [], "uuid": "a5185a19358e1fb30c0e5bb87cd1c4f43e2cfb11", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/694940094001_5125875686001_b3532ca0-eb45-49fb-8086-2c3e13295294.jpg", "site_section": "http://www.foxnews.com/hannity/", "section_title": "Hannity | Sean Hannity | Fox News", "url": "http://www.foxnews.com/transcript/2016/09/14/gingrich-trump-represents-change-oriented-leadership-conway-voters-see-trump/", "country": "IT", "domain_rank": 185, "title": "Gingrich: Trump represents change-oriented leadership; Conway: Voters see Trump can win", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "Gingrich: Trump represents change-oriented leadership; Conway: Voters see Trump can win | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2016-09-14T03:00:00.000+03:00", "replies_count": 0, "uuid": "a5185a19358e1fb30c0e5bb87cd1c4f43e2cfb11"}, "author": "FoxNews.com", "url": "http://www.foxnews.com/transcript/2016/09/14/gingrich-trump-represents-change-oriented-leadership-conway-voters-see-trump/", "ord_in_thread": 0, "title": "Gingrich: Trump represents change-oriented leadership; Conway: Voters see Trump can win", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Published September 14, livefyre 14, And welcome to \"Hannity.\" And tonight, Donald Trump -- he's been pounding the campaign trail. Earlier today, he was in Flint, Michigan, reaching out to African-American voters once again. And just hours ago, he had a rally, this time in Ohio. Let's take a look.\n(BEGIN VIDEO CLIP)\nDONALD TRUMP, R-PRESIDENTIAL NOMINEE: There's a movement. States are in play that no Republican has ever come close to winning.\n(CHEERS)\nTRUMP: States are in play that Republicans fly over those states. Me, we're going to land there. We're going to do a little fun. But we have...\n(CHEERS)\nTRUMP: We do, we have a lot of states in play that are not usually in play, in fact, for many, many decades in some cases, just not in play for Republicans. And they're really in play for us.\nI think we are going to have an unbelievable November 8th. Got to get out and vote.\n(CHEERS)\nTRUMP: Got to get out and vote. Thank you. So the people of the United States are truly -- and you can see that by looking at this incredible crowd -- ready for change.\n(CHEERS)\nTRUMP: They're ready to discard a failed political establishment that disdains, disrespects and looks down on hard-working great people.\n(CHEERS)\nTRUMP: This election is about a choice between the control of an arrogant ruling class in Washington, D.C., versus the hopes and dreams of everyday citizens.\n(CHEERS)\n(END VIDEO CLIP)\nHANNITY: So after several huge rallies, like the one you just saw, and the successful rollout of his comprehensive child care policy, Donald Trump is now surging in some very important key swing states.\nFirst, according to the most recent Bloomberg poll out of the must-win state of Ohio, Trump has now taken a significant 5-point lead in a four-way match-up, polling at 43 percent to Hillary Clinton's 38 percent, which is outside the margin of error.\nAnd that's not all. In another key swing state, Nevada, a brand-new Monmouth University poll shows Trump up by 2 points. CNN also out tonight with another swing state polling information, and in Ohio, Trump tops Clinton by 5 points, 46-41. Also, Trump is leading in Florida, 47-44, over Clinton. Also, a new Reuters poll shows Trump is winning in the state of Colorado, while also The LA Times has a poll out nationally with Trump having a 5-point lead.\nJoining us now with reaction to this good news for the Trump campaign, former speaker of the House, Fox News contributor Newt Gingrich.\nYou've been saying all along -- there's something about you that irritates me when you're right all the time because I was with you in '94, and you told me months before, after the Republicans had been in the wilderness 40 years, that you guys were going to win, and you did.\nAnd you've been saying very confidently, very calmly now for, you know, a pretty significant period of time you believe he has this election. He'll win it. Why?\nNEWT GINGRICH, FMR. HOUSE SPEAKER, FOX NEWS CONTRIBUTOR: Well, I think two things. One is I think Trump represents a visionary, new, change-oriented leadership. The speech he gave last night that -- it was a terrific speech on raising children, on helping mothers, on families, something which Ivanka Trump had done a great job working on, as had Cathy McMorris Rodgers. I mean, you look at that speech, that is a solid, positive speech that's going to appeal to many people, men and women, all over the country.\nYou look at what he's done in other areas recently, his visit to Detroit, where he really made a clear effort to say to every African-American, I really want to work with you for a better future. This is a guy who's really breaking out of the old order.\nAt the same time, you have Hillary getting worse and worse. And I've been doing some research, for example (INAUDIBLE) I don't think this has been in public record yet, but her State Department actually opposed raising the minimum wage in Haiti from $3 a day...\nHANNITY: I saw that, yes.\nGINGRICH: ... to $5 a day. I want you to think about this. Not an hour...\nHANNITY: A day.\nGINGRICH: ... but $2 a day to $5 a day. Now, how does Hillary Clinton run as a caring, compassionate conservative (sic)...\nHANNITY: Well, wait a minute. How does Hillary Clinton run and -- and like when she said \"basket of deplorable,\" and half the country is racist, sexist, misogynist, xenophobic, homophobic, Islamophobic -- I didn't even know all these conditions existed -- when she takes money from country after country, tens of millions of dollars from the Saudis, for example, and yet they kill gays and lesbians, they persecute women, they persecute Christians and Jews?\nHow can she take their money -- they buy her silence -- and then accuse others of the very thing she's guilty of?\nGINGRICH: That's right. And this is a debate, frankly, that conservative and Republicans ought to be prepared to go ahead on. I mean, let's talk about, if you were a gay or lesbian American, who you should be for. When you look at Hillary Clinton's record of taking money from genuinely homophobic societies, you look at the record of Clinton and Obama and John Kerry and sending money to Iran, which kills gays, you have to say to yourself, There's something to profoundly hypocritical.\nAnd that's, frankly, why I mentioned the Haitian minimum wage. They pose as though they're the friends of the poor, but in fact, in Haiti, the Clintons were the friends of the rich and they actively fought against helping the poor.\nHANNITY: Let me go back to the polling numbers again. Now he's up in North Carolina in a poll by 3. He's up in Florida, the poll I just mentioned. He's up in Ohio in two polls now, Colorado and Nevada, also you can add to that Iowa. He's close in Michigan, 3 points in Wisconsin. He's close in Pennsylvania, Virginia.\nHow does he close the gap in these all-important swing states?\nGINGRICH: Well, I think, first of all, he continues what he's been doing. He's been giving very solid speeches. He's been making very positive cases. He needs to lay out a very strong infrastructure plan for the whole country. He needs to continue to develop what he would do, for example, on health care, on the role of science in developing cures.\nI mean, there are a lot of things that he can talk about that are positive, that bring together 80 percent of the country, leaving Hillary over here totally isolated.\nSecond, he's got to continue his effort in the African-American community. We're beginning to see genuine movement as younger African-Americans look up and go, You know, this hasn't worked. Maybe I ought to give Donald Trump a chance.\nHANNITY: Listen, I...\nGINGRICH: He'll continue to campaign there, he is going to have a big impact.\nHANNITY: Yes -- 58 percent since Obama's been president, increased black Americans on food stamps, 12 million more Americans on food stamps, 8 million more Americans in poverty, lowest labor participation rate since the '70s, lowest home ownership in 51 years, worst recovery, believe it or not, since the '40s. No president in our history has ever gone an entire presidency without a year of 3 percent GDP growth, except this president. And then, of course, 1 in 5 American families, not a single family member working. And by the way, he's -- he will have accumulated more debt than every other president before him combined.\nShe can't run on that record, although she says she is. And she certainly can't run on Iran, Iraq, Afghanistan, Putin, China, North Korea or Libya. So the only thing she has left is to attack him and talk about the basket of deplorable. How should he react to that?\nGINGRICH: Well, I think he ought to give a couple of speech on what's really deplorable. What's really deplorable is an American being shot every two hours in Chicago. What's really deplorable is the children being cheated by the Detroit public schools. What's really deplorable is a government that's out of control. What's really deplorable is a border that's open.\nI mean, you can go down the list of deplorables. And I think he ought to say, Let's talk -- we'll take Hillary's language over here. Now let's talk about the real world for real people.\nHANNITY: Isn't that such an arrogant statement that half the country's deplorable? I thought -- whatever happened to that liberal open- mindedness? And yet...\nGINGRICH: It emigrated about 1957.\n(LAUGHTER)\nHANNITY: All right, well said. Touche. Stay right there. More with Newt Gingrich right after the break.\nPlus, after collapsing as she did over the weekend, Hillary's campaign has now released new information about her pneumonia diagnosis and her overall health. Frankly, I don't believe it. But our FOX medical A-team will be here. They'll get their take.\nAnd also later, Donald Trump's campaign manager, Kellyanne Conway, will join us. We'll will talk about these brand-new poll numbers, his debate prep and also Donald Trump's health.\nThat and more on this busy news night on \"Hannity.\"\n(COMMERCIAL BREAK)\n(NEWSBREAK)\n(BEGIN VIDEO CLIP)\nTRUMP: Used to be cars were made in Flint, and you couldn't drink the water in Mexico. Now the cars are made in Mexico, and you can't drink the water in Flint. That's not good.\nAnd I can only say in the strongest of terms that we can fix this problem. It's going to take time. It's amazing the damage that's been done, but we'll get it fixed. And it will be fixed quickly, if I'm elected. But it'll be fixed quickly and effectively, and Flint will come back. Most importantly, we'll bring jobs back to Flint.\n(END VIDEO CLIP)\nHANNITY: Donald Trump talking about the water problems earlier today in Flint, Michigan.\nWe continue with the former speaker of the House, Fox News contributor Newt Gingrich. You know, there are certain things that I have found impressive, especially in the last four or five weeks, with Donald Trump. He decided to go to Baton Rouge, and I went down there. It was devastated. Nobody paid attention to it. Then he goes to Mexico and he looked very presidential.\nThen you watch Donald Trump. He's been in a Wisconsin black church, a Michigan black church. That was a predominantly black church. Those people in Flint have been treated horribly by every level of government! They've been betrayed. And he's saying to the black community, he's saying last night to women, I will -- give me a chance and let us fix problems that Democrats have not fixed.\nIsn't that what the establishment Republicans have said they wanted for years?\nGINGRICH: You would think so. You know, two things about Flint. One, it really is a terrible disaster. It's a disaster that's badly handled from the local government, state government, federal government. I think somebody like Trump would, in fact, cut through the red tape. People in Flint would be better off already if he'd been president.\nBut two, Flint is a case study. There are lead pipes in Flint built around 1901 or 1902. The index cards -- there are 45,000 index cards that record where the various pipes are, kept in little boxes. It's that obsolete a system.\nThe Trump commitment on infrastructure could not be better illustrated than in Flint, Michigan. And there are town after town, included the national capital, where we need to look carefully, for example, at rebuilding the water systems.\nSo Trump's entire commitment -- he is a builder. He knows how to get things built. He's going to build a lot of stuff. And I think the Flint example is a good example of where infrastructure begins to be about real human beings, not just about an abstract idea.\nHANNITY: You know, I have been in a number of fights lately with establishment Republicans. You know, you got two headlines today, this one in The Washington Examiner -- \"Never Trump Republicans standing firm.\" Then you got Buzzfeed -- 'Republicans privately panic at terrifying prospect of a Trump win.\"\nAnd I say, OK -- I'll use two words for everything. Supreme Court, repeal \"Obama care,\" build the wall, radical Islam, you know, education to the states -- three words in that case, four words -- you know, all of these issues -- energy independence. These are massive differences.\nCan you explain how that's not conservative, that agenda?\nGINGRICH: No.\nHANNITY: Can you explain -- it's inexplicable to me that these people are assisting, aiding and abetting Hillary!\nGINGRICH: Look, you and I have a slightly different take on this. I would say...\nHANNITY: You're more mature and you're smarter and wiser. Go ahead, lecture me.\nGINGRICH: No, I just...\nHANNITY: I deserve the correction. Go ahead.\nGINGRICH: No, no, it's not a correction. My view is, if you so love the past that you want to write off the future, then \"never Trump\" makes some sense. Cling to the failed ideas. Cling to the failed bureaucracy. Cling to the projects that didn't work. Cling to the war we didn't win.\nIf that's what you want to do, that your right as a citizen. Don't expect the rest of us to be impressed with it. This is a sign that you're so mired down in the past, you're so unable to see reality, you're so unwilling to look at the future...\nHANNITY: And that goes for Mitt Romney and his crew, NRO and their crew. That goes for The Wall Street Journal and their crew. That goes for Bill Kristol...\nGINGRICH: No, the Wall Street Journal's a little more mixed. I mean, in all fairness, The Wall Street Journal is sort of a mixed bag of...\nHANNITY: Yes.\nGINGRICH: ... some pro-Trump, some anti-Trump. But the key point here is, to suggest that there's any realistic alternative to Donald Trump that's going to be conservative is utterly out of touch with reality.\nHANNITY: Yes. You're right.\n(CROSSTALK)\nHANNITY: You see, you're so much nicer than me. I'm just saying to them, You're aiding and abetting, you're assisting. You own her bad decisions by sabotaging the person that would put originalists on the Supreme Court.\nGINGRICH: You're getting angry at people who are deranged.\n(LAUGHTER)\nGINGRICH: I mean, this is like -- this is like going to a faculty cocktail party and having six drunk assistant professors and getting mad at them because they're noisy..\nHANNITY: You know, I hate when you show me up as being far more mature than I am. I'm just -- you know -- all right, we love you anyway. Good to see you.\nGINGRICH: Good to see you.\nHANNITY: And coming up -- after Clinton collapsed on Sunday, her campaign is now releasing new details about her health. Our medical A-team will weigh in.\nPlus, Donald Trump's campaign manager, Kellyanne Conway -- she'll join us to react to the latest polls, his health and how he's prepping for the debate and much more tonight on \"Hannity.\"\n(COMMERCIAL BREAK)\nHANNITY: Welcome back to \"Hannity.\" So after Hillary Clinton collapsed earlier this week, her campaign released a letter from her doctor detailing her pneumonia diagnosis and recent medical history. Also tonight, Donald Trump -- he taped an interview that will air tomorrow with Dr. Oz about his health, pulled out sheets out of his pocket and gave it to Dr. Oz, and here's a preview.\n(BEGIN VIDEO CLIP)\nDR. MEHMET OZ, HOST, \"DR. OZ\": If your health is as strong as it seems from your assistants (ph), why not share your medical records? Why not...\nTRUMP: Well, I have really no problem in doing it. I have it right here. I mean, should I do it? I don't care. Should I do it?\n(APPLAUSE)\nTRUMP: It's -- it's two letters. One is the report and the other is from Lenox Hill Hospital, saying...\nOZ: May I see them?\nTRUMP: Yes, sure.\nOZ: So these are the -- these are the reports -- this is from...\nTRUMP: Those are all the tests that were just done last week.\n(END VIDEO CLIP)\nHANNITY: Apparently, he's healthy as a horse. Here now with reaction, from the FOX News medical A-team, Dr. Marc Siegel and Dr. David Samadi is with us.\nAll right, here's a problem. You know and you know that there are certain doctors that want patients, and they'll do anything the patient wants, including prescribe drugs that they probably shouldn't give. True or false?\nDR. DAVID SAMADI, FOX NEWS CONTRIBUTOR: Absolutely true.\nDR. MARC SIEGEL, FOX NEWS CONTRIBUTOR: True.\nSAMADI: I think when it comes to taking care of some of patients at that caliber -- and I've taken care of...\nHANNITY: Dr. Feelgood?\nSAMADI: I've have taken care of few presidents, and it's very difficult to take care of this kind of celebrity-type of patients, and you got to make sure you don't give in to what they are asking, so...\n(CROSSTALK)\nHANNITY: All right, but there are some that will.\n(CROSSTALK)\nHANNITY: A good doctor would not.\nSIEGEL: Would not.\nHANNITY: OK. Now, we know, and according to the White House doctor for the Clintons when they were in the White House, a woman by the name of Dr. Connie Mariano (ph) -- she's writing in an upcoming memoir that Hillary allowed her staff to think that she had a pulled muscle rather than tell them she had a blood clot when she was the first lady. She assigned a female nurse in civilian attire to accompany her on the campaign trail.\nDoesn't that sound like -- if she did it once, why should we trust her now? And by the way, she lies about everything else.\nSAMADI: I don't know this doctor, but I can tell you that sometimes, Sean, when it comes to diagnosis of DVT, deep venous thrombosis, it's sometimes difficult to diagnose it, and you may actually miss it. So getting (INAUDIBLE) lower extremities is the way to go because you have pain and swelling. So who knows what she was thinking, whether it was misdiagnosed or the truth is not out there.\nSIEGEL: And to add to that point, though, and to add to your point, Sean, not everybody tells what's actually going on with their health and they don't always tell it in a timely manner, and certainly we saw that this past weekend with what went on. So...\nHANNITY: All right...\n(CROSSTALK)\nHANNITY: You're making it sound simple, that she has hypothyroidism, seasonal allergies, a past history of deep vein thrombosis that we believe really was cerebral venal (sic) thrombosis because it was what, below the ear, which means it could be a neurological...\nSIEGEL: She both. She had deep venous thrombosis...\nHANNITY: Right.\nSIEGEL: ... in the late '90s. And then again, she had a blood clot on the outside of brain.\nHANNITY: And that explains the need for an anticoagulant called Coumadin.\nSIEGEL: For life. For life.\nHANNITY: For life.\nSIEGEL: For life. And that fall, by the way, that she sustained in 2012 was quite a wallop. And it occurred because...\nHANNITY: Well, it was a wallop that she told the FBI that she couldn't remember being briefed about cybersecurity, which I don't believe, either!\nSIEGEL: Yes, but the thing is, she has a history of fainting.\nHANNITY: And she has a history of lying...\n(CROSSTALK)\nHANNITY: Honestly, fainting and lying!\nSAMADI: You know, let me just jump in...\nHANNITY: Sorry!\nSAMADI: What I would say is that the report that we had in July 2015 on her had some information, but we asked for more information. There's a lot more information here, Sean, as opposed to a year ago. There is a calcium score test. There is a CAT scan of her chest...\nHANNITY: All right, do you glean anything from that?\nSIEGEL: Yes...\n(CROSSTALK)\nSAMADI: I actually learned a lot from this because right now -- if she had pneumonia about a week ago, her O2 saturation, which is 99 percent -- that's good for her. The fact that she has no fever now, her vitals are stable -- these are good things about...\nHANNITY: This is bacterial pneumonia, they claim non-contagious, and she's on Lavaquin, which is hardly a real severe antibiotic.\nSIEGEL: Let me talk to you about this because I treat this every day in my office. So what happened was -- and David is right, we got more extensive records that showed that on September 2nd, she had an upper respiratory in infection. She had some fever. She had some congestion. She was started on one antibiotic. She didn't get entirely better.\nSo on September 9th, Dr. Bardack did a CT scan, which showed right middle lobe pneumonia, which is a very common place for pneumonia. But at that time, she had a normal white blood count. She did not have a fever. She was oxygenating well. So clearly, she was improving.\nHANNITY: She also...\nSIEGEL: But this is still pneumonia and...\nHANNITY: But she fainted in 2012! You know, this -- you know, they claim to say that -- why is there this -- this impulse to lie and say, Oh, she's dehydrated, oh, she's overheated? They stuck with that as long as the liberal media let her, and even they couldn't buy it after we saw the video!\nSAMADI: So I think the best thing that would have happened is that if two weeks ago or a week ago, if we had this report, then I think there wouldn't be a lot of these speculations because...\nHANNITY: But they didn't want to tell you she had pneumonia!\nSAMADI: So -- Sean, you either have to go with the pattern of whatever her fall was and think there's some sort of a neurological issue going on, or this recent event is a real diagnosis. Now, on CAT scan, she's showing that there's a right nodule...\nHANNITY: All right, I got it.\n(CROSSTALK)\nSIEGEL: She has pneumonia, according to this CAT scan. And I believe she has both things. I think she has a tendency to fall, a tendency to have faints, which is problematic if you're on blood thinners. That's something that has to be watched carefully...\nHANNITY: Oh, that is because if she starts bleeding...\nSIEGEL: You hit your head...\n(CROSSTALK)\nHANNITY: ... she could have internal bleeding in her brain.\nSIEGEL: And the pneumonia, by the way -- and I've been saying this for days -- is not something to take lightly.\nHANNITY: What about...\nSIEGEL: Right middle lobe pneumonia is something to really be concerned about. It looks like she's getting better...\nHANNITY: Is there any chance...\nSIEGEL: ... and in fact, she is.\nHANNITY: ... that they are covering up a major neurological issue, which I believe is a possibility?\nSIEGEL: Well, they have a CAT scan from March of 2016 that's not showing a problem.\n(CROSSTALK)\nHANNITY: How about an MRI? Wouldn't you rather see an MRI and see if there...\nSIEGEL: I'd like to see it.\nHANNITY: ... if there was a TIA, a stroke or something similar?\nSIEGEL: I'd like to see an MRI.\nHANNITY: Is there any chance that she, as they had investigated -- Wikileaks emails revealed that they were looking at drugs that, in part, could be used to treat Parkinson's or other similar diseases -- is there a chance that's real?\nSAMADI: Look, I don't...\nHANNITY: Why would you be researching those drugs?\nSAMADI: Yes. I don't really know that information. I really don't have - - so I can't make any comment. But what I would...\nHANNITY: Do you trust this? I don't trust it.\nSIEGEL: Look, we're not examining her, and we don't have a record. So that's the whole point. I want to see her records.\nHANNITY: By the way, is bacteria pneumonia -- bacterial pneumonia non- contagious, as they claim?\nSAMADI: She's being treated. She's stable. Her vital signs are stable. The best thing that they did was pull her out of the campaign, let her rest...\n(CROSSTALK)\nHANNITY: ... after she hugged people and shook their hands.\nSAMADI: Well...\nSIEGEL: But she was on antibiotic previously for a few days, and the rule of thumb is if you're on antibiotic for a few days, you're probably not...\nHANNITY: Well, a few days? She was diagnosed Friday. Maybe she didn't start taking it until Saturday.\nSIEGEL: Well, the previous week, she'd been taking it for upper respiratory.\nSAMADI: The only issue is that they have to be really careful. And I'm sure they know this, but they have to have a medical team around her because if it happens again, this would be a big problem for her. But obviously, she's recovered well. A lot of information, Sean, has come from last year to this year. This letter is a lot more impressive, and when I read this...\nHANNITY: If it's true!\nSAMADI: Well, look, you know, I...\n(CROSSTALK)\nSIEGEL: I believe the letter is true. I think it's more information than we had. But as you said before, we still don't have enough information about neurological issues. I want more.\nHANNITY: She should -- Tom Brokaw is right, then. She should have a full neurological mark-up and show the MRIs to the public.\nAll right, guys. Thanks so much for joining us.\nAnd coming up, Donald Trump is surging in the polls. His campaign manager, Kellyanne Conway -- she'll join us next with reaction.\nAlso later tonight, author Ed Klein -- he reveals stunning information about the real state of Hillary Clinton's health. He's coming along next with former Clinton White House Secret Service officer Gary Byrne (ph).\nThat and more tonight\nHANNITY: Welcome back to Hannity. So it's been a good number of weeks now for the Trump campaign. He is delivering a lot of policy messages. He is narrowing and winning in a lot of polls now.\nJoining us is Trump's new campaign manager, Kellyanne Conway. You know, the timing has been pretty good for you because he kind of took off as soon as you got on board. We've been friends a lot of years. I'm not surprised. He's on message. Let's see what we've got here. We've got a poll that came out today. He's winning in two polls in Ohio. One he is up by four, another he's up by five. He is winning by three points in Florida. He has the \"L.A. Times\" nearly a five-point lead there as well. \"Bloomberg\" has him up five in Ohio which I thought was good numbers from him. He is losing -- I'm sorry, winning in Colorado by two points, and he's winning two point in Nevada. He's winning in Iowa. All of these states are key. What has changed?\nKELLYANNE CONWAY, TRUMP CAMPAIGN MANAGER: Well, what has changed is that I think people are seeing a real contrast between these two candidates, Sean. You see Mr. Trump out there every day delivering specific solutions, policy speeches, then meeting in small groups with folks every place he goes. He will be in about seven spring states this week doing five rallies, a number of different roundtables in addition to the policy speeches like the one with child care last night with his daughter, Ivanka, outside of Philadelphia, really remarkable content for a Republican nominee.\nAnd I think what's also changed is people see that there is a chance he can win. And people love to back a winner.\nI will note something for you, Sean, three, four weeks ago, every story on TV and in the papers and online was what? Look at polls, the race is over. Look at the polls, the race is over. None of the journalists want to write polling stories now.\nHANNITY: That's typical.\nCONWAY: Guess what? People don't care. Sean, the biggest disconnect of this campaign is how people see this race and these two candidates and how these candidates are being covered. But I'll bet with the people any day.\nHANNITY: Here's what I see. I see that he is very focused and, look, Hillary Clinton, 19 days in August, didn't have a single rally, 19 days. So she is kind of making Jeb Bush who Trump called low energy seem like the energizer bunny. But it's more than that. He seems focused. He is only talking about Obama's failed record and Hillary's failed record. And he's also giving significant, detailed policy speeches on ISIS, on immigration. He's going to black churches. He went down to Baton Rouge. He went to Mexico. These all seem to put him in a position to say, yes, I've got the energy, the stamina, and the ideas to solve our problems.\nCONWAY: And people know what they see, Sean. For all the conventional political methods, like the paid advertisements that Hillary Clinton and her super PACs over $200 million spent already, but yet you can't cut through -- the people can't deny what they see. If they see her at the van at 9/11, they know what they see. Nobody needs to talk about it. Nobody needs to have conspiracies about it. They just know what they see. When they see Donald Trump in their cities and their towns, meeting with veterans, sticking up tore them after they are called deplorable and every name in the book, when the see Donald Trump unveiling child care plans, when they see him unveiling and middle class tax relief it matters to them.\nAnd he is a leader. He is showing that he is who we all know he is, which is a leader. And the way you convey to people is you bring the case directly to the voters where they live, and that's what he is doing.\nHANNITY: This is a choice election. We have been through a lot of election together, but do you want a president that can say \"radical Islam\" or one that won't? Do you want originalists like Scalia and Thomas on the Supreme Court or more Sonia Sotomayor's and Justice Ginsburgs? Do you want to vet refugees or not vetting refugees and have a 550 percent increase? Do you want a wall or do you want the bridge that Hillary wants on the borders so anybody can walk in? Do you want to eliminate Obamacare or not eliminate Obamacare? You want to fire coal miners and put coal companies out of business, or do you want energy independence? Do you want education top down or do you want it to go to the states?\nThese are not -- these are significant and profound differences between these two candidates. And there's still reluctance and resistance among the elites in the Republican Party, some of the establishment. What do you say to -- if you haven't noticed, I'm fighting with every one of them right now. But what do you say to them?\nCONWAY: I have a couple messages for them. First of all, water is warm, please come on in. We welcome you any time.\nHANNITY: You are so much nicer than me. You always have been.\nCONWAY: -- from elected officials, from elected officials, and we are getting calls from donors and people are excited. You see in these polls, too, Sean, the enthusiasm gap is unmistakable. We have a double digit enthusiasm gap over Hillary Clinton. And you know what changed in these polls, Sean? Likely voters. Many of these polls have shifted from registered voter model to the likely voter model, and when do you that you come upon more Trump voters because they are more enthusiastic and they're more willing to say so. So what I would say to the never-Trumpers and the never-happy, I would say to them put your --\nHANNITY: Never happy.\n(LAUGHTER)\nHANNITY: By the way, that's as mean as you get. I'm a lot meaner. I say you own her if she wines because you are sabotaging somebody who would put an originalist on the Supreme Court, who would get rid of Obamacare. So they make me a little more angry than you, but you've always been nicer.\nCONWAY: And for the elected official, Sean, I have two questions for them. First of all, aren't you moved and just startled by what's happening in your own states by this Trump movement? Have you ever had these kinds of rallies when you have run for office? Have you had these crowds? Have you had the percentage of the vote that he gets in such a crowded field? So they are also disrespecting their own voters at this point.\nAnd the second thing I would ask him is can you really close your eyes and feel comfortable in a world where Hillary Clinton has appointed Supreme Court justices and taxed and regulated us --\nHANNITY: That's a good point. Impact us for generations.\nI'm running out of time. Real quick. I know he wasn't supposed to, but he went on Dr. Oz and revealed that he is in good health. How is the debate prep going? Can you answer those two questions?\nCONWAY: Oh, boy. Sure those are related. Yes and yes, great and great. So Dr. Oz had an opportunity as a medical professional to review the report, I suppose, or some of the numbers that Mr. Trump's doctor had revealed. He said he is in great health. And then he also ribbed him a little bit about how he is in great health but he loves fast-food. And Mr. Trump said what many Americans say, which is I like that I know what I'm getting.\nHANNITY: Kentucky Fried Chicken.\nCONWAY: And I enjoy it, that's right.\nAnd they had a great conversation. People can watch the show and it will air tomorrow. Dr. Oz had a fabulous conversation, really a wide reaching conversation about many issues concerning health. Ivanka, his daughter, was there to talk about the child care policy and why it is so important. And so I think people will enjoy that.\nLook, there is no question that those of us who are nonmedical professionals, Sean, can talk about stamina and energy and the punishing schedule and rigors of a campaign, and frankly, the rigors of being president. And if you look at Morning Consult poll that was released today, 50 percent of Americans told those pollsters they think Hillary Clinton lied about her health, and 44 percent, Sean, that's right, 44 percent in that poll, though, said that they think her health may affect her ability to be president. Read the poll, Morning Consult.\nHANNITY: I saw it. Last question. I think Hillary can't run on Obama's economic record which she said she will continue. She can't run on foreign policy, which is a disaster. So I think her debate prep is this. How can I aggravate, agitate, irritate, upset, piss off Donald Trump in the debate and make him bubble and fizz like Alka-Seltzer in water. My question to you, will he build up an impenetrable shield, know that's her strategy, and not let her get that rise out of him?\nCONWAY: Absolutely. And look at the commander-in-chief forum from one week ago on NBC, Sean, where she could not take those questions from Matt Lauer, very fair questions about her email server and her vote in Iraq. That veteran who stood up and said if I did what you did I would be in jail. Why aren't you in jail? He was unflappable. Donald Trump was unflappable and Hillary was all flustered.\nHANNITY: That's a good point. I think he's in her head, you're right.\nCONWAY: I think he is in her head and she certainly is not in his head, I assure you.\nHANNITY: I got to roll.\nCONWAY: And in debate prep, he is who he is. He knows all these issues. He is enjoying the conversations we're having. We don't need anybody to play the role of Hillary Clinton. We're all very versed in Hillary Clinton.\nHANNITY: Kellyanne, great job. Good to see you. Polls are encouraging.\nComing up, Hillary did release a letter from her doctor, but author Ed Klein is revealing stunning new informing about the real state of her health. He along with former Clinton White House Secret Service officer Gary Byrne as we continue straight ahead.\n(COMMERCIAL BREAK)\nHANNITY: Welcome back to \"Hannity.\" Gary Byrne, the former Secret Service officer who served in the Clinton White House released a scathing new op-ed about Hillary's health entitled \"I protect Hillary Clinton in the Secret Service -- Here's why her fainting video really scares me.\" Joining us now to explain more is the man himself, the author of \"Crisis of Character,\" former Secret Service officer Gary Byrne. Also with us tonight, author of the upcoming book \"Guilty of Sin,\" Ed Klein is is with us. Gary, let's talk about it, why? Tell us about this op-ed.\nGARY BYRNE, AUTHOR, \"CRISIS OF CHARACTER\": Hi, Sean. How are you? What I saw, Sean, the reason I wrote the op-ed was because what scared is that clearly Mrs. Clinton was having some kind of medical episode. Now, I am not a medical expert, as you know, but I am an expert on observation, and I am also an expert on Secret Service procedures.\nAnd the first scene you see in that video, Sean, Mrs. Clinton where she is leaning up against the bollard, clearly her body is stiff. The few seconds that shows her standing there her head keeps raising further and further back. The woman on the left-hand side, the staff member, has her hand underneath her arm clearly trying to help control her and support of her.\nWhen the van pulls up, everybody who has ever gotten into a vehicle a taxi, a van, watch Mrs. Clinton's action as the van pulls up. She stares straight ahead. She doesn't even acknowledge that the van is there. And then the African-American agent walks around to the van, Sean. He opens the door and then steps back and grabs Mrs. Clinton's left arm.\nThe bald agent who I believe is the shift leader does something that's pretty unusual. He walks between the open van door and the protectee. And the reason he does that is because he knows she can't move without his help. Then he takes her right arm and then the woman behind her grabs Mrs. Clinton under both armpits and they all start moving her toward the van.\nHANNITY: And she still collapsed.\nBYRNE: Right. As they move her, Sean, you can see she loses complete control to support herself. And then they pull her into the van as they push her into the van, and they are so quick to try to get away from people seeing this that they actually move so fast that her shoe fell off and they left it on the sidewalk and on the street, and somebody picked it up and handed it to the agent in the follow-up vehicle. This disturbs me greatly.\nHANNITY: Are you clear at all about the Secret Service's handling of this? I hate to be critical, though I do have my pin up here, and they do a good job and they put their life on the line for all of our national leaders and it is an important job. We have got to protect them. But there seems to be a circle that covered what was going on.\nBYRNE: Right. That is standard procedure. So that's standard procedure. Everything they did was spot on to the training. I literally, as you know, I was a uniform division officer but I worked at the training center, and I literally used to help train the agents in some of the skills. And everything they did was correct. Don't forget, they are not just protecting -- what they did was unusual. They weren't really protecting Mrs. Clinton from a video camera. They're protecting her from somebody with a gun.\nHANNITY: OK, you're saying there is something seriously wrong with her. There is a book by Dr. Connie Mariano. Do you remember her?\nBYRNE: I do. I remember her well.\nHANNITY: Apparently she was the White House doctor for the Clintons. Quote: , \"I assigned a female nurse in civilian attire to accompany Hillary on the campaign trail. I notified the Secret Service she was on medication. In the event she was injured excessive bleeding would be dangerous. And Hillary had lied at that time telling her staff she'd pulled a muscle rather than saying she had a blood clot.\" So this would not be the first time, correct? Did you know that?\nBYRNE: No. Yes, actually I did. I don't remember it from the time but I've learned it since then. And I do remember, she was actually a Navy doctor, Dr. Mariano. She was a captain when I met her, and she retired as a one-star admiral.\nListen, none of this surprises me, Sean. And I realize they just supposed released her medical records. The first thing I listen to is their language. We're releasing medical records. I don't believe a thing on there. Based on what I saw over the years, you know, when, for instance, Mrs. Clinton first claimed in the Benghazi attack, that it was a video. And you go back to her husband claiming that he did not have an affair with the intern Monica Lewinski, I don't believe a thing out of their campaign's propaganda.\nHANNITY: All right, Ed Klein, did you know most voters doubt Hillary is telling the truth about her medical condition?\nED KLEIN, AUTHOR, \"GUILTY AS SIN\": With good reason.\nHANNITY: And Bill Clinton now says she frequently collapsed. He actually exposed that. You've got the video of her, remember, going up the stairs in February. She could barely walk upstairs. You have another Democratic politician saying I gave a speech with her, Senator Whitehouse, and saying she can barely walk up to the podium for crying out loud. You know, and then there is another point where Hillary admitted she had collapsed a few times. She's perfectly fine except for pneumonia. That's a problem. They don't tell the truth, so I don't believe anything their doctor is putting out because they can get their Doctor Feelgood to say anything they want.\nKLEIN: Absolutely. Now, I've been over two-and-a-half years reporting on her health, as you know, and I've been speaking to friends and associates who tell me when they visit Chappaqua where the Clintons live, Hillary frequently faints or swoons, that when she sits down she has to put her legs up because she's worried about blood clots, that she has Huma Abedin bringing her cold compresses all the time.\nThis is a woman, what we've seen, this video, is just the tip of the iceberg of something that's been going on for a long time.\nHANNITY: I agree with you. And the problem here is the media is so dishonest and so corrupt and so in the tank for her that they advance the phony narrative, oh, it was so hot outside. It was 75-77 degrees, and breezy. That is not hot.\nKLEIN: And pneumonia doesn't make you faint, also.\nHANNITY: True. Yes?\nBYRNE: There is one more thing I'd like to point out. If you saw anybody else show the same behavior that we saw Mrs. Clinton show, standing there, leaning up against that bollard, the Secret Service would have taken them immediately to the hospital. So what that tells me is that whatever is wrong with her, they appear to be treating it, and the service knew she was going to get treatment either in the van or at the family member's apartment that they went to. If you saw anybody else behave like that you would immediately take them to the hospital.\nHANNITY: I agree. And Ed, you know she has control. They got in the car, and I would argue that the \"New York Post\" had it right. The reason she didn't want to go to the hospital, because then she would have had to disclose what her real condition is and they don't want to tell the American people the truth.\nKLEIN: Exactly. And I still they're not. But what happens is she now she gets back on the campaign trail and she faints again, a second time.\nHANNITY: Let's see what happens.\nBYRNE: There would be another set of lies.\nHANNITY: All right, guys, thank you very much.\nBYRNE: There would be another set of stories.\nHANNITY: At the very minimal.\nWhen we come back, we need your help. A very important \"Question of the Day,\"\nHANNITY: All right, time for our \"Question of the Day.\" So the first presidential debate is less than two weeks away. What do you think the moderator, what do you think they should ask Hillary Clinton? What are the questions that the media will never ask because they're so abusively biased? We want to hear from you. Go to Facebook.com/SeanHannity, @SeanHannity on Twitter, let us know what you think.\nUnfortunately that's all the time we have left for this evening. Thanks for being with us. We'll see you back here tomorrow night.\n ", "external_links": [], "published": "2016-09-14T03:00:00.000+03:00", "crawled": "2016-09-16T05:40:08.029+03:00", "highlightTitle": ""}