{"organizations": [], "uuid": "ccf00cb30d56e6f00a1174888f974f57ec75831b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 41, "shares": 41, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/entertainment/0/0/donald%20latino.jpg", "site_section": "http://feeds.latino.foxnews.com/home/feed", "section_title": "FOX News", "url": "http://latino.foxnews.com/latino/opinion/2016/09/13/opinion-trump-birtherism-is-dangerous-and-disgraceful/", "country": "US", "domain_rank": 185, "title": "Opinion: Trump's 'birtherism' is dangerous and disgraceful", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "Opinion: Trump's 'birtherism' is dangerous and disgraceful | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2016-09-13T03:00:00.000+03:00", "replies_count": 0, "uuid": "ccf00cb30d56e6f00a1174888f974f57ec75831b"}, "author": "Raul A. Reyes", "url": "http://latino.foxnews.com/latino/opinion/2016/09/13/opinion-trump-birtherism-is-dangerous-and-disgraceful/", "ord_in_thread": 0, "title": "Opinion: Trump's 'birtherism' is dangerous and disgraceful", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "donald tru", "sentiment": "neutral"}, {"name": "raul a. reyes    fox", "sentiment": "neutral"}, {"name": "clinton", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "kellyanne conway", "sentiment": "none"}, {"name": "raul a. reyes", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "jorge ramos", "sentiment": "none"}, {"name": "raul a. reyes wrong", "sentiment": "none"}, {"name": "rudy giuliani", "sentiment": "none"}, {"name": "mike pence", "sentiment": "none"}, {"name": "obama", "sentiment": "none"}], "locations": [{"name": "new york city", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "hawaii", "sentiment": "none"}], "organizations": [{"name": "nbc news", "sentiment": "none"}, {"name": "msnbc", "sentiment": "none"}, {"name": "factcheck.org", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "washington post", "sentiment": "none"}, {"name": "cnn", "sentiment": "none"}, {"name": "usa today", "sentiment": "none"}, {"name": "new york times", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Raul A. Reyes \n  Fox News Latino ap \n\"Birtherism\" is dead. That’s was the message from Donald Trump’s campaign last week. On Wednesday, Vice Presidential candidate Mike Pence said that he accepts that President Obama was born in Hawaii. On Thursday, Rudy Giuliani told MSNBC that he and Trump agree that Obama was born in the U.S. On Friday, Trump’s campaign manager Kellyanne Conway told CNN that her candidate believes the president was born here. So the conspiracy theory that Obama was foreign-born is over, right?\nIt is poor strategy for Trump not to disavow his association with Birtherism. If he apologizes soon, he can put it behind him. If he does not, the topic will certainly come in during the debates, where he cannot control the narrative. - Raul A. Reyes\nWrong. The \"birther\" movement will never be over until Donald Trump renounces it. Trump spent years promoting this false and dangerous idea, and only he can put the controversy to rest. His recent policy of “not talking about it” is no substitute for an apology to all Americans.  \nDespite his campaign’s attempt to move away from \"birtherism,\" Trump’s history with it is well documented. In 2011, he launched his pursuit of the president’s “real” birth certificate, raising the issue on the Today Show and The View. That same year, Trump penned an op-ed in USA Today, pressing the president to release his long-form birth certificate (which the president later did). After claiming to have sent investigators to Hawaii to look into whether Obama was foreign-born, Trump announced, “They can’t believe what they are finding.” In 2012, he tweeted that “an extremely credible source” had told him that Obama was a “fraud.” Just last year, Trump refused to say whether he thought Obama was a legitimate president.  \nAbsent repudiation from the candidate himself, Trump’s \"birtherism\" cannot be overlooked or forgiven. Trump’s advisors may be having a change of heart on \"birtherism\" because, now that the polls are tightening, the campaign has realized the importance of the African-American vote. But African-Americans of all political affiliations are offended by Trump’s suggestion that the country’s first Black president is not legitimate. No wonder that Trump polls in the single digits among African-Americans (in some polls, he polls at zero with Blacks). If the campaign thinks a visit by Trump to a Black church might somehow turn things around, they are mistaken. The damage has been done.  \nLatinos can look at Trump’s treatment of President Obama and see, by extension, how the candidate views us. To Trump, Obama is the other, foreign, and therefore undeserving of respect. That’s pretty much the way Trump sees our community, too. He started his campaign insulting Mexicans and immigrants. He booted Jorge Ramos out of a press conference. He maligned a distinguished American judge solely on the basis of his Mexican heritage. And this is someone who wants to lead the nation?      \nEven worse, Trump’s embrace of \"birtherism\" is undermining our democracy. Among Trump supporters, 59 percent believe that President Obama was not born in the U.S. NBC News reports that 72 percent of registered Republican voters still have doubts about the president’s citizenship. What is troubling is that Trump has taken an idea with no basis in fact and successfully sold it to part of the electorate. This is dangerous, because the more that the public loses faith in the legitimacy of our government, the weaker we are as a country.  \nLately Trump says that he doesn’t want to discuss \"birtherism\" anymore. \"I don’t talk about it because if I talk about that, your whole thing will be about that,” he told reporters on his plane last week. That’s not good enough; it’s no apology and he still will not acknowledge that our president was born in this country. Equally shameful is that some of Trump’s supporters have floated the idea that Hillary Clinton was responsible for elevating \"birtherism\" in the public arena, a claim that has been debunked by Politifact, FactCheck.org, and the Washington Post.\n\nSure, both President Obama and Hillary Clinton have made indiscreet remarks — and they have apologized for them. Just this weekend, Clinton expressed “regret” and said she was “wrong” for calling half of Trump supporters “deplorables.” Trump should be held to the same standard as any other candidate or president: when you say something wrong, apologize. Besides, it is poor strategy for Trump not to disavow his association with \"birtherism.\" \nIf he apologizes soon, he can put it behind him. If he does not, the topic will certainly come in during the debates, where he cannot control the narrative. Then again, as the New York Times pointed out, “In the 'birther' movement, Mr. Trump recognized an opportunity to connect with the electorate over an issue many considered taboo: the discomfort, in some quarters of American society, with the election of the nation’s first black president.” \nHow ironic that Trump has probed deeply into Obama’s background while refusing to disclose his own detailed medical history, his tax returns, or information about his wife’s immigration history.  \n\n\"Birtherism\" is toxic, discredited, and indefensible. That Trump has not renounced it is a national disgrace.\n\nRaul A. Reyes is an attorney and columnist in New York City. \nFollow us on twitter.com/foxnewslatino \nLike us at facebook.com/foxnewslatino", "external_links": [], "published": "2016-09-13T03:00:00.000+03:00", "crawled": "2016-09-13T20:55:27.522+03:00", "highlightTitle": ""}