{"organizations": [], "uuid": "c90c24764f70d461e3bc2bb20f6a895932063cc4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 3, "shares": 3, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "latino.foxnews.com", "main_image": "http://global.fncstatic.com/static/v/all/img/fn_latino_128x128.png", "site_section": "http://feeds.latino.foxnews.com/home/feed", "section_title": "FOX News", "url": "http://latino.foxnews.com/latino/politics/2016/09/01/trump-says-will-build-wall-and-begin-mass-deportations/", "country": "US", "domain_rank": 185, "title": "Trump says he will build wall and begin mass deportations | Fox News Latino", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "Trump says he will build wall and begin mass deportations | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2016-09-01T03:00:00.000+03:00", "replies_count": 0, "uuid": "c90c24764f70d461e3bc2bb20f6a895932063cc4"}, "author": "EFE", "url": "http://latino.foxnews.com/latino/politics/2016/09/01/trump-says-will-build-wall-and-begin-mass-deportations/", "ord_in_thread": 0, "title": "Trump says he will build wall and begin mass deportations | Fox News Latino", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "neutral"}, {"name": "pena", "sentiment": "none"}, {"name": "enrique pena nieto", "sentiment": "none"}, {"name": "barack obama", "sentiment": "none"}], "locations": [{"name": "united states", "sentiment": "none"}, {"name": "phoenix", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}, {"name": "arizona", "sentiment": "none"}], "organizations": [{"name": "efe", "sentiment": "negative"}, {"name": "white house", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Published September 01, 2016 EFE Phoenix –   Phoenix, United States, Sept 1 (efe_epa).- Donald Trump, the Republican candidate for the White House, presented his immigration plan that includes the construction of an \"impenetrable\" wall along the country's border with Mexico, a \"deportation task force\" to expel undocumented immigrants with criminal records, and rescinding President Barack Obama's amnesty policy.\nTrump said on Wednesday during a speech in Phoenix, Arizona, that he would begin construction of the southern border wall on his first day in office, equipping it with the best technology such as underground tunnel detection sensors.\nFurthermore, the tycoon reaffirmed that Mexico would pay for the wall within hours of meeting with the Mexican President Enrique Pena Nieto, despite Pena later insisting that he had told Trump his country would not finance the wall.\nTrump also proposed to hire an extra 5,000 border patrol officers, and promised that anyone who illegally crosses the border to the US would be detained and deported.\nHe added that all 11 million undocumented immigrants would be \"subject to\" deportation, thus ending rumors he had recently softened his stance on the issue.\nThere would be \"zero tolerance for criminal aliens\", Trump said, promising to immediately deport two million immigrants with criminal records.\nDuring his long-awaited speech about his 10-point immigration plan, Trump said that undocumented immigration is one of \"the greatest challenges\" the country is facing.\n\"The fundamental problem with the immigration system in our country is that it serves the needs of wealthy donors, political activists and powerful politicians\", the tycoon said.\nAlthough the Republican candidate acknowledged that there were \"good\" undocumented immigrants, he maintained that most were \"lower-skilled workers with less education\" who competed directly against \"vulnerable unemployed American workers\".\n\"When politicians talk about immigration reform, they usually mean the following - amnesty, open borders, lower wages\", he said, when it \"should mean improvements to our laws and policies to make life better for American citizens\".\nDuring the speech, Trump invited on stage a group of parents whose children were assassinated by undocumented immigrants to relate their personal experiences and urge vote for Trump.\n\"We will end the sanctuary cities that have resulted in so many needless deaths. Cities that refuse to cooperate with federal authorities will not receive taxpayer dollars,\" Trump said, referring to localities that have policies or laws that limit the extent to which they will comply with federal immigration orders.", "external_links": [], "published": "2016-09-01T03:00:00.000+03:00", "crawled": "2016-09-01T11:15:09.542+03:00", "highlightTitle": ""}