{"organizations": [], "uuid": "62ae3d114fdcc8e48c974a6f17863a3f8686d0ad", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 109, "shares": 109, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/politics/0/0/Pena%20Nieto%20Trump.jpg", "site_section": "http://feeds.latino.foxnews.com/home/feed", "section_title": "FOX News", "url": "http://latino.foxnews.com/latino/politics/2016/08/31/trump-pena-nieto-cordially-agree-to-disagree-over-immigration-free-trade/", "country": "US", "domain_rank": 185, "title": "Trump, Peña Nieto cordially agree to disagree over immigration, free trade", "performance_score": 1, "site": "foxnews.com", "participants_count": 1, "title_full": "Trump, Peña Nieto cordially agree to disagree over immigration, free trade | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2016-08-31T03:00:00.000+03:00", "replies_count": 0, "uuid": "62ae3d114fdcc8e48c974a6f17863a3f8686d0ad"}, "author": "Fox News Latino", "url": "http://latino.foxnews.com/latino/politics/2016/08/31/trump-pena-nieto-cordially-agree-to-disagree-over-immigration-free-trade/", "ord_in_thread": 0, "title": "Trump, Peña Nieto cordially agree to disagree over immigration, free trade", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "negative"}, {"name": "peña nieto", "sentiment": "negative"}, {"name": "trump", "sentiment": "negative"}, {"name": "alejandro hope", "sentiment": "none"}, {"name": "adolf hitler", "sentiment": "none"}, {"name": "[trump", "sentiment": "none"}, {"name": "vicente fox", "sentiment": "none"}, {"name": "mike pence", "sentiment": "none"}, {"name": "hillary", "sentiment": "none"}, {"name": "pence", "sentiment": "none"}, {"name": "fox", "sentiment": "none"}, {"name": "enrique peña nieto", "sentiment": "none"}], "locations": [{"name": "united states", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}, {"name": "los piños", "sentiment": "none"}, {"name": "indiana", "sentiment": "none"}, {"name": "arizona", "sentiment": "none"}, {"name": "mexico city", "sentiment": "none"}, {"name": "central and south america", "sentiment": "none"}], "organizations": [{"name": "republican", "sentiment": "none"}, {"name": "associated press", "sentiment": "none"}, {"name": "gop", "sentiment": "none"}, {"name": "cnn", "sentiment": "none"}, {"name": "nafta", "sentiment": "none"}, {"name": "facebook  follow us on twitter & instagram", "sentiment": "none"}, {"name": "cbs", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "  Fox News Latino \nRepublican presidential nominee Donald Trump took a more conciliatory tone in addressing immigration during his lightning trip to Mexico to meet with President Enrique Peña Nieto, but kept true to his proposal to build a wall on the United States' southern border.\nIn a joint press conference at the Mexico City presidential residence, Los Piños, Trump and Peña Nieto spoke respectfully of each other while outlining their differences on issues such as immigration and free trade.\n“This is a humanitarian disaster,” Trump said of the large number of undocumented immigrants entering the U.S. via Mexico. “It must be solved quickly.”\nThe GOP nominee, who has in the past derided Mexico as an exporter of rapists and criminals, left out of his remarks his frequent campaign call to deport the 11 million undocumented immigrants living in the U.S., instead focusing his remarks on how the U.S. and Mexico can work together to stem the flow of migrants.\n“Prosperity will increase when we end illegal immigration,” he said. “Not just between our two countries, but between Central and South America and other parts of the world.”\nTrump and Peña Nieto also discussed the candidate's call for a border wall during their meeting, but specified that the two did not talk about the proposal's most contentious part, Trump's insistence that Mexico pay for it.\n\"We did discuss the wall. We didn't discuss payment of the wall,\" Trump said.\nTrump said that having a secure border is a sovereign right and something that would be mutually beneficial to both countries.\nFor his part, Peña Nieto walked a fine line, acknowledging the widespread anger that many Mexicans and Mexican-Americans feel toward the proposal, but described the conversation between the two politicians as \"open and constructive.\" He did not, however, shy away from criticizing the U.S. about the amount of firearms that flow into Mexico from the U.S. as a result of the drug trade.\n“An important number of Americans see the border as a problem because of the number of undocumented immigrants and drugs that cross the border,” he said. “This does not take into account the millions of illegal dollars and guns that come to Mexico from the U.S.”\nThe Mexican president's tone was much more measure than a few months ago when he compared Trump's rhetoric to that of Adolf Hitler.\n“First of all let me tell you, [Trump] is not welcome to Mexico by 130 million people. We don't like him, we don't want him, we reject his visit,” former President Vicente Fox said on Wednesday morning. “I don't understand why President Peña Nieto has offered this opportunity. I think it's nothing more than a political stunt.”\nTrump responded to Fox's criticism on Twitter earlier in the day, saying the former president had, like Peña Nieto, invited him to come to the country when he apologized for \"dropping the f-bomb.\" Fox shot back with a tweet of his own, saying he had invited Trump to \"come and apologize to all Mexicans. Stop lying! Mexico is not yours to play with. Show some respect.\"\nPeña Nieto invited both U.S. presidential candidates to come to Mexico City. The inclusion of Trump puzzled many in Mexico, who said it wasn't clear why their own unpopular president would agree to meet with someone so widely disliked in the country.\nMexico City-based security analyst Alejandro Hope suggested that Peña Nieto \"wanted to invite Hillary, but that meant inviting both of them, and nobody thought Trump would accept.\"\nThe trip, a politically risky move for Trump just ten weeks before Election Day, also came hours before the Republican nominee was expected to deliver a highly-anticipated speech in Arizona about illegal immigration. The issue has been a defining one in Trump's presidential campaign, but also one on which he has appeared to waver in recent days.\n\"The American people are going to see more clearly that there's one candidate in this race who's prepared to take the steps necessary to end the flood of illegal immigration,\" Trump's running mate, Indiana Gov. Mike Pence, said Wednesday on CNN.\nTrump will also make clear, Pence told CBS, \"that there will be no path to legalization, no path to citizenship. People will need to leave the country to be able to obtain legal status or obtain citizenship.\"\nWhile immigration is the hot button issue surrounding Trump’s visit to Mexico, the billionaire businessman also brought up his strong dislike of the North American Free Trade Agreement (NAFTA), which he said “has been a far greater benefit to Mexico than to the United States.”\n“It’s a 22-year-old agreement that should be updated,” he added.\nIn his remarks, Peña Nieto took a more positive view of the trade agreement, saying that in his view, “NAFTA has been beneficial to both the United States and Mexico.”\nThe Associated Press contributed to this report. \nLike us on Facebook \nFollow us on Twitter & Instagram", "external_links": [], "published": "2016-08-31T03:00:00.000+03:00", "crawled": "2016-09-01T01:05:12.239+03:00", "highlightTitle": ""}