{"organizations": [], "uuid": "4beb073a21afabe11c377bee0cf20859dbb87339", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 9, "shares": 9, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/images.foxnews.com/content/fox-news/us/2016/09/08/now-adults-children-11-draw-inspiration-from-tragedy/_jcr_content/par/featured-media/media-0.img.jpg/0/0/1473312967417.jpg?ve=1", "site_section": "http://feeds.foxnews.com/foxnews/national", "section_title": "FOX News", "url": "http://www.foxnews.com/us/2016/09/08/now-adults-children-11-draw-inspiration-from-tragedy.html", "country": "CH", "domain_rank": 185, "title": "Now adults, children of 9/11 draw inspiration from tragedy", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Now adults, children of 9/11 draw inspiration from tragedy", "spam_score": 0.0, "site_type": "news", "published": "2016-09-08T13:24:00.000+03:00", "replies_count": 0, "uuid": "4beb073a21afabe11c377bee0cf20859dbb87339"}, "author": "", "url": "http://www.foxnews.com/us/2016/09/08/now-adults-children-11-draw-inspiration-from-tragedy.html", "ord_in_thread": 0, "title": "Now adults, children of 9/11 draw inspiration from tragedy", "locations": [], "entities": {"persons": [{"name": "thea t", "sentiment": "neutral"}, {"name": "anjunelly", "sentiment": "none"}, {"name": "weinberg", "sentiment": "none"}, {"name": "thea", "sentiment": "none"}, {"name": "steven weinberg", "sentiment": "none"}, {"name": "wenig", "sentiment": "none"}, {"name": "ronald jr.", "sentiment": "none"}, {"name": "jacqueline milam", "sentiment": "none"}, {"name": "adam rose", "sentiment": "none"}, {"name": "ronald milam jr.", "sentiment": "none"}, {"name": "sonia", "sentiment": "none"}, {"name": "rosita", "sentiment": "none"}, {"name": "thea trinidad", "sentiment": "none"}, {"name": "jay\" shah", "sentiment": "none"}, {"name": "lindsay", "sentiment": "none"}, {"name": "maxima", "sentiment": "none"}, {"name": "ryan mcgowan", "sentiment": "none"}, {"name": "lindsay weinberg", "sentiment": "none"}, {"name": "ronald milam", "sentiment": "none"}, {"name": "michael trinidad", "sentiment": "none"}, {"name": "tom", "sentiment": "none"}, {"name": "maxima jean-pierre", "sentiment": "none"}, {"name": "alexandra wald", "sentiment": "none"}, {"name": "casey", "sentiment": "none"}, {"name": "isiah kassidy", "sentiment": "none"}, {"name": "michael", "sentiment": "none"}, {"name": "alex", "sentiment": "none"}, {"name": "victor wald", "sentiment": "none"}, {"name": "sonia shah", "sentiment": "none"}, {"name": "stacey sennas mcgowan", "sentiment": "none"}, {"name": "jayesh", "sentiment": "none"}, {"name": "ryan", "sentiment": "none"}, {"name": "jennifer peltz", "sentiment": "none"}, {"name": "anjunelly jean-pierre", "sentiment": "none"}, {"name": "michael massaroli", "sentiment": "none"}], "locations": [{"name": "pentagon", "sentiment": "none"}, {"name": "fla", "sentiment": "none"}, {"name": "new york city", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "greece", "sentiment": "none"}, {"name": "world trade center", "sentiment": "none"}, {"name": "tampa", "sentiment": "none"}, {"name": "dominican republic", "sentiment": "none"}, {"name": "thea trinidad", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}, {"name": "madison square garden", "sentiment": "none"}, {"name": "san antonio", "sentiment": "none"}], "organizations": [{"name": "twitter", "sentiment": "neutral"}, {"name": "facebook", "sentiment": "neutral"}, {"name": "george washington university", "sentiment": "none"}, {"name": "army", "sentiment": "none"}, {"name": "general services administration", "sentiment": "none"}, {"name": "associated press", "sentiment": "none"}, {"name": "baylor university", "sentiment": "none"}, {"name": "congress", "sentiment": "none"}, {"name": "families of freedom scholarship fund", "sentiment": "none"}, {"name": "emeril lagasse tv", "sentiment": "none"}, {"name": "ap", "sentiment": "none"}, {"name": "boston college", "sentiment": "none"}, {"name": "pro wrestling illustrated", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Now adults, children of 9/11 draw inspiration from tragedy   Facebook 0 Twitter 0 Email Print Thea Trinidad poses for a photo in New York on Tuesday, Aug. 9, 2016. She was 10 when she overheard her father calling her mother to say goodbye from the trade center's north tower, where he worked as a telecommunications analyst. (AP Photo/Seth Wenig) (The Associated Press) This undated photo provided by Thea Trinidad shows her with her father, Michael Trinidad. Michael was a former high school wrestler who didn't flinch when his tomboy daughter did leaping moves off the furniture. In fact, \"he'd say, 'No, you're doing it wrong _ let me show you,'\" says Thea, 25, who lives in Tampa, Fla. She says she feels her father's spirit every time she goes into the ring. \"This one's for you, Dad,\" she tells herself. \"Protect me out there.\" (Courtesy of Thea Trinidad via AP) (The Associated Press) Thea Trinidad practices her wrestling moves with Isiah Kassidy at a ring in New York on Friday, Aug. 19, 2016. Her father, Michael, was a former high school wrestler who didn't flinch when his tomboy daughter did leaping moves off the furniture. In fact, \"he'd say, 'No, you're doing it wrong _ let me show you,'\" says Thea, 25, who lives in Tampa, Fla. She says she feels her father's spirit every time she goes into the ring. \"This one's for you, Dad,\" she tells herself. \"Protect me out there.\" (AP Photo/Seth Wenig) (The Associated Press) Previous Next \nNEW YORK – They were kids, or not even born yet, when America's heart broke for them. \nMore than 3,000 children and young adults lost a parent in the deadliest terror attack on American soil, instantly becoming known as the children of 9/11. \nAs the 15th anniversary of the attacks approaches, these children are now adults or nearly so, and their Sept. 11 legacy is now theirs to shape. \nMany have been guided by a determination to honor the parent they lost or the awareness they so painfully gained. And they have done it in ways as varied as working with refugees, studying the forces that led to the attacks and pursuing a parent's unrealized pro-sports dream. \nHere are some of their stories. \n__ \n\"THINGS KIND OF COME FULL CIRCLE\" \nIt's Lindsay Weinberg's job to find and notify families whose loved ones have died, sometimes under violent circumstances. It's a job she's particularly prepared to do. \n\"I'm giving them among the worst news they can receive, and I've received it,\" she says. \nWeinberg was 12 when the New York City medical examiner's office, where she now works, told her family in 2002 that it had identified her father's remains among the victims of 9/11. \n\"It adds to the amount of empathy that I can have,\" says the 26-year-old, whose father, Steven Weinberg, was an accounting manager killed at the World Trade Center. \nAfter recognizing how forensic science helped provide answers for her family, Lindsay got a master's degree in it, and is now an outreach investigator. She hasn't worked on the continuing analysis of the more than 21,000 bits of bone found at ground zero. \nShe says her connection to 9/11 is \"not something that I lead with, personally or professionally.\" But working at the medical examiner's office, she says, shows \"how things kind of come full circle.\" \n___ \n\"I THOUGHT, 'WHAT WAS IT WE SHARED THE MOST?' AND IT WAS WRESTLING\" \nThea Trinidad's pulse thumped as she walked out on the floor of Madison Square Garden as part of pro wrestler Adam Rose's entourage in 2014. It was the first time she'd been there in her own wrestling career. And the first time since she'd been there with her dad. \nLooking up at the seats where they always sat \"was like a punch to the heart,\" she says. \nShe was 10 when she overheard her father calling her mother to say goodbye from the trade center's north tower, where he worked as a telecommunications analyst. Growing up, she pondered how to honor him. \n\"I thought: 'What was it we shared the most?' And it was wrestling,\" she recalls. \nMichael Trinidad was a former high school wrestler who didn't flinch when his tomboy daughter did leaping moves off the furniture. In fact, \"he'd say, 'No, you're doing it wrong — let me show you,'\" says Thea, 25, who lives in Tampa, Florida. \nAt first, the 5-foot-tall wrestler didn't let on about her dad as she backflipped and body-slammed under the monikers Divina Fly and Rosita. (She now uses her own name). She didn't want anyone thinking she was making a play for sympathy. \nAfter her story emerged, Pro Wrestling Illustrated magazine named her Inspirational Wrestler of the Year in 2011. \nShe says she feels her father's spirit every time she goes into the ring. \n\"This one's for you, Dad,\" she tells herself. \"Protect me out there.\" \n___ \n\"POSITIVE, PERSONAL GROWTH OUT OF SOMETHING THAT WAS SO HORRIFIC\" \nSeveral years after 9/11, Michael Massaroli came across a plastic bin filled with condolence messages. \nThey had come from people around the country and world, many of them strangers, after the attacks killed his father and namesake, an investment executive. Michael was 6. His widowed mother had just given birth to a baby girl two months earlier. \n\"Hearing how people were so selfless and so caring to us really made me want to try to do something, career-wise, that I thought would help other people,\" he says. \nHe decided that would be public service, since he was already interested in politics. By high school, he was interning for a state assemblyman. \nNow 21 and newly graduated from George Washington University, he got his first job working at a Washington firm that helps political campaigns handle their finances properly. He sees himself eventually working in government as an adviser or aide. \n\"I really try and at least get positive personal growth out of something that was so horrific,\" he says, \"rather than let it break me down.\" \n___ \n\"THE LOVE AND THE HERITAGE COMES THROUGH\" \nAnjunelly Jean-Pierre once had her future all figured out. She planned on joining the military and eventually becoming the doctor or lawyer her mother envisioned. \nThen her mother, Maxima Jean-Pierre, was killed at the World Trade Center, where the immigrant from the Dominican Republic managed an executive cafe. \nOver the next few years, Anjunelly grieved, regrouped and decided she wanted to do what her mother did. Recalling the Sunday dinners that filled the house with friends and family, \"I saw how food brings people together,\" says Anjunelly, 34. \nAfter culinary school and a stint as a sous-chef for an Emeril Lagasse TV show, Anjunelly now works in a setting where bringing people together is perhaps especially important: She is a manager in the Members' Dining Room in Congress. \nLast September, a letter she wrote about Maxima was entered into the Congressional Record. One of the most popular dishes she's made over the years was Maxima's rice and peas, she wrote: \"I guess the love and the heritage comes through.\" \n___ \n\"I WANTED TO MAKE SURE IT NEVER HAPPENED AGAIN\" \nAlexandra Wald wanted to understand. She soaked up books about the forces and failures that led to Sept. 11. She took four years of Arabic in college, got a master's degree in international relations and aspired to work in intelligence. \n\"Being as affected as I was by the geopolitical landscape and my dad being killed on 9/11,\" she says, \"I wanted to make sure it never happened again.\" \nIt was her first day of high school when her father, stockbroker Victor Wald, was killed at the World Trade Center. \nHis daughter, who goes by Alex, was already interested in world events. But 9/11 made her want \"to be that person to decipher that information, to protect the homeland.\" \nNow 28, she works on a cybersecurity project for a contractor for the federal General Services Administration in Washington. \nStudying for her career — with help from the Families of Freedom Scholarship Fund, set up for the children of 9/11 victims — also meant dealing with the frustration of contemplating missed opportunities to disrupt the terror plot. \nWhen the anger stirred, she'd think of some advice her father gave her a few weeks before the attacks. \n\"You can't look back with regret,\" he told her. And \"never say, 'What if?'\" \n___ \n\"ONCE IT'S ON MY SKIN, I HAVE TO TALK ABOUT IT\" \nIt's all right to ask Ryan McGowan about the \"IX.XI\" tattooed on the back of her neck. It's 9/11 in Roman numerals. \n\"Once it's on my skin,\" she says, \"I have to talk about it.\" \nRyan was 5, sister Casey 4, when their mother, investment executive Stacey Sennas McGowan, was killed at the trade center. \nAs a preteen, Ryan partly played the role of parent, helping her sister pick outfits for school and making dinner when their father, Tom, had to work. She came to think of her mother as \"an amazing guardian angel.\" \nNow 20, Ryan is a junior majoring in marketing at Boston College, where 19-year-old Casey is a sophomore in communications. \nOften, Ryan makes her way through the campus to a labyrinth inscribed with her mom's name and those of 21 fellow BC graduates killed in 9/11. It's a place she feels close to her mother, whose remains were never identified and buried. \n\"I can just sit there and reflect,\" she says. \"I don't have that anywhere else.\" \n___ \n\"I WANTED TO PLAY IN HONOR OF MY DAD\" \nRonald Milam Jr. doesn't always tell his football and basketball teammates that there's a reason he wears the number 33. It's for his father, Army Maj. Ronald Milam, who was 33 when he was killed at the Pentagon on 9/11. \nRonald Jr. never met his father. His mother, then-Air Force Capt. Jacqueline Milam, was pregnant with him on 9/11. She safely escaped from the Pentagon. \nRonald Jr., now a 14-year-old high school freshman in San Antonio, is one of the more than 100 Sept. 11 victims' children who were born after the attacks. \nHe has his dad's features and unflappable personality. And his jersey number was a connection he could make with his father, a college player himself. \n\"I wanted to play in honor of my dad,\" he says. \"So I picked that.\" \n___ \n\"I RECOGNIZED HARDSHIP IN OTHER PEOPLE'S LIFE\" \nSometimes, after refugees told her their stories of conflict and loss, Sonia Shah would let them know that she had one, too. \nExplaining that her father died in 9/11 opened \"a bonding moment,\" says the Baylor University social work student, who spent the summer volunteering with refugee aid organizations in Greece. \nHer father, Jayesh \"Jay\" Shah, was killed at ground zero, where he was a financial trading technology executive. Sonia was 7. \nHis death fueled Sonia's impulse to try to help where others turn away. \n\"Because I had faced loss at such a young age and in such a different way than many other people, I recognized hardship in other people's life a lot more easily,\" says the 22-year-old senior, who took a year off from college for religious study. She says that without her faith, she \"wouldn't be as whole and as healed.\" \n___ \nReach Jennifer Peltz on Twitter @jennpeltz. Advertisement", "external_links": [], "published": "2016-09-08T13:24:00.000+03:00", "crawled": "2016-09-08T08:41:34.144+03:00", "highlightTitle": ""}