{"organizations": [], "uuid": "06cfc1f1bbfc6a151f57e12c57a338d36b9f50a7", "thread": {"social": {"gplus": {"shares": 1}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 47, "shares": 47, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/0/0/ewrewr354345dsf543.jpg", "site_section": "http://feeds.foxnews.com/foxnews/section/lifestyle", "section_title": "FOX News", "url": "http://www.foxnews.com/leisure/2016/09/07/eu-proposal-to-ban-american-lobsters-to-move-forward/", "country": "IT", "domain_rank": 185, "title": "EU proposal to ban American lobsters to move forward", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "EU proposal to ban American lobsters to move forward | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2016-09-07T03:00:00.000+03:00", "replies_count": 0, "uuid": "06cfc1f1bbfc6a151f57e12c57a338d36b9f50a7"}, "author": "Associated Press", "url": "http://www.foxnews.com/leisure/2016/09/07/eu-proposal-to-ban-american-lobsters-to-move-forward/", "ord_in_thread": 0, "title": "EU proposal to ban American lobsters to move forward", "locations": [], "entities": {"persons": [{"name": "robert s. steneck", "sentiment": "none"}, {"name": "gavin gibbons", "sentiment": "none"}, {"name": "steneck", "sentiment": "none"}, {"name": "arnie gamage jr.", "sentiment": "none"}], "locations": [{"name": "sea hag seafood", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "maine", "sentiment": "none"}, {"name": "sweden", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "negative"}, {"name": "associated press", "sentiment": "negative"}, {"name": "european union", "sentiment": "none"}, {"name": "european union's scientific forum on invasive alien species", "sentiment": "none"}, {"name": "national fisheries institute", "sentiment": "none"}, {"name": "agency for marine", "sentiment": "none"}, {"name": "university of maine", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "  Associated Press   Email Print Live lobsters are processed at the Sea Hag Seafood plant in Tenants Harbor, Maine.  (AP File Photo) \nThe European Union will conduct a more extensive review of a proposal to ban lobsters imported from the U.S. and Canada after a scientific panel concluded Sweden raised valid points in its request to declare the American lobster an invasive species.\nThe opinion of the European Union's Scientific Forum on Invasive Alien Species sets in motion a broader review that also will take into account the opinions of North American officials, who've criticized the proposal to ban American lobsters.\nThe international dispute started when Sweden announced it had found 32 American lobsters in the country's waters earlier this year and that they pose a threat to native crustaceans.\nLobstermen in the U.S. and Canada, which together export $200 million worth of lobster to EU countries each year, had hoped to stop the proposal before it moved any further.\nThe congressional delegation in Maine, the nation's lobster leader, issued a statement saying the EU's actions represent an \"unnecessary overreaction that would have devastating economic effects on the American lobster industry that supports so many Mainers and their families.\"\nA spokesman for the European Union stressed that the scientific panel's conclusion is considered preliminary. The full review won't be completed until spring at the earliest.\nThe expanded review will include issues raised by scientists in the United States and Canada, and it'll also consider economic impact and means of protecting native lobsters other than an outright ban, the European Union's executive body said Tuesday in a statement.\nIt's unclear how the American lobsters ended up in Swedish waters.\nSweden's Agency for Marine and Water Management contends the country is right to be cautious about the appearance of a foreign species. The agency also says more research is needed into the impact of cross-breeding of American and European lobsters.\nBut Robert S. Steneck, a University of Maine scientist, said there's no evidence of successful reproduction resulting in new American or hybrid lobsters in Europe, possibly because of water temperatures or unsuitable nursery habitat for American lobster.\nSteneck said the risk of American lobsters becoming invasive in Europe is \"vanishingly small.\"\n\"I doubt there is evidence that the American lobster can increase in abundance to the point it creates measurable harm to the ecosystem or to humans. Those are the criteria on which 'invasive species' are defined,\" Steneck said.\nThe National Fisheries Institute, a U.S. seafood trade association, also criticized the EU actions.\n\"You might get hit by a car crossing the street but that doesn't mean the only way to avoid such risk is never crossing the street,\" spokesman Gavin Gibbons said. \"This is an attempt to supposedly introduce a zero-risk solution to an issue that numerous researchers have said is not a genuine scientific concern.\"\nMaine lobstermen like Arnie Gamage Jr. question how the lobsters got into Swedish waters in the first place. He's among those who believe they were illegally released.\n\"It seems to me that they have a problem over there with people releasing things into the ocean. It's their problem, not our problem,\" he said.", "external_links": [], "published": "2016-09-07T03:00:00.000+03:00", "crawled": "2016-09-07T17:25:11.536+03:00", "highlightTitle": ""}