{"organizations": [], "uuid": "936ea43a245678627cc4692f922d18fa905d77b2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 12, "shares": 12, "comments": 1}, "stumbledupon": {"shares": 0}}, "site_full": "www.buzzfeed.com", "main_image": "https://img.buzzfeed.com/buzzfeed-static/static/2016-09/22/21/campaign_images/buzzfeed-prod-fastlane02/how-a-decision-in-may-changed-the-general-election-2-22378-1474595423-0_dblbig.jpg", "site_section": "", "section_title": "", "url": "https://www.buzzfeed.com/rubycramer/how-a-decision-in-may-changed-the-general-election", "country": "US", "domain_rank": 137, "title": "How A Decision In May Changed The General Election - BuzzFeed News", "performance_score": 0, "site": "buzzfeed.com", "participants_count": 0, "title_full": "How A Decision In May Changed The General Election - BuzzFeed News", "spam_score": 0.011, "site_type": "news", "published": "2016-09-22T08:00:00.000+03:00", "replies_count": 0, "uuid": "936ea43a245678627cc4692f922d18fa905d77b2"}, "author": "Rucramer Buzzfeed News Reporter", "url": "https://www.buzzfeed.com/rubycramer/how-a-decision-in-may-changed-the-general-election", "ord_in_thread": 0, "title": "How A Decision In May Changed The General Election - BuzzFeed News", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "neutral"}, {"name": "justin sullivan", "sentiment": "neutral"}, {"name": "debbie wasserman schultz", "sentiment": "none"}, {"name": "kelly ayotte", "sentiment": "none"}, {"name": "zac petkanas", "sentiment": "none"}, {"name": "miranda", "sentiment": "none"}, {"name": "luis miranda", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "reynolds", "sentiment": "none"}, {"name": "ted cruz", "sentiment": "none"}, {"name": "christina reynolds", "sentiment": "none"}, {"name": "jennifer palmieri", "sentiment": "none"}, {"name": "hillary for america", "sentiment": "none"}, {"name": "paul ryan", "sentiment": "none"}, {"name": "richard burr", "sentiment": "none"}, {"name": "petkanas", "sentiment": "none"}, {"name": "palmieri", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "mitt romney", "sentiment": "none"}, {"name": "richard nixon", "sentiment": "none"}, {"name": "paul ryan-donald trump", "sentiment": "none"}, {"name": "rob portman", "sentiment": "none"}, {"name": "nancy pelosi", "sentiment": "none"}, {"name": "ayotte", "sentiment": "none"}, {"name": "obama", "sentiment": "none"}, {"name": "john mccain", "sentiment": "none"}, {"name": "clinton", "sentiment": "none"}, {"name": "ruby cramer", "sentiment": "none"}, {"name": "ryan-trump", "sentiment": "none"}, {"name": "donald", "sentiment": "none"}, {"name": "ryan", "sentiment": "none"}, {"name": "hillary", "sentiment": "none"}, {"name": "barbara comstock", "sentiment": "none"}, {"name": "harry reid", "sentiment": "none"}, {"name": "pat toomey", "sentiment": "none"}], "locations": [{"name": "new hampshire", "sentiment": "none"}, {"name": "fla.", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "nashua", "sentiment": "none"}, {"name": "virginia", "sentiment": "none"}, {"name": "rhode island", "sentiment": "none"}, {"name": "brooklyn", "sentiment": "none"}, {"name": "north carolina", "sentiment": "none"}, {"name": "miranda", "sentiment": "none"}, {"name": "capitol hill", "sentiment": "none"}, {"name": "st. petersburg", "sentiment": "none"}, {"name": "n.h.", "sentiment": "none"}, {"name": "pennsylvania", "sentiment": "none"}, {"name": "ohio", "sentiment": "none"}], "organizations": [{"name": "democratic national committee", "sentiment": "none"}, {"name": "republican", "sentiment": "none"}, {"name": "republican party", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "american legion", "sentiment": "none"}, {"name": "congress", "sentiment": "none"}, {"name": "senate", "sentiment": "none"}, {"name": "gop", "sentiment": "none"}, {"name": "dnc", "sentiment": "none"}, {"name": "tea party", "sentiment": "none"}, {"name": "buzzfeed news", "sentiment": "none"}, {"name": "cbs news-yougov", "sentiment": "none"}, {"name": "house", "sentiment": "none"}, {"name": "democratic party", "sentiment": "none"}, {"name": "wikileaks", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Justin Sullivan / Getty Images ID: 9669580 \nLast summer, when Donald Trump began his rise to the nomination, Hillary Clinton responded by pointing a finger squarely and firmly at the Republican Party. \nTrump might sound extreme, she said , “but if you look at everyone else’s policies, they’re pretty much the same.” He might make “hateful comments,” she said, “but how many others disagree with him?” \nLater that year, when Trump proposed his ban on Muslims, Clinton responded again by implicating the rest of the Republican Party. “Their language may be more veiled than Trump’s,” she said , “but their ideas are not so different.” \nAnd the following spring, when Trump solidified his lead in the primary, Clinton yet again faulted the modern Republican Party. “Donald Trump didn’t come out of nowhere,” she said . “What the Republicans have sown with their extremist tactics, they are now reaping with [his] candidacy.” \nSo when Trump secured the nomination just a few weeks later in May, officials at the Democratic Party expected to hear more of the same from their own candidate, turning the new GOP standard-bearer into a sweeping indictment of the Republican Party, the Republican platform, and every Republican running for House and Senate. \nWhat Clinton did instead was vastly different. \nThat month, the candidate and her team of aides in Brooklyn set out on a new approach, outlined for the Democratic National Committee in an internal email that landed in the communications shop as something of a shock. “They want to make Trump look even more extreme than the rank-and-file Republican member of Congress,” the DNC’s deputy communications director wrote on the night of May 13, summarizing a conversation earlier that evening with Clinton’s rapid response director, Zac Petkanas. “He doesn’t want to link the House and Senate Republicans to Trump,” the message read. \nThe bottom line? \n“The campaign does not want to connect Trump and the Republican Party.” \nThe email, made public along with 20,000 others on WikiLeaks as part of a massive cyberattack on the DNC this summer, is one of about two dozen exchanges that reveal a running tension this spring over the campaign’s decision to “ disaggregate ” Trump from the Republican Party. The strategic shift made back in May didn’t just drive a wedge between Clinton’s team and the officials tasked with coordinating the party across the states. It fundamentally upended the way Democrats talk about Republicans. \n“I think that’s crazy” was the reply from the DNC’s communications director, Luis Miranda, whose emails make up more than half of those on WikiLeaks. (Miranda and other top officials at the DNC, including the chair, Rep. Debbie Wasserman Schultz, later stepped down in the wake of the hack.) “Insane,” he wrote again a few hours later, concerned that campaign’s approach might let down-ballot Republicans off the hook. \nMonths later, Clinton’s strategy is unrecognizable from the first year of her campaign. She doesn’t tie Trump to the rest of the Republican Party. She doesn’t talk about Republican extremism or Republican rhetoric or Republican ideology. She has made the race almost exclusively about Donald Trump, his temperament, his qualifications, his character, and his fitness to serve, leaving the rest of the Democratic Party to adjust to a general election that has little to do with traditional partisan policy or politics. \nThe result, with less than 50 days until Election Day, is a Democratic nominee who praises establishment Republicans, makes forceful appeals for bipartisan support, and only rarely addresses Trump as President Obama might have John McCain or Mitt Romney in 2008 or 2012, strictly avoiding attacks on Republicans writ large. \nIt’s a message that requires great discipline from a candidate who once made a starkly different case, appearing at times to delight in attacking Republican policy. (At one rally in Rhode Island before the end of the primary, Clinton memorably nodded along in approval when the crowd booed one of her lines stating that Trump and his competitor Ted Cruz were peddling “ the same snake oil ” as the rest of Republicans.) \nWhen she recently deviated from her general election approach, describing “ half ” of Trump’s supporters as “deplorables”— a remark that cast millions of Republicans as racist, sexist, homophobic, and xenophobic — Clinton quickly apologized for the broad characterization. “I regret saying ‘half,’” she said. (The retraction notably did nothing to back away from what she again described as Trump’s “deplorable” behavior.) \nOn the trail, Clinton doesn’t engage much in the economic and social debates that typically animate both parties in a presidential election. (In May, on at least two occasions, WikiLeaks emails show, Clinton’s team asked the DNC to stay “out of policy” when it came to framing Trump — once around his May 12 meeting with Speaker of the House Paul Ryan, and a second time in relation to infrastructure messaging.) \nClinton’s stump speech from the primary — a laundry list of policy proposals, capped off with a reminder that “ everything I’ve just said, the Republicans disagree with ”— gave way this summer to highly specific and often personal portraits of Trump, his record, and his credentials. A stray comment last month to a crowd in St. Petersburg, Fla. — that Trump’s tax plan would “ repackage trickle-down economics ”— is perhaps the closest she’s come since the spring to identifying Trump with mainstream GOP policy. \nInstead, as Clinton presents it now, this election is about “values.” (“ Consider our plans and the values behind them ,” the candidate tells voters.) And she means values in the most basic sense of the word — touchstones of decency and fairness that, against Trump, have suddenly become (big-D) Democratic slogans. Her speeches cast the GOP nominee as a threat to “ big-heartedness ,”“ tolerance ”— the belief that “ no one’s worthless, no one’s less-than .” Her tagline on the trail is the simple idea that “ love trumps hate .” Her running mate describes the race as “ near existential ”— a choice about “ fidelity to our values .” And her field offices across the country are decorated more often with words like “kindness” than anything overtly partisan. (Next to “Hillary For President” and “Yaaas Hillary” posters on the wall in Nashua, N.H., one sign simply reads, “Be Respectful.”) \nEarlier this month, delivering a speech about the hallmark Republican theme of American exceptionalism, Clinton admitted that such topics should normally be “ above politics .” But, she told the crowd at the American Legion, “this is not a normal election.” \n“The debates are not the normal disagreements between Republicans and Democrats.” \nThrough the month of May, the party’s adjustment to Clinton’s new normal did not come quickly, easily, or without some resistance inside the Democratic apparatus in Washington tasked with races at the state and local levels, and presented with the opportunity of a historically unpopular Republican nominee. The internal DNC emails on WikiLeaks offer an unvarnished glimpse at a campaign and party operation out of sync at times on messaging objectives that in any other election year might be routine. \nIn one early instance, the hacked emails show, both offices separately drew up plans for the highly anticipated May 12 Paul Ryan-Donald Trump summit on Capitol Hill. The day of the meeting, Miranda, the DNC communications director, and Petkanas, the Clinton rapid response director, discovered that they had prepared contradictory talking points. \nTo Clinton, the meeting with Ryan, an occasional Trump critic, showcased the distance between establishment Republicans and an alienating nominee. The DNC, meanwhile, had already instructed the Democratic state parties to say the opposite: that Ryan may not like Trump, but they share “the same divisive agenda” and “same old Republican playbook.” (They even designed posters: “Reject the Trump-Ryan Agenda.”) \n“This is unfortunate messaging,” Petkanas wrote to Miranda, forwarding one of the state party press releases highlighting Trump and Ryan’s shared policy positions. \nMiranda, at this point, had yet to receive the email about decoupling Trump from the GOP. (That came a day later.) He replied , asking for “better clarity,” then added flatly: “Because the idea that we would prop up Paul Ryan as a model isn’t going to work.” \nPetkanas wrote back , frustrated. He referenced a call from the day before —“a whole back and forth on this exact subject”— where, he said, they had “specifically talked about how we don’t want to tie them together just yet or talk about the Ryan-Trump agenda.” \n“That’s what you agreed to do on the 1:30 p.m. call yesterday. That’s what I informed our campaign that you would be doing,” Petkanas said , prompting no further reply. \nThrough the end of May, the plan to “disaggregate” Trump, as it was described in one lengthy email , remained a source of frustration for Miranda, the campaign’s go-between on messaging at the DNC. In the same message, subject-lined “Problem with HFA [Hillary For America],” he argued that the campaign’s frame — that “Trump is much worse than regular Republicans”— would give down-ballot GOP candidates an “easy out” and put every Democrat not named Clinton at a possible disadvantage. (“It might be a good strategy ONLY for Clinton,” Miranda wrote.) Worse, he added, the strategy would put the party “at odds” with the its own broader message against Republicanism. \nAs Miranda put it to one colleague , Democrats had been building the case for years against an increasingly extreme GOP, drawing a line from the rise of hardline Tea Party figures to the fights over affirmative action, immigration, and same-sex marriage of the early- and mid-2000s, to as far back as Richard Nixon’s so-called Southern Strategy in the 1960s, Miranda said. His point was the same one Clinton used to make before the end of the primaries: that Republicans “made their bed and now they’re lying in it,” as Miranda said in the email. “Democrats couldn’t dump the approach,” he wrote , citing congressional leaders like Harry Reid and Nancy Pelosi who had been making the case he had in mind. “It’s worse than turning an aircraft carrier. We would lose 3/4 of the fleet.” \nReached Thursday, Miranda declined to comment on the emails or Clinton’s strategy. \nSince May, Democratic officials working on races up and down the ticket said in recent interviews, any initial hurdles have been overcome inside the party: Clinton, they said, can hold up Republicans who have rejected Trump, while House and Senate Democrats put the pressure on those who haven’t, including such candidates in closely watched races as Sen. Kelly Ayotte in New Hampshire and Rep. Barbara Comstock in Virginia. \nBut the messaging marks a subtle but significant shift for down-ballot Democrats, many of whom used to blast out releases about “the party of Trump,” casting the Republicans as a reflection of the same GOP that produced Trump. In the general election, Democrats now ask why Republicans haven’t backed away from him altogether, arguing that candidates have chosen “party over country”— a message that better fits the Clinton framework, distancing Trump from the rest of the Republicans up for election. \nThe strategies are distinct, said one Democratic operative working on 2016 races, but “not contradictory.” Since May, a second Democratic operative said, the party has developed an understanding that “different entities can do different things.” \nStill, the message has disadvantages for Democrats. \nSenate Republicans have been able to distance themselves from Trump to their benefit: In New Hampshire, 78% of voters see Ayotte, a first-term senator who rarely mentions her party’s nominee on the campaign trail, as a “ different kind of Republican ” than Trump, according to a CBS News-YouGov poll of battleground states last month. \nTwo other vulnerable GOP incumbent candidates, Sens. Pat Toomey and Richard Burr, have seen a similar dynamic among voters in their respective home states, Pennsylvania and North Carolina. In Ohio, 20% of likely Clinton voters said in another recent poll that they will also vote for incumbent Republican Sen. Rob Portman over the Democrat. \nAnd despite Clinton’s lengthy list of policy proposals (clocking in at 113,000 words on the campaign’s website), her message has become closely associated with an anti-Trump position. \nThis month, even as her aides have promised that Clinton will make a more “positive” and “aspirational” case on the trail, as communications director Jennifer Palmieri put it to reporters last week, Clinton still spends much of her time drawing contrasts. The candidate’s new “Stronger Together” speeches — an ongoing series unveiled by Palmieri as an effort to highlight “the values that motivate” Clinton and move “beyond just Donald Trump”— still name or invoke the GOP nominee, and in some cases do so at length. \nThe strategy is one the candidate and her aides committed to back in May, and still continue to drive daily on the trail and from headquarters. If one theme runs through many of this spring’s hacked DNC emails relating to message, it is that the Clinton campaign has shaped the party’s approach in matters large and small , dictating broad changes, slight tweaks, setting the course for Democrats in the general election. \nTrump’s foreign policy views? “It’s not that he’s on over his head,” Petkanas told DNC officials in late April. “It’s that he’s advocating for some very dangerous policies that undermine our national interest and our security.” \nTrump’s business record? “We have found that calling him a failed businessman is ineffective,” deputy communications director Christina Reynolds wrote in May. “Aiming more at the angle that he got rich at the expense of the little guy, etc., is much more believable and effective.” \nAnd Trump, period? When party officials started referring to him as “Dangerous Donald,” Clinton’s team quickly vetoed the idea. “We are very worried that Dangerous Donald sounds too much like him — it’s Lyin’ Ted or Corrupt Hillary,” Reynolds wrote in a message to the communications team, “which undermines the broader point.” \nAfter the fact, emails show, DNC officials still disagreed with the decision. But as with other complaints about Clinton’s strategy, this one had no bearing on the outcome. \n“Cool,” Miranda wrote back , “We’ll tweak it.” Ruby Cramer is a political reporter for BuzzFeed News and is based in New York. Contact Ruby Cramer at . ", "external_links": [], "published": "2016-09-22T08:00:00.000+03:00", "crawled": "2016-09-23T04:59:42.766+03:00", "highlightTitle": ""}