{"organizations": [], "uuid": "c824812cb4f3cc52f0e87c111709c4f635bbd3df", "thread": {"social": {"gplus": {"shares": 1}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.politico.com", "main_image": "", "site_section": "http://www.politico.com/defense", "section_title": "Defense: Latest News, Top Stories &amp; Analysis - POLITICO", "url": "http://www.politico.com/tipsheets/playbook/2016/09/government-funding-battle-likely-to-slip-to-next-week-trump-talks-debate-strategy-with-oreilly-the-playbook-food-truck-mook-memo-how-well-win-216401", "country": "US", "domain_rank": 531, "title": "Government funding battle could SLIP to next week -- Trump talks debate strategy with O’REILLY -- THE PLAYBOOK FOOD TRUCK -- MOOK MEMO: How we’ll win", "performance_score": 0, "site": "politico.com", "participants_count": 1, "title_full": "Government funding battle could SLIP to next week -- Trump talks debate strategy with O’REILLY -- THE PLAYBOOK FOOD TRUCK -- MOOK MEMO: How we’ll win - POLITICO", "spam_score": 0.0, "site_type": "news", "published": "2016-09-20T14:55:00.000+03:00", "replies_count": 0, "uuid": "c824812cb4f3cc52f0e87c111709c4f635bbd3df"}, "author": "Jake Sherman", "url": "http://www.politico.com/tipsheets/playbook/2016/09/government-funding-battle-likely-to-slip-to-next-week-trump-talks-debate-strategy-with-oreilly-the-playbook-food-truck-mook-memo-how-well-win-216401", "ord_in_thread": 0, "title": "Government funding battle could SLIP to next week -- Trump talks debate strategy with O’REILLY -- THE PLAYBOOK FOOD TRUCK -- MOOK MEMO: How we’ll win", "locations": [], "entities": {"persons": [{"name": "jon husted", "sentiment": "none"}, {"name": "townsend", "sentiment": "none"}, {"name": "du jour", "sentiment": "none"}, {"name": "tim kaine", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "bush", "sentiment": "none"}, {"name": "bill clinton", "sentiment": "none"}, {"name": "george w. bush", "sentiment": "none"}, {"name": "john harris", "sentiment": "none"}, {"name": "james hohmann", "sentiment": "none"}, {"name": "john bresnahan", "sentiment": "none"}, {"name": "n.j. rahami", "sentiment": "none"}, {"name": "mitch mcconnell", "sentiment": "none"}, {"name": "jake", "sentiment": "none"}, {"name": "ronald reagan", "sentiment": "none"}, {"name": "jeff horwitz", "sentiment": "none"}, {"name": "muhammadu buhari", "sentiment": "none"}, {"name": "karl rove", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "robby mook", "sentiment": "none"}, {"name": "rahami", "sentiment": "none"}, {"name": "n.r. kleinfeld", "sentiment": "none"}, {"name": "olaf", "sentiment": "none"}, {"name": "schumer", "sentiment": "none"}, {"name": "ban ki-moon", "sentiment": "none"}, {"name": "barack obama", "sentiment": "none"}, {"name": "joe biden", "sentiment": "none"}, {"name": "harris", "sentiment": "none"}, {"name": "john nichols", "sentiment": "none"}, {"name": "peter thomson", "sentiment": "none"}, {"name": "nancy pelosi", "sentiment": "none"}, {"name": "kathleen hartington kennedy townsend", "sentiment": "none"}, {"name": "obama", "sentiment": "none"}, {"name": "jim mcgrath", "sentiment": "none"}, {"name": "julie bykowicz", "sentiment": "none"}, {"name": "anna", "sentiment": "none"}, {"name": "bill o’reilly", "sentiment": "none"}, {"name": "clinton", "sentiment": "none"}, {"name": "george h.w.] bush", "sentiment": "none"}, {"name": "gabe debenedetti", "sentiment": "none"}, {"name": "bernie sanders", "sentiment": "none"}, {"name": "ahmad khan rahami", "sentiment": "none"}, {"name": "ricketts", "sentiment": "none"}, {"name": "gabe fleisher", "sentiment": "none"}, {"name": "john lewis", "sentiment": "none"}, {"name": "hillary", "sentiment": "none"}, {"name": "jimmy fallon", "sentiment": "none"}, {"name": "lester holt", "sentiment": "none"}, {"name": "adelson", "sentiment": "none"}, {"name": "darren samuelsohn", "sentiment": "none"}, {"name": "gerald ford", "sentiment": "none"}, {"name": "daniel", "sentiment": "none"}, {"name": "donald", "sentiment": "none"}, {"name": "robert f. kennedy", "sentiment": "none"}, {"name": "lester", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "george h.w. bush", "sentiment": "none"}, {"name": "ahmad rahami", "sentiment": "none"}, {"name": "mook", "sentiment": "none"}, {"name": "teddy schleifer", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "burgess everett", "sentiment": "none"}, {"name": "richard nixon", "sentiment": "none"}, {"name": "seth abramovitch", "sentiment": "none"}, {"name": "sanders", "sentiment": "none"}, {"name": "michael grunwald", "sentiment": "none"}, {"name": "pelosi", "sentiment": "none"}, {"name": "bill", "sentiment": "none"}, {"name": "heuvel", "sentiment": "none"}, {"name": "reno", "sentiment": "none"}, {"name": "lewis", "sentiment": "none"}, {"name": "clinton", "sentiment": "none"}], "locations": [{"name": "united states", "sentiment": "none"}, {"name": "hartford", "sentiment": "none"}, {"name": "philly", "sentiment": "none"}, {"name": "afghanistan", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}, {"name": "d.c.", "sentiment": "none"}, {"name": "chelsea", "sentiment": "none"}, {"name": "san francisco", "sentiment": "none"}, {"name": "sacramento", "sentiment": "none"}, {"name": "hollywood reporter", "sentiment": "none"}, {"name": "fiji", "sentiment": "none"}, {"name": "washington d.c.", "sentiment": "none"}, {"name": "brooklyn", "sentiment": "none"}, {"name": "maryland", "sentiment": "none"}, {"name": "pittsburgh", "sentiment": "none"}, {"name": "wisconsin", "sentiment": "none"}, {"name": "long island", "sentiment": "none"}, {"name": "nevada", "sentiment": "none"}, {"name": "ohio", "sentiment": "none"}, {"name": "las vegas", "sentiment": "none"}, {"name": "minnesota", "sentiment": "none"}, {"name": "seaside park", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "pakistan", "sentiment": "none"}, {"name": "virginia", "sentiment": "none"}, {"name": "n.y.", "sentiment": "none"}, {"name": "linden", "sentiment": "none"}, {"name": "kenansville", "sentiment": "none"}, {"name": "northfield", "sentiment": "none"}, {"name": "duplin county events center", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "new york city", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "georgia", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "north carolina", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "michigan", "sentiment": "none"}, {"name": "new jersey", "sentiment": "none"}, {"name": "pennsylvania", "sentiment": "none"}, {"name": "maine", "sentiment": "none"}, {"name": "fivethirtyeight.com", "sentiment": "none"}, {"name": "quetta", "sentiment": "none"}], "organizations": [{"name": "trump gold card", "sentiment": "none"}, {"name": "capitol hill", "sentiment": "none"}, {"name": "house of representatives", "sentiment": "none"}, {"name": "cia", "sentiment": "none"}, {"name": "dscc", "sentiment": "none"}, {"name": "cnn", "sentiment": "none"}, {"name": "hofstra university", "sentiment": "none"}, {"name": "pac", "sentiment": "none"}, {"name": "senate", "sentiment": "none"}, {"name": "un general assembly", "sentiment": "none"}, {"name": "gop", "sentiment": "none"}, {"name": "house", "sentiment": "none"}, {"name": "wapo", "sentiment": "none"}, {"name": "bp", "sentiment": "none"}, {"name": "nyt", "sentiment": "none"}, {"name": "hrc", "sentiment": "none"}, {"name": "u.n.", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "un", "sentiment": "none"}, {"name": "congress", "sentiment": "none"}, {"name": "ford", "sentiment": "none"}, {"name": "u.n. general assembly", "sentiment": "none"}, {"name": "nbc news/survey monkey weekly election tracking poll", "sentiment": "none"}, {"name": "politico", "sentiment": "none"}, {"name": "nicolaus czarnecki/boston herald", "sentiment": "none"}, {"name": "smithsonian", "sentiment": "none"}, {"name": "isis", "sentiment": "none"}, {"name": "state", "sentiment": "none"}, {"name": "rnc", "sentiment": "none"}, {"name": "wells fargo", "sentiment": "none"}, {"name": "dccc", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "ap potus", "sentiment": "none"}, {"name": "carleton college", "sentiment": "none"}, {"name": "ap", "sentiment": "none"}, {"name": "nrcc", "sentiment": "none"}, {"name": "national museum of african american history", "sentiment": "none"}, {"name": "honda", "sentiment": "none"}, {"name": "democratic party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "GOVT FUNDING UPDATE -- POTOMAC FEVER SETTING IN -- Earlier this month, Republicans and Democrats on Capitol Hill had a rosy prediction: They would be able to wrap up the fight over government funding this week and head home until after Election Day. But the optimistic outlook has collided with reality over the last few days. Senior aides on Capitol Hill now say the funding battle can easily stretch into next week because of disagreements over ancillary spending requests. Big deal? No, not really. They were always scheduled to be in session next week. But Congress would just prefer to get the hell out of D.C. and in front of their constituents. 49 DAYS until Election Day. Six days until the first presidential debate at Hofstra University on Long Island. Big thanks to Carleton College and POLITICO publisher and editor in chief John Harris for organizing a political discussion last night in Northfield, Minnesota. Harris moderated a conversation on Clinton, Trump and the media in 2016 before a packed house with Anna (a St. Olaf alum) and POLITICO alums and friends of Playbook, NYT’s JMart and WaPo’s James Hohmann.\nATTN BROOKLYN -- TRUMP DISCUSSES DEBATE STRATEGY ON FOX NEWS -- Speaking with Bill O’Reilly last night, Trump gave a taste of his debate prep. How he plans to go after Clinton in the debates: “I can talk about her deleting emails after she gets a subpoena from Congress and lots of other things. I mean I can talk about her record which is a disaster. I can talk about all she’s done to help ISIS become the terror that they’ve become and I will be doing that. So I mean we’re going to go back and forth and she’s got a lot of baggage. I’ll tell you what.” On going after Bill Clinton’s infidelities: “I don’t think I’m looking to do that Bill. I don’t know what I’m going to do that exactly. It depends on what level she hits you with, if she’s fair, if it’s unfair, but certainly I’m not looking to do that.” His view of Lester Holt: “Lester is a professional, but we’ll see what happens … By the way, Lester is a Democrat. It’s a phony system. They are all Democrats. It’s a very unfair system. I’ve worked pretty well within the system.” Video of full interview http://bit.ly/2cNUAVf\n-- CLINTON on “The Tonight Show” with Jimmy Fallon: Hillary Clinton on her health http://bit.ly/2cFmFCe … On “breaking barriers, fighting bigotry and debating Trump” http://bit.ly/2czVUKc … On “balancing seriousness with positivity as a woman” http://bit.ly/2cPZqQm\nPLAYBOOKING AND FOOD TRUCKING -- Want free breakfast? Nice. We want to give you some. Anna, Daniel and Jake have taken over a food truck for the week, and will be popping up at central locations Wednesday, Thursday and Friday to feed and caffeinate you. Why? Why not. Stay tuned for exact locations. #playbookEATS\nFROM BROOKLYN -- HOW ROBBY MOOK SAYS CLINTON CAN WIN -- by Gabe Debenedetti in New York: “‘Here’s the story that no poll can tell: Hillary Clinton has many paths to 270 electoral votes, while Donald Trump has very few. Hillary is nearly certain to win 16 ‘ blue' states, including Washington D.C., which will garner her 191 electoral votes,” writes Mook in the nearly 2,000-word memo that was blasted out [to donors, supporters and volunteers] in the early evening, and which was obtained by POLITICO. ‘If we add the five states that FiveThirtyEight.com gives Hillary a 70% or greater chance of winning (Michigan, Minnesota, Pennsylvania, Virginia, and Wisconsin), Hillary only needs 10 more electoral votes.’ ...\n“‘Put a different way , of these battleground states, Hillary can win just one (Florida, Ohio, or North Carolina) and win the presidency, which means the six additional states would only add more electoral votes to her total,” he writes. “Donald Trump, on the other hand, must win six of these seven states, including Florida, North Carolina, and Ohio — none of which he can lose.’” http://politi.co/2cjjFVC\nADELSON PONIES UP -- “ Adelson to spend at least $45 million on 2016 races in boost for GOP ,” by CNN’s Teddy Schleifer: “The billionaire on Tuesday will disclose having given $20 million to the Senate Leadership Fund, a super PAC linked to George W. Bush hand Karl Rove and Senate Majority Leader Mitch McConnell. A check of a similar size is expected to go to the Congressional Leadership Fund, a similar super PAC focused on the House of Representatives. And to back Trump, a donation of at least $5 million is likely headed to the political operation helmed by the Ricketts family, who are expected to finally spend their fortunes on Trump as well. Other cash may be routed to Ricketts-led nonprofit groups that are not required to disclose the funders.” http://cnn.it/2czQezN\n-- “Schumer transfers millions to Dems in bid for Senate takeover,” by Burgess Everett and John Bresnahan: “The New York senator is transferring $1 million to Senate Democrats’ campaign arm on Tuesday. He’s also given $3.2 million to state parties over the past week, Democratic sources said. Earlier this month, Schumer shifted an additional $2 million from his campaign war chest to the [DSCC]. Altogether in September, Schumer has transferred $6.2 million of the $27 million he has on hand to help Democratic hopefuls.” http://politi.co/2cVJhfO\nA message from BP: Safety is training in virtual reality onshore…\nso we can drill safely offshore.\nBP teams train – and retrain – in state-of-the art simulators. Take 15 seconds to experience our drill simulator\nH.W. FOR HRC -- FROM DARREN SAMUELSOHN : “[Former President George H.W.] Bush, 92, had intended to stay silent on the White House race between Clinton and Donald Trump, a sign in and of itself of his distaste for the GOP nominee. But his preference for the wife of his own successor, President Bill Clinton, nonetheless became known to a wider audience thanks to Kathleen Hartington Kennedy Townsend, the former Maryland lieutenant governor and daughter of the late Robert F. Kennedy. In a telephone interview, Townsend said she met with the former president in Maine earlier today, where she said he made his preference known that he was voting for a Democrat. ‘That’s what he said,’ she told POLITICO.\n“Asked about Townsend’s [Facebook] post , George H.W. Bush spokesman Jim McGrath in an email replied, ‘The vote President Bush will cast as a private citizen in some 50 days will be just that: a private vote cast in some 50 days. He is not commenting on the presidential race in the interim.’” http://politi.co/2cjhwJX\n-- QUICK THOUGHT : This is a man who is not only a former president, but a former Republican member of Congress, former chairman of the RNC, former ambassador under Gerald Ford and Richard Nixon, former CIA director under Ford and Ronald Reagan’s vice president. This should resonate with many on-the-fence Republicans.\nYOU’RE INVITED! -- Join us for Playbook Cocktails TOMORROW evening with civil rights icon, Rep. John Lewis (D-Ga.)! Our conversation comes during the opening week of the Smithsonian’s National Museum of African American History and Culture. We’ll talk about civil rights and explore Lewis’s extraordinary life. Doors open at 5:30 p.m. The W Hotel, 515 15th Street, NW. RSVP here http://bit.ly/2cvXEEd\nTERROR WATCH -- “Ahmad Rahami: Fixture in Family’s Business and, Lately, a ‘Completely Different Person,’” by NYT’s N.R. Kleinfeld: “He presided behind the counter of a storefront New Jersey fried chicken restaurant, making his home with his family in an apartment above it. To some of his friends, Ahmad Khan Rahami was known as Mad, an abridgment of his name rather than a suggestion of his manner, and they liked that he gave them free food when they were short on money. Beyond that, his other known obsession was souped-up Honda Civics that he liked to race. In recent years, though, some friends noticed a marked change in his personality and religious devotion after what they believed was a trip to Afghanistan, where he and his relatives are from. In fact ... Mr. Rahami had actually traveled to Pakistan, for three months in 2011 and, most recently, to Quetta, for nearly a year, where he stayed with family, returning to the United States in March 2014. While there, he is believed to have married.” http://nyti.ms/2clEhSa\nDRUDGE banner, “ISIS AMONG US” ... TAB COVERS -- N.Y. POST : “HE HATES AMERICA -- Bomber ‘hates gays, hates military, hates culture’” http://nyp.st/2algwpl … N.Y. DAILY NEWS : “MARTYR DUMB” http://nydn.us/2b6YE1k\nPOLLS DU JOUR -- HILLARY CLINTON 50, DONALD TRUMP 45 in NBC News/Survey Monkey Weekly Election Tracking Poll (online) http://nbcnews.to/2czVXp6 … MONMOUTH: GEORGIA -- Donald Trump 43, Hillary Clinton 41. http://bit.ly/2cqVvvX\nSIREN -- AP: “524k Ohio absentee ballots requested, 40k more than 2012”: “State officials say more than 524,000 absentee ballots have been requested in Ohio this year -- an increase of 40,000 compared to the same period during the 2012 presidential election. Secretary of State Jon Husted says nearly 12,000 of the absentee ballot applications are from military and overseas voters. The rest are from in-state residents.” http://apne.ws/2cNET0i\nSKITTLES RESPONDS -- via the Hollywood Reporter’s Seth Abramovitch -- “Skittles are candy. Refugees are people. We don’t feel it’s an appropriate analogy. We will respectfully refrain from further commentary as anything we say could be misinterpreted as marketing.”\nPELOSI’S CASH DASH -- House Minority Leader Nancy Pelosi is continuing her quest to fill the DCCC’s coffers with a luncheon Tuesday in New York City with Vice President Joe Biden. The push follows a bicoastal swing over the weekend that began with a trip to New York City followed by visits to Hartford, San Francisco, Sacramento and then Las Vegas. The aggressive dollar dash comes as the DCCC announced Monday it had outraised the NRCC by nearly $4 million in August, pulling in $11 million.\n-- GABE FLEISHER , the 14-year-old proprietor of “Wake Up To Politics” ( http://bit.ly/2d7Iav5 ), sends over an image of the “dramatic subject lines” he’s gotten from the DCCC in the last few days. http://bit.ly/2clJ7Pn\nHAPPENING TODAY -- Donald Trump is in High Point, North Carolina, at noon, and Kenansville, North Carolina, at the Duplin County Events Center for a 5 p.m. rally. Tim Kaine is in Reno, Nevada.\nBARACK OBAMA is addressing the U.N. General Assembly in the morning. He’ll then hold a meeting with Nigerian President Muhammadu Buhari, and calls with UN General Assembly President Peter Thomson of Fiji and UN Secretary General Ban Ki-Moon. Moon hosts Obama for lunch, and then Obama will attend a CEO roundtable, and a refugee summit. In the evening, Obama will speak at a reception for foreign heads of delegations to the U.N. He’s sleeping in New York.\nPlaybook Reads PHOTO DU JOUR: Ahmad Khan Rahami is taken into custody after a shootout with police Monday in Linden, N.J. Rahami was wanted for questioning in the bombings that rocked the Chelsea neighborhood of New York and the New Jersey shore town of Seaside Park over the weekend. | Nicolaus Czarnecki/Boston Herald via AP\nPOTUS on the Pittsburgh Post-Gazette op-ed page, “Self-driving, yes, but also safe”: “[M]y administration is rolling out new rules of the road for automated vehicles – guidance that the manufacturers developing self-driving cars should follow to keep us safe. ... [T]echnology isn’t just about the latest gadget or app – it’s about making people’s lives better. That’s going to be the focus of the first-ever White House Frontiers Conference on Oct. 13. And what better place to hold it than Pittsburgh – a city that has harnessed innovation to redefine itself as a center for technology, health care and education.” http://bit.ly/2cNFsqO\nCOMING TODAY -- “The Obama administration Tuesday will unveil its long-awaited guidance update for self-driving vehicles, outlining its expectations for automakers and tech companies, some of which are already bringing those cars to the road.” http://politi.co/2cElVgE\nBEING THERE -- “Millennials Go Mild For Hillary,” by Michael Grunwald in Philly: “In interviews at the event, many of her millennial supporters, especially the former Sanders revolutionaries, talked about her in the could-be-worse tone they might use to describe a boring but socially appropriate romantic partner. They used words like ‘capable,’ ‘well-informed,’ ‘responsible,’ and ‘qualified.’ They dutifully praised her positions on issues like abortion, student debt, mass incarceration, and climate change, while emphasizing the importance of stopping Trump and his inflammatory rhetoric. But most of them did not sound particularly inspired.” http://politi.co/2cUY0Yl\nTRUMP’S MONEY PLAY -- “Gold cards and red hats: A Trumpian approach to fundraising,” by AP’s Julie Bykowicz and Jeff Horwitz: “Donald Trump is underwriting his presidential bid by selling the Donald Trump lifestyle — and campaign finance records show it is working. For the low price of $25, you can snag a Trump Gold Card emblazoned with your name or join a campaign ‘Board of Directors’ that comes with a personalized certificate. For $30, there’s Trump’s signature hats — billed as ‘the most popular product in America.’ Supporters can elevate themselves to ‘big league’ by ponying up $184 for a signed, ‘now out of print’ copy of Trump’s book, ‘The Art of the Deal.’” http://apne.ws/2d16COf\nBERNIE SANDERS on the cover of The Nation, interviewed by Katrina vanden Heuvel and John Nichols: “The Democrats have got to open the door to young people. Welcome them in and understand that it will be messy, that many young people are not professional politicians. The Democratic Party is going to have to adjust itself to their reality, rather than force young people to be adjusted to the Democratic leadership’s reality.” http://bit.ly/2cjh9yM\nHILLARY’s open letter to Wells Fargo customers in the wake of the major scandal at the bank: “Executives should be held individually accountable when rampant illegal activity happens on their watch. Their compensation should take a hit if their companies pay major fines. And they must face appropriate legal consequences if they break the law.” The letter http://hrc.io/2cr2Rzs ... The latest on Wells Fargo http://nyti.ms/2cYLQMJ\n*", "external_links": ["http://nbcnews.to/2czVXp6", "http://politi.co/2cjjFVC", "http://nyti.ms/2cYLQMJ", "http://bit.ly/2cFmFCe", "http://nydn.us/2b6YE1k", "http://politi.co/2cUY0Yl", "http://apne.ws/2cNET0i", "http://bit.ly/2cNFsqO", "http://bit.ly/2clJ7Pn", "http://apne.ws/2d16COf", "http://hrc.io/2cr2Rzs", "http://politi.co/2cjhwJX", "http://bit.ly/2cPZqQm", "http://cnn.it/2czQezN", "https://ad.doubleclick.net/ddm/clk/310696006;138377355;i", "http://nyti.ms/2clEhSa", "http://bit.ly/2d7Iav5", "http://nyp.st/2algwpl", "http://bit.ly/2cqVvvX", "http://bit.ly/2czVUKc", "http://bit.ly/2cvXEEd", "http://bit.ly/2cjh9yM", "http://politi.co/2cVJhfO", "http://politi.co/2cElVgE", "http://bit.ly/2cNUAVf"], "published": "2016-09-20T14:55:00.000+03:00", "crawled": "2016-09-20T14:01:47.948+03:00", "highlightTitle": ""}