{"organizations": [], "uuid": "5db44c1a6b4c38675d37c879694b0fcb3c2bb844", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 108, "shares": 108, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.buzzfeed.com", "main_image": "https://img.buzzfeed.com/buzzfeed-static/static/2016-09/28/13/campaign_images/buzzfeed-prod-fastlane03/corbyn-pledges-to-clamp-down-on-arms-sales-to-sau-2-2593-1475083416-5_dblbig.jpg", "site_section": "https://news.google.co.il/news/feeds?pz=1&cf=all&ned=en_il&hl=en&topic=awkl&output=rss", "section_title": "Arab World - Google News", "url": "https://www.buzzfeed.com/jimwaterson/corbyn-pledges-to-clamp-down-on-arms-sales-to-saudi-arabia", "country": "US", "domain_rank": 137, "title": "Corbyn Pledges To Clamp Down On Arms Sales To Saudi Arabia - BuzzFeed News", "performance_score": 1, "site": "buzzfeed.com", "participants_count": 0, "title_full": "Corbyn Pledges To Clamp Down On Arms Sales To Saudi Arabia - BuzzFeed News", "spam_score": 0.0, "site_type": "news", "published": "2016-09-29T01:03:00.000+03:00", "replies_count": 0, "uuid": "5db44c1a6b4c38675d37c879694b0fcb3c2bb844"}, "author": "", "url": "https://www.buzzfeed.com/jimwaterson/corbyn-pledges-to-clamp-down-on-arms-sales-to-saudi-arabia", "ord_in_thread": 0, "title": "Corbyn Pledges To Clamp Down On Arms Sales To Saudi Arabia - BuzzFeed News", "locations": [], "entities": {"persons": [{"name": "corbyn", "sentiment": "negative"}, {"name": "christopher furlong", "sentiment": "negative"}, {"name": "jeremy corbyn", "sentiment": "negative"}, {"name": "médecins sans frontières", "sentiment": "none"}, {"name": "saleh al-obeidi", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "jim waterson", "sentiment": "none"}], "locations": [{"name": "saudi arabia", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "sharija", "sentiment": "none"}, {"name": "yemen", "sentiment": "none"}, {"name": "syria", "sentiment": "none"}, {"name": "liverpool", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "iraq", "sentiment": "none"}, {"name": "middle east", "sentiment": "none"}], "organizations": [{"name": "labour", "sentiment": "none"}, {"name": "buzzfeed uk", "sentiment": "none"}, {"name": "buzzfeed news", "sentiment": "none"}, {"name": "united nations", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Christopher Furlong / Getty Images ID: 9701729 \nJeremy Corbyn has pledged to make it much harder for British companies to export arms to countries accused of human rights violations, as part of a new approach to foreign policy that puts “peace and justice at the heart of foreign policy”. \nThe Labour leader said that if he becomes prime minister he will crack down on arms sales the moment that credible accusations of war crimes are made. \n“Britain continues to sell arms to Saudi Arabia, a country that the United Nations says is committing repeated violations of international humanitarian law and war crimes in Yemen, just as we have seen taking place in Syria,” Corbyn told the Labour party’s annual conference in Liverpool. \n“Under a Labour government, when there are credible reports of human rights abuses or war crimes being committed, British arms sales will be suspended, starting with Saudi Arabia.” \nTheresa May’s Conservative government has so far rejected calls to end British arms exports to Saudi Arabia, a key UK ally in the Middle East, especially for intelligence on extremism. \nBut the kingdom has faced increased criticism for involvement in the ongoing conflict in Yemen, where it faces multiple accusations of human rights abuses and the bombing of hospitals run by Médecins Sans Frontières. Yemeni pro-government forces fire towards Huthi rebels positioned in the Sharija region, 25 September 2016. Saleh Al-obeidi / AFP / Getty Images ID: 9701650 \nBritish companies make substantial sums of money selling arms to Saudi Arabia, with more than £1 billion worth of bombs exported from the UK to the country during one three-month period during 2015. \nRecent parliamentary inquiries into arms sales to Saudi Arabia ended in chaos as MPs released conflicting reports , with two committees concluding sales should be suspended pending an investigation and another concluding the matter should be left to the courts. \nThe prime minister has insisted that maintaining a strong relationship with Saudi Arabia is good for Britain’s standing in the world and has so far refused to cancel export licenses without clearer evidence that UK arms are involved in the human rights abuses. \nCorbyn told the audience that this was not good enough. He said a Labour government would go a step further and stop British arms exports earlier, whenever there are “credible reports” of war crimes. \nHis intervention came during a speech in which he received a standing ovation for apologising for Labour’s role in the invasion of Iraq and said the current refugee crisis was “fuelled by wars across the Middle East” that have been exacerbated by “repeated military interventions by British governments”. \nSome Labour MPs raised concerns that restricting arms sales would hit jobs in the British arms industry, although a spokesperson for the Labour leader told BuzzFeed News trade unions had been consulted on the issue and that Labour was simply committing to enforcing the existing rules. \n“That’s always been an issue in relation to arms sales,” they said. “A lot of jobs depend on the arms industry. In a way our position is not different from that of the British government in principle. The difference is over the interpretation of the existing evidence.” \nThe spokesperson said the arms sale ban would apply to any country where there is “clear evidence of war crimes”. This “included Russia”, they confirmed. Jim Waterson is politics editor at BuzzFeed UK and is based in London. Contact Jim Waterson at .", "external_links": [], "published": "2016-09-29T01:03:00.000+03:00", "crawled": "2016-09-28T20:26:38.152+03:00", "highlightTitle": ""}