{"organizations": [], "uuid": "7e0dbac621470df3b61e0a6c93836503b77ab7d7", "thread": {"social": {"gplus": {"shares": 7}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 970, "shares": 970, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nbcnews.com", "main_image": "http://media4.s-nbcnews.com/j/newscms/2016_36/1700741/230502_refugees_trapped_in_greece_july_2016_30f4f576ac1fea90c01c3a56eb7467ff.nbcnews-fp-1200-800.jpg", "site_section": "", "section_title": "", "url": "http://www.nbcnews.com/storyline/syrias-suffering-families/two-syrians-wheelchairs-make-remarkable-escape-isis-n644851", "country": "US", "domain_rank": 478, "title": "Two Syrians in Wheelchairs Make Remarkable Escape From ISIS - NBC News", "performance_score": 9, "site": "nbcnews.com", "participants_count": 0, "title_full": "Two Syrians in Wheelchairs Make Remarkable Escape From ISIS - NBC News", "spam_score": 0.218, "site_type": "news", "published": "2016-09-09T03:25:00.000+03:00", "replies_count": 0, "uuid": "7e0dbac621470df3b61e0a6c93836503b77ab7d7"}, "author": "Natasha Bertrand", "url": "http://www.nbcnews.com/storyline/syrias-suffering-families/two-syrians-wheelchairs-make-remarkable-escape-isis-n644851", "ord_in_thread": 0, "title": "Two Syrians in Wheelchairs Make Remarkable Escape From ISIS - NBC News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Sep 8 2016, 2:27 pm ET Two Syrians in Wheelchairs Make Remarkable Escape From ISIS by Natasha Bertrand advertisement \nTwo Syrian siblings with muscular dystrophy managed to escape the advance of ISIS earlier this year despite being confined to wheelchairs for much of their harrowing journey through Iraq, Turkey, and Greece, according to Amnesty International . \nThe human rights organization released footage of the brother and sister, Alan Mohammad, 30, and Gyan, 28, making the daring escape. They only succeeded only on their fourth attempt, having been shot at by Turkish police along the Turkish-Syrian border during the previous times they tried to flee. \"For normal people, it is very difficult. But for disabled people, it's like a miracle to cross the border.\" \n\"For normal people, it is very difficult [to cross the border],\" Alan told Amnesty International in an interview. \"But for disabled people, it's like a miracle to cross the border.\" \nThe video shows Alan — who said he worked as a teacher in Syria before fleeing — being strapped to a horse after he and his family reach the top of a mountain in Iraqi Kurdistan. They had been living nearby for just more than a year after being denied entry into Turkey. The family was originally from the Syrian town of Al-Hasakah. advertisement \nHe told Amnesty that his sister, also a teacher, was strapped to a horse as well. \nAfter hearing reports of ISIS movement within Iraqi Kurdistan, Alan and his family decided it was no longer safe there. \nRelated: Hungarian Camerawoman Who Kicked Syrian Refugees Is Charged \nThey finally made it into Turkey, where they paid smugglers for a place on a small boat to the Greek island of Chios. \n\"The journey took about four hours,\" Alan said. \"Every time I looked around, I saw babies, children crying inside the boat. It was very difficult.\" Haunting images humanize Syrian civil war 4:41 autoplay autoplay Copy this code to your website or blog <iframe src=\"http://www.nbcnews.com/widget/video-embed/757649475850\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen></iframe> \nThe Syrian civil war, now entering its sixth year, has spawned the worst refugee crisis since World War II. In 2016 alone, 278,327 migrants fleeing primarily from Africa and the Middle East arrived in the Mediterranean, according to the Missing Migrants Project . \nAs of Sept. 7, at least 3,198 migrants had died trying to cross the sea in overcrowded boats. In May, 700 people died over the course of three days when three separate boats sank traveling from Libya to Italy. advertisement \nAlan and his family made it to mainland Greece on March 12. They were taken to Ritsona refugee camp, where they have lived for the past six months. \n\"The best time of day, for me, is when I am teaching the children. I decided to help the kids here because ... they aren't doing any important things here — just playing, without learning,\" Alan said. \"So I decided to teach them English.\" \nRelated: UNICEF Report Finds Half of All Refugees Are Now Children \nPrior to leaving Iraq, Alan had heard reports that Europe was opening its borders to refugees. In the wake of several terror attacks in France, Germany, and Brussels, however, many countries in the region have been under pressure to impose tighter restrictions on asylum-seekers, out of fear that the Islamic State may try to sneak in operatives posing as refugees. \n\"This is a remarkable story that shows strength and resilience,\" Amnesty spokeswoman Monica Costa Riba said in a recorded statement. \"But also it shows the failure of the European states to offer safety to these people who are fleeing persecution and war in their countries.\" \nStill, Alan was hopeful about one day making it to Germany, where he said his father and sister \"live a normal life.\" \n\"They have a family, they have a job,\" Alan said. \"This is my dream.\" Play ", "external_links": [], "published": "2016-09-09T03:25:00.000+03:00", "crawled": "2016-09-08T22:26:52.395+03:00", "highlightTitle": ""}