{"organizations": [], "uuid": "7ed7e91add957d70afe30a6a4d754cb6ef59e74c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nbcnews.com", "main_image": "http://media1.s-nbcnews.com/j/newscms/2016_37/1707646/160913-trump_lid_0913-1730_64a8daeb4600fc9e1ba7f1781cf3927a.nbcnews-fp-1200-800.jpg", "site_section": "", "section_title": "", "url": "http://www.nbcnews.com/politics/2016-election/trump-uses-ny-nj-bombings-bolster-case-immigration-vetting-n650991", "country": "US", "domain_rank": 478, "title": "Trump Uses NY/NJ Bombings to Bolster Case For Immigration Vetting - NBC News", "performance_score": 0, "site": "nbcnews.com", "participants_count": 0, "title_full": "Trump Uses NY/NJ Bombings to Bolster Case For Immigration Vetting - NBC News", "spam_score": 0.163, "site_type": "news", "published": "2016-09-19T08:00:00.000+03:00", "replies_count": 0, "uuid": "7ed7e91add957d70afe30a6a4d754cb6ef59e74c"}, "author": "Ali Vitali", "url": "http://www.nbcnews.com/politics/2016-election/trump-uses-ny-nj-bombings-bolster-case-immigration-vetting-n650991", "ord_in_thread": 0, "title": "Trump Uses NY/NJ Bombings to Bolster Case For Immigration Vetting - NBC News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Sep 19 2016, 7:55 pm ET Trump Uses NY/NJ Bombings to Bolster Case For Immigration Vetting by Ali Vitali Clinton, Trump Rehash Stark Differences on ISIS Following Bombings 1:19 autoplay autoplay Copy this code to your website or blog <iframe src=\"http://www.nbcnews.com/widget/video-embed/768934979642\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen></iframe> \nESTERO, FL — Donald Trump on Monday used the New York and New Jersey bombings as further evidence to support his plans for an immigration ban from certain regions of the world, an ideological test for immigrants to the United States, and to prove that Hillary Clinton is unfit to sit in the Oval Office. \n\"Immigration security is national security,\" Trump boomed to a boisterous crowd of 8,000-plus. \nAttacks such as those seen over the weekend in N.Y., N.J., and Minnesota are \"made possible because of our open immigration system, which fails to properly vet and screen individuals or families coming into our country,\" Trump said, with added caution that America must be \"careful.\" \nRelated: Trump Grabs Spotlight Again, In All the Negative Ways \nTrump celebrated catching bombing suspect Ahmad Khan Rahami, who he called an \"evil thug,\" and seemed to push for him to be tried as an enemy combatant. \"We must also use whatever lawful methods are available to obtain information from the apprehended suspect to get information before it's no longer timely,\" Trump said. \"And Congress should pass measures to ensure that foreign enemy combatants are treated as such. These are enemies. These are combatants.\" \nThis statement puts Trump in rare agreement with Sen. Lindsay Graham, who also pushed for the suspect to be tried as an enemy combatant. \"Holding Rahami as an enemy combatant also allows us to question him about what attacks may follow in the future,\" Graham said in a statement. \"That should be our focus, not a future domestic criminal trial that may take years to complete.\" \nTrump further lamented \"the bad part now\" that we've captured Rahami is that he'll have \"amazing hospitalization,\" some of the best doctors, and probably \"even have room service knowing the way our country is.\" Adding to the list, Trump surmised the suspect would get an \"outstanding lawyer\" and a lesser punishment in court than \"what it once would have been.\" Trump Bemoans Bombing Suspect's 'Amazing Hospitalization' 2:00 autoplay autoplay Copy this code to your website or blog <iframe src=\"http://www.nbcnews.com/widget/video-embed/768920643848\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen></iframe> \nBut Trump also used the bombings as an opportunity to further cast Clinton as unelectable and unfit for the office. In one of his most passionate and unrelenting speeches targeting the former secretary of state over her foreign policy and the rise of ISIS, the GOP nominee said Clinton is \"not the right person to solve a problem that largely her and Obama gave us!\" \nTo a cheering crowd, he said Clinton's policies \"disqualify her from being a credible presidential candidate, in my opinion. What do I know?\" Trump questioned, before being affirmed by cheers from the crowd when he asked, \"Does everybody agree with me or not?\" \nDespite a recycled use of many of his attack lines, Trump's blows came off more effective and impassioned cast in the new light of these latest attacks. He repeatedly lambasted Clinton, and President Obama, for their reluctance to use the words \"radical Islamic terror,\" a description Trump feels is a key piece of his strategy to combat ISIS. \"Anyone who cannot name our enemy, is not fit to lead this country,\" he said. advertisement \n\"She talks tougher about my supporters than she does about Islamic terrorists,\" Trump quipped, referencing Clinton's comments calling Trump supporters \"deplorables.\" Trying a new tactic on these comments, Trump described Clinton as more willing to speak harshly of his supporters — \"hardworking Americans\" — than she is of foreign threats and terrorists. \"Has she ever talked that way about radical Islamic terror?\" Trump asked to a resounding \"no\" from the arena. \nTrump's own plan for immigration seeks to implement an ideological test that would admit only people who \"love our country\" and \"our people.\" The GOP nominee has proposed the need for \"extreme vetting\" of immigrants and refugees into the United States and said he plans to temporarily ban Muslims, as well as people from countries where adequate vets cannot be performed and where there is a history of terrorism. Vetting is impossible if ideology is not also examined, he said Monday. The recent bombings only add to the list of international and domestic terror acts that Trump uses to bolster the argument for his policies. Ali Vitali ", "external_links": [], "published": "2016-09-19T08:00:00.000+03:00", "crawled": "2016-09-20T03:43:50.872+03:00", "highlightTitle": ""}