{"organizations": [], "uuid": "9852ed0ee967fdb8c3dc2f172870a56be4ca1f0e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/694940094001_5119256972001_cdea5a5e-29ef-449c-9739-c556cbccbe01.jpg", "site_section": "http://www.foxnews.com/hannity/", "section_title": "Hannity | Sean Hannity | Fox News", "url": "http://www.foxnews.com/transcript/2016/09/09/aj-delgado-clinton-is-dangerous-reckless-candidate-gorka-americans-in-more/", "country": "IT", "domain_rank": 185, "title": "A.J. Delgado: Clinton is the 'dangerous, reckless' candidate; Gorka: Americans in more danger than they were before 9/11", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "A.J. Delgado: Clinton is the 'dangerous, reckless' candidate; Gorka: Americans in more danger than they were before 9/11 | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2016-09-09T03:00:00.000+03:00", "replies_count": 0, "uuid": "9852ed0ee967fdb8c3dc2f172870a56be4ca1f0e"}, "author": "FoxNews.com", "url": "http://www.foxnews.com/transcript/2016/09/09/aj-delgado-clinton-is-dangerous-reckless-candidate-gorka-americans-in-more/", "ord_in_thread": 0, "title": "A.J. Delgado: Clinton is the 'dangerous, reckless' candidate; Gorka: Americans in more danger than they were before 9/11", "locations": [], "entities": {"persons": [{"name": "a.j. delgado", "sentiment": "negative"}, {"name": "gorka", "sentiment": "negative"}, {"name": "clinton", "sentiment": "negative"}, {"name": "sean hannity", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "negative"}, {"name": "christ", "sentiment": "none"}, {"name": "h. clinton", "sentiment": "none"}, {"name": "bush", "sentiment": "none"}, {"name": "bill clinton", "sentiment": "none"}, {"name": "jonah goldberg", "sentiment": "none"}, {"name": "falwell", "sentiment": "none"}, {"name": "kasich", "sentiment": "none"}, {"name": "darrell scott", "sentiment": "none"}, {"name": "john kerry", "sentiment": "none"}, {"name": "glenn becks", "sentiment": "none"}, {"name": "lindsey graham", "sentiment": "none"}, {"name": "jon voight", "sentiment": "none"}, {"name": "matt", "sentiment": "none"}, {"name": "voight", "sentiment": "none"}, {"name": "ronald reagan", "sentiment": "none"}, {"name": "a.j.", "sentiment": "none"}, {"name": "ted cruz", "sentiment": "none"}, {"name": "clintons", "sentiment": "none"}, {"name": "sam", "sentiment": "none"}, {"name": "doug schoen", "sentiment": "none"}, {"name": "jeffress", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "sebastian gorka", "sentiment": "none"}, {"name": "scott", "sentiment": "none"}, {"name": "deneen", "sentiment": "none"}, {"name": "chelsea clinton", "sentiment": "none"}, {"name": "gadhafi", "sentiment": "none"}, {"name": "matt lauer", "sentiment": "none"}, {"name": "obama", "sentiment": "none"}, {"name": "jerry falwell", "sentiment": "none"}, {"name": "deneen borelli", "sentiment": "none"}, {"name": "schoen", "sentiment": "none"}, {"name": "robert byrd", "sentiment": "none"}, {"name": "b. clinton", "sentiment": "none"}, {"name": "robert jeffress", "sentiment": "none"}, {"name": "deneen borelli", "sentiment": "none"}, {"name": "doug schoen", "sentiment": "none"}, {"name": "lauer", "sentiment": "none"}, {"name": "hillary", "sentiment": "none"}, {"name": "robert \"ku klux", "sentiment": "none"}, {"name": "a.j", "sentiment": "none"}, {"name": "mercedes schlapp", "sentiment": "none"}, {"name": "j. william fulbright bill clinton", "sentiment": "none"}, {"name": "jeffress", "sentiment": "none"}, {"name": "darrell scott", "sentiment": "none"}, {"name": "robert jeffress", "sentiment": "none"}, {"name": "joe concha", "sentiment": "none"}, {"name": "joe", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "chelsea", "sentiment": "none"}, {"name": "mike huckabee", "sentiment": "none"}, {"name": "joe concha", "sentiment": "none"}, {"name": "jeffres", "sentiment": "none"}, {"name": "borelli", "sentiment": "none"}, {"name": "jon voight", "sentiment": "none"}, {"name": "hannity", "sentiment": "none"}, {"name": "fox", "sentiment": "none"}, {"name": "scott", "sentiment": "none"}, {"name": "reagan", "sentiment": "none"}, {"name": "doug", "sentiment": "none"}, {"name": "putin", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "jerry falwell", "sentiment": "none"}, {"name": "sebastian gorka", "sentiment": "none"}, {"name": "falwell", "sentiment": "none"}, {"name": "jesus", "sentiment": "none"}, {"name": "byrd", "sentiment": "none"}, {"name": "delgado", "sentiment": "none"}, {"name": "sean", "sentiment": "none"}, {"name": "bill", "sentiment": "none"}, {"name": "neil cavuto", "sentiment": "none"}, {"name": "reince priebus", "sentiment": "none"}, {"name": "schlapp", "sentiment": "none"}, {"name": "bill clinton", "sentiment": "none"}], "locations": [{"name": "united states", "sentiment": "none"}, {"name": "newsbreak", "sentiment": "none"}, {"name": "the hill", "sentiment": "none"}, {"name": "syria", "sentiment": "none"}, {"name": "orlando", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}, {"name": "iraq", "sentiment": "none"}, {"name": "d.c.", "sentiment": "none"}, {"name": "baton rouge", "sentiment": "none"}, {"name": "detroit", "sentiment": "none"}, {"name": "hannity", "sentiment": "none"}, {"name": "chattanooga", "sentiment": "none"}, {"name": "wisconsin", "sentiment": "none"}, {"name": "roanoke", "sentiment": "none"}, {"name": "west virginia", "sentiment": "none"}, {"name": "ohio", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "virginia", "sentiment": "none"}, {"name": "fort hood", "sentiment": "none"}, {"name": "libya", "sentiment": "none"}, {"name": "hollywood", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "reince priebus", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}, {"name": "belgium", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}, {"name": "north carolina", "sentiment": "none"}, {"name": "san bernardino", "sentiment": "none"}, {"name": "kentucky", "sentiment": "none"}, {"name": "michigan", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}, {"name": "pennsylvania", "sentiment": "none"}, {"name": "sweden", "sentiment": "none"}], "organizations": [{"name": "americans united for separation of church and state", "sentiment": "none"}, {"name": "fox news", "sentiment": "none"}, {"name": "fox news", "sentiment": "none"}, {"name": "republican party", "sentiment": "none"}, {"name": "cnn", "sentiment": "none"}, {"name": "baton rouge", "sentiment": "none"}, {"name": "clinton foundation", "sentiment": "none"}, {"name": "supreme court", "sentiment": "none"}, {"name": "national counter-terrorism center", "sentiment": "none"}, {"name": "clintons", "sentiment": "none"}, {"name": "nbc", "sentiment": "none"}, {"name": "new york daily news", "sentiment": "none"}, {"name": "liberty university", "sentiment": "none"}, {"name": "nctc", "sentiment": "none"}, {"name": "bloomberg", "sentiment": "none"}, {"name": "quinnipiac", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "mitt romney", "sentiment": "none"}, {"name": "chelsea", "sentiment": "none"}, {"name": "mercedes", "sentiment": "none"}, {"name": "wall street journal", "sentiment": "none"}, {"name": "fbi", "sentiment": "none"}, {"name": "isis", "sentiment": "none"}, {"name": "rnc", "sentiment": "none"}, {"name": "harvard", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "obamacare", "sentiment": "none"}, {"name": "air force", "sentiment": "none"}, {"name": "google", "sentiment": "none"}, {"name": "ap", "sentiment": "none"}, {"name": "national diversity coalition", "sentiment": "none"}, {"name": "democratic party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Published September 09, 9,\nSEAN HANNITY, HOST: And welcome to \"Hannity.\" So Donald Trump -- he caps off another very good week on the campaign trail with a rally in the key swing state of Florida. Here are some of those highlights.\n(BEGIN VIDEO CLIP)\nDONALD TRUMP, R-PRESIDENTIAL NOMINEE: There are thousands of people outside that can't get in!\n(CHEERS AND APPLAUSE)\nTRUMP: Fantastic. Way to go. Thank you. Thank you, everybody.\nIt is so great to be back in Florida, my second home. You know it's my second home.\n(CHEERS AND APPLAUSE)\nTRUMP: Thank you. Thousands of people outside cannot get in. This is what's happening. It's a movement like they have never seen before! Decades of political failure and corruption will come swiftly to an end, and a new American future will begin November 8th.\n(CHEERS AND APPLAUSE)\nTRUMP: The citizens of this country will be in charge once more, and it's about time! The special interests have had their day. That chapter in our history is closing. We're going to bring back victory. We're going to bring back common sense. We're going to bring back something that the country has not had in a long, long time. We're going to start winning again.\nThe history book is closing on the failed politicians of yesterday. A new chapter is beginning, and this chapter will be authored by you, the American people. Not me, you.\n(CHEERS AND APPLAUSE)\nTRUMP: This will be your time. You will be running the show. This is a movement like they've never seen. The show is beginning. Hillary Clinton-- and you can see that from those e-mails...\n(BOOS)\nTRUMP: …is a very dishonest candidate of the past! Ours is the campaign of the future. In this future, we're going to pursue new trade policies that put American workers first, and we're going to keep our jobs in our country! We're not going to let them take our jobs anymore, folks. We're not going to let it happen.\nIt's been happening long enough. And the reason they don't do anything about it is because the special interests and the donors control our politicians, and they control Hillary Clinton. And it's never, ever going to happen. Take a look at New York state. When she was the senator from New York state, she campaigned by saying that she was going to bring jobs back to New York state. New York state is a disaster!\n(END VIDEO CLIP)\nHANNITY: Also this week, after whining about how the media is covering her campaign, Hillary Clinton actually held a press conference after, what, 280 days? Take a look.\n D-PRESIDENTIAL NOMINEE: No conversation about our national security would be complete unless we acknowledge that the nominee on the other side promises to do things that will make us less safe. Every day that goes by, this just becomes more and more of a reality television show. It's not -- it's not a serious presidential campaign.\n(END VIDEO CLIP)\nHANNITY: Here with reaction, Trump campaign senior adviser A.J. Delgado, FOX News contributor Mercedes Schlapp, and former Clinton pollster, FOX News contributor Doug Schoen.\nA.J., I start with you. It's interesting to watch that, you know, after Donald Trump goes to Baton Rouge and after Donald Trump has a pretty successful meeting with the Mexican president and after he has a good Value Voters Summit and after he also has a great town hall, looks like Hillary Clinton can't hide any longer. Donald Trump's looking pretty presidential and a lot more energetic.\nA.J. DELGADO, TRUMP CAMPAIGN SENIOR ADVISER: Absolutely. You know, what I find remarkable about that clip is she calls him reckless and dangerous. Sean, can we take a look at her foreign policy for a minute?\nFour prongs here. Iraq -- Hillary was in favor of it. Donald Trump was against it. Check the Neil Cavuto interview from two months before the war. Syria -- she wants us to establish a no-fly zone there. You know what the problem with that is, Sean? The Russians are already flying there, so that means military conflict, potential war with Russia.\nLibya -- she involved us in that, taking down Gadhafi. Donald Trump at the time was critical of it. Check his social media feed. Russia -- while Trump is trying to be, and very much so presidential, diplomatic in extending the hand of not necessarily friendship, but engagement with a dialogue with Russia, just like Ronald Reagan did...\nHANNITY: Let's look at...\nDELGADO: ... these should be our allies in fighting ISIS, she wants us to have conflict with Russia. Four reckless and dangerous positions on foreign policy...\n(CROSSTALK)\nHANNITY: I mean, you know, Oh, sorry, I made a mistake. I sent you to Iraq. Oops. We got to learn from it...\n(CROSSTALK)\nHANNITY: ... 5,000 dead Americans. We got to learn from it, and nobody died in Libya. We got to learn from that, too.\nAll right, let's look at some of the poll numbers. Trump has had a good month now, Hillary under one ethical cloud after another, and it continues. Here's some interesting polling numbers, Doug Schoen. If you look among Hispanics, African-Americans, just look at Trump's number, 19 percent, the black community. He's doing outreach in Detroit. I thought his speech one of the best he ever gave. The Hispanic number, it's very strong.\nDOUG SCHOEN, FOX CONTRIBUTOR: Yes.\nHANNITY: If he gets up to the 90 percent number, 92 percent with Republicans, and he holds these numbers, he's the next president.\nSCHOEN: That is true. The reason Hillary went out today -- and I thought she did a good job today. She made it clear she disagrees with Trump about Putin.\nBut the reason she's out is because she is sinking in the polls. I put that in my Wall Street Journal article. It's a fact. She has to get out. She can't hide. She started today, a good first step. But Sean, this is a very close election.\nHANNITY: All right, two press conferences in a week. I mentioned the one earlier this week. Now I mentioned the one today. She's not exactly getting hard-hitting questions.\nMercedes, we can look Quinnipiac. All right, so it's 47-47 in Florida, no big surprise. In one poll, in the Quinnipiac poll, she's up 47-43, but he's up 3 in another poll, so it's dead even, in North Carolina, 46-45 Trump in Ohio. Look, it's a 5-point race in Pennsylvania, 5-point race in Michigan, 3-point race in Wisconsin.\nHillary's got a lot of defending to do here, and more options seem to be opening up for Trump in terms of the electoral map if this continues, Mercedes.\nMERCEDES SCHLAPP, FOX CONTRIBUTOR: Well, you know, again, Trump has been viewed as the underdog, right, Sean? So then what has Hillary done? Hillary has spent her time on just a one-focus strategy, which is that saying Trump is dangerous. That's not enough because what's happening is, is Trump is being very proactive.\nI mean, just this week, they outlined two separate messages. The beginning of the week, it was national security, America first, with peace through strength, where you would have limited military engagement, as well as a strong military. That's a very strong message. And then at the end of the week, what was he talking about? School choice, something that's a kitchen table issue.\nIt draws in not only African-Americans that would be interested in this issue, Hispanics, but also women, which we saw in the last CNN poll that with married women, he's actually doing better than Hillary Clinton. He's up 54 percent.\n(CROSSTALK)\nHANNITY: ... she's got one ethical issue after another -- Clinton Foundation selling access, selling her soul. And she's got this whole issue -- e-mail -- it does not go away! E-mail might be the very reason she loses.\nBut there's another reason. She's not extremely principled. Listen to Hillary flip-flopping on issues like immigration, and then I'll play her flip-flopping the Sunday after 9/11. It's the 15th anniversary this Sunday. The Sunday after 9/11, she was for racial profiling.\nSo let's show Hillary Clinton in all of her flipping, flopping, flailing. She's like John Kerry voting for the $87 billion and then voting against it. Watch this.\n I do not think that it is either appropriate to give a driver's license to someone who is here undocumented...\nQUESTION: In 2007, you opposed giving driver's licenses to undocumented people. Why?\nH. CLINTON: Well, back then, it was a state-by-state determination, and I'm happy that most states have understood and moved in the right direction.\nQUESTION: Are you going to crack down on the sanctuary states?\nH. CLINTON: No, I'm not, and I'll tell you why. I'm not. I'm not because the reason why a lot of those folks do it -- in New York, why do police officers turn a blind eye?\nQUESTION: Because they want them to report crimes.\nH. CLINTON: They want them to report crimes.\nThe city made a mistake not to deport someone that the federal government strongly felt should be deported. So I have absolutely no support for a city that ignores the strong evidence that should be acted on.\nI voted numerous times when I was a senator to spend money to build a barrier to try to prevent illegal immigrants from coming in.\nQUESTION: You do want a wall, then?\nH. CLINTON: No. We've already...\nQUESTION: You said that.\nH. CLINTON: Well, I voted for border security, and some of it was a fence. I don't think we ever called it a wall.\nQUESTION: Would illegal immigrants be covered under your plan?\nH. CLINTON: Illegal immigrants would not be covered, no. They would not be covered. I want to open up the opportunity for immigrants to be able to buy into the exchanges under the Affordable Care Act.\nEveryone recognizes we have to tighten security. We have to do whatever it takes to keep our people safe.\nQUESTION: Including profiling, Senator?\nH. CLINTON: Well, I think we have to do whatever it takes, Sam. And I believe that -- you know, Tuesday changed everything. Tuesday was a day that America has never, ever had to experience, and I hope to heaven that we never have to again. But we are in a war situation, and we're going to have to do things that people do in times of war.\n(END VIDEO CLIP)\nHANNITY: She was wrong. She did it. Now, let's go through this. She admitted this week her vote to send kids to Iraq was wrong. Well, they died because of her decision! Now she was for profiling, Doug. She was for driver's licenses before she was against driver's licenses, for sanctuary cities, against sanctuary cities, for the wall, against the wall, coverage for health care for illegals, against coverage for health care.\nSCHOEN: Right.\nHANNITY: Then she said, I won't use the word illegal immigrants, even though she's used the word illegal immigrants. Does she have any core at all, or is it just all political expediency?\nSCHOEN: Look, I think what we're seeing here...\nHANNITY: Is there a core?\nSCHOEN: She is playing politics now because she...\nHANNITY: She doesn't have a core!\nSCHOEN: She has three states that matter. That's what matters to her. That's her core, Wisconsin, Michigan, Pennsylvania. She is going to run a tough negative campaign on Trump because...\n(CROSSTALK)\nHANNITY: Trump's a racist, sexist...\nSCHOEN: I don't think he's a racist.\nHANNITY: No, she's going to say it.\nSCHOEN: And I think...\nHANNITY: She'll say it! Her campaign already is.\nSCHOEN: ... (INAUDIBLE) a clear world view that is malleable.\nHANNITY: Oh, so basically, she has no core, A.J. She has no core!\nDELGADO: Malleable? Is that the word, Doug?\nHANNITY: She stands for nothing!\nSCHOEN: Malleable.\nDELGADO: Good Lord. How is that even the same person? You watch that clip -- and by the way, she's lying. I heard her say there, Well, I talked about a fence. I never mentioned a wall. That's a lie. Look it up, 2006, New York Daily News interviews, she literally said the word \"wall,\" that a wall in some places would be appropriate.\nShe's not only a flip-flopper, she lies about the flip-flopping! This is insane. How is she even qualified to run? This shouldn't be allowed!\nHANNITY: All right, Mercedes, you're going to get the last word here. We're running out of time.\nSCHLAPP: There's a phrase in Spanish that A.J. will understand, \"Basta ia (ph),\" \"Enough already\" with Hillary Clinton, OK?\n(LAUGHTER)\nSCHLAPP: For Hillary Clinton, it's all about political convenience, the same way it was convenient for her to use 15,000 Blackberries and iPads that were destroyed by a hammer. I mean, let's get real, people! And I think the American voter...\nHANNITY: Don't forget BleachBit.\nSCHLAPP: ... needs to wake up to this!\nHANNITY: Don't forget BleachBit. That's very important...\nSCHOEN: ... $2 billion from the Clintons to make this all go away.\nHANNITY: OK, like -- you mean like (INAUDIBLE) mean, like, with a cloth? No. They used BleachBit so that God couldn't read it and Jesus couldn't read it.\nAll right, good to see you all.\nSCHOEN: Thank you.\nHANNITY: Thank you.\nSCHOEN: Thank you.\nHANNITY: And coming up, Donald Trump on message, attacking Hillary Clinton with polls for the race for the White House now tightening. RNC chairman Reince Priebus is here with reaction.\nAlso, later tonight...\n(BEGIN VIDEO CLIP)\nBILL CLINTON, FORMER PRESIDENT OF THE UNITED STATES: That message where -- I'll give you, America great again -- if you're a white Southerner, you know exactly what it means, don't you?\n(CHEERS AND APPLAUSE)\n(END VIDEO CLIP)\nHANNITY: Bill Clinton's suggesting that Trump's slogan, \"Make America great again,\" is racist. Whoops! One big problem. He used the phrase over and over again. Is he calling himself a racist?\nAll of that, and actor Jon Voight will join us as we continue on this busy Friday on \"Hannity.\"\n(COMMERCIAL BREAK)\n(NEWSBREAK)\n(BEGIN VIDEO CLIP)\nTRUMP: The politics of people like Hillary Clinton have produced only poverty, joblessness and rising crime.\nHillary Clinton opposes school choice because she is controlled totally -- totally, like a puppet -- by special interests.\nIt was the failed policies, you have to remember, of Hillary Clinton and Obama that unleashed ISIS in the first place.\nUnfortunately for our country, our enemies probably hacked into Hillary Clinton's e-mails. These are the same e-mails she destroyed after receiving a federal subpoena.\n(END VIDEO CLIP)\nHANNITY: Donald Trump going after his Democratic rival on multiple issues at the Values Voters Summit in Washington, D.C.\nNow, this tops off what has been yet another very bad week for Hillary Clinton. After cracking under the pressure of some tough but fair questions during NBC's commander-in-chief forum, Clinton is now changing her strategy. She's actually now talking to the press for the first time in 280 days. Pretty amazing.\nHere now with reaction, RNC chairman Reince Priebus. I'm looking at polls-- neck and neck in most of the swing states. You look at the breakdown, you see Donald Trump is doing better among black Americans than the last eight Republican presidential candidates, among independents, crushing Hillary Clinton. Hispanics, he's doing very well.\nYou know where he's doing poorly? With the Republicans. He's getting about 73, 74, or 75 percent of Republicans. He needs 90 percent.\nNow, you've got opposition from The Wall Street Journal, NRO, Jonah Goldberg, the Glenn Becks of the world, the Mitt Romney team in total, and some four presidential candidates that signed a pledge for you -- Kasich, Bush, Lindsey Graham and Ted Cruz.\nI'm a little pissed off at all these people because they're helping Hillary. Are you mad?\nREINCE PRIEBUS, RNC CHAIRMAN: Well, yes, of course. I mean, they're absolutely helping Hillary. If you're not voting for Donald Trump, you're basically voting for Hillary Clinton.\nAnd look, you're right. It was a pledge, and it wasn't just a pledge. In some cases, it was a data exchange agreement, where the candidates received valuable data and information, and in exchange for that information, they agreed to support the nominee, whomever he or she was.\nAnd so I think they should honor the pledges, and I think that our state chairmen and our committee people on the committee are going to review this situation, and there may be consequences in the future.\nBut look, I saw some polling that should give you a much better feeling about this. This CNN poll came out this week, had a much higher percentage of Republican support for Donald Trump. But look...\nHANNITY: What was the percentage of that poll?\n(CROSSTALK)\nHANNITY: What was the percentage in that poll?\nPRIEBUS: It was in the high 80s. So I mean...\nHANNITY: He needs 92. If he gets to 92...\n(CROSSTALK)\nPRIEBUS: ... going to get there. I think by the time we get to November, Sean, I think he's going to get there, especially if he continues down this path that he's on. I think everybody is very pleased with what he's been doing.\nHANNITY: Baton Rouge, Mexico. I thought his speech in particular in Detroit was strong, Value Voters Summit today.\nPRIEBUS: I think he did very well -- he did very well in the forum the other day, the military forum. He won easily. He did a great job. Hillary Clinton was very, very defensive, and she was upset because she couldn't believe that she...\nHANNITY: You know -- you know Trump won when the media...\nPRIEBUS: ... had to stand there and...\nHANNITY: ... the liberals in the media are blasting poor Matt Lauer. I mean, I'm not a fan of Lauer's, but...\nPRIEBUS: Well, that was -- but -- but that was also Hillary Clinton's campaign. I mean, the reason she was so fiery (ph) Matt, it wasn't because they were serious issues, like she claims -- they were serious issues, but she was beyond upset because she couldn't believe that she had to stand there for 11 minutes and answer questions about something she did to herself.\nAnd when that Air Force corpsman stood up and said, I would be in prison if I did what you did, her team and her surrogates went after Matt Lauer and NBC all night and the next day. You know, look it, this is what Republicans...\nHANNITY: Let me ask you this...\nPRIEBUS: We deal with a double standard every single day...\nHANNITY: All agreed.\nPRIEBUS: ... of our lives in the media. Now, this wasn't a double standard. She had what she had coming, and she's going to answer more tough questions like that in the future.\nHANNITY: I agree. But how could Matt Lauer not ask about the e-mails? I mean, it's ridiculous. She's been ducking and dodging and hiding, you know, more than anybody. All right, Reince, good to see you.\nPRIEBUS: You bet.\nHANNITY: Sixty days to go. No pressure on you. You better do your job.\nPRIEBUS: You bet.\nHANNITY: All right, thank you.\nAnd coming up next tonight on \"Hannity\"...\n(BEGIN VIDEO CLIP)\nBILL CLINTON, FORMER PRESIDENT OF THE UNITED STATES: That message where -- I'll give you America great again, is -- if you're a white Southerner, you know exactly what it means, don't you?\n(END VIDEO CLIP)\nHANNITY: Bill Clinton playing the race card, insinuating Donald Trump's campaign slogan is racist. Well, sorry, Bill, but we have video of you using the exact same phrase over and over and over and over again.\nPlus, Chelsea Clinton calls out Donald Trump's rhetoric, saying he's misogynistic and sexist. Chelsea, you really want to go there? We got a lot to say about your father. OK, you open the debate. We'll do it.\nPlus, Hollywood A-lister Jon Voight introduced Donald Trump at the Value Voters Summit earlier today. He'll join us and more straight ahead.\n(COMMERCIAL BREAK)\n(BEGIN VIDEO CLIP)\nBILL CLINTON: I'm actually old enough to remember the good old days, and they weren't all that good in many ways. That message, where -- I'll give you America great again, is -- if you're a white Southerner, you know exactly what it means, don't you?\n(CHEERS AND APPLAUSE)\nB. CLINTON: What it means is, I'll give you the economy you had 50 years ago, and I'll move you back up on the social totem pole and other people down. What Hillary wants to do is take the totem pole down and let us all go forward together!\n(END VIDEO CLIP)\nHANNITY: That was former president Bill Clinton earlier this week implying that Donald Trump's slogan, \"Make America great again,\" is racist. Now, it's funny that Bill thinks that because it's a phrase that he used years ago over and over and over. I used it over and over again in front of all those hot chicks on the campaign trail. Take\nB. CLINTON: I believe that together, we can make America great again.\nI want to attack these problems and make America great again.\nUNIDENTIFIED MALE: Paid for by Clinton for president.\nB. CLINTON: And now you are being called upon, every one of you, to secure a better future for your children and your grandchildren and to make America great again economically, educationally and socially.\nIt's time for another comeback, time to make America great again. I know Hillary's the one who can do it.\nUNIDENTIFIED MALE: Paid for by Hillary Clinton for president.\nH. CLINTON: I'm Hillary Clinton, candidate for president, and I approved this message.\n(END VIDEO CLIP)\nHANNITY: All right, joining us now with reaction, CEO for the National Diversity Coalition for Donald Trump, Reverend Darrell Scott, from The Hill-- newspaper, of course -- Joe Concha -- on line, you can find it there -- FOX News contributor Deneen Borelli.\nPastor Scott, by Bill Clinton's own definition, he's a racist!\nREV. DARRELL SCOTT, TRUMP SUPPORTER: Yes. I mean, you know, here's \"Slick Willy.\"\n(LAUGHTER)\nSCOTT: He's the pot calling the kettle black. This is the same guy that belonged to two white-only country clubs in the '90s, the same guy who fought to retain the Confederate flag. But watch this. By his own definition, he's a racist. This is a guy that doesn't know what the definition of sex is! I didn't have sex with that woman.\n(CROSSTALK)\nHANNITY: ... he said, We white Southerners know. So he used a phrase that white Southerners knew back when he was running, so...\nSCOTT: Right.\nHANNITY: ... based on his -- all right, and here's what gets interesting, Deneen, is J. William Fulbright Bill Clinton cites as his mentor, a known segregationist. Hillary Clinton's mentor is a guy by the name of Robert \"Ku Klux Klan\" Byrd, former mentor...\nDENEEN BORELLI, FOX CONTRIBUTOR: Right.\nHANNITY: ... her mentor!\nBORELLI: Yes, it's interesting that Bill Clinton is using this language, who justifies Robert Byrd being a Klansman, and Hillary, yes, she thought Byrd was a mentor to her.\nBut listen, the Clinton campaign is getting very desperate right now. They're going to play every card they possibly can, the race card, the woman card, the Russian card. They are concerned that Donald Trump's message is resonating with black voters, his message of empowerment, school choice, pro-energy, pro-economic policies -- they are concerned about that. And anytime they play the race card, it's a sign of desperation.\nHANNITY: Yes, I agree with you. Joe, this is a certain timing to all of this. Let me play Chelsea Clinton talking about Donald Trump being a misogynist and a sexist. And I'm, like, Chelsea, really? Your dad -- you want to go there? OK, let's play the game.\n(BEGIN VIDEO CLIP)\nQUESTION: What's your response to Donald Trump saying your mom does not look presidential?\nCHELSEA CLINTON, DAUGHTER OF BILL AND HILLARY CLINTON: Where to begin? Or maybe just I would hope that everyone could see that as the sad, misogynistic, sexist rhetoric that I hoped we had moved beyond in the 21st century, certainly in 2016.\n(END VIDEO CLIP)\nHANNITY: Timing is interesting to me. I want to get your observation on this, Joe. All right, so the timing is that Hillary Clinton under fire, Clinton Foundation, 55 percent, the AP reports, of those meetings that she had with individuals are either donors or people pledging money.\nNow we've got Hillary under fire all week, more e-mail problems, one after another. You got Chelsea playing the sex card, the gender card, and you got Bill playing the race card.\nIs there -- is this a coincidence, or is this designed to divert attention?\nJOE CONCHA, THE HILL: I think they're running out of cards at this point, right? I mean, how many cards can you play? Look, the bottom line is that the Clintons led by -- or Hillary Clinton -- by 8 points in the RealClearPolitics average just four weeks ago. Donald Trump has won every week since then, and now it's a virtual dead heat. And the swing states are going in that direction, as well.\nSo I don't think it's any coincidence, Sean, that these cards are being played when Hillary Clinton has lost momentum, clearly, and used the sexist card. They used it against Matt Lauer, as well. They said Matt Lauer kept interrupting Hillary on Wednesday -- because she was filibustering!\nHANNITY: Well, actually, I went back and looked. If you look closely, Donald Trump was interrupted more aggressively 13 times, Hillary only six or seven times.\nCONCHA: And Donald Trump got more questions. And by the way, the whole thing...\nHANNITY: Twice as many questions.\nCONCHA: ... about Bill Clinton saying that \"Make America great\" again -- obviously, he used it. Obviously, Donald Trump is using it. Somebody else used it, as well...\nHANNITY: Ronald Reagan used it.\nCONCHA: ... Ronald Reagan in 1980...\nHANNITY: Show the poster. I love the poster you brought.\nCONCHA: OK, go to the Google machine and you can see, Reagan, make America great again...\n(CROSSTALK)\nCONCHA: ... in 1980, so...\nHANNITY: By the way, he did make America great again. He succeeded.\nCONCHA: And wasn't a racist.\nBORELLI: (INAUDIBLE) Sean, Bill Clinton is mocking people in coal country, Kentucky and West Virginia...\nHANNITY: I know. I saw that.\nBORELLI: ... just because they're -- they don't -- they're not in line with the progressive policies. And so Bill Clinton has no use for them, and he's mocking these people? It's unbelievable!\nHANNITY: Guys, good to see you all. Thank you for being with us.\nComing up -- Donald Trump addressed the Values Voters Summit. Hollywood legend Jon Voight introduced Trump. He'll join us coming up next with reaction, along with Jerry Falwell, Jr., and Pastor Robert Jeffress.\nAnd then later, Sunday marks the 15th anniversary of the 9/11 terrorist attack. Have we gone back to a pre-9/11 mindset? We'll get to that with Dr. Sebastian Gorka and much more tonight here on \"Hannity.\"\n(COMMERCIAL BREAK)\n(BEGIN VIDEOTAPE)\nHANNITY: Donald Trump spoke to conservatives at the Value Voter Summit in Washington, D.C.\nthis week. Here are some of the highlights.\nTRUMP: Our media culture often mocks and demeans people of faith, and you understand that. Your values of love, charity, and faith built this nation. Our politicians have really abandoned you to a large extent. So, let me state this right up front, a Trump administration, our Christian heritage will be cherished, protected, defended like you've never seen before.\nHANNITY: Joining us now, legendary Hollywood actor Jon Voight. He introduced Donald Trump at the summit today. A good friend of mine, and I'm also a fan of his. How are you, sir? Good to see you, my friend.\nJON VOIGHT, HOLLYWOOD ACTOR: I'm great, Sean. It's good to be with you.\nHANNITY: You know, what he said today, I really have been critical of Obama, who's unwilling to say the words radical Islam. But worse than that-\nVOIGHT: Yes, of course.\nHANNITY: -- he said the terrible deeds done in the name of Christ and talked about the crusades. And I listened to Donald Trump there, and he said, \"Yeah, Christians have been mocked and demeaned. And those qualities of love, charity, and faith, they did build this nation.\" Obama doesn't seem -\nVOIGHT: You bet.\nHANNITY: -- to want to say those things, to me.\nVOIGHT: Yes. Well, I think he's got other agendas, of course. But the people, you know, there are Christian people throughout the world have been attacked, and we've been attacked right here in this country in many ways. And so, the reception for Donald Trump here has been quite extraordinary.\nHANNITY: You know, I -\nVOIGHT: And his speech was wonderful. By the way, I - you know, his speech was wonderful. I wish that people could listen to the whole speech. It was a quite extraordinary speech, and people were standing throughout the entire speech here.\nHANNITY: Yeah, we actually ran it on Fox earlier today. And I know it's on foxnews.com if people haven't seen it, they have an opportunity to see it. You were very outspoken early on, and you said that you believe that Donald Trump would be a very good president. I agree with you.\nVOIGHT: Yes.\nHANNITY: And there are some Republicans that seem to be putting their heads in the sand and not comparing Trump's position on Supreme Court justices, and his position on vetting refugees and securing our borders and eliminating ObamaCare and energy independence and education back to the states.\nVOIGHT: Yeah.\nHANNITY: Why do you think there is this mysterious reluctance among some, \"arrogant\" the intelligentsia as they consider themselves in the Republican Party?\nVOIGHT: Well, you know, there's a lot of good people among them. But, you know, when people start - early on, when he had a little bit of a roughness about his speech and stuff, and he's not too smooth, he's not slick, but he's completely honest. But early on, they chose other people, and they built their own arguments against Donald Trump. And they were so in love with their own arguments, they couldn't let them go, and they still hold on to them a little bit sometimes. But I think coming toward this election, they're going to realize the stakes, and you repeat them every night to people. You make that list of the important things that they should be thinking about. And I think there's going to be a unity coming on November 8th.\nHANNITY: Yeah, I hope so. You know, you're one of Hollywood's biggest actors. You're one of my favorite actors even before I knew you. And you have no fear at all. You've never had any fear expressing your strongly and deeply held political beliefs. Have you paid a price at all for that?\nVOIGHT: Well, you know, you never know what goes on behind closed doors. But I've been very fortunate to have, you know, roles offered me all through my career. I've been very, very lucky. And I think that there are more - you know, there are more conservatives in Hollywood than one would think in all echelons, even among the actors. But they kind of keep their heads down a little bit because there's an awful lot of real hatred coming from the left, unfortunately, and they're very outspoken. So, we have that little difficulty, but look, I was on the left one time, and I always think, you know, the problem is information. If they get some of the facts, maybe they can turn around. So, I'm really always open to talk to anybody.\nHANNITY: Yeah. Did you get to spend time with Trump? Is there a part of him that you know that you want to share with people that maybe don't have the opportunity to see him behind the scenes as I do and as you do?\nVOIGHT: I'll tell you one thing that I - I just saw him just for a little bit. But, you know, he was very moved by the whole evening. And coming off the stage, he was very moved by it and very grateful to me. And, you know, he is - he is a very considerate - he's a very considerate guy. He goes to the guys who run the - you know, run the machinery for his, you know, his teleprompter, and he always gives them a little pat and stuff like that, but it's very sincere. He's got a lot of compassion. He cares about people, and his speeches are starting to reflect that, too.\nHANNITY: Yeah, and I've seen - I've had the same experience. He always says hi to my crew and the people that work with us and the camera guys and the producers and directors. Jon Voight, it's been a while. Good to see you. Thanks for coming back.\nVOIGHT: Great, Sean. God bless.\nHANNITY: God bless. And joining us now with reaction, the president of Liberty University, Jerry Falwell, Jr., Fox News contributor, Dr. Robert Jeffress. Dr. Falwell, you said from day one, I - we're not electing a pastor-in-chief, we are electing a president of the United States, a commander-in-chief. That was a -\nDR. JERRY FALWELL, JR., PRESIDENT OF LIBERTY UNIVERSITY: That's right.\nHANNITY: -- pretty connecting speech for people of faith today as I watched it. One that I think your father would be proud of.\nFALWELL: I agree. I think - very proud. And I think he hit all of the major issues that are important to people of faith, the Johnson Amendment, the - you know, that's very important to us, and, you know, to the university where I work because so many liberal universities, Ivy League Universities, left-wing ideology is so pervasive that they pretty much are democrat voter indoctrination camps. It was in the news today that a major university, the professor was using the e-mail list of the school to promote Hillary Clinton, and you never see left-wing schools ever tagged by this Johnson Amendment. It's always conservative churches, conservative schools. In 2008, I endorsed Mike Huckabee personally, and Americans United for Separation of Church and State filed a complaint against Liberty University, because I endorsed Mike Huckabee. And we had to - we had to go through all of that process, and we actually filed a complaint against them for violating their own 501(c )(3) status by only going after and filing complaints against conservative universities and churches. And so, they never bothered us again after that. But there's so many churches and schools, conservative schools that are - that are - it's a chilling effect on them. They're in silence because they're afraid of what's going to happen to them.\nHANNITY: You know, and this is important, but I don't think most people even know what you're talking about with the Johnson Amendment. Why don't you explain what that is?\nFALWELL: It's a 1954 amendment that was attached to a bill in congress. It was signed by the president at the time, and it basically said no non- profit organization, no university, no church can endorse or oppose a candidate. And so, since that time, though, it's - there's only been complaints filed against conservative churches and schools.\nHANNITY: Not liberal ones.\nFALWELL: And there's a group called (INAUDIBLE) this - a former New York mayor Bloomberg spoke at Harvard in 2014 for their commencement, and he chastised the Ivy League because 96 percent of their faculty and staff donated to the Obama administration. Many of their speakers were disinvited because they were conservatives, and they were denied an honorary degree, like the one you received at Liberty once, Sean. And so, that - it's just very telling that this Johnson Amendment is only used against conservatives. They're the only ones -\nHANNITY: Well said.\nFALWELL: -- that feel intimidated. The liberal schools -\nHANNITY: And they should have freedom of speech like everybody else, so every individual.\nFALWELL: Exactly.\nHANNITY: Dr. Jeffress, did Donald Trump make inroads with the evangelical and faith community today?\nDR. ROBERT JEFFRESS, FOX NEWS CONTRIBUTOR: He certainly did, Sean, because he spoke about the issue that not only resonated today, but it's resonating with evangelicals everywhere, and that's the appointment of conservative Supreme Court justices. Trump has made a commitment that he's going to appoint justices who interpret the law using the constitution rather than political correctness as the standard. And, you know, Sean, the issues many of us evangelicals care about, religious liberty and the sanctity of life -\nHANNITY: This will impact -\nJEFFRES: -- performed to be determined by the Supreme Court. And let me just say - yes?\nHANNITY: Dr. Jeffress, this will impact this country for generations. That one issue alone ought to be a game-changer for anyone that says they are a conservative. That one should be enough.\nJEFFRESS: Let me just say, I agree. I agree. And that's why I am getting sick and tired of these namby-pamby-wasted weakling Christians who say they're going to stay at home in November out of moral principle. Will you please tell me what right moral principle there is in the universe that would allow a prohibition, anti-religious liberty candidate like Hillary Clinton to become the president? I believe any conservative Christian who refuses to vote or throws away his vote in November is nothing but a hypocrite and a fool.\nHANNITY: Wow. All right, guys. Good to see you both. Appreciate your time.\nFALWELL: And, Sean?\nHANNITY: Yeah.\nFALWELL: The vouchers is very important. I was so glad to hear that he mentioned that because that's how the teachers unions and the Democratic Party have kept minorities down, kept them from getting the education they need to succeed. If you bring jobs back to the United States, you've got to re-educate the populace, so I'm so glad he mentioned vouchers.\nHANNITY: We're destroying all that God-given talent with a horrible educational system. Guys, good to see you both. Coming up, while Americans prepare to remember the 15th anniversary of the 9/11 terrorist attack, the threat posed by ISIS, radical Islam is growing both here and abroad. Dr. Sebastian Gorka is going to react to the question, \"Have we gone back to a pre-9/11 mentality?\" Straight ahead.\n(END VIDEOTAPE)\n(COMMERCIAL BREAK)\n(BEGIN VIDEOTAPE)\nHANNITY: Welcome back to \"Hannity.\" Now, this Sunday marks the 15th anniversary of the September 11th terrorist attacks. Now, while it's important to remember those who are lost and never forget, America needs to remain vigilant. Especially in the fight against radical Islamic terror, but - because this threat around the globe, and right here in our homeland is growing. According to the FBI, there are ISIS-related cases now in all50 states. That includes 1,000 active investigations in this country alone. Now, since 2014, over 105 people have been charged under federal law in ISIS-related cases. Seven of those have been convicted.\nAnd in the same timeframe, there have been 30 ISIS-linked plots to attack this country. Here with reaction, the author of \"Defeating Jihad: The Winnable War,\" Dr. Sebastian Gorka. If we have a president and a presidential candidate that can't say Radical Islamic and we got Chattanooga, and we've got Fort Hood, and we've got San Bernardino, and we've got Orlando, and we've got Belgium, and we've got Sweden, and we've got Paris and Paris and Paris and Germany, and all - you know, all over the world, have we learned anything? Have we gone back to what the 9/11 commission report said as they were at war with us, we're not at war with them. I don't think you can be at war with somebody if you can't identify them.\nDR. SEBASTIAN GORKA, NATIONAL SECURITY ANALYST AND TERRORISM EXPERT: You're absolutely right. The (INAUDIBLE) said, \"You have to know yourself. You have to know the enemy if you want to win your war.\" Americans today, Sean, the sad fact is are in greater danger than they were the day before September 11th, 2001. You've given the statistics. ISIS cases in every state. We have just recently arrested the 110th ISIS supporter in America, in Roanoke, Virginia. If you look at the facts on the ground, it's the same everywhere. The NCTC, the National Counter-Terrorism Center which works for President Obama's director of national intelligence, just briefed him and said there are ISIS affiliates today in 18 nations around the world. Two years ago, it was seven, Sean. It is now more than double that. The threat has increased.\nHANNITY: You know, let's say that we're right. And I pray to God we're wrong, that we have a pre-9/11 mind-set. Let's say it's the aftermath and the next 9/11 commission comes together. Are they going to talk about misidentifying Fort Food, euphemisms, man-caused disasters, overseas contingencies, workplace violence, are they going to mention giving $150 billion to the number one state sponsor of terror? Are they going to mention precipitously pulling out of Iraq and not following through in Syria, and creating a vacuum for ISIS to emerge? Are they going to mention all those things? In other words, can I write the story ahead of time that we set the stage for our own next big attack that kills thousands?\nGORKA: I think, Sean, that's only going to happen, we're only going to grasp the nettle of reality if we have men with a back bone, if we have leaders, if we have men or women politicians who have a spine, because it takes that to defeat your enemy. In World War II it was the same, under President Reagan during the Cold War, we spoke truthfully about the enemy. We called them evil and we saw them as a totalitarian threat. Well, guess what, the Jihadis are just the same, whether you're a communist or a fascist, you are an existential threat to America, and it's the same with Jihadis.\nHANNITY: And it is evil. Let's be clear. This is evil.\nGORKA: It's evil. Yes.\nHANNITY: Radical Islamic terrorism is evil in our time. ISIS is evil.\nGORKA: True.\nHANNITY: Radical Islamist are evil. Why is it so hard for them to say that?\nGORKA: Because they don't believe in objective truth. They're post- secular modernists. They believe in cultural relativism or cultures are equal except America, which is worse than everybody else. That's the thing, Sean.\nHANNITY: Yeah.\nGORKA: We remember the apology tour, right?\nHANNITY: A good point. A very good - well, talk about terrible deeds in the name of Christ, he does do that -\nGORKA: Which happened when? Which happened when?\nHANNITY: Well, he's talking about the crusades, which were Christians -\nGORKA: Right.\nHANNITY: -- fighting for lands that were taken by radical Islamist of their time.\nGORKA: Right. And - but we're talking about Islamic terrorism now. Being crucified, burnt alive as we speak.\nHANNITY: And beheaded now.\nGORKA: And be headed.\nHANNITY: Right? Yeah.\nGORKA: Yeah.\nHANNITY: All right. And by the way, women being tortured and oppressed.\nGORKA: Enslaved.\nHANNITY: Gays and lesbians being killed, Hillary takes money from those countries, Christians and Jews persecuted. Thank you, Dr. GORKA.\nGORKA: Thank you.\nHANNITY: Coming up, we need your help. A very important question of the day, straight ahead.\n(END VIDEOTAPE)\n(COMMERCIAL BREAK)\n(BEGIN VIDEOTAPE)\nHANNITY: Welcome back to \"Hannity.\" Time for our \"Question of the Day.\" Has America - this is an important question - come back to a pre-9/11 mind-set? Sadly, I hope I'm dead wrong. But I believe we have. What do you think? Go to facebook.com/seanhannity, @seanhannity on Twitter, let us know what you think. That's all the time we have left this weekend, for today. Have a great weekend. 57 days, Monday, until Election Day. Buckle up. It's going to be a great ride. We'll continue on Monday. See you then.\nEND\n ", "external_links": [], "published": "2016-09-09T03:00:00.000+03:00", "crawled": "2016-09-10T19:26:47.036+03:00", "highlightTitle": ""}