{"organizations": [], "uuid": "0cb4eb386bfdcea1c8ec827ac3c92a78ad8265a4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 790, "shares": 790, "comments": 1}, "stumbledupon": {"shares": 0}}, "site_full": "www.buzzfeed.com", "main_image": "https://img.buzzfeed.com/buzzfeed-static/static/2016-09/20/15/campaign_images/buzzfeed-prod-web08/latina-and-black-operatives-join-clinton-transiti-2-13014-1474400822-0_dblbig.jpg", "site_section": "", "section_title": "", "url": "https://www.buzzfeed.com/adriancarrasquillo/latina-and-black-operatives-join-clinton-transition-team-in", "country": "US", "domain_rank": 137, "title": "Latina And Black Operatives Join Clinton Transition Team In Key Roles - BuzzFeed News", "performance_score": 7, "site": "buzzfeed.com", "participants_count": 0, "title_full": "Latina And Black Operatives Join Clinton Transition Team In Key Roles - BuzzFeed News", "spam_score": 0.081, "site_type": "news", "published": "2016-09-20T08:00:00.000+03:00", "replies_count": 0, "uuid": "0cb4eb386bfdcea1c8ec827ac3c92a78ad8265a4"}, "author": "Adrian Carrasquillo Buzzfeed News Reporter", "url": "https://www.buzzfeed.com/adriancarrasquillo/latina-and-black-operatives-join-clinton-transition-team-in", "ord_in_thread": 0, "title": "Latina And Black Operatives Join Clinton Transition Team In Key Roles - BuzzFeed News", "locations": [], "entities": {"persons": [{"name": "justin sullivan", "sentiment": "negative"}, {"name": "john jones", "sentiment": "negative"}, {"name": "stephanie valencia ramirez", "sentiment": "negative"}, {"name": "hill", "sentiment": "none"}, {"name": "jones", "sentiment": "none"}, {"name": "jeh johnson", "sentiment": "none"}, {"name": "cesar blanco", "sentiment": "none"}, {"name": "obama", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "clinton", "sentiment": "none"}, {"name": "garcia", "sentiment": "none"}, {"name": "ken salazar", "sentiment": "none"}, {"name": "darren sands", "sentiment": "none"}, {"name": "ramirez", "sentiment": "none"}, {"name": "clintons", "sentiment": "none"}, {"name": "valencia ramirez", "sentiment": "none"}, {"name": "latina", "sentiment": "none"}, {"name": "alida garcia", "sentiment": "none"}, {"name": "adrian carrasquillo", "sentiment": "none"}, {"name": "emanuel cleaver ii", "sentiment": "none"}, {"name": "salazar", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "inclusv", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "west wing", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "capitol hill", "sentiment": "none"}, {"name": "colorado", "sentiment": "none"}, {"name": "d.c.", "sentiment": "none"}], "organizations": [{"name": "latina and black operatives join clinton transition team", "sentiment": "negative"}, {"name": "senate", "sentiment": "none"}, {"name": "homeland security", "sentiment": "none"}, {"name": "latina", "sentiment": "none"}, {"name": "congressional black caucus foundation", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "buzzfeed news", "sentiment": "none"}, {"name": "capitol hill", "sentiment": "none"}, {"name": "house", "sentiment": "none"}, {"name": "congressional black caucus", "sentiment": "none"}, {"name": "google", "sentiment": "none"}, {"name": "cbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Justin Sullivan / Getty Images ID: 9651680 \nStephanie Valencia Ramirez and John Jones, two operatives with experience in the Obama administration and on Capitol Hill, have joined Hillary Clinton’s transition team, putting two prominent people of color in charge of strategic outreach to the Hill and constituency groups under former Colorado Sen. Ken Salazar, who serves as chair. \nRamirez starts Monday, according to three Latino strategists. Jones hire was confirmed by a CBC staffer and two other operatives. \nRamirez, who left the administration earlier this year to join Google, is considered a Latina leader among Hispanics in Washington, having worked for the Obama campaign in 2008, the transition team, and then the administration. She serves on the national committee for Latino Victory, which has helped Hispanic Democrats get elected. \nThe hire comes after news that Latino Victory and a coalition of 40 national Hispanic organizations have come together to create a resume bank of Latino candidates for political appointments in the next administration. \nAlida Garcia, executive director of Inclusv, which works to increase diversity hires in politics, said that if Clinton is elected, Valencia Ramirez will work to prioritize diversity and inclusion on the transition team because she has done so in every role she’s had. \n“She sat me down in her office in the West Wing and asked what she could do to help me and if I could help her identify other young Latina leaders looking to serve,” Garcia said. “That’s rare in this town, and that’s how barriers of access for people of color begin to break down.” \nJones, who was recommended to the transition team by the Congressional Black Caucus, two sources said, is a respected figure on and off Capitol Hill. As a chief of staff to Rep. Emanuel Cleaver II, he’s also well-connected with members in the House and Senate, especially inside the CBC. \nThe subject of transition is hot topic of conversation on the minds of White House operatives trying to figure out their next move, and for some Clinton campaign staff — from which there are plenty of black and Latino operatives to choose from for a Clinton White House — angling for potential White House appointments. \nInside black Democratic circles, operatives and strategists are actively figuring out what more can be done to ensure blacks are considered for positions, if Clinton is elected. In a spirited conversation about the subject of transition during the Congressional Black Caucus Foundation’s annual policy convention, operatives observed how nice it would be, for instance, to see a black secretary of defense. \nBut it’s not just the most high-profile cabinet positions black Democrats are paying attention to. With fewer than 50 days until the election, also up for discussion is how Clinton will staff key mid-level positions like political directors and communications staff. \nLatino Democrats similarly don’t want potential appointments limited to the well-trodden ground of immigration, labor, and housing. Cesar Blanco, Latino Victory’s interim director, also said he would like to see Hispanics considered for defense, trade, and foreign affairs roles. The key, operatives argue, is not just a focus on high-profile cabinet roles, but in creating a pipeline that will mean a wealth of candidates across departments for years to come. \nGarcia of Inclusv, said that regardless who wins, thousands of campaign staff of color will be looking for work. Her organization is gearing up for an “off-boarding training program” for campaign staff of color seeking mentors, career development and guidance pursuing their next jobs in politics. \nWith Salazar leading the transition, Valencia Ramirez coming onboard and the new Latino appointments initiative, Democrats feel primed to make advances on a key measure of Latino political power. \n“The right people are being elevated,” a Clinton official said. “They’re going to be engaged on meaningful outreach. It’s a sign the Latino community is growing.” \nOver and over, people talking about transition laud the Obama administration for its innovation — he appointed two black attorney generals, made Jeh Johnson director of Homeland Security, and has four Latinos in the cabinet. While many contend Obama doesn’t get enough credit, people believe Clinton will be graded on a higher curve. \n“Hillary Clinton won’t get to slide,” a senior Democratic strategist said. “People are going to be tough and demanding. They’ve known her and the Clintons for far too long.” Adrian Carrasquillo is a political reporter for BuzzFeed News and is based in New York. Contact Adrian Carrasquillo at . Darren Sands is a political reporter for BuzzFeed News and is based in Washington, D.C. Contact Darren Sands at . ", "external_links": [], "published": "2016-09-20T08:00:00.000+03:00", "crawled": "2016-09-20T23:50:02.762+03:00", "highlightTitle": ""}