{"organizations": [], "uuid": "58d68ba88bb475c36f6fe6af986fb6ea38431b99", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.myjoyonline.com", "main_image": "http://photos.myjoyonline.com/photos/news/201606/6799403898676_3111012233783.jpg", "site_section": "http://www.myjoyonline.com/pages/rss/site_world.xml", "section_title": "World News HomePage | International News HomePage", "url": "http://www.myjoyonline.com/world/2016/september-4th/poll-clinton-leads-in-north-carolina-pennsylvania-as-email-questions-linger.php", "country": "CA", "domain_rank": 15333, "title": "Poll: Clinton leads in North Carolina, Pennsylvania, as email questions linger", "performance_score": 0, "site": "myjoyonline.com", "participants_count": 0, "title_full": "Poll: Clinton leads in North Carolina, Pennsylvania, as email questions linger", "spam_score": 0.0, "site_type": "news", "published": "2016-09-05T02:09:00.000+03:00", "replies_count": 0, "uuid": "58d68ba88bb475c36f6fe6af986fb6ea38431b99"}, "author": "", "url": "http://www.myjoyonline.com/world/2016/september-4th/poll-clinton-leads-in-north-carolina-pennsylvania-as-email-questions-linger.php", "ord_in_thread": 0, "title": "Poll: Clinton leads in North Carolina, Pennsylvania, as email questions linger", "locations": [], "entities": {"persons": [{"name": "clinton", "sentiment": "negative"}, {"name": "trump", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}], "locations": [{"name": "north carolina", "sentiment": "none"}, {"name": "pennsylvania", "sentiment": "none"}, {"name": "virginia", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}, {"name": "iowa", "sentiment": "none"}, {"name": "new hampshire", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "arizona", "sentiment": "none"}, {"name": "georgia", "sentiment": "none"}, {"name": "michigan", "sentiment": "none"}, {"name": "wisconsin", "sentiment": "none"}, {"name": "colorado", "sentiment": "none"}, {"name": "nevada", "sentiment": "none"}, {"name": "ohio", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Poll: Clinton leads in North Carolina, Pennsylvania, as email questions linger Source: cbsnews.com Date: 04-09-2016 Time: 06:09:54:pm \nThe presidential race heads into the home stretch with Clinton in the lead, but questions linger for both her and for Donald Trump. \nFor Clinton, it is whether she can move historically high unfavorable numbers, and turn that polling lead into actual votes; for Trump, it is whether he can change the minds of enough voters beyond his durable base, and take back key battleground states in which he trails. It is a race in which at least one-third of each candidates’ voters say they’re motivated mostly by opposition to the other candidate, and one-quarter feel they’re merely settling for a choice between candidates they aren’t happy with. It is not so much that voters are undecided between the two – few actually are - but rather that they appear unconvinced by either one. \nThis week, Clinton leads in two new polls of states that Trump needs to win, given his current electoral map: Clinton leads in Pennsylvania fairly comfortably by eight points, 45 percent to 37 percent, and she is up four in North Carolina, 46 - 42 percent. \nMore broadly, when we look across all states that may be in play -- or could come into play this fall depending on the race – that’s now 13 total - Clinton holds an overall two-point lead across them. For Clinton, doubts about her explanations of the email server continue to weigh on her. Forty-six percent across the battlegrounds say those explanations are changing and getting less believable. The same percentage say those explanations remain the same. Only 7 percent feel the explanations are getting more believable. Voters are more apt to feel her campaign is driven a lot by her own desire to be president – 77 percent - more than by a sincere desire for a better America, at 30 percent. And 51 percent feel that her campaign is driven by doing what donors and party leaders want. Trump does a little better by comparison on motivation, with 59 percent saying it is his own desire and 37 percent -- higher than Clinton -- driven by his desire for a better country. He is much lower than Clinton on being seen as driven by donors and party leaders: just 10 percent feel he’s driven a lot by that. In a week that saw Donald Trump’s trip to Mexico and speech on immigration , more voters (47 percent) across the battlegrounds feel his policy on immigration has not changed, while 37 percent say he has changed policies to become easier on those in the U.S. illegally. Neither of those views appears to have done much to his vote share, though it illustrates the difficulty he may have satisfying both his base and trying to broaden his appeal on the topic. Conservatives are not more likely than anyone else to see softening on immigration policy – so, if he was trying to assure them with his Arizona speech after the Mexico trip , perhaps he did. His voters who feel he has held steady are relatively more enthusiastic about him, in general, than those who feel he has changed. More generally, both candidates’ outreach to minority groups is met with cynicism, and partisanship plays a dominant role in these views. Majorities of voters feel Clinton and Trump’s outreach to minority groups is based more on a search for votes than actual attempts to help people: 65 percent say the former of Trump, 64 percent of Clinton. Moreover, voters see each of the candidates appealing to some racial groups over others, but they don’t agree on who is doing the dividing. Democrats think Trump is while Republicans think Clinton is. The map overall continues to favor Clinton, and the demographic patterns are the same as we’ve seen before and seen elsewhere, in this regard reflecting a somewhat stable race: Clinton relies on younger voters, African American voters, on moderates, and on doing relatively well with those with college and postgraduate degrees. The pooled battleground states include North Carolina and Pennsylvania here, and also a look at Arizona, Georgia, Florida, Iowa, Colorado, Michigan, New Hampshire, Nevada, Ohio, Virginia, and Wisconsin. In recent weeks, including surveys done since the conventions, Arizona and Georgia have shown Trump with narrow leads, all the rest with a Clinton lead, including some even in double digits, except Iowa, which was recently tied. Leave a Comment", "external_links": [], "published": "2016-09-05T02:09:00.000+03:00", "crawled": "2016-09-04T21:53:49.296+03:00", "highlightTitle": ""}