{"organizations": [], "uuid": "a2127c1317ed195fe2c40905c2bed7b41ae1d02e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 312, "shares": 312, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/FNL/Politics/0/0/food%20truck%20latino.jpg", "site_section": "http://feeds.latino.foxnews.com/home/feed", "section_title": "FOX News", "url": "http://latino.foxnews.com/latino/politics/2016/09/02/latino-trump-supporter-warns-us-with-taco-truck-on-every-corner/", "country": "US", "domain_rank": 185, "title": "Latino Trump supporter warns of a U.S. with 'taco truck on every corner' | Fox News Latino", "performance_score": 3, "site": "foxnews.com", "participants_count": 1, "title_full": "Latino Trump supporter warns of a U.S. with 'taco truck on every corner' | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2016-09-02T03:00:00.000+03:00", "replies_count": 0, "uuid": "a2127c1317ed195fe2c40905c2bed7b41ae1d02e"}, "author": "Fox News Latino", "url": "http://latino.foxnews.com/latino/politics/2016/09/02/latino-trump-supporter-warns-us-with-taco-truck-on-every-corner/", "ord_in_thread": 0, "title": "Latino Trump supporter warns of a U.S. with 'taco truck on every corner' | Fox News Latino", "locations": [], "entities": {"persons": [{"name": "marco gutierrez", "sentiment": "negative"}, {"name": "trump", "sentiment": "negative"}, {"name": "adriano espaillat", "sentiment": "none"}, {"name": "gutierrez", "sentiment": "none"}, {"name": "joy reid", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "reid", "sentiment": "none"}, {"name": "charles rangle", "sentiment": "none"}, {"name": "jason scott", "sentiment": "none"}, {"name": "taylor ham", "sentiment": "none"}, {"name": "espaillat", "sentiment": "none"}, {"name": "scott", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}, {"name": "new york state", "sentiment": "none"}, {"name": "new jersey", "sentiment": "none"}], "organizations": [{"name": "fox news", "sentiment": "negative"}, {"name": "fox news latino", "sentiment": "none"}, {"name": "msnbc", "sentiment": "none"}, {"name": "congress", "sentiment": "none"}, {"name": "taco", "sentiment": "none"}, {"name": "taco truck", "sentiment": "none"}, {"name": "facebook  follow us on twitter & instagram", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Published September 02, 2016 Fox News Latino Getty Images \nMarco Gutierrez meant to curb the growth of taco trucks, but he instead may have given them a boost.\nGutierrez, the founder of the group Latinos for Trump, tried to defend the Republican presidential candidate’s controversial speech on cracking down on illegal immigration by sounding an alarm — if left to their own devices, he said, Mexicans here will turn the United States into a country where “you’re going to have taco trucks on every corner.”\nGutierrez issued his dire warning during an interview with MSNBC host Joy Reid , who responded with a visible look of horror.\nWhat Gutierrez was trying to get across was his belief that Mexicans are overbearing, and leave their imprints on everything, even on people’s palates.\n“My culture is a very dominant culture,” Gutierrez said. “It’s imposing and it’s causing problems. If you don’t do something about it, you’re going to have taco trucks on every corner.”\n“The Spanish never conquered Mexico,” Gutierrez argued. “We have a lot of good things that we bring to the United States. But we also have problems.”\nThe remark spawned a new hashtag #TacoTrucksOnEveryCorner, which was among the most popular on Twitter on Friday. The bulk of social media comments poked fun at the taco truck remark, and many people posting them said having a taco truck on every corner would be sublime.\nOn Thursday, Gutierrez issued a similar warning – this time more generally about a Latino invasion – on his personal YouTube account. \n\n\"This is what I think about Hispanics because I am one. Our culture is a very dominant culture,\" Gutierrez said while in a car. \"I'm going to talk as [if] I was still Mexican — if you guys as Americans don't do something about this, us Hispanics are taking over.\"\nTaco truck owners, meanwhile, say they're proud of their growing popularity.\n\"Who wouldn't want The Taco Truck on every corner?,\" asked Jason Scott, CEO and co-founder of The Taco Truck, a New Jersey-based company , in a statement to Fox News Latino. \"Since 2009, we've had the privilege to employ hundreds of hard-working Americans and Mexican-Americans along with serving millions of our authentic tacos to loyal customers.\"\n\"Tacos are just one of many Mexican traditions that have added to the amazing cultural patchwork that makes America great,\" said Scott, clearly playing off Trump's campaign motto \"Make America Great Again.\"\n(On his website, www.thetacotruck.com , Scott explains that he is a New Jersey native who \"didn't grow up eating tacos,\" and instead \"grew up eating Taylor Ham, egg and cheese,\" but \"fell in love with tacos when fly-fishing in Mexico.\")\nMany Latinos expressed disgust over Gutierrez's comments.\nOn the MSNBC segment, New York State Sen. Adriano Espaillat, who is of Dominican descent, and is likely to succeed longtime Rep. Charles Rangle in Congress, assailed Gutierrez. \nAsked by Reid for his reaction, Espaillat said he was offended.\nThe lawmaker said that Latinos are an asset, and welcoming towards others.\n“It is a tolerant culture, it is one that welcomes neighbors,” Espaillat said. “It is not an aggressive or bullying culture.”\nHe said that Donald Trump’s speech on immigration was not in the spirit of what makes the United States special.\n“America is about being flexible with different groups that want to pray to different gods, that want to speak different languages, and want to move forward and be part of this great American experiment,” Espaillat said.\nGutierrez was unfazed.\n“I think you haven’t been in Mexico for a long time,” he said. “You guys defend a Mexico that doesn’t exist anymore.”\nLike us on Facebook \nFollow us on Twitter & Instagram", "external_links": [], "published": "2016-09-02T03:00:00.000+03:00", "crawled": "2016-09-02T19:56:22.108+03:00", "highlightTitle": ""}