{"organizations": [], "uuid": "d0203dc7e9a54f21c814b73cbf596aacd0a32256", "thread": {"social": {"gplus": {"shares": 1}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 107, "shares": 107, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/politics/0/0/Maduro%20Chavez%20Profile.jpg", "site_section": "http://feeds.latino.foxnews.com/home/feed", "section_title": "FOX News", "url": "http://latino.foxnews.com/latino/news/2016/09/01/venezuela-detains-miami-herald-reporter-other-journalists-ahead-major-protest/", "country": "US", "domain_rank": 185, "title": "Venezuela detains Miami Herald reporter, other journalists ahead of major protest | Fox News Latino", "performance_score": 1, "site": "foxnews.com", "participants_count": 1, "title_full": "Venezuela detains Miami Herald reporter, other journalists ahead of major protest | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2016-09-01T03:00:00.000+03:00", "replies_count": 0, "uuid": "d0203dc7e9a54f21c814b73cbf596aacd0a32256"}, "author": "Fox News Latino", "url": "http://latino.foxnews.com/latino/news/2016/09/01/venezuela-detains-miami-herald-reporter-other-journalists-ahead-major-protest/", "ord_in_thread": 0, "title": "Venezuela detains Miami Herald reporter, other journalists ahead of major protest | Fox News Latino", "locations": [], "entities": {"persons": [{"name": "nicolas maduro", "sentiment": "negative"}, {"name": "teresa bo", "sentiment": "none"}, {"name": "jim wyss", "sentiment": "none"}, {"name": "lagmi chavez", "sentiment": "none"}, {"name": "john otis", "sentiment": "none"}, {"name": "wyss", "sentiment": "none"}, {"name": "maduro", "sentiment": "none"}, {"name": "carlos lauría", "sentiment": "none"}, {"name": "nicolás maduro", "sentiment": "none"}, {"name": "le monde", "sentiment": "none"}, {"name": "aminda marques gonzalez", "sentiment": "none"}], "locations": [{"name": "venezuela", "sentiment": "none"}, {"name": "maiquetia", "sentiment": "none"}, {"name": "americas", "sentiment": "none"}, {"name": "bogotá", "sentiment": "none"}, {"name": "latin america", "sentiment": "none"}, {"name": "caracas", "sentiment": "none"}, {"name": "colombia", "sentiment": "none"}, {"name": "bogota", "sentiment": "none"}], "organizations": [{"name": "miami herald", "sentiment": "negative"}, {"name": "fox news", "sentiment": "negative"}, {"name": "committee", "sentiment": "none"}, {"name": "fox news latino", "sentiment": "none"}, {"name": "cpj", "sentiment": "none"}, {"name": "associated press", "sentiment": "none"}, {"name": "caracol tv", "sentiment": "none"}, {"name": "caracol radio", "sentiment": "none"}, {"name": "herald", "sentiment": "none"}, {"name": "national union of press workers", "sentiment": "none"}, {"name": "espacio publico", "sentiment": "none"}, {"name": "facebook  follow us on twitter & instagram", "sentiment": "none"}, {"name": "al jazeera", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Published September 01, 2016 Fox News Latino Venezuelan President Nicolas Maduro AP \nVenezuela has detained and deported a number of foreign journalists in the lead-up to a massive anti-government protest planned for Thursday in Caracas.\nAmong those detained was The Miami Herald’s Andean bureau chief Jim Wyss, who arrived in Caracas early on Tuesday on a journalist visa that is valid through October. Wyss, however, emailed the newspaper late on Wednesday afternoon saying: “Am being detained … by immigration.”\nFox News Latino was able to get in touch with Wyss, who said that he was “scrambling to get back to Bogotá and figuring out how to cover today's protests in Caracas.”\nMiami Herald Executive Editor Aminda Marques Gonzalez said Wyss was just doing his job.\n“Jim Wyss traveled to Venezuela as a journalist to report a story that is extremely important to our readers and Latin America,” she said. “He was doing his job when he was detained.”\nBesides Wyss, there have been numerous reports of foreign journalists being detained and denied entry into the country in the days preceding the protest to demand a recall referendum on President Nicolás Maduro.\nVenezuela’s National Union of Press Workers (SNTP) announced that authorities had detained three employees of the Qatar-based news agency Al Jazeera when they arrived on Monday at the Maiquetia international airport outside Caracas.\n\"Teresa Bo, correspondent, Lagmi Chavez, producer, and a cameraman (from) @AlJazeera were detained in Maiquetia,\" the SNTP tweeted, adding that their equipment was confiscated.\nAlong with the Al Jazeera journalists, Venezuela this week has denied entry to reporters from Le Monde, Caracol Radio in Colombia, Caracol TV and the Andean correspondent for the Committee to Protect Journalists (CPJ) John Otis.\nThe CPJ has called for the Venezuelan government to allow foreign journalists to freely work in the country.\n“We urge Venezuelan authorities to allow journalists to cover events in Venezuela, in the midst of a deep economic and political crisis,” said Carlos Lauría, CPJ’s senior program coordinator for the Americas. “Authorities should expedite timely permission for journalists so the international press can report first-hand on these important events.”\nWyss is based in Bogota, Colombia and has covered the Andean region for the Herald since 2010. This is the second time that Wyss has been detained in Venezuela, with the first occurring in 2013 as he was wrapping up a reporting trip on the Venezuelan border and taken to Caracas.\nHe was held for 48 hours. At the time, Venezuelan authorities said the detention stemmed from not having the proper media credentials. Since then, Wyss has returned to Venezuela on reporting trips without similar problems.\nAlong with foreign reporters, Venezuelan journalists have also reported numerous issues, with media rights group Espacio Publico saying that in 2015 there were 286 incidents of intimidation and harassment against journalists.\nReporters Without Borders ranked the country 137th out of 180 last year on its worldwide press freedom index.\nThe detainment of the journalists comes as Venezuela’s socialist government faces major economic and political turmoil, with organizers of Thursday’s march demanding that the government meet their constitutionally sanctioned demand for a referendum to remove Maduro from power.\nSince global oil prices plunged in 2015, Venezuela hasn’t had the funds to import basic goods such as food and medicine, creating acute shortages and stirring anger toward the Maduro administration.\nAdding to the overall misery are a drastic rise in violent crime, especially in the capital city of Caracas, rolling blackouts and widespread and often times bloody protests against the government. There have been casualties and deaths on both sides of the protests and accusations from international groups of human rights abuses and political oppression as well as the suppression of free press.\nThe Associated Press contributed to this report. \nLike us on Facebook \nFollow us on Twitter & Instagram", "external_links": [], "published": "2016-09-01T03:00:00.000+03:00", "crawled": "2016-09-01T20:11:57.388+03:00", "highlightTitle": ""}