{"organizations": [], "uuid": "c9d11c9e769fb28b40ea09c86e2f584d946fcc3f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "mediamatters.org", "main_image": "http://cloudfront.mediamatters.org/static/uploader/image/2016/09/19/hrcvettingrefugee.png", "site_section": "", "section_title": "", "url": "http://mediamatters.org/research/2016/09/19/right-wing-media-falsely-claim-clinton-adopting-trump-s-position-refugee-vetting/213185", "country": "US", "domain_rank": 12596, "title": "Right-Wing Media Falsely Claim Clinton Is Adopting Trump’s Position On Refugee Vetting", "performance_score": 0, "site": "mediamatters.org", "participants_count": 0, "title_full": "Right-Wing Media Falsely Claim Clinton Is Adopting Trump’s Position On Refugee Vetting", "spam_score": 0.027, "site_type": "news", "published": "2016-09-19T22:59:00.000+03:00", "replies_count": 0, "uuid": "c9d11c9e769fb28b40ea09c86e2f584d946fcc3f"}, "author": "", "url": "http://mediamatters.org/research/2016/09/19/right-wing-media-falsely-claim-clinton-adopting-trump-s-position-refugee-vetting/213185", "ord_in_thread": 0, "title": "Right-Wing Media Falsely Claim Clinton Is Adopting Trump’s Position On Refugee Vetting", "locations": [], "entities": {"persons": [{"name": "clinton", "sentiment": "negative"}, {"name": "cydney hargis", "sentiment": "negative"}, {"name": "trump", "sentiment": "negative"}, {"name": "hillary clinton", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}, {"name": "maccallum", "sentiment": "none"}, {"name": "lisa", "sentiment": "none"}, {"name": "lisa boothe", "sentiment": "none"}, {"name": "emily", "sentiment": "none"}, {"name": "hemmer", "sentiment": "none"}, {"name": "martha maccallum", "sentiment": "none"}, {"name": "emily tisch sussman", "sentiment": "none"}, {"name": "john brennan", "sentiment": "none"}, {"name": "kayleigh mcenany", "sentiment": "none"}, {"name": "fox", "sentiment": "none"}, {"name": "bill hemmer", "sentiment": "none"}, {"name": "boothe", "sentiment": "none"}, {"name": "lisa boothe", "sentiment": "none"}, {"name": "john dickerson", "sentiment": "none"}, {"name": "bill hemmer", "sentiment": "none"}, {"name": "obama", "sentiment": "none"}, {"name": "martha maccallum", "sentiment": "none"}, {"name": "@hillaryclinton", "sentiment": "none"}, {"name": "hillary", "sentiment": "none"}, {"name": "sussman", "sentiment": "none"}, {"name": "ed henry", "sentiment": "none"}, {"name": "mark levin", "sentiment": "none"}], "locations": [{"name": "united states", "sentiment": "none"}, {"name": "minnesota", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "syria", "sentiment": "none"}, {"name": "u.s", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "new jersey", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}], "organizations": [{"name": "fox news", "sentiment": "none"}, {"name": "congress", "sentiment": "none"}, {"name": "time magazine", "sentiment": "none"}, {"name": "state", "sentiment": "none"}, {"name": "u.n. general assembly", "sentiment": "none"}, {"name": "cia", "sentiment": "none"}, {"name": "cnn", "sentiment": "none"}, {"name": "washington examiner", "sentiment": "none"}, {"name": "time", "sentiment": "none"}, {"name": "isis", "sentiment": "none"}, {"name": "university of minnesota’s humphrey school of public affairs", "sentiment": "none"}, {"name": "united nations", "sentiment": "none"}, {"name": "university of minnesota speech", "sentiment": "none"}, {"name": "cbs", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "››› CYDNEY HARGIS ? \nConservative media claimed Democratic presidential nominee Hillary Clinton was adopting rival Republican nominee Donald Trump’s stance on how to handle refugees and immigrants after she called for “tough vetting” following a series of recent terror attacks. However, Clinton has been consistent in calling for “rigorous” and “thorough” vetting, while also arguing that “we cannot allow terrorists to intimidate us into abandoning our values and our humanitarian obligations.” Clinton Calls For “Courage And Vigilance” After A Series Of Terror Attacks \nClinton Responds To Question About Terror Suspect -- Who Is A Naturalized Citizen -- And “Trump’s Approach To Terror” By Reiterating Her Support For “Tough Vetting” And Condemning Trump’s “Campaign Rhetoric.” Democratic presidential nominee Hillary Clinton held a press conference on September 19 after there were a series of terror attacks in New York, New Jersey and Minnesota. Clinton offered her support and thanks to law enforcement while calling for Americans to be “vigilant, but not afraid” and to “not turn on each other or undermine our values.” When asked about one of the suspects, an Afghan immigrant who is a naturalized U.S. citizen, and whether voters “may see this as a reason to consider supporting Trump’s approach to terror and immigration,\" Clinton reiterated her support for “tough vetting” for refugees and immigrants. From the September 19 press conference transcript, as printed by Time magazine: \nHILLARY CLINTON: Like all Americans, my thoughts are with those who were wounded, their families and our brave first responders. This threat is real, but so is our resolve. Americans will not cower, we will prevail. We will defend our country and we will defeat the evil, twisted ideology of the terrorists. \n[...] \nMost of all, I want to say this to my fellow Americans. Let us be vigilant, but not afraid. We have faced threats before. If you see something, or you hear something, report it immediately to local law enforcement authorities. I know we will meet this new danger with the same courage and vigilance. We choose resolve, not fear. We will not turn on each other or undermine our values. We’ll stand together because we are stronger together in the face of this threat and every other challenge. \n[...] \nWell, it is true that a suspect of interest has been identified and we need to do everything we can to support law enforcement as they track him down to determine what role if any he played in these events. \nBut let us remember, there are millions and millions of naturalized citizens in America from all over the world. There are millions of law-abiding peaceful Muslim-Americans. This is the kind of challenge that law enforcement can be and is prepared to address, namely going after anyone who would threaten the United States. \nSo I am absolutely in favor of and have long been an advocate for tough vetting, for making sure that we don’t let people into this country — and not just people who come here to settle, but we need a better visa system. Let’s remember what happened on 9/11. These were not refugees who got into airplanes and attacked our city and our country. So let’s not get diverted and distracted by the kind of campaign rhetoric we hear coming from the other side. [ Time magazine, 9/19/16 ] Right-Wing Media Claim Clinton Is Adopting Trump’s “Tough” Refugee Stance \nFox’s Bill Hemmer: “I Have Not Seen This ‘Tough Vetting’ Comment Before” From Clinton. Fox anchor Bill Hemmer questioned whether Clinton was toughening her stance on vetting refugees after claiming to have “scour[ed]” her website looking for similar statements from the candidate. Washington Examiner ’s Lisa Boothe agreed, suggesting that Clinton is “weak” on terrorism whereas it is “actually a strong suit” for Trump. After brief pushback, Hemmer repeated that he has not seen this comment from Clinton before and “by all accounts, it's the first time.” From the September 19 edition of Fox News’ America’s Newsroom : \nBILL HEMMER (CO-HOST): I’ve been scouring Hillary Clinton’s website, we’re looking for articles or statements in the past, maybe we find them, so far we haven’t, OK, on the following comment she made a moment ago about immigrants and immigration here in the U.S. She said we need tough vetting. Lisa, is she changing a different perhaps direction on this issue now? \nLISA BOOTHE: Perhaps, because I think this has been a weakness, terrorism has been a weakness for both the Obama administration and Hillary Clinton. Americans have consistently seen President Obama as weak when it comes to taking the fight to ISIS and Hillary Clinton is an extension of that, both just looking at their failed foreign policy with the expansion of ISIS, which is now in 18 different countries. And this is actually a strong suit for Donald Trump. He has consistently led in polling on the issue of taking the fight to ISIS, on issue of terrorism. So he needs to continue to voice a strong opinion about that and continue to project himself as a leader and someone that will indeed take that fight to ISIS. \nHEMMER: Well, you know, they say current events can change things quickly. And, you know, we’re a week away from this debate, Emily. You just wonder is she changing her position, prepping for one-on-one with Trump next week? \nEMILY TISCH SUSSMAN: I don't think she is changing a position. I think she has always been very strong on this issue. And the fact is that the way we're going to combat terrorism, both domestic and abroad, has to be a holistic policy. You have to have smart foreign policy, you have to have allies, and you have to have economic policy that goes along with that. So what Trump is spouting is an isolationist economic policy and a total warmonger foreign policy. Those don't make any sense and those don't work. What Clinton has talked about and has always talked about is one consistent policy. So if we're going to talk about refugees and strong vetting, that is consistent. That is actually consistent what we have right now. A process for bring -- \nHEMMER: Is it? I have not seen this tough vetting comment before. I mean -- \nSUSSMAN: Maybe she hasn't used that kind of -- \nHEMMER: By all accounts it's the first time. \nSUSSMAN: She may not have used that language before but certainly consistent with policy she talked about on immigration where we know who is coming in and we know who is here and we legalize them and bring them into the system that we have. Refugees -- \nBOOTHE: But the problem with that, Obama administration, Obama administration themselves has said we cannot vet Syrian refugees that are coming into the country. \n[...] \nBOOTHE: As well, CIA director John Brennan said before the intelligence committee that is a fear of his. The fact that ISIS will penetrate both European nations and United States through Syrian migrants. I mean, this is a point of weakness that the Obama administration themselves has admitted. So that is smart of Donald Trump to try to project the -- both the Obama administration and Hillary Clinton campaign as weak on this issue. [Fox News, America’s Newsroom , 9/19/16 ] \nFox News’ Martha MacCallum: Hillary “May Be Trying To … Narrow The Daylight Between Herself And Donald Trump” On Thorough Vetting Of Immigrants And Refugees. Later during America’s Newsroom, Hemmer admitted that Clinton had previously talked about “thoroughly screening” immigrants, but his co-anchor Martha MacCallum still claimed that “Clinton came on much stronger” on vetting refugees and immigrants during the September 19 press conference. MacCallum added that Clinton spoke with much more urgency “than we have seen … from her in the past,” and suggested that Clinton “may be trying to sort of narrow the daylight between herself and Donald Trump on this issue a little bit as they head into the debate period.” From the September 19 edition of Fox News’ America’s Newsroom : \nBILL HEMMER (CO-HOST): This is going to be an issue, national security, no doubt about it. Fifty days away from an election, seven days away from the debates. Now Donald Trump has been talking about extreme vetting for several months now, about immigrants coming out of war-torn countries and countries that are tied to terrorism here in the United States. Hillary Clinton, in the past hour, talked about quote “tough vetting of immigrants.” So we’ve done a big scan, we found this on the 14th of July, so two months ago this past summer, in an interview on CNN, she said, “We should only let people in this country after we have thoroughly screened them, no matter how long that takes. No matter what we have to act more quickly. I would not short-circuit the vetting process.” So, in a way, she has referred to this in the past. Whether or not this is a significant change based on the language we heard today about strong vetting is something we will wait and see. \nMARTHA MACCALLUM (CO-HOST): Obviously Hillary Clinton came on much stronger this morning than we have seen her in the past, or even over the last 24 hours. The way that she spoke about this and the urgency that she had when she spoke about these terror attacks that happened in three states over the weekend was stronger than what we have seen in other instances from her in the past. She may be trying to sort of narrow the daylight between herself and Donald Trump on this issue a little bit as they head into that debate period because clearly everyone wants someone who is vigilant. Although she did say she didn’t see this as a religious battle. She believes that it is a violent extremist battle that we are waging in this country. But boy have we become thick-skinned about this stuff, New Yorkers, everybody through the tunnels, over the bridges this morning, back into the city in spite of this attempted attack and real attack over the course of the weekend. [Fox News, America’s Newsroom , 9/19/16 ] \nFox News’ Ed Henry: “Hillary Clinton Says She Is For ‘Tough Vetting’ Of Immigrants -- Sounds Sort Of Familiar.” . @HillaryClinton says she is for \"tough vetting\" of immigrants -- sounds sort of familiar \n[Twitter, 9/19/16 ] \nCNN’s Kayleigh McEnany: “Hillary Calls For ‘Tough Vetting Of Immigrants.’ Instead Of Demonizing Trump Today, She’s Attempting To Duplicate Him.” Hillary calls for \"tough vetting of immigrants.\" Instead of demonizing Trump today, she's attempting to duplicate him. \n[Twitter, 9/19/16 ] \nRadio Host Mark Levin: “Now Hillary Wants Tough Vetting. Wouldn’t That Make Her A Muslim-Hating Racist?” Conservative radio host and Conservative Review editor Mark Levin tweeted about Clinton’s call for “tough vetting,” linking to an article in Conservative Review headlined “Did Hillary Just Adopt Trump’s ‘Tough Vetting’ Position?” Now Hillary wants tough vetting. Wouldn't that make her a Muslim-hating racist? https://t.co/i0yUTSil9g \n[Twitter, 9/19/16 ] Clinton Has Consistently Advocated For “Vigilant” And “Rigorous Vetting” \nClinton Calls For “Vigilant” Screening And Vetting In University Of Minnesota Speech. At the University of Minnesota’s Humphrey School of Public Affairs, Clinton called for a “full visa investigation” for “anyone who has traveled in the past five years to a country facing serious problems with terrorism and foreign fighters.” Clinton added that, while “rigorous vetting already takes place,” “we also have to be vigilant in screening and vetting refugees from Syria.” From the December 2015 speech: \nFor many years, America has waived visa requirements for travelers from countries with reliable security procedures, including key allies in Europe and Asia. That makes sense. But we also have to be smart. Except for limited exceptions like diplomats and aid workers, anyone who has traveled in the past five years to a country facing serious problems with terrorism and foreign fighters should have to go through a full visa investigation, no matter where they’re from. \nWe also have to be vigilant in screening and vetting refugees from Syria, guided by the best judgment of our security and diplomatic professionals. Rigorous vetting already takes place while these refugees are still overseas, and it’s a process that historically takes 18 to 24 months. \nBut Congress needs to provide enough resources to ensure we have sufficient personnel deployed to run the most thorough possible process. \nAnd just as important, we cannot allow terrorists to intimidate us into abandoning our values and our humanitarian obligations. \nTurning away orphans, applying a religious test that discriminates against Muslims, slamming the door on every single Syrian refugee; that is not who we are. We are better than that. [Hillaryclinton.com, 12/15/2015 ] \nClinton Says U.S. Needs To Put In Place “Mechanisms For Vetting” Larger Numbers Of Syrian Refugees. During an interview with Face the Nation ’s John Dickerson, Clinton advocated for the United States to accept more Syrian refugees in order to help alleviate “the worst refugee crisis since the end of World War II.” The candidate called for increasing the number of refugees to 65,000, while immediately putting into place “the mechanisms for vetting the people that we would take in.” From the September 15, 2015, edition of CBS’ Face the Nation : \nDemocratic presidential candidate Hillary Clinton said Sunday that the United States should accept 65,000 refugees from Syria to help alleviate the humanitarian crisis created by the war there. \n\"We're facing the worst refugee crisis since the end of World War II and I think the United States has to do more,\" the former secretary of state said Sunday on CBS' \"Face the Nation.\" \"I would like to see us move from what is a good start with 10,000 to 65,000 and begin immediately to put into place the mechanisms for vetting the people that we would take in.\" \nShe said there should be a focus on admitting the most vulnerable, like persecuted religious minorities, or those who had been brutalized, like the Yazidi women. \nClinton also said, \"I want the United States to lead the world,\" and said the United Nations Secretary General should call for a meeting at the upcoming U.N. General Assembly meeting in which countries make specific commitments about to provide money and aid. [CBSNews.com, 9/15/2015 ] \n", "external_links": [], "published": "2016-09-19T22:59:00.000+03:00", "crawled": "2016-09-21T02:31:21.201+03:00", "highlightTitle": ""}