{"organizations": [], "uuid": "55770efe10d131c729adad30165a766cdd21f1d6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cogwriter.com", "main_image": "", "site_section": "http://www.cogwriter.com/news/feed", "section_title": "Church of God News", "url": "http://www.cogwriter.com/news/prophecy/stephen-hawking-warns-of-alien-contact-danger/", "country": "US", "title": "Stephen Hawking warns of alien contact danger", "performance_score": 0, "site": "cogwriter.com", "participants_count": 1, "title_full": "Stephen Hawking warns of alien contact danger", "spam_score": 0.0, "site_type": "news", "published": "2016-09-25T08:00:00.000+03:00", "replies_count": 0, "uuid": "55770efe10d131c729adad30165a766cdd21f1d6"}, "author": "admin", "url": "http://www.cogwriter.com/news/prophecy/stephen-hawking-warns-of-alien-contact-danger/", "ord_in_thread": 0, "title": "Stephen Hawking warns of alien contact danger", "locations": [], "entities": {"persons": [{"name": "stephen hawking", "sentiment": "none"}, {"name": "paul", "sentiment": "none"}, {"name": "christ", "sentiment": "none"}, {"name": "gospel of the kingdom of god", "sentiment": "none"}, {"name": "james", "sentiment": "none"}, {"name": "peter", "sentiment": "none"}, {"name": "thiel", "sentiment": "none"}, {"name": "john", "sentiment": "none"}, {"name": "jesus", "sentiment": "none"}, {"name": "zechariah", "sentiment": "none"}, {"name": "gospel of the kingdom", "sentiment": "none"}, {"name": "christopher columbus", "sentiment": "none"}, {"name": "herbert w. armstrong", "sentiment": "none"}, {"name": "charles f. hunting", "sentiment": "none"}, {"name": "hawking", "sentiment": "none"}, {"name": "jesus christ", "sentiment": "none"}], "locations": [{"name": "america", "sentiment": "none"}, {"name": "earth", "sentiment": "none"}, {"name": "columbus", "sentiment": "none"}, {"name": "euphrates", "sentiment": "none"}, {"name": "jerusalem", "sentiment": "none"}, {"name": "mount of olives", "sentiment": "none"}], "organizations": [{"name": "oxford university", "sentiment": "none"}, {"name": "oxford", "sentiment": "none"}, {"name": "tiene dios", "sentiment": "none"}, {"name": "oxford university’s future of humanity institute", "sentiment": "none"}, {"name": "the times", "sentiment": "none"}, {"name": "russian times", "sentiment": "none"}, {"name": "great tribulation", "sentiment": "none"}, {"name": "global challenges foundation", "sentiment": "none"}, {"name": "cbs", "sentiment": "none"}, {"name": "mount of olives", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Theoretical physicist and atheist Stephen Hawking has once again given a warning about possible destruction from alien contact: \nSeptember 24, 2016 \nHumanity should be wary of seeking out contact with alien civilizations, Stephen Hawking has warned once again. \nIn 2010, the famed astrophysicist said that intelligent aliens may be rapacious marauders, roaming the cosmos in search of resources to plunder and planets to conquer and colonize . He reiterates that basic concern in “Stephen Hawking’s Favorite Places,” a new documentary streaming now on the CuriosityStream video service. \n“One day, we might receive a signal from a planet like this,” Hawking says in the documentary, referring to a potentially habitable alien world known as Gliese 832c. “But we should be wary of answering back. Meeting an advanced civilization could be like Native Americans encountering Columbus. That didn’t turn out so well.” \nFor what it’s worth, some other astronomers believe Hawking’s caution is unwarranted. Any alien civilization advanced enough to come to Earth would surely already know of humans’ existence via the radio and TV signals that humanity has been sending out into space since 1900 or so, this line of thinking goes. \nThe alien musings are just a small part of “Stephen Hawking’s Favorite Places.” The 26-minute documentary shows the scientist zooming through the cosmos on a souped-up CGI spaceship called the “S.S. Hawking,” making five separate stops. http://www.space.com/34184-stephen-hawking-afraid-alien-civilizations.html \nHe has done this before: \nAlien life \nBut Hawking had made ominous warnings even before these recent ones. Back in 2010, Hawking said that, if intelligent alien life exists, it may not be that friendly toward humans. \n“If aliens ever visit us, I think the outcome would be much as when Christopher Columbus first landed in America, which didn’t turn out very well for the Native Americans,” Hawking said during an episode of “Into the Universe with Stephen Hawking,” a show hosted by the Discovery Channel, reported The Times, a U.K.-based newspaper. \nAdvanced alien civilizations might become nomads, looking to conquer and colonize whatever planets they could reach, Hawking said. “If so, it makes sense for them to exploit each new planet for material to build more spaceships so they could move on. Who knows what the limits would be?” http://www.cbsnews.com/news/stephen-hawking-thinks-these-3-things-could-destroy-humanity/ \nNo, Dr. Hawking there will not be nomadic aliens that destroy humanity. \nHowever, if unclean spirits (watch Poltergeists and Lying Wonders ) and the return of Jesus Christ would be considered to be some type of ‘alien life’ by an atheist such as Stephen Hawking, then the earth will be affected. \nNotice that the influence of the unclean spirits to draw fighters to Armageddon: \n12 Then the sixth angel poured out his bowl on the great river Euphrates, and its water was dried up, so that the way of the kings from the east might be prepared. 13 And I saw three unclean spirits like frogs coming out of the mouth of the dragon, out of the mouth of the beast, and out of the mouth of the false prophet. 14 For they are spirits of demons, performing signs, which go out to the kings of the earth and of the whole world, to gather them to the battle of that great day of God Almighty. \n15 “Behold, I am coming as a thief. Blessed is he who watches, and keeps his garments, lest he walk naked and they see his shame.” \n16 And they gathered them together to the place called in Hebrew, Armageddon. (Revelation 16:12-16) \nBut what will happen to this ‘alien influenced’ force? Well, it will itself be destroyed when Jesus returns: \n3 Then the Lord will go forth And fight against those nations, As He fights in the day of battle. 4 And in that day His feet will stand on the Mount of Olives, Which faces Jerusalem on the east. And the Mount of Olives shall be split in two, From east to west, Making a very large valley; Half of the mountain shall move toward the north And half of it toward the south. (Zechariah 14:3-4) \n19:11 Now I saw heaven opened, and behold, a white horse. And He who sat on him was called Faithful and True, and in righteousness He judges and makes war. 12 His eyes were like a flame of fire, and on His head were many crowns. He had a name written that no one knew except Himself. 13 He was clothed with a robe dipped in blood, and His name is called The Word of God. 14 And the armies in heaven, clothed in fine linen, white and clean, followed Him on white horses. 15 Now out of His mouth goes a sharp sword, that with it He should strike the nations. And He Himself will rule them with a rod of iron. He Himself treads the winepress of the fierceness and wrath of Almighty God. 16 And He has on His robe and on His thigh a name written: KING OF KINGS AND LORD OF LORDS. (Revelation 19:11-16) \n12 And this shall be the plague with which the Lord will strike all the people who fought against Jerusalem: Their flesh shall dissolve while they stand on their feet, Their eyes shall dissolve in their sockets, And their tongues shall dissolve in their mouths. 13 It shall come to pass in that day That a great panic from the Lord will be among them. Everyone will seize the hand of his neighbor, And raise his hand against his neighbor’s hand; (Zechariah 14:12-13) \n17 Then I saw an angel standing in the sun; and he cried with a loud voice, saying to all the birds that fly in the midst of heaven, “Come and gather together for the supper of the great God, 18 that you may eat the flesh of kings, the flesh of captains, the flesh of mighty men, the flesh of horses and of those who sit on them, and the flesh of all people, free and slave, both small and great.” \n19 And I saw the beast, the kings of the earth, and their armies, gathered together to make war against Him who sat on the horse and against His army. 20 Then the beast was captured, and with him the false prophet who worked signs in his presence, by which he deceived those who received the mark of the beast and those who worshiped his image. These two were cast alive into the lake of fire burning with brimstone. 21 And the rest were killed with the sword which proceeded from the mouth of Him who sat on the horse. And all the birds were filled with their flesh. Revelation 19:17-21) \nNotice that afterwards, another form of ‘alien life’ (an angel) will come and bind the ‘dragon, the leader of the unclean spirits: \n20:1 Then I saw an   the key to the bottomless pit and a great chain in his hand. 2 He laid hold of the dragon, that serpent of old, who is the Devil and Satan, and bound him for a thousand years; 3 and he cast him into the bottomless pit, and shut him up, and set a seal on him, so that he should deceive the nations no more till the thousand years were finished. But after these things he must be released for a little while. \n4 And I saw thrones, and they sat on them, and judgment was committed to them. Then I saw the souls of those who had been beheaded for their witness to Jesus and for the word of God, who had not worshiped the beast or his image, and had not received his mark on their foreheads or on their hands. And they lived and reigned with Christ for a thousand years. (Revelation 20:1-4) \nTherefore, instead of ‘alien life’ actually destroying all human life, it will take the return of Jesus Christ and the establishment of the kingdom of God to prevent humanity from destroying itself: \n20 And unless the Lord had shortened those days, no flesh would be saved; but for the elect’s sake, whom He chose, He shortened the days. (Mark 13:20) \nWhile humanity will get close to destroying itself, Divine intervention, which is alien to people such as Dr. Hawking, will intervene and save humanity (read also The Gospel of the Kingdom of God and Did The Early Church Teach Millenarianism? ). \nSome items of possibly   \nStephen Hawking and ‘Alien Destruction’ CBS reported that theoretical physicist and atheist was concerned about three ways humanity could be destroyed. One of them was actually by being conquered by aliens. Does the Bible give credence to anything that could be considered as ‘alien’? Will ‘alien beings’ be a factor in Armageddon? Will humans fight against Jesus when He returns? Will the result of the type of ‘alien interventions’ the Bible discusses turn out in disaster or peace? This is a video. Stephen Hawking is wrong about the ‘end of the world’ Atheist and theoretical physicist Stephen Hawking stated that humans will not last another 1000 years on planet Earth. His ‘solutions’ included finding another planet or looking for alternative planes of existence. Dr. Hawking is considered the smartest man on the Earth according to some, but you can know more of the truth if you. believe what the Bible itself teaches. Dr. Thiel quotes the words of Jesus and other portions of scripture to explain where Dr. Hawking is right about some of his ideas, but wrong about others. Does the Bible show that all Christians be protected at the end or only a few? This is a video. The Gospel of the Kingdom of God This free online pdf booklet has answers many questions people have about the Gospel of the Kingdom of God and explains why it is the solution to the issues the world is facing. 12 Apocalyptic Risks from Oxford University This is a video related to a 212 page report from Oxford University’s Future of Humanity Institute and the Global Challenges Foundation titled “12 Risks that threaten human civilisation.” The Russian Times reported about it with an article titled The article was titled, “12 likely causes of the Apocalypse, as seen by scientists.” Risks included asteroid impact, supervolacanic explosion, global pandemic, nuclear war,climate change, synthetic biology, nanotechnology, unknown consequences, ecological collapse, economic global system collapse, bad governance, and artificial intelligence flaws. Are the risks greater than what Oxford scientists believe? What does the Bible say about these risks? A written article of   Oxford University’s 12 likely causes of the Apocalypse . Just What Do You Mean — Repentance? Do you know what repentance is? Have you truly repented? Repented of what? Herbert W. Armstrong wrote this as a booklet on this important subject. When You Sin: Do You Really Repent? This is an article by Charles F. Hunting. A related sermon is Confess to God and truly repent . The Ten Commandments Reflect Love, Breaking them is Evil Some feel that the ten commandments are a burden. Is that what Jesus, Paul, Peter, James, and John taught? For a more detailed discussion of the first four commandments, please see the video The Ten Commandments: Loving God . For a more detailed discussion of the last six commandments, please see: The Ten Commandments: Loving Your Neighbor . Here is a link to a related article in Mandarin Chinese 十条诫命显示爱，违反诫命的就是邪恶的 Did The Early Church Teach Millenarianism? Was the millennium (sometimes called chiliasm) taught by early Christians? Who condemned it? Will Jesus literally reign for 1000 years on the earth? Is this time near? Two related sermons are available Millennial Utopia and The Millennium. Does God Have a 6,000 Year Plan? What Year Does the 6,000 Years End? Was a 6000 year time allowed for humans to rule followed by a literal thousand year reign of Christ on Earth taught by the early Christians? Does God have 7,000 year plan? What year may the six thousand years of human rule end? When will Jesus return? 2023 or 20xx? There is also a video titled The 6000 Year Plan: Is the end of humanity’s reign almost up? Here is a link to the article in Spanish: ¿Tiene Dios un plan de 6,000 años? When Will the Great Tribulation Begin? 2016, 2017, or 2018? Can the Great Tribulation begin today? What happens before the Great Tribulation in the “beginning of sorrows”? What happens in the Great Tribulation and the Day of the Lord? Is this the time of the Gentiles? When is the earliest that the Great Tribulation can begin? What is the Day of the Lord? Who are the 144,000? Here is a version of the article in the Spanish language: ¿Puede comenzar la Gran Tribulación en 2016 o 2017? ¿Es el Tiempo de los Gentiles? You can also see the English language sermon video: The Great Tribulation from the Mount of Olives . A shorter video is: Can the Great Tribulation Start in 2016?", "external_links": [], "published": "2016-09-25T08:00:00.000+03:00", "crawled": "2016-09-25T06:21:03.620+03:00", "highlightTitle": ""}