{"organizations": [], "uuid": "300289504a11eef18903ffa7e7af2cade3e706eb", "thread": {"social": {"gplus": {"shares": 2}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 679, "shares": 679, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/politics/0/0/clinton%20latino%20dc.jpg", "site_section": "http://feeds.latino.foxnews.com/home/feed", "section_title": "FOX News", "url": "http://latino.foxnews.com/latino/politics/2016/09/16/hillary-clinton-taco-truck-on-every-corner-sounds-absolutely-delicious/", "country": "US", "domain_rank": 185, "title": "Hillary Clinton: A taco truck on every corner sounds 'absolutely delicious'", "performance_score": 6, "site": "foxnews.com", "participants_count": 1, "title_full": "Hillary Clinton: A taco truck on every corner sounds 'absolutely delicious' | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2016-09-16T03:00:00.000+03:00", "replies_count": 0, "uuid": "300289504a11eef18903ffa7e7af2cade3e706eb"}, "author": "Serafin Gómez", "url": "http://latino.foxnews.com/latino/politics/2016/09/16/hillary-clinton-taco-truck-on-every-corner-sounds-absolutely-delicious/", "ord_in_thread": 0, "title": "Hillary Clinton: A taco truck on every corner sounds 'absolutely delicious'", "locations": [], "entities": {"persons": [{"name": "hillary clinton", "sentiment": "positive"}, {"name": "serafin gómez", "sentiment": "positive"}, {"name": "clinton", "sentiment": "none"}, {"name": "serafin gomez", "sentiment": "none"}, {"name": "luis magana", "sentiment": "none"}, {"name": "norma torres", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "barack obama", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "cesar chavez", "sentiment": "none"}, {"name": "obama", "sentiment": "none"}], "locations": [{"name": "california", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "washington convention center", "sentiment": "none"}, {"name": "latin america", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "ohio", "sentiment": "none"}], "organizations": [{"name": "caucus institute", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "congressional hispanic caucus", "sentiment": "none"}, {"name": "fox news channel", "sentiment": "none"}, {"name": "congressional hispanic caucus institute", "sentiment": "none"}, {"name": "ap", "sentiment": "none"}, {"name": "miami bureau producer for fox news channel", "sentiment": "none"}, {"name": "hispanic heritage month", "sentiment": "none"}, {"name": "democratic party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Serafin Gómez \n  Democratic presidential candidate Hillary Clinton speaks to the Congressional Hispanic Caucus Institute's 39th Annual Gala Dinner held at the Washington Convention Center, in Washington, Thursday, Sept. 15, 2016. Clinton returned to the campaign trail after a bout of pneumonia that sidelined her for three days and revived questions about both Donald Trump's and her openness regarding their health..( AP Photo/Jose Luis Magana) \nWASHINGTON DC - –   The two most prominent standard-bearers of the Democratic Party—the sitting president of the United States and the party’s presidential nominee-- came to the Congressional Hispanic Caucus Institute dinner on Thursday, just one mile away from the  White House,  and appealed to Latino voters  with one simple message: They needed their help to beat Donald Trump.\n“Folks are betting that if they can drive us far enough apart and if they can put down enough of us because of where we come from or what we look like, what religion we practice, then that may pay off at the polls. But I am telling you that is a bet they are going to lose,”  President Barack Obama said in his remarks.\n\"We can’t let that brand of politics win. If we band together, and if we organize communities, if we deliver enough votes, then the better angels of our natures will carry the day,“ Obama said.\nAt one point the president also reiterated the popular slogan for Latino and immigrant rights activist that was immortalized during the Cesar Chavez marches in the 1960s.\n“Si se puede,” Obama said.  Of course, a Spanish translation of his own favorite  motto: “Yes we can.”\nObama won crucial battleground states in 2008, and during his reelection in 2012, due in part to record Latino support. Four years ago, Obama garnered 69 percent of the Latino vote and Hillary Clinton is hoping Hispanics will mobilize again with the election less than two months away.\nThe Democratic presidential hopeful returned to the campaign trail after taking three days off to recuperate from a bout of pneumonia. She also found herself losing in a number of swing states including Ohio after an onslaught of media criticism over her campaign’s handling of the situation.\nClinton told the room of politically active Hispanics, many of whom are Democratic members of the Congressional Hispanic Caucus, that any chance of victory in November relied on turning out the Latino vote.\n\"No one understands better than you the pivotal moment we're at right now—not just for Latinos but for our country, “ Clinton said.\"My friends in the caucus have traveled to every battleground state and have registered voters. You have stayed focused no matter what kind of outlandish and offensive comments we have heard from my opponent and his supporters.\"\nOne of the loudest response from an already amplified crowd was when she ridiculed the comment of a Trump surrogate who said that continued unfettered immigration would cause a “ taco truck on every order.”\n\"By the way, I personally think a taco truck on every corner sounds absolutely delicious,\" she said to the suddenly raucous crowd at the Washington Convention Center.\nEarlier in the week, Democratic members of the Congressional Hispanic Caucus  told reporters at a commemoration of Hispanic Heritage Month that they felt a greater need to mobilize this election because of Trump and the controversial comments he has made against undocumented immigration.\n\"To the Latinos out there, too often we have allowed people like Donald Trump to label us,” California Rep. Norma Torres (D-C) told The Hill. \"Let’s show Donald Trump that this sleeping giant that everyone talks about is awake.\"\n\nSerafin Gomez covers Special Events and Politics for FOX News Channel and is also a contributor to FOX News Latino. Fin formerly worked as the Miami Bureau Producer for Fox News Channel where he covered Latin America. Follow him on Twitter:  @Finnygo . \nFollow us on twitter.com/foxnewslatino \nLike us at facebook.com/foxnewslatino", "external_links": [], "published": "2016-09-16T03:00:00.000+03:00", "crawled": "2016-09-16T15:29:43.342+03:00", "highlightTitle": ""}