{"organizations": [], "uuid": "3c52624f6f3f2f5abb9c97addf351ae6152c1713", "thread": {"social": {"gplus": {"shares": 2}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 3}, "facebook": {"likes": 147, "shares": 147, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/images.foxnews.com/content/fox-news/politics/2016/09/16/gift-to-unions-push-to-close-private-immigration-detention-sites-under-fire/_jcr_content/par/featured-media/media-0.img.jpg/0/0/1474028934226.jpg?ve=1", "site_section": "http://feeds.foxnews.com/foxnews/politics", "section_title": "FOX News", "url": "http://www.foxnews.com/politics/2016/09/16/gift-to-unions-push-to-close-private-immigration-detention-sites-under-fire.html", "country": "CH", "domain_rank": 185, "title": "'Gift' to Unions? Push to close private immigration detention sites under fire", "performance_score": 1, "site": "foxnews.com", "participants_count": 1, "title_full": "'Gift' to Unions? Push to close private immigration detention sites under fire | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2016-09-16T03:00:00.000+03:00", "replies_count": 0, "uuid": "3c52624f6f3f2f5abb9c97addf351ae6152c1713"}, "author": "FoxNews.com", "url": "http://www.foxnews.com/politics/2016/09/16/gift-to-unions-push-to-close-private-immigration-detention-sites-under-fire.html", "ord_in_thread": 0, "title": "'Gift' to Unions? Push to close private immigration detention sites under fire", "locations": [], "entities": {"persons": [{"name": "fred lucas", "sentiment": "negative"}, {"name": "johnson", "sentiment": "none"}, {"name": "vadum", "sentiment": "none"}, {"name": "mohler", "sentiment": "none"}, {"name": "jeh johnson", "sentiment": "none"}, {"name": "carl takei", "sentiment": "none"}, {"name": "john culberson", "sentiment": "none"}, {"name": "george c. zoley", "sentiment": "none"}, {"name": "matthew vadum", "sentiment": "none"}, {"name": "scott", "sentiment": "none"}, {"name": "gerges scott", "sentiment": "none"}, {"name": "obama", "sentiment": "none"}, {"name": "jeremy mohler", "sentiment": "none"}], "locations": [{"name": "ariz", "sentiment": "none"}, {"name": "new mexico", "sentiment": "none"}, {"name": "r-texas", "sentiment": "none"}, {"name": "tucson", "sentiment": "none"}], "organizations": [{"name": "foxnews.com", "sentiment": "none"}, {"name": "corrections corps of america", "sentiment": "none"}, {"name": "geo group, inc.", "sentiment": "none"}, {"name": "border protection", "sentiment": "none"}, {"name": "homeland security", "sentiment": "none"}, {"name": "justice department", "sentiment": "none"}, {"name": "dhs", "sentiment": "none"}, {"name": "american civil liberties union", "sentiment": "none"}, {"name": "corrections corp of america", "sentiment": "none"}, {"name": "aclu", "sentiment": "none"}, {"name": "u.s. customs", "sentiment": "none"}, {"name": "homeland security advisory council", "sentiment": "none"}, {"name": "geo", "sentiment": "none"}, {"name": "bureau of prisons", "sentiment": "none"}, {"name": "new mexico department of corrections", "sentiment": "none"}, {"name": "capital research center", "sentiment": "none"}, {"name": "customs enforcement", "sentiment": "none"}, {"name": "public interest", "sentiment": "none"}, {"name": "ap", "sentiment": "none"}, {"name": "partnership for working families", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Fred Lucas \nPublished September 16, 2016 FoxNews.com   In this Aug. 9, 2012, file photo, suspected illegal immigrants are transferred out of the holding area after being processed at the Tucson Sector of the U.S. Customs and Border Protection headquarters in Tucson, Ariz.  (AP) \nA push to close the country’s privately run or contracted immigration detention centers is drawing fire from lawmakers and law enforcement experts worried that doing so could lead to more overcrowding -- and even amount to a post-election “gift” to public employee unions.\nThe Homeland Security Advisory Council will make recommendations to Homeland Security Secretary Jeh Johnson on Nov. 30 on whether to close the private centers. Johnson announced a review of the sites on Aug. 29, shortly after the Justice Department announced the Bureau of Prisons would reduce and ultimately end the use of privately run federal prisons in response to an audit.\nHowever, closing the contracted immigration sites would require an 800 percent expansion of Immigration and Customs Enforcement capacity, according to ICE.\n“There’s obviously a need for these private prisons,” Rep. John Culberson, R-Texas, told FoxNews.com, citing ICE’s own numbers in saying they’re arresting “more than 100,000 criminal illegal immigrants.”\nHe said, “I’ve registered my concerns [with the administration] and I strenuously oppose closing these private facilities.”\nWhile the Obama administration already is moving to end the use of private general-purpose prisons, ending the use of such centers to hold illegal immigrants could have a far bigger impact. While only 10 percent of federal prisoners are in private facilities, about 60 percent of ICE detainees pending deportation procedures are held in contracted facilities. Their population fluctuates, but averages nearly 34,000 per day, according to ICE.\nImmigration rights activists originally asked President Obama in August to close down those detention centers.\nBut there could be another factor at play.\nMatthew Vadum, senior vice president for the Capital Research Center, a think tank that investigates liberal nonprofits, said the push is driven to benefit activists and labor unions.\n“This will benefit government unions by providing more opportunities for federal workers and expand unions. De-privatizing doesn’t mean shutting down all of these detention centers,” Vadum told FoxNews.com. “Some will be taken over by the government. This is a gift to the labor movement, but first and foremost it’s ideological, based on the de-incarceration movement.” \nAs of August, ICE uses 182 adult detention facilities, only 10 percent of which are federal government-owned. The rest are in contracted facilities, in many cases with local governments such as county jails. \nThis admittedly makes the immigrant centers more complex than the federal prisons, said Jeremy Mohler, spokesman for the liberal group, In The Public Interest, which has long advocated against both private prisons and detention centers. He acknowledged that public employee unions favor closing the centers but said it goes beyond self-interest.\n“Federal employee unions are interested in having public facilities because that means more union employment in the long run and work conditions will be better,” Mohler told FoxNews.com. “It’s not just self-interest. Unions are interested in not throwing [immigrant] families into torturous situations.”\nIn The Public Interest is a project of the Partnership for Working Families , a coalition of several progressive groups that includes labor unions.\nThe private immigration centers are actually in the interest of the illegal immigrant detainees, contends Gerges Scott, a former deputy secretary for the New Mexico Department of Corrections.\n“If DHS closes these detention centers, the detainees will be shipped to overcrowded federal centers,” Scott said. “Women and children, they will be separated, but they will still be in the same facility with dangerous illegal immigrants. As a former corrections official and taxpayer, this is a concern to me.”\nDuring Scott’s time in office from 1999 through 2002, New Mexico was under a federal order to deal with state prison overcrowding and the state legislature was in no mood to build new prisons. So, the state contracted with private prisons, which he said are more accountable and efficient.\n“Private prisons have the same standards and guidelines as federal prisons,” Scott said. “There is a lot more accountability for private prisons. Union workers in public prisons provide a lot of leniency for their employees. In a private prison, a majority are not unionized, so the oversight is very rigid.”\nThe American Civil Liberties Union disputes that assessment. The legal group helped conduct a review that found over a two-year period, six of the eight deaths attributable to substandard medical care in the immigration centers were at contract facilities, ACLU staff attorney Carl Takei told FoxNews.com. But, he adds, if the DHS is going to conduct “a meaningful review, it has to tackle ICE’s incarceration policy.”\nThe head of one large private prison operator, GEO Group, Inc., said he welcomes the review.\n“Our public-private partnership has allowed ICE to transfer services from older public jail facilities that did not meet the most up-to-date national standards to GEO’s highly rated, cost-effective facilities,” said George C. Zoley, GEO’s chairman in a statement. “We are confident that this independent review will show that GEO has provided needed, cost-effective services that have resulted in significantly improved safety outcomes for the men and women in ICE’s care and custody.”\nICE reportedly has had $1.18 billion in contracts with GEO since 2008. Another private firm, Corrections Corp of America, got $689 million in ICE contracts since 2008. Corrections Corps of America did not respond to inquiries from FoxNews.com.", "external_links": [], "published": "2016-09-16T03:00:00.000+03:00", "crawled": "2016-09-16T18:18:07.282+03:00", "highlightTitle": ""}