{"organizations": [], "uuid": "84d3b6dfe189de4ff6da852db360f5281cae3da5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.foxnews.com", "main_image": "http://www.foxnews.com/content/dam/fox-news/logo/og-fn-foxnews.jpg", "site_section": "http://feeds.foxnews.com/foxnews/national", "section_title": "FOX News", "url": "http://www.foxnews.com/us/2016/09/23/ny-town-mourns-4-murdered-teens-and-some-blame-federal-immigration-policy.html", "country": "CH", "domain_rank": 185, "title": "NY town mourns 4 murdered teens, and some blame federal immigration policy", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "NY town mourns 4 murdered teens, and some blame federal immigration policy", "spam_score": 0.0, "site_type": "news", "published": "2016-09-24T04:24:00.000+03:00", "replies_count": 0, "uuid": "84d3b6dfe189de4ff6da852db360f5281cae3da5"}, "author": "Joseph J. Kolb", "url": "http://www.foxnews.com/us/2016/09/23/ny-town-mourns-4-murdered-teens-and-some-blame-federal-immigration-policy.html", "ord_in_thread": 0, "title": "NY town mourns 4 murdered teens, and some blame federal immigration policy", "locations": [], "entities": {"persons": [{"name": "joseph j. kolb faceboo", "sentiment": "neutral"}, {"name": "mayo", "sentiment": "none"}, {"name": "aaron galan", "sentiment": "none"}, {"name": "monica martinez", "sentiment": "none"}, {"name": "hector torres", "sentiment": "none"}, {"name": "kayla cuevas", "sentiment": "none"}, {"name": "david sandler", "sentiment": "none"}, {"name": "lenny tucker", "sentiment": "none"}, {"name": "gomez", "sentiment": "none"}, {"name": "rigoberto gomez", "sentiment": "none"}, {"name": "tucker", "sentiment": "none"}, {"name": "nisa mickens", "sentiment": "none"}, {"name": "mickens", "sentiment": "none"}, {"name": "martinez", "sentiment": "none"}, {"name": "cuevas", "sentiment": "none"}, {"name": "ray mayo", "sentiment": "none"}], "locations": [{"name": "central islip", "sentiment": "none"}, {"name": "wyandanch", "sentiment": "none"}, {"name": "long island railroad", "sentiment": "none"}, {"name": "huntington", "sentiment": "none"}, {"name": "copiague", "sentiment": "none"}, {"name": "farmingdale", "sentiment": "none"}, {"name": "islip", "sentiment": "none"}, {"name": "new york city", "sentiment": "none"}, {"name": "brentwood", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "el salvador", "sentiment": "none"}, {"name": "suffolk county", "sentiment": "none"}, {"name": "long island", "sentiment": "none"}, {"name": "central america", "sentiment": "none"}], "organizations": [{"name": "latin kings", "sentiment": "none"}, {"name": "brentwood high school", "sentiment": "none"}, {"name": "u.s. department of health and human services", "sentiment": "none"}, {"name": "brentwood country club", "sentiment": "none"}, {"name": "brentwood association for concerned citizens", "sentiment": "none"}, {"name": "bls", "sentiment": "none"}, {"name": "twitter", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NY town mourns 4 murdered teens, and some blame federal immigration policy By Joseph J. Kolb Facebook 0 Twitter 0 livefyre Email Print \nThe village of Brentwood, on New York’s Long Island, is nearly 2,000 miles from the Mexican border, but with four dead teenagers, it has become a flashpoint in the debate over federal immigration policies and their possible links to gang violence. \nThe murder last week of Brentwood High School students, Nisa Mickens, 15, and Kayla Cuevas, 15, and the discovery of two sets of human remains, males ages 17 and 19, in a wooded area adjacent to the Long Island Railroad have allegedly been linked to the MS-13 gang that has wreaked havoc in Brentwood. \nMickens' family said they believe gang members tried to kidnap Cuevas, and investigators say Mickens may have been killed trying to help her friend. Related Image Expand / Contract Nisa Mickens, (l.), and Kayla Cuevas, (r.) \nSuffolk County police said on Friday that the department was launching an \"all-out assault\" on gangs in the 11-square-mile town as well as in Central Islip and Wyandanch. \nArea residents are worried and frightened given the notorious El Salvadorean gang's growth in the area, which they say has coincided with an influx of illegal immigrants. \n“Without a doubt the community is scared, but I know of instances where residents have heard things and have called police,” says Ray Mayo, executive director, Brentwood Association for Concerned Citizens. \nMayo said that while he has seen a direct correlation between the infusion of Central American teens in the community and the increase in gang activity, the community is not putting up with it. \n“We have been in regular talks with the police to come up with some strategies,” says Mayo. \nHe said residents are supportive of immigrants, even undocumented, who have come to Brentwood to better their lives and who are law abiding, paying their taxes, and striving towards citizenship. It is the other, growing and nefarious immigrant element that concerns Mayo. \nLaw enforcement officials say MS-13 is the largest gang on Long Island with Suffolk County “cliques” concentrated in the villages of Brentwood, Huntington, Copiague, Farmingdale, and Islip. \nSuffolk County Legislator for Brentwood, Monica Martinez, a former teacher and school district administrator, says she has seen a transformation in recent years of this predominantly African-American and Hispanic working class community 47 miles east of New York City. \n“We have seen an influx of them to the district, one in which no child was denied access to an education,” Martinez says. “There is no indication that the current incidents have been a result of the influx of unaccompanied children.” \nMartinez said these types of incidents have occurred in waves. \n“We had a surge in 2012-2013 and unfortunately we are seeing it again,” she says. “Actually after researching a bit myself the sharpest increase in violent crime was in 2010,” \nBetween October 2013 and July 2016 nearly 3,500 unaccompanied children from Central America were placed by the U.S. Department of Health and Human Services in Suffolk County, one of the highest placement areas in the country. The overwhelming majority are law-abiding and welcome, say residents. But some come with gang experience and others are ripe for recruitment, according to law enforcement sources. \nEven before 2013, Brentwood was a hotbed for gang violence with skirmishes between MS-13, the Latin Kings and Bloods. Eventually, the Salvadoran gang claimed a violent stranglehold on the community. \nSome of the more heinous acts of violence Brentwood experienced began in 2008, when members of MS-13 were involved in a non-fatal shooting incident in a Brentwood park. In 2009, several MS-13 gang members attacked suspected rival gang members at a house party killing one. This was followed in 2010 when the violence spun out of control. \nMS-13 gang members, committed two murders and one attempted murder in February and March 2010. One member was convicted in connection with the murder of 21-year-old David Sandler and the attempted murder of 20-year-old Aaron Galan in Brentwood. \nOne of the prime suspects convicted in many of these violent crimes was already an MS-13 member in El Salvador when he entered the U.S. illegally. \nAlso in 2010, the Sailors clique of the MS-13 suspected that fellow member Rigoberto Gomez was cooperating with local law enforcement. As a result, the Sailors put a “green light” on Gomez, authorizing other MS-13 members to kill Gomez on sight. \nIn the early morning hours of Aug. 31, 2010, Hector Torres, then second in command of the BLS clique, together with a Sailors clique member, who has also been charged federally, spotted Gomez as they drove through Brentwood. They lured Gomez into the car, inviting him to smoke marijuana with them at a nearby park. Gomez was shot three times in the head and killed. \nMost recently, before the Mickens and Cuevas killings, three teen age gang members were charged with the brutal gang rape of a 16-year-old girl by the Brentwood Country Club in 2015. \nThe discovery of four dead teenagers in one week, possibly at the hands of MS-13, has sparked outrage. \nLenny Tucker, president, Brentwood Association for Concerned Citizens, said the community was taken by surprise with the influx of Central American teens and is outraged at the impact the violence the gang has had on their community as well as the lack of attention paid by the federal government. \n“After all of the community’s hard work to keep our children safe, it’s disgusting,” Tucker said. “I don’t think the federal government has done its due diligence or us any justice.” \nTucker says the children coming into Brentwood have been exposed to violence in their countries and have a mindset of lack of control to violent behavior. \nMickens was buried Wednesday and Cuevas on Friday. Advertisement", "external_links": [], "published": "2016-09-24T04:24:00.000+03:00", "crawled": "2016-09-24T00:13:06.827+03:00", "highlightTitle": ""}