{"organizations": [], "uuid": "f8c776cdc59bc94793181929b569fa6f767cc142", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 145, "shares": 145, "comments": 1}, "stumbledupon": {"shares": 0}}, "site_full": "www.buzzfeed.com", "main_image": "https://img.buzzfeed.com/buzzfeed-static/static/2016-09/26/14/campaign_images/buzzfeed-prod-fastlane01/finding-help-and-healing-through-santeria-2-21815-1474914271-6_dblbig.jpg", "site_section": "http://www.buzzfeed.com//index.xml", "section_title": "BuzzFeed Index - Latest", "url": "https://www.buzzfeed.com/chayababu/finding-help-and-healing-through-santeria", "country": "US", "domain_rank": 137, "title": "How Santeria Brings Hope To The New Yorkers Who Need It Most", "performance_score": 1, "site": "buzzfeed.com", "participants_count": 1, "title_full": "How Santeria Brings Hope To The New Yorkers Who Need It Most", "spam_score": 0.0, "site_type": "news", "published": "2016-09-28T22:34:00.000+03:00", "replies_count": 0, "uuid": "f8c776cdc59bc94793181929b569fa6f767cc142"}, "author": "Chaya Babu", "url": "https://www.buzzfeed.com/chayababu/finding-help-and-healing-through-santeria", "ord_in_thread": 0, "title": "How Santeria Brings Hope To The New Yorkers Who Need It Most", "locations": [], "entities": {"persons": [{"name": "marlon krieger", "sentiment": "neutral"}, {"name": "erica small", "sentiment": "none"}, {"name": "kaposi", "sentiment": "none"}, {"name": "yoruba", "sentiment": "none"}, {"name": "marta moreno vega", "sentiment": "none"}, {"name": "charles v. wetli", "sentiment": "none"}, {"name": "obatalá", "sentiment": "none"}, {"name": "peter liang", "sentiment": "none"}, {"name": "rudy guardiola", "sentiment": "none"}, {"name": "babalawo pancho mora", "sentiment": "none"}, {"name": "vega", "sentiment": "none"}, {"name": "carmen", "sentiment": "none"}, {"name": "miriam", "sentiment": "none"}, {"name": "gabriel", "sentiment": "none"}, {"name": "justin siegel", "sentiment": "none"}, {"name": "liang", "sentiment": "none"}, {"name": "oshun", "sentiment": "none"}, {"name": "miguel", "sentiment": "none"}, {"name": "akai gurley", "sentiment": "none"}, {"name": "lyonel", "sentiment": "none"}, {"name": "laurence", "sentiment": "none"}, {"name": "anahí viladrich", "sentiment": "none"}, {"name": "alexi", "sentiment": "none"}, {"name": "lawrence somerville", "sentiment": "none"}, {"name": "jacob", "sentiment": "none"}, {"name": "justin", "sentiment": "none"}, {"name": "botanica la jose", "sentiment": "none"}, {"name": "manuel noriega", "sentiment": "none"}, {"name": "botanica orisha locumi", "sentiment": "none"}, {"name": "berta", "sentiment": "none"}, {"name": "pancho mora", "sentiment": "none"}, {"name": "viladrich", "sentiment": "none"}, {"name": "botanica orisha locumí", "sentiment": "none"}, {"name": "erica", "sentiment": "none"}, {"name": "locumi marlon krieger", "sentiment": "none"}, {"name": "lukumi babalu aye", "sentiment": "none"}, {"name": "lawrence", "sentiment": "none"}, {"name": "rudy", "sentiment": "none"}, {"name": "quita maldicion", "sentiment": "none"}, {"name": "walter", "sentiment": "none"}, {"name": "beyoncé", "sentiment": "none"}, {"name": "yemaya", "sentiment": "none"}, {"name": "padrino", "sentiment": "none"}, {"name": "botanica orisha locumii", "sentiment": "none"}, {"name": "jesus", "sentiment": "none"}, {"name": "debra lex", "sentiment": "none"}, {"name": "botanica", "sentiment": "none"}, {"name": "chaya babu buzzfeed", "sentiment": "none"}, {"name": "jason mizrahi", "sentiment": "none"}, {"name": "italo", "sentiment": "none"}, {"name": "noriega", "sentiment": "none"}], "locations": [{"name": "san miguel", "sentiment": "none"}, {"name": "cuba", "sentiment": "none"}, {"name": "san hilarion", "sentiment": "none"}, {"name": "obatalá", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}, {"name": "washington heights", "sentiment": "none"}, {"name": "haiti", "sentiment": "none"}, {"name": "puerto rico", "sentiment": "none"}, {"name": "elegua", "sentiment": "none"}, {"name": "botanica las mercedes", "sentiment": "none"}, {"name": "greenpoint", "sentiment": "none"}, {"name": "catland", "sentiment": "none"}, {"name": "shango", "sentiment": "none"}, {"name": "long island", "sentiment": "none"}, {"name": "rikers", "sentiment": "none"}, {"name": "panama", "sentiment": "none"}, {"name": "lower east side", "sentiment": "none"}, {"name": "oshun", "sentiment": "none"}, {"name": "miami", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "americas", "sentiment": "none"}, {"name": "east elmhurst", "sentiment": "none"}, {"name": "jackson heights", "sentiment": "none"}, {"name": "havana", "sentiment": "none"}, {"name": "santa muerte", "sentiment": "none"}, {"name": "west africa", "sentiment": "none"}, {"name": "queens", "sentiment": "none"}, {"name": "new york city", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "east new york", "sentiment": "none"}, {"name": "brazil", "sentiment": "none"}, {"name": "bushwick", "sentiment": "none"}, {"name": "prospect park", "sentiment": "none"}, {"name": "new jersey", "sentiment": "none"}, {"name": "regla", "sentiment": "none"}, {"name": "santeria", "sentiment": "none"}, {"name": "broadway", "sentiment": "none"}, {"name": "williamsburg", "sentiment": "none"}, {"name": "trinidad", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "bronx", "sentiment": "none"}, {"name": "upper west side", "sentiment": "none"}, {"name": "orishas", "sentiment": "none"}, {"name": "sunset park", "sentiment": "none"}, {"name": "caribbean", "sentiment": "none"}, {"name": "florida straits", "sentiment": "none"}, {"name": "hialeah", "sentiment": "none"}, {"name": "botanica orisha locumí", "sentiment": "none"}, {"name": "varet street", "sentiment": "none"}, {"name": "brooklyn", "sentiment": "none"}, {"name": "hylan houses", "sentiment": "none"}, {"name": "latin america", "sentiment": "none"}, {"name": "philadelphia", "sentiment": "none"}, {"name": "barnard", "sentiment": "none"}, {"name": "connecticut", "sentiment": "none"}, {"name": "manhattan", "sentiment": "none"}, {"name": "dominican republic", "sentiment": "none"}, {"name": "georgia", "sentiment": "none"}, {"name": "los angeles", "sentiment": "none"}], "organizations": [{"name": "miel de amor", "sentiment": "none"}, {"name": "santa muerte marlon krieger for buzzfeed news", "sentiment": "none"}, {"name": "la virgen de regla", "sentiment": "none"}, {"name": "caribbean cultural center african diaspora institute", "sentiment": "none"}, {"name": "juan de la conquista", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "atrapa hombre", "sentiment": "none"}, {"name": "christian", "sentiment": "none"}, {"name": "mercedes", "sentiment": "none"}, {"name": "supreme court", "sentiment": "none"}, {"name": "louis h. pink houses", "sentiment": "none"}, {"name": "regla de ocha", "sentiment": "none"}, {"name": "gucci", "sentiment": "none"}, {"name": "google", "sentiment": "none"}, {"name": "la virgen de la caridad del cobre", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Marlon Krieger for BuzzFeed News Your Post Has Been Launched! Fabulous! Don't forget to share with your friends on Twitter and Facebook. Finding Help And Healing Through Santeria Cuban santero Rudy Guardiola has hundreds of “godchildren” in New York and around the US. Like the religion itself, many of its followers, including young people who were drawn to Santeria over trendier forms of spirituality, are in a constant struggle to survive. At Rudy’s botanica, they find safety, healing, and hope. Chaya Babu BuzzFeed Contributor \nThe sunlight falls in a perforated line down the sidewalk on Broadway where the J and M trains click by on rusty green tracks overhead. Graffitied columns facing two unisex beauty salons, a florist with a neon “Se Habla Español” sign in the window, and a mobile retailer punctuate the commercial strip of Brooklyn’s Bushwick neighborhood, rooted in piles of dirty snow and bags of garbage. It’s here that Botanica Orisha Locumí’s door opens to long metal shelves stocked with glass-encased pillar candles and sachets of herbs. Though two large nylon flags that seem more appropriate for a surf shop than a spiritual goods store flap in the breeze outside, “BOTANICA” written prominently on both, many of those who stop by regularly say they’ve walked past for years without so much as glancing at the place. \nOn a Thursday afternoon in February, all the patrons who came in took a seat on one of the plastic chairs that butt up against a wall of bottled perfumes and potions — everything from Miel de Amor (Honey of Love) and Exito (Success) to Quita Maldicion (Go Away Evil) and Santa Muerte (Holy Death). By 3:00, there were eight people waiting, their heads bent to their phone screens, a few talking quietly in pairs. With nowhere else to sit, some created a queue that neared the entrance where a dusty, black-robed Grim Reaper stands guard, its jewel-orbed eyes glowing red and a scale in its right hand, the arbiter of justice. \nBotanica literally translates to “botany store” or “plant store” for its historic purpose as an establishment that sells medicinal herbs in Latin America. Most also carry a range of other spiritual amulets and items, including oils and Florida Water, beads and statuary. And like many of its kind, at least in name, Botanica Orisha Locumí is also a place for consultas , readings, and limpiezas , or cleansings, and more. \nHere, Rudy Guardiola, an Afro-Cuban santero — a priest in Santeria, a religion descending from indigenous African spiritual traditions — conducts such services. Before Rudy opened his shop along with the “Church of the Orishas” in its basement 24 years ago, he had been practicing out of his home — common for healers who don’t feel the need to mix spirituality with the realities of running a business. And while on some days he has ten clients and others only two or even none, that afternoon was a testament to his highly coveted wisdom. \nThough several stray white customers entered, browsed, flashed self-conscious half-smiles, and left, all of those who lingered were black or Latino, some from within a few-block radius, others from outside the borough. G., who is Puerto Rican but was born in the US, explained that Rudy’s reputation and his English drew her back to him. She came “just for questions” that she said would otherwise get lost in translation with santeros who speak only Spanish. \n“We would never put ‘psychic’ in the window or something like that,” said Lawrence Somerville, one of Rudy’s “godsons,” a soon-to-be formal initiate who also works at the store. “That’s not really what it is, and people would probably run the other way.” The godsons are like a brotherhood of sorts, congregating behind the counter, where bunches of sage hang drying from a ribbon stretched from the wall to a radiator pipe with chipping paint. Rudy’s own kids are grown up, one living in Georgia and the other in the army — they’ve given him seven grandchildren and one great-grandchild — so the men in their late twenties and early thirties who idle and joke at the botanica are like another family to him. Some are unofficial godsons, with no plans of being formally initiated but welcomed into the folds of the group nonetheless. One can’t help but wonder about the magical haunts veiled in ordinary brick-and-mortar among our lives of logic and material gain. ID: 9600468 \nOne by one, the clients, bundled in their coats, holding on to whatever drove them to seek counsel, got their turn. Rudy came out from a room in the back, took each by the hand, and led them around the counter and through a dark doorframe to cast shells or coconuts on the ground and tell them something that came to him from the Orishas, or gods. His frame is stocky and his gait more a shuffle than a walk. And at 59, he has a youthful air, a guilelessness, despite his father figure role — his godchildren refer to him as “Padrino”— and obviously keen business acumen. He’s a man of few words apart from fervent punches about Santeria, the people for whom he provides guidance, and how relentlessly busy he is. \nWhen G. emerged from her session, she walked swiftly to the exit, her hood pulled over her head and her fingers gripping her coat tightly shut. Her long, brown hair was wet and her gaze downward as she beelined for Broadway. Boogey, the botanica cat, squinted and yawned after her, keeping watch from his perch near a sculpture of a Catholic saint and rows of rosaries that hung from nails on a board. His eyes quivered. \n“We say that he’s been in here so long that he sees all the spirits that come through, so most of the time when he’s looking at you, he’s looking at the spirits around you, too,” Lawrence said with a laugh. \nWhile exploring the cluster of botanicas in northeast Brooklyn, curios tucked into blocks that are rapidly turning — sandwiched between massive fluorescent-lit laundromats and tony lounges that serve craft cocktails — one can’t help but wonder about the magical haunts veiled in ordinary brick-and-mortar among our lives of logic and material gain, the meaning we assign the small rituals that unite us with something bigger, and, most poignantly, whose magic matters. \n“Among the Latino community, wellness isn’t trendy,” Christian, a 35-year-old education professor and priest of Oshun, Orisha of love and sweet waters, told me one evening during a festive gathering at Botanica Orisha Locumí. “Look around you. This isn’t the nice 14th Street bookstore where you smell beautiful scents of incense burning or yoga pamphlets outside.” \nToday, Google Maps drops nine pins in the Bushwick neighborhood alone in a search for “botanicas.” And while not all who visit botanicas may explicitly identify with the religion or even believe at all, there they find solutions to both physical and mental health issues, for which many lack access to adequate care. Orisha worship, however altered from its origins, maintains a connection to its legacy during slavery in that it provides a lifeline in a world intent on the silent erasure of communities of color. City dwellers caught up in the daily hustle of just trying to survive in an age of exorbitant wealth inequality, police brutality, entrenched housing segregation coupled with the violence of gentrification, and a slew of other injustices are devoting their time and energy to becoming new loyal followers of Santeria. For many in the religion and its purlieu, the consciousness embraced on this spiritual path is one specifically intertwined with a link to ancestral spirits and the remembrance of a home before diaspora, a heritage untouched by colonialism, and an enduring faith in the resilience of a self rooted in African identity. \nAt Botanica Orisha Locumí, the young people who have sought out Rudy in times of loss and despair have stumbled upon a sanctuary of healing, a salve for the wounds of systemic trauma they were long unable to name. \n“I live for my people,” Rudy told me. “I live for my religion; I live for my faith; this is my life.” Rudy standing at the coutner of Botanica Orisha Locumi talking to Miguel. Marlon Krieger For Buzzfeed News ID: 9599530 \n“I’m nothing; my power is not my power,” Rudy said, pensive, earnest, searching for words as he stood leaning against a table in the dank cell at the back of his shop. “I surprise myself: How do I know these things? It’s something with me, something spiritual with me.” \nIt’s the messages of divination that he was speaking of, which come through him about someone’s undetected cancer or what they need to do to find a job. This, and his abilities to then call upon the Orishas to bless and bring positive energy to a situation, lead people to want to be in his orbit. He has over 400 godchildren he has brought into Santeria and that doesn’t count those who frequent his store, or those who watch and call in to his hour-long television show Los Secretos de las Religiones on the Dominican View channel, which airs in the US, the Dominican Republic, Puerto Rico, and a number of other countries. \nHe arrived to the US from Cuba in 1980 and was crowned Obatalá in New York in 1983, meaning he was initiated formally into the religion with Obatalá as his guardian Orisha. Obatalá is the creator, the sculptor of mankind, and the father of all the gods. Rudy’s relationship with the Orishas is one that unfolded as a natural step in his journey, and it’s now one he feels intimately: “The connection…I can’t live without it because it follows me.” \n“All my family is santero in Cuba pero I come to the country very young, 17, and very crazy,” he told me, his speech a mix of his two languages. “At 17, I don’t want to do nothing you know? And then three years later, maybe 19, 20, I crowned Santo.” “Your son is a spiritual man. The spirit is with him, and let him deliver that spirit.” ID: 9600473 \nHe remembers that 10 years prior to his migration with his mother, he had visions of their coming to the US by boat. “I tell her, ‘You know what? Mami, I see that one day I leave my country on the water, not plane, water’— it’s so far and so dangerous but I dreamed it,” he said. This was far before the announcement of the Mariel boatlift — the mass exodus of Cubans to the United States in 1980 during which approximately 125,000 Cubans, dubbed “Marielitos,” crossed the Florida Straits — but Rudy foretold their travels. By then he had gotten used to this “something gift” of his, which he had become aware of when he was 11. \n“I started to shake-shake-shake; my mother think I have epilepsy, people think I have epilepsy,” he said. “My mother sent me to something spiritual in Cuba and there we found a person and he tell her, ‘Your son is not epileptic. Your son is a spiritual man. The spirit is with him, and let him deliver that spirit.’” \nA full breath moved in and out of his barrel-like chest before he continued. \n“One day I remember, me and my mother were waiting for the bus coming up, and I tell my mother, ‘Mami, I want to walk two blocks from here, something happens here in the bus stop,’” he recalled. “She said, ‘What? No no, come come come.’ I said, ‘No no, I can’t. I can’t stay here.’ She said, ‘Why?’ And then me and my mother walked like a half block; I see something noise and I turn. I see the bus hit somebody and kill somebody there. And then my mother believed too. I don’t know who told me to remove my mother from there.” \nNot all botanicas have someone like Rudy, a santero or espiritist, running the place, but most are much more than a marketplace of herbal remedies, books on magic in Spanish, and a surfeit of candles with San Miguel or Juan de la Conquista illustrations; some have santeros who are licensed medical professionals and doctors in their home countries whose credentials don’t cross over. In New York and other urban locales in the US, botanicas serve as points of connection and belonging in an “informal economy of healing,” as put by immigration and health sociologist Anahí Viladrich, for the communities in areas where they are located. Typically they can be spotted in neighborhoods with high counts of Afro-Caribbean and Latino immigrants, many of whom may face barriers to the US health care system ( 35% of Hispanics report difficulties with accessing quality care). A photo of Rudy Guardiola of Botanica Orisha Locumii. Marlon Krieger For Buzzfeed News ID: 9599822 \nThis social aspect is key to the presence of the shops throughout the city. Customers find their way in through word of mouth and reputation of the owner. And not only is it a tough gamble to make rent in hot neighborhoods like Bushwick by selling enough $4 boxes of baths for Suerte (luck) or Atrapa Hombre (catching a man), but often these are only the surface trappings of vibrant though hidden lairs of spiritual work. This “‘invisible world of folk healing” as Viladrich put it, which thrives in the back rooms and basements of many botanicas, propels forward ancient earth-based traditions in what, on its face, might look like the unlikeliest of modern settings. \nStill, many such spots are just businesses, and the question of authenticity amid the increasing commercialization of Santeria — manifested by the influx of largely white travelers to Cuba, some of whom take part in the consumption and appropriation of Orisha tradition, and the fact that the largest botanica in New York is owned by a Jewish non-practitioner — is one that comes up frequently among those in the religion and, not surprisingly, between botanica owners themselves. \nUntil a fire led to its closing in June, across the street from Rudy’s was Botanica La Jose, a narrow, carpeted boutique bathed in darkness, where a woman named Carmen sat behind a curtain past the haphazard clutter of soaps and statues of saints. She said, simply, “Toma mi numero,” pointing to her cards, which had instructions on how to make an appointment. Her cramped alley of a store felt much more like the dwellings of a fortune-teller as depicted in popular culture. K., a young white woman browsing the shelves at Botanica Las Mercedes, also in Bushwick, said she shops at botanicas, pronouncing them “baw-tanicas,” for herbs or other products related to occult practice and vouched for Rudy’s place as legit. “I feel like that’s the most popular one,” she said. \n“That botanica is a botanica for its name, but no, no, no, no,” Rudy said about Botanica La Jose, slamming a hand down on the tabletop where a severed goat’s head lies just a few feet away. “Some botanicas don’t have a base. ‘What do you practice?’‘Spiritual.’ You can be spiritual, anybody can be spiritual — there’s the spiritual and the material, everyone has spirit. Pero everybody doesn’t have Orishas. Orishas. You have to be baptized as an Orisha. You have to pay for that, you have to feel the roots, the roots .” \nIt’s these roots, steeped in indigenous Yoruba tradition, that keep Santeria cloaked in exoticism and even taboo to many on the outside looking in, particularly in comparison to other alternative medicine and healing practices that have become mainstream in the US. Santeria, also known as Regla de Ocha or Regla de Ifá and a descendant of the Ifá Yoruba religion, was born on the sugarcane plantations of Cuba and is a sister of Candomblé from Brazil, Vodou in Haiti, Shango in Trinidad, and others. All stemming from nature-based worship in West Africa, they were transported to the Americas during the slave trade and syncretized, disguised in the imagery and iconography of Catholicism as colonialism threatened to otherwise wipe them out completely. They have now found a new place as large swaths of immigrants from Latin America have predominantly settled in Miami, Los Angeles, and New York. In spite of growing interest in and greater visibility of the Orisha traditions, traces of their demonization in the Western imagination that drove them underground in the first place as early as the sixteenth century still exist. An altar at the foot of Santa Muerte Marlon Krieger For Buzzfeed News ID: 9599578 \nIn late 2014, a series of incidents involving goat heads turning up in Brooklyn’s Prospect Park, including one in which two heads were tied together and flung over a streetlamp pole like a pair of sneakers, sparked a frenzy of accusations that Santeria was behind the mysterious disposals. Though other explanations were offered alongside suggestions that the remains were those of ritual offering, the language used in much of the reporting, phrases like “ sinister force ,” harkened to an earlier time when Afro-Caribbean religions were distorted and lumped into the misnomer “voodoo,” a word that conjures evil hexes and cloth dolls stuck with needles. \nIn the 1980s, when Rudy began practicing as a santero, American pop culture was particularly frantic in its obsession with all things occult and reveled in pointing fingers at Afro-Caribbean religions for their “black magic.” The film The Believers, a thriller that showed Santeria as devil worship essentially, came out in 1987, and was part of a spate of similarly ignorant and racist movies about Orisha tradition, including Angel Heart (1987) and The Serpent and the Rainbow (1988). The craze crossed into international relations: in 1989, when an American military force in Panama invaded the home of elusive dictator General Manuel Noriega, its commander reported that it had seized “voodoo artifacts” in what became widely known as Noriega’s “ witch house ,” totems allegedly wielded to keep the drug lord in power. Deputy Chief Medical Examiner Dr. Charles V. Wetli, an expert on santeria and palo mayombe, sitting in his office with artifacts. Debra Lex / Getty Images ID: 9600002 \nThe ’80s also saw a string of NYPD raids on botanicas and other practitioner locations, busting and fining them for animal cruelty. (Anyone familiar with Santeria will explain that ritual slaughter is conducted only by the highest order of priests and entails meticulous care in the handling of all of the animals’ parts. Rudy’s take: “You no seen the movies? Jesus movies? You see people with the lamb? Sacrifice. The same thing. It’s a religion thing.”) But Santeria crossed a major official hurdle in the US when the Supreme Court removed the ban on animal sacrifice in a landmark religious freedom case in 1993, Church of Lukumi Babalu Aye v. City of Hialeah . Regardless of that victory, Rudy’s first years in New York were amid a climate of hostility toward the faith and its followers. Back then, the perception of Santeria as a religion “for black people only” contributed to the fear, he said, touching on how racism, in all of the various times and places in which Orisha worship has flourished, has fueled the stigmas associated with it. \nBut even now as Beyoncé struts her stuff in a flowing yellow dress in Lemonade evoking the fiercely feminine energy of Oshun, also a goddess of sensuality and fertility, the esoteric haze around Santeria persists and an insularity pervades its ranks. Everyone I spoke to who comes to Rudy found him through word of mouth: a whisper about his prophetic prowess from a co-worker, an invitation to join a friend at a basement toque (musical ritual), the gentle nudge from the woman next door during times of hardship. Whatever the present-day image of Santeria, its obscurity is partly reinforced by the protective hush of many devotees, and getting in is not as simple as learning a few patakis, or sacred stories that are passed on orally. Kinship ties are based on ritual descent, with spiritual knowledge handed down from santero to apprentice, or godparent to godchild, in a reciprocal duty-bound bond. \nJustin Siegel, the former manager of Italo’s BK, a chic café that opened in December next to Botanica Orisha Locumí and has a studio in the back where yoga and meditation classes are often held, called the botanica “one of those voodoo shops” with a knowing smile and dismissive roll of his eyes. “They do a lot of weird stuff over there, especially on Saturday nights; it’s crazy,” he said. “We know [Rudy] because we’re all neighbors here, but he’s one of those people who’s like, ‘Give us money and we’ll give you success,’ and, uh, that’s not how life works.” But Justin was quick to endorse a healing studio in Greenpoint called Golden Drum, which has everything from astrology and Kundalini workshops to shamanic sound healing sessions featuring the sacred vibrations of crystal bowls, didgeridoos, bells, gongs, and more, each for about $30 a pop. Herbal combinations to be poured over the body stating different spiritual or material gains Marlon Krieger for Buzzfeed News ID: 9599671 \nOn a frigid February weekend, while white kids with blue mohawks and ripped jeans smoked cigarettes outside of the corner bar, the hypnotic cadence of Yoruba incantations and drumbeats erupted from the icy ground at 893 Broadway through open cellar doors that lead to a cement staircase. Inside the botanica, the pulse of the celebration down below was muted, and the space behind the counter was functioning as a staging area of sorts for those who were yet to play their part in the public ceremony, a “birthday” honoring Elegua, or rather the one-year anniversary of an iyawo being crowned Elegua as their guardian Orisha. ( Iyawo is the term for a novice initiate in their first year of making santo.) Rudy was at his best dressed, in a plaid Burberry sweater over white pants and Gucci shoes, with a white knit cap over his buzzed undercut and long locks pulled back into a ponytail. He modeled how to style a white scarf for a dewy-faced iyawo who watched intently. “Como”— Rudy stuck a pose, throwing the scarf behind his neck, pulling the ends taut at his waist, one knee bent; “Como”— another freeze, his head cocked back, lips pursed. His flock of godsons laughed. \n“I went to knock on other doors and they wouldn’t open for me,” said Erica Small, 30, wearing a starched white dress with sleeves to her wrists and a tightly wrapped white turban, waiting to descend with her plate of candles and coconuts for the Orishas. Erica was crowned daughter of Yemaya in December, but she has known Rudy for over a decade. She said she was going through an extreme depression around the time they met. She looked toward the paths of healing that were more readily available to her — from the pastors at her family’s church to other spiritual readers — but nothing worked. \n“I was desperate,” she said. “I needed something really serious that was going to save my life. And my spirit ended up connecting here. I felt it so deep.” \nErica’s mother is black, born in the US, and her father is Haitian, but she grew up Pentecostal with no overt ties to indigenous African religion — though, looking back, she said she can see how it’s always been in her DNA. As someone who has had a profound sense of intuition since childhood, Erica felt the spirits of her ancestors calling her to go back to the African part of her bloodline (and the friend who directed her to Botanica Orisha Locumí more than 10 years ago sent her there on the suggestion that she buy the Black African Power candle). \nShe lives in Williamsburg now but was raised in East New York, a Brooklyn neighborhood still notorious for its poverty and violence long after the demise of the city’s soaring crime during the crack-riddled ’80s and ’90s. In 1993, when she was a child growing up there, East New York was listed as having the highest number of homicides that year, 126, out of all the neighborhoods in the city; in the past years, as the bigger picture of violent crime in New York has plummeted to record lows since the ’60s, the 75th Precinct — once known by cops as “the killing fields” — lags, with murders up again nearly twofold since 2008. It’s where, in 2014, NYPD officer Peter Liang shot Akai Gurley in the Louis H. Pink Houses and failed to call for aid. (Liang was later sentenced to five years of probation and community service after the judge ruled the shooting an accident.) \n“A lot has happened in my life, a lot of things I’ve seen growing up in rough neighborhoods and stuff like that,” Erica said, attempting to explain the inexplicable — that Rudy was able to offer her something in his low-lit chamber for consultas that provided her with the resolve she needed to overcome her suffering. “When I say ‘rough,’ I mean that when I was 8 years old, someone’s brains were blown out and they left the guy’s brains there for over a week. Out in the street in the back of the building. And me and my friends played with the brains. That’s severe. That’s traumatic… I will never forget that.” She was hesitant to share the exact details of what Rudy did, just that he taught her how to be there for herself. “People who come to me, they don’t leave without something good.” ID: 9600475 \nScholarly work on Santeria has pointed to its legacy as a form of cultural resistance to the dominant forces in society. During slavery in the Caribbean, the choice to hold on to African-based spirituality, when one could be killed for it, was symbolic of this refusal to acquiesce to the brutal efforts by the colonizers to impose shackles upon not only the bodies but the minds of black slaves. Today, when young people like Erica grow up where men in their communities are shot and then abandoned — a circumstance that hasn’t changed much in the 20 years since the incident she described — pushing back on the toll of that level of dehumanization is indeed resistance. \n“I hear a lot of things, a lot of things,” Rudy said. “My god, you don’t know where to start because it’s a lot of things, so many questions. I don’t know how I can answer those questions. But it’s okay. I love my job. I love it. It’s my life. I like helping people. Maybe I have worse problems; maybe I have more problems than them. Pero I try to not show my problems. I try to be calm.” \nHe relayed stories of people coming to him in various states of distress: pregnant teenagers, raped and beaten by their fathers; homesick immigrants with a loneliness so acute they long to return to countries they fled; HIV patients fighting suicidal thoughts as they grapple with their diagnoses. \n“People who come to me, they don’t leave without something good,” Rudy said. “To convince the person that life is big, God is with me and you, you’re not lonely, it’s something you have to pass through in this life to be stronger, this life is not for people to be weak, it’s for strong people — I tell them something like that in Spanish. And people listen to me. And it changes their life.” \nErica and another iyawo, a middle-aged woman, entered from the stairwell into the steady throb of four drums and the undulating vocals of Alexi, a dark-skinned man with a walker who comes from Philadelphia to sing at the toques de fundamento , or tambores (drummings). About 70 people lined the perimeter of the basement, its walls covered in lurid floor-to-ceiling painted murals of both black and white saints, from La Virgen de Regla and La Virgen de la Caridad del Cobre to San Hilarion smoking a pipe next to a bucket of skulls, snakes, and tridents, with the sun a glowing marigold orb behind him. And at the far end of the cavernous space, an altar decked in a thick layer of green leaves overflowed with a rotunda of fruit, new toys, and 10 cakes that read “Felicidades Elegua”— a sort of tropical jungle Christmas morning explosion. Many of the women were in long white skirts, beneath which jeans and leather boots peaked out from the hems. Erica and her godsister briefly lay prostrate at the feet of the drummers as they gave their offerings. \nThree sons of Elegua were being celebrated that night, all in court jester costumes symbolic of the Orisha’s trickster quality. They danced in a line in the area in front of Alexi and the drummers in the center of the floor, where only those invited by the Orishas were permitted to join. One pulled Rudy away and whispered something to him in the corner: A message from a spirit had come through him, Christian, the young education professor moving subtly to the beat, explained. Throughout the night, Rudy stepped away from his position in the middle of the room to greet guests with hugs, check on the altar, and ensure everything was going smoothly in the kitchen, where Berta, who has worked for him since 1984, heaped ladles of steaming rice, beans, chicken, and fish onto paper plates. \nThe party for Elegua revealed just how vast Rudy’s reach is in and around the city, with Christian having grown up in Manhattan and others traveling from New Jersey and Connecticut. Lyonel, a retired salesman who is a practitioner of the Haitian tradition of Vodou, heard about the tambor on Facebook and drove to Bushwick from Queens; Miriam, a community organizer, comes to toques frequently from Long Island. A man sitting inside Botanica orisha Locumi Marlon Krieger For Buzzfeed News ID: 9599726 \nLike the pioneering souls who planted the seeds of Orisha tradition in New York before him, Rudy nurtured from scratch the sphere he calls “his people” when he began practicing as a santero. \nBabalawo Pancho Mora was the first to practice Ifá divination in New York. He arrived from Cuba in 1946 and shortly after founded the first ile , or house of the Orishas, in the city. At the time, music was critical to the religion’s burgeoning presence in New York City even as the traditions hung low beneath the bustle of the urban American zeitgeist. Though many of the Cuban musicians who were influential in this process had not been formally initiated, their immersion in Santeria from their upbringings meant that the philosophies and practices of the religion traveled with them and found a home on Manhattan’s Upper West Side. And by 1964, following the Cuban Revolution’s tide of exiles flooding the community and swelling the number of practitioners in New York from a handful to thousands, Afro-Cuban music had crossed borders within borders, drawing a crowd of 3,000 to a drumming ceremony held by Pancho Mora. “It’s hard to stay in business, especially in New York City.” ID: 9600478 \nBut that era is long gone — the Palladium, which became known as “home of the mambo,” held its final performance in 1966, and most of the botanicas that were in the area have closed. The neighborhoods with the densest count of botanicas have moved over the decades, with the shops slowly disappearing from blocks in Washington Heights and the Lower East Side and shifting around throughout the other boroughs, now situated mostly across the Bronx, Jackson Heights in Queens, and Sunset Park and of course Bushwick in Brooklyn. \n“It’s hard to stay in business, especially in New York City,” said Jason Mizrahi, owner of Original Products, a veritable emporium of botanica goods in the Bronx and wholesale supplier to stores locally and nationwide, as he charted the trajectory of the dwindling botanicas across the boroughs. “All the rents have gone up.” \nThough the presence of botanicas does not determine the continuation of the religion, which will follow its people (“We’ve always done it — public, undercover, wherever, whenever,” Marta Moreno Vega, founder and director of the Caribbean Cultural Center African Diaspora Institute, told me), they are gems in ethnic enclaves that are repeatedly displaced as gentrification uproots New York’s most vulnerable communities, including working-class Latinos and Afro-Caribbeans. A small botanica down Broadway, just feet away from Rudy’s, the inside gutted and the glass storefront cracked, shuttered only weeks ago. Botanica Orisha Locumi in Brooklyn surrounded by various stores including cafes and bars. Two young women look down at the basement of the Botanica upon hearing the ceremonial music and singing Marlon Krieger for BuzzFeed News ID: 9599746 \nOne day at noon as spring crept over the train tracks, Gabriel, who works behind the counter, answered the phone taking consulta appointments with a Spanish ballad blaring in the background, and Lawrence was in and out of the store, between the two floors, getting things in order for the coming weekend’s toque. “I have another job in IT, but my boss is a godson as well so he knows that Padrino takes priority,” Lawrence said. Walter, an honorary godson, passed around a bag of gummy worms, his vertical “BROOKLYN” tattoo exposed down his forearm. \nRudy was in the middle of a particularly hectic day, having come from court because he said his tenants don’t pay him rent (he’s also a landlord, with four properties between New York and Florida), but not too hectic to keep him from stopping to plant a kiss on the head of Jacob, who looks no older than 25, before taking the hand of a client and walking her to the back. The young men could pass for a boy band in their black puffy vests, baseball caps with super-stiff brims, and squeaky clean Jordans with their all-white outfits. \n“I don’t know where he gets it or why,” Lawrence said of Rudy’s endless supply of energy. “It’s not like he has little kids he’s putting through college. He maybe makes a $200 profit a month off this store. But it helps to facilitate all of his other work; it acts as more of an office for him. You know, if you want to find him, this is where you can find him.” \nLawrence was living with Rudy for the time being as he got on his feet to find an apartment. There are no non-botanica days for his padrino, he said, having been privy for months to the quotidian realities of Rudy’s utter devotion to his practice as a santero. This of course leaves out travels to Cuba and elsewhere to conduct initiations — one Saturday evening in early April, I caught Rudy after a closed crowning ceremony in the basement; he had flown in earlier that day from doing the same in Florida and was about to fly right back out on the following Monday for another. \n“He is by far the hardest-working man I’ve never known, and I’ve been around a lot of hard-working people; he’s like almost inhuman,” Lawrence said, later describing Rudy’s lifestyle as comfortable, far from extravagant. He lives in a two-bedroom apartment in East Elmhurst and although he drives to the botanica every day in his Mercedes, he never takes vacations free of toting-along godchildren who want to be crowned santo in Cuba. \nLawrence, who’s 33 and half African-American and half Puerto Rican, was gearing up for his own crowning ceremony this fall, anxious about saving enough money. On top of everything else, the logistics around the rites of passage can add up to several thousand dollars, with costs for seven days of food for the iyawos, payment for people serving them, animals for the rituals, and materials for dressing the altar. He came to Rudy while he was at a crossroads about two years prior, trying to reroute his life after taking wrong turn after wrong turn. Following a number of face-to-face confrontations with death, as he put it, including getting diagnosed with late-stage Kaposi’s sarcoma in 2010 and going into remission six months later, it was losing a friend to a drug-related overdose that served as his awakening. “I was like, how is it that I’m acting like someone who’s grateful to have another chance? I’m not.” \nLawrence and I drove around Bushwick one morning, buying plastic cups and plates at the 99-cent megastore and stopping in to check out Catland, a pagan bookshop with dark wood shelves holding little witchy wonders like crystals, tarot decks, and a smooth, green, palm-sized Elegua statue that Lawrence thumbed in awe before noting the $40 price tag. We parked briefly on Varet Street; a mammoth yellow crane sat in an empty construction lot that holds the debris from the demolished home Lawrence’s mother grew up in as a child (his father, now deceased, was in his life but physically absent). Staring out into the chill, he recalled having graduated eighth in his class in high school, starting college, but then being pulled into the allure of fast money on the streets while simultaneously bartending. \n“I don’t think any smart drug dealer would stay selling weed, because after a while you have to graduate, you know,” Lawrence said, in his white sweater and white sweatpants albeit not having attained official iyawo status yet. He looked back to when he was on the brink of getting swept further into the drug trade; this is where he found himself when an alternate journey, one with a nurtured connection to the Orishas, appeared. \n“I made the conscious decision to retire, leave that whole game, the hustling life, alone,” he said, reflective, attributing the renewal in and around him, his newfound stability, wholly to Rudy. “But it was always very easy for me to slip back in at any given moment, anytime I needed to make a quick buck or something. I can, but I won’t do it. Why? I hear him in my head… That fire that he lights under my ass that causes me to stress, to lose the hair on my head, is all him trying to push me to do more and better for myself.” \nThat Botanica Orisha Locumí functions as a therapeutic space is perhaps its least perceptible facet. When it comes to remedies for bodily issues, most who visit botanicas for herbal medicine do so as complementary to regular visits to a physician; but when it comes to the other pieces of holistic wellness, the integration of mind, body, and soul, someone like Rudy along with his peripheral universe is an invaluable resource to his people. “People who used to be drug dealers, prostitutes, jobless, or depressed — suddenly they found a model, they found hope, they found a community.” ID: 9600481 \nViladrich, whose research spans more than a decade and who met Rudy in that time, explained that the healing map in the city is rigidly divided by class and ethnic differences — with practices such as acupuncture dissociated from their origins and absorbed by the Western medical establishment — and that a santero can offer the cultural currency and relevant treatment that’s often missing within the scope of conventional mental health, counseling, or social services. “They speak the same language not only in terms of idiomatic expressions but also in terms of the problems they share,” she told me. “They understand what the client has gone through. You may go to a psychologist, the psychologist doesn’t know how to help someone with a deportation case who may be afraid of going to a lawyer. … People who used to be drug dealers, prostitutes, jobless, or depressed — suddenly they found a model, they found hope, they found a community, they found a purpose, they found peace.” \nBack at the store, Lawrence teased Walter about having been recently fired from his job at a packing company. Though Lawrence has a dignified air and Walter bleeds mischief, there’s a palpable camaraderie between them, the buoying of a shared experience. For both of them, their padrino provides a semblance of protection. \n“He tries to bless me,” 29-year-old Walter said, relaying how Rudy’s divination rightly predicted that he wouldn’t go back to prison for getting caught dealing drugs despite being on parole, that he’d be released from Rikers where he was awaiting his sentence after already serving three years upstate for gun possession. “When he told me that I was coming out, I believed it, okay, I had the faith in court, and then they let me go. I was so happy, I came and I shook the bell, and I spoke to Yemaya and everything.” \nGrowing up in the Hylan Houses and Borinquen Plaza, both housing projects not far from Botanica Orisha Locumí, Walter, unlike Lawrence, had a rough upbringing and admitted to a long history of brushes with the law. Gangs were outside his front door. Gangs were in his family. Also half African-American and half Puerto Rican, he could easily have remained a statistic, part of the 60% of our prison population represented by people of color, and potentially subject to a mandatory-minimum sentence, which black defendants are 21 % more likely to receive than their white counterparts. \n“Without that faith, listen, I believe I woulda just went wherever — you probably wouldn’t even see me today; I’d probably just be over there,” Walter flicked his wrist dismissively, there meaning nowhere really. “Rudy’s pretty powerful, you know? When he asks for something, he gets it.” He added that this power is shared with him at no cost. \n“When you come here, if you have no money, I help you,” Rudy told me. “It’s not business. Business is when you’re making money to profit. So you come in with a problem and no money, I do the reading without money. … Old ladies or people sick, I don’t charge.” \nLaced through the testimonies of the godsons was an undertone of Rudy having saved them from whatever darker fate might have befallen them. “I don’t get involved with no gangs, nothing like that,” Walter said of his new ways. “I’m into…” he paused. “This: I’m into peace, I’m into things that smell good.” He rotated a cylinder of cascarilla — chalky crushed egg shells — in his hands, and grinned. Laurence inside Botanica Orisha Locumi. Marlon Krieger for Buzz Feed News ID: 9599782 \nIt’s possible that the process of exposing Orisha tradition to broader American society is a dance not so different from coaxing the gods to come down at a toque — slow, tempered, methodical. Many who practice are quiet about it. Christian said that no one on the faculty of the university where he works knows he’s a santero, and he prefers to keep it that way; he called individuals like Vega “the out academics.” Other prominent voices are vehement about its integration into our mainstream culture, emphasizing its role in daily wellness, not so different from the fashionable forms taught at healing centers with eclectic practices, as well as the fact that its believers span socioeconomic backgrounds. \n“Santeria gets a bad rap,” Christian explained. “It’s such a marginal religion; it’s such a misunderstood religion. … But it’s more than all this mystery. It’s about the inner life.” \n“Some people say, ‘I’m seeing iyawos everywhere,’” said Y., a 22-year-old urban studies major at Barnard, who was crowned Oshun when she was only 8, right before emigrating from Cuba to the US with her mother. Y., who isn’t a part of any particular close-knit Orisha community in New York, grew up in Miami and hasn’t found an ile like Rudy’s, though she’s not sure she’s seeking that. Her ties remain strong to Regla, a suburb of Havana, where her uncle, a babalawo, conducts the rituals that carry her through the vicissitudes of her life, both ordinary and significant. “Before,” Y. said, “you really wouldn’t be seeing too many people dressed all in white walking the city.” Once aware of their presence, it’s impossible to miss them in their sparkling white head-to-toe ensembles around New York. \n“The white is never dingy; it’s crisp white — you have to have a new set of whites for everything,” Lawrence said, explaining that initiation is a symbolic rebirth through “marriage” to an Orisha, traditionally entailing a year of celibacy if the iyawo is unmarried. Often an iyawo will have had their crowning ritual in a botanica’s subterranean ceremonial space. \n“I was a skeptic,” Y. told me about her relationship to Santeria as a biracial Cuban immigrant child in the US. “I was radically against it.” But getting older and being inserted into a very different racial landscape at Barnard, and in New York City in general, from her early years in Miami made her realize how precious her religious heritage is and how nostalgic she was for its philosophies and practices. She spoke of times when she’s had cotton, honey, coconuts, and cacao poured over her head for cleansing. “Seriously, when I have that ceremony, if I say I want something, in a week it appears — it’s so crazy,” she said, while acknowledging that the sacrificing of animals in other rites is controversial. “It’s scary to people who are not used to it. I don’t think that will ever go away.” With Santeria, Y said, she encounters “a magic that gets shit done.” ID: 9600485 \nWhile she described the healing her babalawo uncle does as similar to reiki and energy work in that it involves purifying white light and aims to raise the vibration of those who come to see him, she nonetheless drew the distinction clearly. “The rich, white vegan as an audience for New Age spirituality, they have different spiritual needs, and they go into spirituality to serve them in different ways,” she said. “People who have come out of prison finding something in Santeria, and finding a padrino who believes in them and who saves them and gives them a framework for becoming a better person, a more righteous person, that’s a different kind of character change.” \nY. still has her feet in both realms but clarified that they have discrete functions in her life. The New Age spaces give her a lot of feel-good and sweet experiences — but with Santeria, she said, she encounters “a magic that gets shit done.” \nThrough the days I camped out on the dingy-tiled top floor of the botanica and the evenings spent in the concrete vault below, the “magic” was elusive and a word that never came up. What was readily apparent was that those who opened up to the energy of the Orishas, who chose to believe, had done so because they were reaching, very simply, for the best in themselves. With a nudge from Rudy, they discovered a kind of alchemy of their deepest selves, a way to unlock the potential to rise from the dross of human existence. \n“For everybody it’s for something reason,” Rudy said in his hidden back nook, where a stainless steel bowl lay overturned on the sodden, crooked floor. “Always faith,” he added, with the gentle reminder that it’s not all tragedy and woe: “We need faith because of something, eh? We’re wanting something for that faith. We want prosperity, we want a job, we want a good life, to get married, good things for children.” \nIn his world, the mysticism around Santeria, whether tied to the seemingly ineradicable association of African religions with death curses and satanic cults or the quixotic notion of godly spirits heeding our wishes or something else, evaporated. Through the words of his godchildren, the line between magic and faith blurred, which is what he had been getting at all along. For Rudy Guardiola, being a santero, convincing people to take hold of the faith that lay dormant inside of them — the unshakeable belief that they have abundance even in lack, the unbreakable core that even the most persistent and pernicious structural inequities cannot touch — has been his greatest fortune. \nThough his legacy as well as the spiritual roots that define it will endure, the question of how and where is like a shadow that chases Orisha worship. New York’s aggressive gentrification, our modern-day colonialism, keeps at the heels of the few visible havens that Santeria calls home in the city. And next door at Italo’s, Justin said the plan is to expand the café into the shop’s space in a few years. \nDespite the changes throughout the block and elsewhere, Justin’s forecast was news to Rudy, who was adamant that he’s not moving or selling, even when the time comes that the Orishas finally give him the green light to retire. Instead, he plans to pass the botanica onto one of his godsons. In fact, months later, it was not the botanica that had disappeared but Italo’s, its glass front taped up with “RETAIL SPACE FOR LEASE” posters and a sheet of looseleaf hanging in a corner of the window advertising the sale of its furniture and decor. \nFor Rudy, his dream is to lift the curtain on Santeria just a little. He may not have been around during the time of Pancho Mora and when Afro-Cuban drummers used music as the vehicle to bring Orisha tradition to the masses, but his hopes for the future hint to the synchronicity of kindred souls. He stands firm in his belief about what the faith and its followers deserve: to be held in their wholeness and humanity, to be heard, to be celebrated. \n“My mind is that I want to get a big hall in Manhattan to show religion, to play tambor, all the singing groups, all the drumming groups, there’s maybe like 10, bring them together,” he said. “Everybody see, and people dancing. The dance of the religion. And show everybody that part.”• Marlon Krieger for BuzzFeed News ID: 9599798", "external_links": [], "published": "2016-09-28T22:34:00.000+03:00", "crawled": "2016-09-28T17:55:41.777+03:00", "highlightTitle": ""}