{"organizations": [], "uuid": "6895093c6a0746d42dbe6da822c4611c88d3eceb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 13, "shares": 13, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/news/0/0/Haitan%20immigrants%20in%20Mexico.jpg", "site_section": "http://feeds.latino.foxnews.com/home/feed", "section_title": "FOX News", "url": "http://latino.foxnews.com/latino/news/2016/09/22/homeland-security-widening-efforts-to-deport-haitian-immigrants-overwhelming/", "country": "US", "domain_rank": 185, "title": "Homeland Security widening efforts to deport Haitian immigrants overwhelming Tijuana border", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "Homeland Security widening efforts to deport Haitian immigrants overwhelming Tijuana border | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2016-09-22T03:00:00.000+03:00", "replies_count": 0, "uuid": "6895093c6a0746d42dbe6da822c4611c88d3eceb"}, "author": "Fox News Latino", "url": "http://latino.foxnews.com/latino/news/2016/09/22/homeland-security-widening-efforts-to-deport-haitian-immigrants-overwhelming/", "ord_in_thread": 0, "title": "Homeland Security widening efforts to deport Haitian immigrants overwhelming Tijuana border", "locations": [], "entities": {"persons": [{"name": "carole maniga", "sentiment": "negative"}, {"name": "johnson", "sentiment": "none"}, {"name": "guerrero", "sentiment": "none"}, {"name": "sarah saldana", "sentiment": "none"}, {"name": "hadassa carole albert", "sentiment": "none"}, {"name": "pat murphy", "sentiment": "none"}, {"name": "jeh johnson", "sentiment": "none"}, {"name": "saldana", "sentiment": "none"}, {"name": "andrea guerrero", "sentiment": "none"}, {"name": "murphy", "sentiment": "none"}], "locations": [{"name": "miami", "sentiment": "none"}, {"name": "san diego", "sentiment": "none"}, {"name": "little haiti", "sentiment": "none"}, {"name": "caribbean", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "haiti", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "san ysidro", "sentiment": "none"}, {"name": "tijuana", "sentiment": "none"}, {"name": "brazil", "sentiment": "none"}, {"name": "calexico", "sentiment": "none"}, {"name": "central america", "sentiment": "none"}, {"name": "san diego", "sentiment": "none"}], "organizations": [{"name": "fox news latino file", "sentiment": "negative"}, {"name": "homeland security", "sentiment": "negative"}, {"name": "house judiciary committee", "sentiment": "none"}, {"name": "u.s. department of homeland security", "sentiment": "none"}, {"name": "alliance san diego", "sentiment": "none"}, {"name": "u.s. citizenship and immigration services", "sentiment": "none"}, {"name": "casa del migrante", "sentiment": "none"}, {"name": "associated press", "sentiment": "none"}, {"name": "congress", "sentiment": "none"}, {"name": "notre dame d'haiti catholic church", "sentiment": "none"}, {"name": "customs enforcement", "sentiment": "none"}, {"name": "christ united methodist church", "sentiment": "none"}, {"name": "ap", "sentiment": "none"}, {"name": "facebook  follow us on twitter & instagram", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "  Fox News Latino FILE - In this Thursday, Jan. 21, 2010, file photo, Haitian national Carole Manigat, left, holds her daughter Hadassa Carole Albert as she waits for her turn to fill out temporary protective status papers at Notre Dame d'Haiti Catholic Church in the Little Haiti neighborhood in Miami. The U.S. Department of Homeland Security said Thursday, Sept. 22, 2016, that it was widening efforts to deport Haitians, a response to thousands of immigrants from the Caribbean nation who have overwhelmed California border crossings with Mexico in recent months. The move lifts special protections that shielded Haitians from deportation after their nationâs 2010 earthquake. (AP Photo/Alan Diaz, File) Copyright 2016 The Associated Press. All rights reserved. \nSAN DIEGO (AP) –   The U.S. Department of Homeland Security said Thursday that it was widening efforts to deport Haitians, a response to thousands of immigrants from the Caribbean nation who have overwhelmed California border crossings with Mexico in recent months.\nImmigration and Customs Enforcement Director Sarah Saldana testified in Congress that other governments told her on a recent trip to Central America that 40,000 Haitians were on their way and called it an \"emergency situation\" on California's border. She said the estimate of people on their way contributed to the policy shift, as did changing conditions in Haiti.\nThe move lifts special protections that shielded Haitians from deportation after their nation's 2010 earthquake. Since 2011, U.S. authorities have avoided deporting Haitians unless they were convicted of serious crimes or posed a national security threat. Now they will be treated like people from other countries.\nSecretary Jeh Johnson said the new posture doesn't apply to Haitians who got temporary status to live and work in the U.S. after the earthquake and have remained in the country since January 2011.\nThe change may dramatically affect Haitians who have been showing up at U.S. border crossings in California, claiming they lived in Brazil for several years, left for economic reasons, and traveled through Central America and Mexico. Homeland Security officials say about 5,000 Haitians have been stopped at San Diego's San Ysidro port of entry since October, compared to only 339 for the 2015 fiscal year. Large numbers have also turned themselves in to U.S. inspectors in Calexico, California, 120 miles east of San Diego.\nThe influx is so heavy that inspectors at San Ysidro, the nation's busiest border crossing, are turning back Haitians with appointments to come at a later date, leaving hundreds waiting in Tijuana, Mexico. Many stay at one of the Mexican border city's five migrant shelters that volunteered in May to help.\nThe Rev. Pat Murphy, director of Casa del Migrante in Tijuana, said Haitians arriving at the San Diego crossing on Wednesday wouldn't get an appointment until Oct. 12. His shelter now houses 1,000 people a month, up from 600 before the Haitians began arriving. About half who stay there are Haitians.\n\"We've opened the doors and sometimes we've opened the floors so people can have a place to sleep,\" Murphy said at a news conference Wednesday at San Diego's Christ United Methodist Church, which has provided food, clothing and temporary shelter over the last few months to about 3,000 Haitians after they arrived in the U.S.\nMurphy said 90 percent of the people who have come to his shelter in the last six weeks are Haitians who moved to Brazil after the 2010 earthquake.\nImmigration and Customs Enforcement has been releasing many Haitians with notices to appear before an immigration judge, triggering a process that can take years in the overcrowded courts. Many head to Florida, which has a large Haitian community.\nThe new posture subjects Haitian arrivals to enforcement policies that Johnson announced in 2014, which, among other things, make people who are caught at the border a high priority for deportation. Still, if a U.S. Citizenship and Immigration Services officer finds they have a \"credible fear\" of persecution at home, they can stay in the country until they appear before an immigration judge for asylum or other relief.\n\"Haitians are not going to be treated any different than anyone else,\" Saldana said at a House Judiciary Committee hearing. \"If they have an ... asylum claim or claim to be a refugee we will consider those claims along with everything else.\"\nIt is unknown if Haiti will agree to take large numbers of its citizens back and how quickly. Presidential elections are scheduled there for Oct. 9.\nJohnson said conditions have improved enough in Haiti to lift the post-earthquake protections against deportation but the toughened stance drew criticism from immigration advocacy groups. Andrea Guerrero, executive director of Alliance San Diego, said it betrays a U.S. pledge to assist earthquake victims.\n\"Haiti is not in a situation to accept anyone,\" Guerrero said. \"It all sounds nice for political rhetoric but the reality is if they're going to attempt to deport recent arrivals from Haiti, it's nonsensical and inhumane.\"\nLike us on Facebook \nFollow us on Twitter & Instagram", "external_links": [], "published": "2016-09-22T03:00:00.000+03:00", "crawled": "2016-09-23T00:48:00.322+03:00", "highlightTitle": ""}