{"organizations": [], "uuid": "f2e693d5d63f4abb72c348cbd3757ad9a3bdf617", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 38, "shares": 38, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "nation.foxnews.com", "main_image": "http://nation.foxnews.com/sites/nation.foxnews.com/files/styles/story_624_300/public/DebatePreview092616.jpg", "site_section": "http://feeds.feedburner.com/FoxNation", "section_title": "nation.foxnews.com", "url": "http://nation.foxnews.com/2016/09/26/keys-victory-trump-and-clinton-first-presidential-debate", "country": "US", "domain_rank": 185, "title": "The Keys to Victory for Trump and Clinton in the First Presidential Debate", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "The Keys to Victory for Trump and Clinton in the First Presidential Debate", "spam_score": 0.0, "site_type": "news", "published": "2016-09-27T02:44:00.000+03:00", "replies_count": 0, "uuid": "f2e693d5d63f4abb72c348cbd3757ad9a3bdf617"}, "author": "robinson", "url": "http://nation.foxnews.com/2016/09/26/keys-victory-trump-and-clinton-first-presidential-debate", "ord_in_thread": 0, "title": "The Keys to Victory for Trump and Clinton in the First Presidential Debate", "locations": [], "entities": {"persons": [{"name": "clinton", "sentiment": "negative"}, {"name": "trump", "sentiment": "negative"}, {"name": "kellyanne conway", "sentiment": "none"}, {"name": "jimmy carter", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "ronald reagan", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "bill clinton", "sentiment": "none"}, {"name": "mike pence", "sentiment": "none"}, {"name": "reid j. epstein", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "paul manafort", "sentiment": "none"}, {"name": "gennifer flowers", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "first presidential debate    candidates", "sentiment": "neutral"}, {"name": "white house", "sentiment": "none"}, {"name": "wall street journal/nbc news", "sentiment": "none"}, {"name": "twitter", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The Keys to Victory for Trump and Clinton in the First Presidential Debate   \nCandidates will debate in front of largest audience of the campaign \nBy REID J. EPSTEIN, The Wall Street Journal Tonight’s presidential debate figures to be one of the most-watched political events in American history. Viewership for the first one-on-one showdown between Democrat Hillary Clinton and Republican Donald Trump is expected to approach the 80 million who watched Ronald Reagan and Jimmy Carter in 1980. \nOne-third of voters say the presidential debates will be very important in helping them decide whom to support for president. The nominees likely will never have a larger audience to which they can make the case for themselves as president. \nThe first presidential debate – and the two that follow Oct. 9 and Oct. 19 – will probably be typical of the campaign: full of slashing political and personal attacks along with glaring and repeated departures from the truth, particularly from Mr. Trump, who has rarely allowed himself to be governed by restrictions of fact. \nHere’s a look at what the White House hopefuls can do to best help themselves in their 90 minutes before the biggest audiences of their political careers. \nHILLARY CLINTON Talk to the fence-sitters \nThe latest Wall Street Journal/NBC News poll found approximately 20% of likely voters in November are either undecided or leaning toward a third-party candidate. She has to find a way either to pull them into her camp, or keep them from jumping to Mr. Trump. Motivate the base \nIn five of the last six presidential elections, the Democratic candidate has won more votes than the Republican, so it stands to reason that if Mrs. Clinton can just turn out regular Democratic voters, she’ll be fine come Election Day. \nTo do this she has to hit on the issues that matter to today’s Democratic coalition, a multiracial, multicultural, multilingual group with disparate concerns. Expect her to stress her commitment to social justice issues and an overhaul of the U.S. immigration system in particular, and to remind black and Hispanic voters of Mr. Trump’s long history of questioning   place of birth. Keep it about Mr. Trump \nMrs. Clinton is the second least popular major-party presidential nominee in the history of modern polling. Lucky for her, Mr. Trump is No. 1. \nSo while it is important to give Americans something to vote for, Mrs. Clinton has to be careful not to let Mr. Trump redefine himself as someone suburban women and college-educated white can envision as president. Among those swing demographics, Mr. Trump lags far behind what a Republican needs to win a national election. \nThis will entail not just repeating Mr. Trump’s past provocative statements back to him but challenging him in real time on statements he makes that are not true. \nDONALD TRUMP Knock Mrs. Clinton off balance \nMr. Trump’s biggest advantage is his unpredictability — this is a candidate who bragged about the size of his genitalia during a primary debate. There is nothing that one can definitively say he won’t do on the biggest stage of the campaign. \nAlready we saw this starting over the weekend, when Mr. Trump on Twitter invited Gennifer Flowers, with whom Bill Clinton reportedly had an affair decades ago, to attend the debate as his guest. (On Sunday, Trump running mate Mike Pence and campaign manager Kellyanne Conway said she hadn’t been invited.) \nMr. Trump will need an attack that knocks Mrs. Clinton for a loop to win himself some rhetorical space to look like someone Americans can trust to be commander-in-chief and run the federal government. Look like a president \nWhen he was still running Mr. Trump’s campaign, Paul Manafort liked to say that once Americans saw his candidate as a president he would win the election in a runaway. Well, Mr. Trump been running for president for 15 months and has yet to put together a full week without a distraction from his core message. \nThis debate will be a chance to show that a candidate who has in the past bragged that “it can be smart to be shallow” has a command of policy sufficient to run the federal government. Refreshing a long-cemented image will be a heavy lift, but if Mr. Trump is going to do it he will need to show a discipline and preparedness in the debate that he has not to date. ...", "external_links": [], "published": "2016-09-27T02:44:00.000+03:00", "crawled": "2016-09-26T23:55:22.560+03:00", "highlightTitle": ""}