{"organizations": [], "uuid": "5fc3bd7b1b39140e88581b643b4aea019961b408", "thread": {"social": {"gplus": {"shares": 1}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 102, "shares": 102, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/news/0/0/Child%20Migrants%20Bus.jpg", "site_section": "http://feeds.latino.foxnews.com/home/feed", "section_title": "FOX News", "url": "http://latino.foxnews.com/latino/news/2016/09/07/more-than-127000-child-refugees-expected-to-enter-us-by-end-2016-group-says/", "country": "US", "domain_rank": 185, "title": "More than 127,000 child refugees expected to enter the U.S. by end of 2016, group says", "performance_score": 1, "site": "foxnews.com", "participants_count": 1, "title_full": "More than 127,000 child refugees expected to enter the U.S. by end of 2016, group says | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2016-09-07T03:00:00.000+03:00", "replies_count": 0, "uuid": "5fc3bd7b1b39140e88581b643b4aea019961b408"}, "author": "Fox News Latino", "url": "http://latino.foxnews.com/latino/news/2016/09/07/more-than-127000-child-refugees-expected-to-enter-us-by-end-2016-group-says/", "ord_in_thread": 0, "title": "More than 127,000 child refugees expected to enter the U.S. by end of 2016, group says", "locations": [], "entities": {"persons": [{"name": "david murphey", "sentiment": "none"}], "locations": [{"name": "united states", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "burma", "sentiment": "none"}, {"name": "bethesda", "sentiment": "none"}, {"name": "honduras", "sentiment": "none"}, {"name": "el salvador", "sentiment": "none"}, {"name": "syria", "sentiment": "none"}, {"name": "guatemala", "sentiment": "none"}, {"name": "u.s", "sentiment": "none"}, {"name": "maryland", "sentiment": "none"}, {"name": "iraq", "sentiment": "none"}, {"name": "somalia", "sentiment": "none"}], "organizations": [{"name": "ap photo/rebecca blackwell", "sentiment": "negative"}, {"name": "border patrol", "sentiment": "none"}, {"name": "associated press", "sentiment": "none"}, {"name": "central american minors", "sentiment": "none"}, {"name": "u.s. state department", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "  (AP Photo/Rebecca Blackwell) \nA research group estimates that the United States will see an influx of more than 127,000 children entering the country from abroad this year as either refugees or unauthorized migrants, up from less than 100,000 last year.\nChild Trends, in a report being released Wednesday, projected that about 37,500 children will be designated as refugees and 90,000 will enter the country without authorization, with or without a parent.\nChildren who arrive as refugees have favored status for support services and will be eligible for citizenship after five years, while children who are apprehended at the border face possible detention and varying custody arrangements, the report states.\nAccording to Child Trends, an estimated 1 million children not apprehended at the border are living in the U.S. as unauthorized immigrants, often lacking legal representation or access to social services.\n\"While these children have the potential to make vital contributions to our communities, many have faced or will face trauma that, without intervention, can have lifelong negative impacts.\" the report said.\nChild Trends said most of the arriving children face a range of continued risks after arriving in the U.S. These include discrimination and bullying, challenges in school, problematic conditions in detention centers, and the risk of being released to sponsors who are not adequately screened or monitored.\nChild Trends recommended that legal representation be provided to all children during asylum processing and deportation hearings. It also said law enforcement personnel and Border Patrol officers should have specific training in working with child victims of human trafficking.\n\"Children are coming in with very serious needs and have a precarious kind of existence while we sort out their future,\" said David Murphey, author of the Child Trends report. \"There's a bewildering array of agencies and offices that these children and families pass through.\"\nHowever, the government is not required to provide children publicly funded counsel because crossing the U.S. border without authorization or documentation is a civil offense and not a criminal one.\nIn recent years, the vast majority of children arriving as unauthorized migrants have been from El Salvador, Guatemala and Honduras, fleeing rampant crime and gang violence, while the largest number of child refugees have been from Iraq, Burma, Somalia and Syria.\nThe Child Trends report was sent in advance to the U.S. State Department, which expressed its commitment to protecting child refugees. It cited the Central American Minors program, which allows parents lawfully in the U.S. to request that their children in El Salvador, Guatemala, and Honduras be considered for refugee status — \"a safe, legal, and orderly alternative to the dangerous journey that some children have undertaken to join their parents.\"\nChild Trends, based in Bethesda, Maryland, is an independent, nonprofit organization providing research, analysis and communication to decision makers \"to improve public policies and interventions that serve children and families.\"\nBased on reporting by The Associated Press. \n ", "external_links": [], "published": "2016-09-07T03:00:00.000+03:00", "crawled": "2016-09-07T15:14:55.946+03:00", "highlightTitle": ""}