{"organizations": [], "uuid": "bdcdd324ab293b67582ae5f8c60f6f9134e358a0", "thread": {"social": {"gplus": {"shares": 1}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 34, "shares": 34, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/entertainment/0/0/vz%20old%20rally2.jpg", "site_section": "http://feeds.latino.foxnews.com/home/feed", "section_title": "FOX News", "url": "http://latino.foxnews.com/latino/news/2016/09/01/venezuela-braces-for-massive-taking-caracas-rally-foreign-reporters-expelled/", "country": "US", "domain_rank": 185, "title": "Venezuela braces for massive 'Taking of Caracas' rally, 6 foreign reporters expelled", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "Venezuela braces for massive 'Taking of Caracas' rally, 6 foreign reporters expelled | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2016-09-01T03:00:00.000+03:00", "replies_count": 0, "uuid": "bdcdd324ab293b67582ae5f8c60f6f9134e358a0"}, "author": "Fox News Latino", "url": "http://latino.foxnews.com/latino/news/2016/09/01/venezuela-braces-for-massive-taking-caracas-rally-foreign-reporters-expelled/", "ord_in_thread": 0, "title": "Venezuela braces for massive 'Taking of Caracas' rally, 6 foreign reporters expelled", "locations": [], "entities": {"persons": [{"name": "jim wyss", "sentiment": "none"}, {"name": "pantoulas", "sentiment": "none"}, {"name": "yon goicoechea", "sentiment": "none"}, {"name": "miguelina caballero", "sentiment": "none"}, {"name": "maduro", "sentiment": "none"}, {"name": "daniel ceballos", "sentiment": "none"}, {"name": "— jim wyss", "sentiment": "none"}, {"name": "goicoechea", "sentiment": "none"}, {"name": "hugo chavez", "sentiment": "none"}, {"name": "nicolas maduro", "sentiment": "none"}, {"name": "carlos melo", "sentiment": "none"}, {"name": "dimitris pantoulas", "sentiment": "none"}], "locations": [{"name": "venezuela", "sentiment": "none"}, {"name": "caracas", "sentiment": "none"}, {"name": "san cristobal", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}, {"name": "colombia", "sentiment": "none"}], "organizations": [{"name": "democratic unity alliance", "sentiment": "none"}, {"name": "associated press", "sentiment": "none"}, {"name": "miami herald", "sentiment": "none"}, {"name": "el nacional", "sentiment": "none"}, {"name": "u.s. state department", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "  FILE: An anti-government demonstration on March 4, 2014 in Caracas, Venezuela. Getty \nAs hundreds of thousands of opponents of President Nicolas Maduro are expected to flood the streets of Caracas Thursday, the buildup to the protest is turning increasingly tense, with the government planning a counter protest and denying entry to at least six foreign journalists who wanted to cover the rally.\nOne of those journalists is Jim Wyss, the Miami Herald’s Andean bureau chief, who was detained by Venezuelan immigration authorities Wednesday evening and later expelled to Colombia.\nAll is well. On my way home sooner than expected. Venezuelan officials were as professional and kind as possible under circumstances.\n— Jim Wyss (@jimwyss) September 1, 2016 \nThe Thursday march called the \"taking of Caracas\" aims to pressure electoral authorities to allow a recall referendum against Maduro this year.\nMaduro said Tuesday that his opponents hope violence during the march will pave the way for a coup such as the one that briefly toppled his late predecessor Hugo Chavez in 2002.\n\"If they're coming with coups, ambushes and political violence, the revolutionary will provide an uncommon and overwhelming response,\" Maduro told supporters.\nRather than dampening Venezuelans' enthusiasm, the \"war-like\" rhetoric appears to be energizing the opposition, said Dimitris Pantoulas, a political analyst from Caracas.\n\"The government made a big mistake by throwing fuel onto the flames,\" said Pantoulas.\nAmong those taking part in the march, which organizers are hoping will draw 1 million people, are some 100 members of the piaroa and jiwi indigenous tribes. They arrived in Caracas on Wednesday for the protest, after travelling more than 375 miles  — by foot, canoe and bus — from the Amazon rainforest.\n\"We came to see if they'll free the political prisoners,\" said Miguelina Caballero through an interpreter. She was referring to someone from her piaroa tribe who had been jailed for alleged fraud during December's congressional elections, a case the government used to disqualify three indigenous leaders from taking seats in the opposition-controlled legislature.\nBut delivering on its big promises won't be easy for Maduro's opponents.\nThe opposition has staged a half-dozen or so marches this year, some of which ended in clouds of tear gas as hard-core activists clashed with riot police, but posed no major risk to Maduro's grip on power. Even the anti-government protests in 2014 that were blamed for more than 40 deaths failed to rally the huge numbers now sought for Thursday's march by the hard-to-keep together Democratic Unity alliance.\nThe opposition hopes to force electoral authorities widely seen as pro-government to allow a recall vote this year. If Maduro loses, new elections would be held and polls indicate the opposition would win. But if a vote is delayed until after Jan. 10, and Maduro loses, his vice president would finish his term ending in 2019.\nElectoral authorities have yet to set the date for the next stage of the complex process, in which the opposition must collect 4 million signatures over three days, with a referendum vote scheduled only once the signatures are validated.\nThe government plans a counter protest on Thursday, but Pantoulas said authorities will have a tougher time rallying supporters among the poor amid 700 percent inflation blamed for growing hunger and a collapse in wages.\n\"I don't know that the poor will join opposition march, but they're not going to partake in the counter-protest,\" said Pantoulas. \"The fact that the poor barrios won't be supporting Chavismo is enough to damage the government.\"\nAlso invigorating the opposition is a government crackdown.\nAuthorities over the weekend moved a prominent opposition leader, former San Cristobal Mayor Daniel Ceballos, from house arrest back to prison while he awaits trial on civil rebellion charges stemming from the 2014 protests. Authorities said he was plotting to flee and carry out violence during the protests.\nTwo other activists, Yon Goicoechea and Carlos Melo, were also detained this week, with a top socialist leader accusing Goicoechea of carrying explosives.\nThere have been more subtle threats as well. Government workers say they've suffered retaliation for signing petitions seeking Maduro's removal and the opposition-leaning newspaper El Nacional said thugs threw excrement and Molotov cocktails at its building Tuesday.\nThe U.S. State Department accused Maduro of trying to bully Venezuelans from taking part in the march.\nBased on reporting by The Associated Press. \n ", "external_links": [], "published": "2016-09-01T03:00:00.000+03:00", "crawled": "2016-09-01T15:34:46.509+03:00", "highlightTitle": ""}