{"organizations": [], "uuid": "2ca20bc69415d7f4140b68c8c509a2e7e79fbab6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/politics/0/0/Trump%20Aguilar%20Latino.jpg", "site_section": "http://feeds.latino.foxnews.com/home/feed", "section_title": "FOX News", "url": "http://latino.foxnews.com/latino/politics/2016/09/08/former-trump-backer-says-there-was-real-shot-at-pivot-on-his-immigration-stance/", "country": "US", "domain_rank": 185, "title": "Former Trump backer says 'there was real shot at pivot' on his immigration stance", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "Former Trump backer says 'there was real shot at pivot' on his immigration stance | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2016-09-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "2ca20bc69415d7f4140b68c8c509a2e7e79fbab6"}, "author": "Elizabeth Llorente", "url": "http://latino.foxnews.com/latino/politics/2016/09/08/former-trump-backer-says-there-was-real-shot-at-pivot-on-his-immigration-stance/", "ord_in_thread": 0, "title": "Former Trump backer says 'there was real shot at pivot' on his immigration stance", "locations": [], "entities": {"persons": [{"name": "alfonso aguilar", "sentiment": "negative"}, {"name": "trump", "sentiment": "negative"}, {"name": "elizabeth llorente    donald trump", "sentiment": "neutral"}, {"name": "clinton", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "elizabeth llorente", "sentiment": "none"}, {"name": "marin", "sentiment": "none"}, {"name": "sean hannity", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "rosario marin", "sentiment": "none"}, {"name": "aguilar", "sentiment": "none"}, {"name": "george w. bush", "sentiment": "none"}, {"name": "hillary", "sentiment": "none"}, {"name": "jerry natividad", "sentiment": "none"}, {"name": "enrique peña nieto", "sentiment": "none"}], "locations": [{"name": "united states", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "arizona", "sentiment": "none"}, {"name": "phoenix", "sentiment": "none"}, {"name": "colorado", "sentiment": "none"}], "organizations": [{"name": "fox news latino", "sentiment": "none"}, {"name": "u.s. office of citizenship", "sentiment": "none"}, {"name": "fox news", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "gop", "sentiment": "none"}, {"name": "fox new latino", "sentiment": "none"}, {"name": "facebook  follow us on twitter & instagram", "sentiment": "none"}, {"name": "supreme court", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Elizabeth Llorente \n  Donald Trump, left, and Alfonso Aguilar. (Photos: Getty Images) \nA prominent Latino conservative who, in the face of criticism from other Latinos, endorsed GOP nominee Donald Trump then recently withdrew that support, defended his decision to give the candidate a chance to win him over.\nAlfonso Aguilar – a former George W. Bush administration official and president of the Latino Partnership for Conservative Principles, which aims to build support among Latinos for conservative policies – told Fox News Latino that the real estate mogul had signaled that he would soften his stance on immigration.\n“I wasn’t naïve” to support Trump, Aguilar said. “It was a long shot, but we had to try to do it.”\n“There was a real shot of a pivot,” he added. “It could have happened, but didn’t at the end.”\nAguilar, who had endorsed Trump after long expressing misgivings about him, withdrew his support after the mogul’s hard line speech on immigration last week. Aguilar says he will not vote for president.\nThe former head of the U.S. Office of Citizenship took a very high profile position in opposition to Trump last year as the billionaire took an increasingly hard line on immigration as he competed against a large field of Republicans for the party nomination.\nBut after the reality TV star became the presumptive GOP nominee, Aguilar attended the Republican National Convention in July with what he stated would be an open mind. There, he announced that he was supporting Trump.\nLast October, Aguilar was part of a coalition of Latino conservative leaders who held a press conference ahead of a Republican debate in Colorado to warn the party that to embrace rhetoric deemed anti-Latino or anti-immigrant would have repercussions among the country’s largest minority electorate.\nThe group singled out Trump for the most criticism.\n“This group unanimously has decided that Donald Trump is not a candidate who we can support,” said Jerry Natividad, one of the organizers of the meeting.\nAfter the meeting, as other GOP candidates withdrew from the race and Trump grew closer to the nomination, members of the group went in different directions. Former U.S. Treasurer Rosario Marin boycotted this year’s GOP convention and has decided to support Hillary Clinton – the first time, Marin noted, she has endorsed a Democratic presidential nominee.\nLike other disenchanted Latinos, Aguilar weighed voting for other Republicans running for office at various levels of government, but leaving the president spot blank.\n“It would be a protest vote,” he told Fox New Latino on Wednesday.\nThough the convention took a hard line on immigration, with Trump showcasing relatives of Americans who had been killed by undocumented immigrants and bringing them on stage to share their story, some, like Aguilar, believed he would soften his tone.\nLast month, Trump suggested in a meeting with Latino leaders that he was open to their thoughts about how to handle immigration. In a town hall with Fox News host Sean Hannity, Trump went a step further, expressing sympathy for undocumented immigrants who have been in the United States for 10 years or more, had raised families here and not run into any trouble with police. \nHe suggested that they might deserve a chance to legalize their status by paying fines and back taxes, adding that many people had told him that to deport these immigrants from their families would be harsh.\nBut then, after a lightning trip to meet with Mexican President Enrique Peña Nieto, Trump delivered a decidedly hard line speech on immigration, saying, essentially, that no undocumented immigrant should consider himself or herself spared from deportation.\nAgain, he brought to the stage relatives of Americans who had been killed by undocumented immigrants. Critics blasted Trump for showing a menacing, one-dimensional side of immigration.\nAguilar says he and other Latinos stayed in the fold in order to try to nudge the candidate to move to the center on immigration.\n“I knew it was a risk,” he said. “But we needed to be part of the process to move him to the center. We needed to try to be part of the conversation.”\nBut then Trump delivered his long-awaited address on immigration in Phoenix, Arizona, on Aug. 31, and Aguilar decided that was enough.\n“He gave a terrible speech, and I withdrew my support,” he told FNL. “At least I know I tried.”\nAguilar said in no uncertain terms that he will not be joining the Republicans who have announced that they are voting for Clinton. He plans to leave the presidential spot on the ballot blank and vote for Republican candidates down-ticket. He urges other Latinos to go to the polls to vote on Nov. 8, and to do the same.\n“Hillary will be disastrous for our country,” Aguilar said. “I’m concerned about the future of the Supreme Court. She would appoint judges who would legislate from the bench. She’s aggressively for abortion on demand. All of that is unacceptable. As a conservative, she is not an option.”\n\nElizabeth Llorente is the Politics Editor/Senior Reporter for Fox News Latino, and can be reached at Elizabeth.Llorente@Foxnewslatino.com. Follow her on https://twitter.com/Liz_Llorente \nLike us on Facebook \nFollow us on Twitter & Instagram", "external_links": [], "published": "2016-09-08T03:00:00.000+03:00", "crawled": "2016-09-08T18:20:50.814+03:00", "highlightTitle": ""}