{"organizations": [], "uuid": "d6e58cc50c8d66c1664caa0e939e55291ed5545b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 3, "shares": 3, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/politics/0/0/Cruz%20Brussels%20Photo.jpg", "site_section": "http://feeds.latino.foxnews.com/home/feed", "section_title": "FOX News", "url": "http://latino.foxnews.com/latino/politics/2016/09/23/after-months-bad-blood-ted-cruz-endorses-donald-trump-bid-for-president/", "country": "US", "domain_rank": 185, "title": "After months of bad blood, Ted Cruz endorses Donald Trump's bid for president", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "After months of bad blood, Ted Cruz endorses Donald Trump's bid for president | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2016-09-23T03:00:00.000+03:00", "replies_count": 0, "uuid": "d6e58cc50c8d66c1664caa0e939e55291ed5545b"}, "author": "Fox News Latino", "url": "http://latino.foxnews.com/latino/politics/2016/09/23/after-months-bad-blood-ted-cruz-endorses-donald-trump-bid-for-president/", "ord_in_thread": 0, "title": "After months of bad blood, Ted Cruz endorses Donald Trump's bid for president", "locations": [], "entities": {"persons": [{"name": "ted cruz", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "negative"}, {"name": "martin", "sentiment": "negative"}, {"name": "rick tyler", "sentiment": "none"}, {"name": "clinton", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "barack obama", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "heidi cruz", "sentiment": "none"}, {"name": "joe barton", "sentiment": "none"}, {"name": "cruz", "sentiment": "none"}, {"name": "obama", "sentiment": "none"}, {"name": "john kasich", "sentiment": "none"}], "locations": [{"name": "america", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "indiana", "sentiment": "none"}, {"name": "cleveland", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}, {"name": "ohio", "sentiment": "none"}], "organizations": [{"name": "ap", "sentiment": "negative"}, {"name": "fox news latino", "sentiment": "negative"}, {"name": "senate", "sentiment": "none"}, {"name": "republican", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "gop", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "facebook  follow us on twitter & instagram", "sentiment": "none"}, {"name": "the washington examiner", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "  Fox News Latino (AP Photo/Jacquelyn Martin) \nAfter Sen. Ted Cruz delivered a highly criticized speech in Cleveland at the Republican National Convention, it seemed like the Texas lawmaker would never endorse GOP presidential nominee Donald Trump.\nCruz, however, finally broke said on Friday on a Facebook post that he will vote for Trump on Election Day in November.\n“After many months of careful consideration, of prayer and searching my own conscience, I have decided that on Election Day, I will vote for the Republican nominee, Donald Trump,” Cruz wrote.\n\nIn his lengthy post, Cruz said he was voting for Trump out of party loyalty and to prevent Democrat Hillary Clinton from winning the White House.\n“I’ve made this decision for two reasons. First, last year, I promised to support the Republican nominee. And I intend to keep my word,” Cruz wrote. “Second, even though I have had areas of significant disagreement with our nominee, by any measure Hillary Clinton is wholly unacceptable — that’s why I have always been #NeverHillary .”\nCruz continued by laying out “six key policy differences” that led him to endorse Trump – all of which focused on Clinton’s perceived shortcomings on issues such as health care, energy and national security.\nOn the topic of immigration, which has been a hot button issue this campaign, Cruz said that Trump would stop the executive actions taken by President Barack Obama, while Clinton would continue them.\n“Clinton would continue, and even expand, President Obama’s lawless executive amnesty,\" the first-term senator wrote. “Trump has promised that he would revoke those illegal executive orders.”\nHe added, “If Clinton wins, we know — with 100 percent certainty — that she would deliver on her left-wing promises, with devastating results for our country.”\nAfter the endorsement, Trump put out a statement reading, “I am greatly honored by the endorsement of Sen. Cruz. We have fought the battle, and he was a tough and brilliant opponent. I look forward to working with him for many years to come in order to make America great again.”\nCruz’s endorsement comes after months of bad blood between him and Trump in the primaries during which Cruz, Trump and Ohio Gov. John Kasich fought for the nomination until early May and the Indiana primary, where Trump clinched the number of delegates needed to win the nomination.\nOn the campaign trail, Trump nicknamed Cruz \"Lyin' Ted,\" and derided him as \"unstable,\" ''crazy,\" ''a maniac\" and \"sick.\"\nTrump also questioned whether Cruz's birth in Canada disqualified him to hold the office of president, threatening to sue over the issue. He never followed through, but several lawsuits were filed on the topic, including one in Cruz's home state.\nCruz initially avoided personal attacks on Trump, hoping that the former reality TV star's supporters would flow to him if Trump flamed out. As Trump's momentum grew with early primary victories, however, Cruz decided to fight back – labeling Trump a \"pathological liar\" and \"utterly amoral\" and claiming he can't be trusted because of his past support for Democratic candidates, abortion rights and same-sex marriage.\nThe two candidates also exchanged highly personal barbs after Trump tweeted out an unflattering image of Heidi Cruz along with the caption \"A picture is worth a thousand words.\"\nDuring his time in the race, Cruz also argued that he was the only truly conservative candidate running. He was aided in that effort by having clashed stubbornly in the Senate repeatedly both with Democrats and with members of his own party over ideological matters. \nCruz’s endorsement seemed to signal that he is more concerned about the possibility of another Clinton in the White House than he is about holding onto any grudge against Trump.\n“Our country is in crisis,” he wrote. “Hillary Clinton is manifestly unfit to be president, and her policies would harm millions of Americans. And Donald Trump is the only thing standing in her way.”\nCruz continued, “A year ago, I pledged to endorse the Republican nominee and I am honoring that commitment. And if you don’t want to see a Hillary Clinton presidency, I encourage you to vote for him.”\nIn recent days, after it appeared that Cruz was leaning toward endorsing Trump, critics characterized the move as a potentially damaging flip-flop.\n“There were thousands of people not in that arena [in Cleveland] who will be utterly disappointed that Cruz didn't maintain his principled stand for conservatism,\" the Washington Examiner quoted Rick Tyler, Cruz’s former campaign spokesman, as saying. \"Endorsing now for no reciprocation? He would just end up being a Trump Chump.”\nOther saw a Cruz endorsement as good politics.\n“Trump is our nominee, and Sen. Cruz represents a big electoral state and is very popular in Texas,” said Rep. Joe Barton (R-Texas). “It certainly would be helpful, I think, for the Trump campaign to have Cruz’s endorsement.\"\nLike us on Facebook \nFollow us on Twitter & Instagram", "external_links": [], "published": "2016-09-23T03:00:00.000+03:00", "crawled": "2016-09-24T00:19:06.165+03:00", "highlightTitle": ""}