{"organizations": [], "uuid": "946583afc1a607ea9e5f758121088dda71cabb4c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/FNL/Politics/0/0/santos%20farc.jpg", "site_section": "http://feeds.latino.foxnews.com/home/feed", "section_title": "FOX News", "url": "http://latino.foxnews.com/latino/opinion/2016/09/28/opinion-applaud-pres-santos-for-reaching-colombia-landmark-peace-deal/", "country": "US", "domain_rank": 185, "title": "Opinion: I applaud Pres. Santos for reaching Colombia's landmark peace deal", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "Opinion: I applaud Pres. Santos for reaching Colombia's landmark peace deal | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2016-09-28T03:00:00.000+03:00", "replies_count": 0, "uuid": "946583afc1a607ea9e5f758121088dda71cabb4c"}, "author": "Gustavo Torres", "url": "http://latino.foxnews.com/latino/opinion/2016/09/28/opinion-applaud-pres-santos-for-reaching-colombia-landmark-peace-deal/", "ord_in_thread": 0, "title": "Opinion: I applaud Pres. Santos for reaching Colombia's landmark peace deal", "locations": [], "entities": {"persons": [{"name": "santos", "sentiment": "negative"}, {"name": "juan manuel santos", "sentiment": "negative"}, {"name": "gustavo torres", "sentiment": "negative"}, {"name": "enrique pena nieto", "sentiment": "none"}, {"name": "pedro pablo kuczynski", "sentiment": "none"}, {"name": "timochenko", "sentiment": "none"}, {"name": "ban ki moon", "sentiment": "none"}, {"name": "rodrigo londono", "sentiment": "none"}, {"name": "juan carlos", "sentiment": "none"}, {"name": "raul castro", "sentiment": "none"}], "locations": [{"name": "colombia", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "cuba", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}, {"name": "spain", "sentiment": "none"}, {"name": "cartagena", "sentiment": "none"}, {"name": "peru", "sentiment": "none"}, {"name": "maryland", "sentiment": "none"}], "organizations": [{"name": "fox news latino colombia", "sentiment": "negative"}, {"name": "u.n.", "sentiment": "none"}, {"name": "associated press", "sentiment": "none"}, {"name": "farc", "sentiment": "none"}, {"name": "revolutionary armed forces of colombia", "sentiment": "none"}, {"name": "ap", "sentiment": "none"}, {"name": "facebook  follow us on twitter & instagram", "sentiment": "none"}, {"name": "fair immigration reform movement", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Gustavo Torres \n  Fox News Latino Colombia’s President Juan Manuel Santos, front left, and the top commander of the Revolutionary Armed Forces of Colombia (FARC) Rodrigo Londono, known by the alias Timochenko, shake hands after signing the peace agreement between Colombia’s government and the FARC to end over 50 years of conflict in Cartagena, Colombia, Monday, Sept. 26, 2016. Behind, from left, are U.N. Secretary General Ban Ki Moon, Mexico's President Enrique Pena Nieto, Peru's President Pedro Pablo Kuczynski, Cuba's President Raul Castro, and Spain's former King Juan Carlos. (AP Photo/Fernando Vergara) Copyright 2016 The Associated Press. All rights reserved. \nOn behalf of the Fair Immigration Reform Movement , we write to applaud President Juan Manuel Santos and the persistent and visionary leadership of countless Colombian leaders and citizens who worked tirelessly to reach the landmark peace deal between the Colombian government and the Revolutionary Armed Forces of Colombia (FARC). This peace accord – pending ratification by the Colombian people in a plebiscite next month – will bring half a century of fighting to an end.    \nHowever, despite this momentous success, significant challenges remain. At this critical moment, we hope the U.S. government will come together to ensure that America is committed to helping Colombia secure peace and to providing assistance to Colombia as the government begins the difficult work of implementing this historic agreement.  \nWe also write to express our renewed commitment to ensuring that the United States remains a steadfast partner as you implement this landmark accord. If ratified by the Colombian people next month, the peace agreement will bring an end to the longest running conflict in our hemisphere.  As you know, Colombians of all walks of life have suffered over half a century of fighting, which has claimed more than 220,000 lives and displaced over 6 million people. This accord – the product of four years of painstaking negotiations – will help to reintegrate former combatants into society and promote security and economy opportunity in rural areas plagued by violence.  \nWe strongly encourage the Colombian government and all relevant parties to ensure that it is carried out in a manner that promotes the rights of victims of all armed actors and honors their demands for truth and justice. We also welcome the inclusion of provisions on Afro‐Colombian and indigenous rights and urge their full implementation.            \nFor these reasons and recognizing the serious challenges that Colombia will face in implementing the agreement, we strongly support the Peace Colombia initiative announced in February. We also believe that this commitment must be honored by our next Administration.\nAfter standing with Colombia through decades of war, we must continue to stand with the Colombian people as you work to build a just and lasting peace.      \nAgain, we want to congratulate all the parties engage in this historic milestone. This progress is indicative not only of the Colombian government’s commitment to peace, but also of the Colombian people’s remarkable capacity for healing and forgiveness.  \nWe look forward to continuing to support Colombia at this momentous time in your nation’s history.\nGustavo Torres is a Maryland resident originally from Colombia. \nLike us on Facebook \nFollow us on Twitter & Instagram", "external_links": [], "published": "2016-09-28T03:00:00.000+03:00", "crawled": "2016-09-28T21:20:45.847+03:00", "highlightTitle": ""}