{"organizations": [], "uuid": "45dea7d92cb3c63b85e96884543a58aa3a0d21fd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 2, "shares": 2, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "latino.foxnews.com", "main_image": "http://global.fncstatic.com/static/v/all/img/fn_latino_128x128.png", "site_section": "http://feeds.latino.foxnews.com/home/feed", "section_title": "FOX News", "url": "http://latino.foxnews.com/latino/politics/2016/09/20/trump-relates-terrorism-immigration-mexico-in-same-speech/", "country": "US", "domain_rank": 185, "title": "Trump relates terrorism, immigration, Mexico in same speech | Fox News Latino", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "Trump relates terrorism, immigration, Mexico in same speech | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2016-09-20T03:00:00.000+03:00", "replies_count": 0, "uuid": "45dea7d92cb3c63b85e96884543a58aa3a0d21fd"}, "author": "EFE", "url": "http://latino.foxnews.com/latino/politics/2016/09/20/trump-relates-terrorism-immigration-mexico-in-same-speech/", "ord_in_thread": 0, "title": "Trump relates terrorism, immigration, Mexico in same speech | Fox News Latino", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Published September 20, 2016 EFE Washington –   By Jairo Mejia\nRepublican presidential candidate Donald Trump on Tuesday related terrorist attacks in the United States with the country's \"open borders policy,\" called for refugees to be presumed guilty, while his supporters loudly called for a wall to be built on the Mexican border.\nTrump told a rally in North Carolina that the attacks inspired by radical jihadism only happened because the country \"allowed thousands of criminal aliens to be released into our communities.\"\nHe further said that the immigration plan of his rival for the White House, Hillary Clinton, would bring in 620,000 refugees in her first term with no way to know if they are terrorists or not.\nThe Republic said Clinton was reckless in proposing an increase in the quota of refugees from the Syrian civil war and said they must undergo detailed scrutiny before being granted asylum.\n\"Let me state this very clearly: immigration security is national security,\" Trump said, and asked that immigrants be totally barred if they come from regions \"with no effective way to screen or vet them.\"\nTrump has revived his call to suspend immigration from countries with a history of terrorism and to stop people from entering who look like Muslims after the recent attacks in New York, New Jersey and Minnesota.\nU.S. media since Monday have displayed images of Afghan-American Ahmad Khan Rahami, wounded in a shootout with police and taken into custody a few days after planting homemade bombs in New York and New Jersey, which wounded a number of people but caused no deaths.\nThen over the weekend a Somali immigrant stabbed and wounded nine people in a Minnesota shopping mall before being shot by an off-duty police officer.\nTrump slammed Clinton for an \"open borders policy\" and for allowing, as secretary of state, \"thousands of criminal aliens to be released into our communities.\"\nThe New York magnate had no trouble mixing basically unrelated concepts like terrorism, Barack Obama's freeing \"undocumented criminals,\" most of whom had committed minor traffic infractions, and the acceptance of refugees, most of whom are victims and not supporters of the Islamic State.\nMeanwhile the Republican candidate's more than 2,000 supporters, many of them young people and students at High Point University in North Carolina, cheered him on shouting \"Build the wall!\" to which Trump again responded that the wall will be built and Mexico will pay for it.\nClinton had quite a different take on the situation this week. \"We know that a lot of the rhetoric we've heard from Donald Trump has been seized on by terrorists, in particular ISIS, because they are looking to make this into a war against Islam rather than a war against jihadists,\" she said.", "external_links": [], "published": "2016-09-20T03:00:00.000+03:00", "crawled": "2016-09-21T02:10:48.340+03:00", "highlightTitle": ""}