{"organizations": [], "uuid": "ce71ec0af6fe436372d1d59df6b42bc514acd468", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 1}, "vk": {"shares": 0}, "linkedin": {"shares": 8}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/images.foxnews.com/content/fox-news/world/2016/09/19/latest-afghan-migrants-found-hiding-in-trucks-in-serbia/_jcr_content/par/featured-media/media-0.img.jpg/0/0/1474291957178.jpg?ve=1", "site_section": "http://feeds.foxnews.com/foxnews/world", "section_title": "FOX News", "url": "http://www.foxnews.com/world/2016/09/19/latest-afghan-migrants-found-hiding-in-trucks-in-serbia.html", "country": "IT", "domain_rank": 185, "title": "The Latest: Afghan migrants found hiding in trucks in Serbia", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "The Latest: Afghan migrants found hiding in trucks in Serbia | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2016-09-19T03:00:00.000+03:00", "replies_count": 0, "uuid": "ce71ec0af6fe436372d1d59df6b42bc514acd468"}, "author": "Associated Press", "url": "http://www.foxnews.com/world/2016/09/19/latest-afghan-migrants-found-hiding-in-trucks-in-serbia.html", "ord_in_thread": 0, "title": "The Latest: Afghan migrants found hiding in trucks in Serbia", "locations": [], "entities": {"persons": [{"name": "dunham", "sentiment": "none"}], "locations": [{"name": "serbia", "sentiment": "none"}, {"name": "athens", "sentiment": "none"}, {"name": "ritsona", "sentiment": "none"}, {"name": "ljubljana", "sentiment": "none"}, {"name": "slovenia", "sentiment": "none"}, {"name": "turkey", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "balkan", "sentiment": "none"}, {"name": "afghanistan", "sentiment": "none"}, {"name": "italy", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "ljubljana", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "parliament square", "sentiment": "none"}, {"name": "croatia", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "european union", "sentiment": "none"}, {"name": "united nations summit for refugees and migrants", "sentiment": "none"}, {"name": "houses of parliament", "sentiment": "none"}, {"name": "associated press", "sentiment": "none"}, {"name": "oecd", "sentiment": "none"}, {"name": "customs", "sentiment": "none"}, {"name": "organization for economic cooperation and development", "sentiment": "none"}, {"name": "ap", "sentiment": "none"}, {"name": "turtle productions", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "  A woman sweeps a path among the tents at the Ritsona refugee camp north of Athens, which hosts about 600 refugees and migrants on Monday, Sept. 19, 2016. The European Union's border agency says the number of migrants arriving in the Greek islands has increased significantly over the last month. (AP Photo/Petros Giannakouris)  (The Associated Press) \nSome 2500 lifejackets worn by refugees who made the sea crossing from Turkey to the Greek island of Chios are displayed in what the organisers called a \"Lifejacket Graveyard\" in Parliament Square, London, backdropped by the Houses of Parliament, Monday, Sept. 19, 2016. The display was organised by Snappin' Turtle Productions and supported by refugee charities to coincide with the first ever United Nations Summit for Refugees and Migrants taking place in New York later today. (AP Photo/Matt Dunham)  (The Associated Press) \nA Syrian Kurdish woman hangs out washing at Ritsona refugee camp north of Athens, which hosts about 600 refugees and migrants on Monday, Sept. 19, 2016. The European Union's border agency says the number of migrants arriving in the Greek islands has increased significantly over the last month.(AP Photo/Petros Giannakouris)  (The Associated Press) \nPrevious Next LJUBLJANA, Slovenia –   The Latest on Europe's migration crisis (all times local):\n3:20 p.m.\nSerbia's customs officers have discovered three migrants from Afghanistan hidden in two cargo trucks with Macedonian license plates that were heading toward the European Union.\nCustoms authorities said the migrants were discovered early Monday at the Serbian border with EU-member Croatia. Two migrants were hiding in a truck bound for Italy, while the third one was in a truck heading to Germany.\nAuthorities said that the customs officers looked into the trucks after their drivers suspected someone had climbed into them when they stopped earlier at a nearby gas station.\nMigrants fleeing war and poverty have been looking for ways to enter the EU countries illegally after countries closed their borders for free entry in March. Thousands remain stuck in the Balkan countries.\n___\n2:10 p.m.\nThe Organization for Economic Cooperation and Development is urging governments to improve reception conditions for migrants in order to address anti-immigration backlash.\nIn a report on international migration released on Monday, the Paris-based international organization recommended countries address the local impact of the arrival of migrants.\nThe OECD said \"large and sudden\" inflows of migrants are often concentrated in the most disadvantaged areas and that governments should scale up public services in those areas.\nThe organization is also suggesting that countries step up international cooperation and is urging the international community to \"significantly increase its effort in terms of resettlement\".\nMigration flows increased by 10 percent in 2015 across the OECD area, which is made up of 35 leading industrial countries from all around the world.\n___\n12:55 p.m.\nSeveral dozen refugees have staged a protest in an asylum center in Slovenia, complaining that the EU nation is slow in processing their asylum requests.\nThe refugees gathered outside the asylum center in the capital Ljubljana on Monday, holding a banner reading \"We are Human Beings.\" They are demanding a meeting with Slovenia's interior minister.\nThe refugees have also complained over what they described as bad living conditions in the center. One migrant told Slovenia's public broadcaster that \"these are not normal conditions.\"\nHundreds of thousands of refugees and migrants passed through Slovenia last year at the height of Europe's migrant crisis. Slovenia and other countries along the route closed their borders for migrants in March.\nSlovenian police say 321 refugees and migrants remain in the Alpine country.", "external_links": [], "published": "2016-09-19T03:00:00.000+03:00", "crawled": "2016-09-19T16:47:56.601+03:00", "highlightTitle": ""}