{"organizations": [], "uuid": "34dcf2da28d5b756bdf49880a56e57a6a4ee79fc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "nvs24.com", "main_image": "", "site_section": "http://nvs24.com/rss.xml", "section_title": "NVS24 News Network", "url": "http://nvs24.com/news/topstories/Trumps-25-Million-New-Jobs-Promise-Doesnt-Add-Up-8459981.html", "country": "US", "title": "Trump's 25 Million New Jobs Promise Doesn't Add Up", "performance_score": 0, "site": "nvs24.com", "participants_count": 0, "title_full": "Trump's 25 Million New Jobs Promise Doesn't Add Up", "spam_score": 0.0, "site_type": "news", "published": "2016-09-16T07:26:00.000+03:00", "replies_count": 0, "uuid": "34dcf2da28d5b756bdf49880a56e57a6a4ee79fc"}, "author": "", "url": "http://nvs24.com/news/topstories/Trumps-25-Million-New-Jobs-Promise-Doesnt-Add-Up-8459981.html", "ord_in_thread": 0, "title": "Trump's 25 Million New Jobs Promise Doesn't Add Up", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "chad stone", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "china", "sentiment": "none"}], "organizations": [{"name": "trump", "sentiment": "none"}, {"name": "gop", "sentiment": "none"}, {"name": "world trade organization", "sentiment": "none"}, {"name": "economic club", "sentiment": "none"}, {"name": "center on budget and policy priorities", "sentiment": "none"}, {"name": "trump needs", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "  Trump's 25 Million New Jobs Promise Doesn't Add Up  26 Donald Trump's promise to grow the U.S. economy fast enough to create 25 million new jobs over the next decade is bound to win support among American workers. There's only one problem with his pledge. Without a wave of new immigrants entering the American workforce, Trump will have a hard time finding enough workers to fill those jobs. In a speech Thursday to the Economic Club of New York, Trump outlined his latest proposals to revive a U.S. economy that has shown lackluster growth in the past year. In a post on his website, he promised to raise the growth of U.S. gross domestic product to 3.5 percent a year, nearly double the average pace so far this century. In his remarks, he suggested a 4 percent growth target was achievable. \"My great economists don't want me to say this, but I think we can do better than that,\" he said. With a series of tax cuts and a moratorium on federal regulations, the GOP candidate promised that a Trump economy would also expand U.S. payrolls by 25 million new jobs over the next decade, harkening back to a period when the economy grew at a more rapid pace. Related: Trump Needs to Answer 20 Questions About Business Conflicts \"Between World War II and the year 2000, the United States averaged a 3.5 percent growth rate,\" he said. \"But, after China joined the World Trade Organization, our average growth rate has been reduced to only 2 percent..\" But beyond globalization, a lot has changed closer to home since those post-War boom to slow the growth of the American economy. That includes a slowdown in the growth in of the workforce. \"In the post World War II period, we had very strong labor force growth - especially with women entering the workforce in large numbers,\" said Chad Stone, chief economist at The Center on Budget and Policy Priorities. \"Especially in the absence of immigration, those demographic trends are... Source: http://nbcnews.com   http://nbcnews.com", "external_links": [], "published": "2016-09-16T07:26:00.000+03:00", "crawled": "2016-09-16T11:37:43.744+03:00", "highlightTitle": ""}