{"organizations": [], "uuid": "d409336dda7083064634a52676f9f55a36af8915", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 3, "shares": 3, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/694940094001_5122314565001_c9b45a8a-f62d-4d0f-a97c-b6892cad0bfc.jpg", "site_section": "http://feeds.feedburner.com/foxnews/affiliates/kpth?format=xml", "section_title": "FOX News", "url": "http://www.foxnews.com/transcript/2016/09/13/crowley-schoen-on-tight-presidential-poll-numbers/", "country": "US", "domain_rank": 185, "title": "Crowley, Schoen on the tight presidential poll numbers", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "Crowley, Schoen on the tight presidential poll numbers | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2016-09-13T03:00:00.000+03:00", "replies_count": 0, "uuid": "d409336dda7083064634a52676f9f55a36af8915"}, "author": "FoxNews.com", "url": "http://www.foxnews.com/transcript/2016/09/13/crowley-schoen-on-tight-presidential-poll-numbers/", "ord_in_thread": 0, "title": "Crowley, Schoen on the tight presidential poll numbers", "locations": [], "entities": {"persons": [{"name": "schoen", "sentiment": "negative"}, {"name": "crowley", "sentiment": "negative"}, {"name": "jim crow", "sentiment": "none"}, {"name": "debbie wasserman schultz", "sentiment": "none"}, {"name": "brian fallon", "sentiment": "none"}, {"name": "charlie", "sentiment": "none"}, {"name": "h. clinton", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "bill clinton", "sentiment": "none"}, {"name": "george w. bush", "sentiment": "none"}, {"name": "newt", "sentiment": "none"}, {"name": "lifezette", "sentiment": "none"}, {"name": "larry", "sentiment": "none"}, {"name": "monica crowley", "sentiment": "none"}, {"name": "charlie rangel", "sentiment": "none"}, {"name": "gupta", "sentiment": "none"}, {"name": "clintons", "sentiment": "none"}, {"name": "ingraham", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "doug schoen", "sentiment": "none"}, {"name": "fallon", "sentiment": "none"}, {"name": "charlie hurt", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "gupta", "sentiment": "none"}, {"name": "joe biden", "sentiment": "none"}, {"name": "steve", "sentiment": "none"}, {"name": "chevy chase", "sentiment": "none"}, {"name": "tom brokaw", "sentiment": "none"}, {"name": "david samadi", "sentiment": "none"}, {"name": "chelsea clinton", "sentiment": "none"}, {"name": "matt lauer", "sentiment": "none"}, {"name": "obama", "sentiment": "none"}, {"name": "sean hannity", "sentiment": "none"}, {"name": "archie bunker", "sentiment": "none"}, {"name": "clinton", "sentiment": "none"}, {"name": "cokie roberts", "sentiment": "none"}, {"name": "monica", "sentiment": "none"}, {"name": "david cameron", "sentiment": "none"}, {"name": "b. clinton", "sentiment": "none"}, {"name": "doug schoen", "sentiment": "none"}, {"name": "hillary", "sentiment": "none"}, {"name": "brian fallon", "sentiment": "none"}, {"name": "gerald ford", "sentiment": "none"}, {"name": "barack obama", "sentiment": "none"}, {"name": "samadi", "sentiment": "none"}, {"name": "lewinsky", "sentiment": "none"}, {"name": "nixon", "sentiment": "none"}, {"name": "david samadi", "sentiment": "none"}, {"name": "steve hilton", "sentiment": "none"}, {"name": "salem", "sentiment": "none"}, {"name": "hannity", "sentiment": "none"}, {"name": "stelter", "sentiment": "none"}, {"name": "laura ingraham", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "hannity", "sentiment": "none"}, {"name": "fox", "sentiment": "none"}, {"name": "newt gingrich", "sentiment": "none"}, {"name": "newt gingrich", "sentiment": "none"}, {"name": "david", "sentiment": "none"}, {"name": "anita", "sentiment": "none"}, {"name": "steve hilton", "sentiment": "none"}, {"name": "doug", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "gingrich", "sentiment": "none"}, {"name": "samadi", "sentiment": "none"}, {"name": "mitt romney", "sentiment": "none"}, {"name": "larry elder", "sentiment": "none"}, {"name": "sean", "sentiment": "none"}, {"name": "claire mccaskill", "sentiment": "none"}, {"name": "bill", "sentiment": "none"}, {"name": "charles murray", "sentiment": "none"}, {"name": "clinton", "sentiment": "none"}, {"name": "anita gupta", "sentiment": "none"}, {"name": "muhammad morsi", "sentiment": "none"}, {"name": "bill clinton", "sentiment": "none"}, {"name": "speaker", "sentiment": "none"}, {"name": "laura ingraham", "sentiment": "none"}, {"name": "monica crowley", "sentiment": "none"}, {"name": "anita gupta", "sentiment": "none"}, {"name": "wikileaks", "sentiment": "none"}], "locations": [{"name": "united states", "sentiment": "none"}, {"name": "saudi arabia", "sentiment": "none"}, {"name": "newsbreak", "sentiment": "none"}, {"name": "north africa", "sentiment": "none"}, {"name": "missouri", "sentiment": "none"}, {"name": "syria", "sentiment": "none"}, {"name": "milwaukee", "sentiment": "none"}, {"name": "afghanistan", "sentiment": "none"}, {"name": "south", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}, {"name": "u.k.", "sentiment": "none"}, {"name": "iraq", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "new hampshire", "sentiment": "none"}, {"name": "detroit", "sentiment": "none"}, {"name": "uae", "sentiment": "none"}, {"name": "kennesaw state", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "hannity", "sentiment": "none"}, {"name": "nevada", "sentiment": "none"}, {"name": "ohio", "sentiment": "none"}, {"name": "west virginia", "sentiment": "none"}, {"name": "new orleans", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "virginia", "sentiment": "none"}, {"name": "libya", "sentiment": "none"}, {"name": "crowdpac", "sentiment": "none"}, {"name": "benghazi", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "manhattan", "sentiment": "none"}, {"name": "arizona", "sentiment": "none"}, {"name": "north carolina", "sentiment": "none"}, {"name": "g.w.", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "georgia", "sentiment": "none"}], "organizations": [{"name": "fox news", "sentiment": "none"}, {"name": "fox news", "sentiment": "none"}, {"name": "fox news", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "hilton", "sentiment": "none"}, {"name": "ford", "sentiment": "none"}, {"name": "washington times", "sentiment": "none"}, {"name": "inc", "sentiment": "none"}, {"name": "barney frank", "sentiment": "none"}, {"name": "cnn", "sentiment": "none"}, {"name": "house ways and means committee", "sentiment": "none"}, {"name": "new york times", "sentiment": "none"}, {"name": "llc", "sentiment": "none"}, {"name": "nbc news", "sentiment": "none"}, {"name": "fbi", "sentiment": "none"}, {"name": "senate", "sentiment": "none"}, {"name": "new york post", "sentiment": "none"}, {"name": "dnc", "sentiment": "none"}, {"name": "fox news network", "sentiment": "none"}, {"name": "house", "sentiment": "none"}, {"name": "washington post", "sentiment": "none"}, {"name": "u.s. senate", "sentiment": "none"}, {"name": "marist", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "  FoxNews.com   livefyre Email Print \nThis is a rush transcript from \"Hannity,\" September 12, 2016. This copy may not be in its final form and may be updated. \nSEAN HANNITY, HOST: And welcome to \"Hannity.\" And tonight, growing concerns over Hillary Clinton's health. Now, video from yesterday at the 9/11 memorial shows the candidate collapsing and having to be helped into a van after leaving the event abruptly. Now, several hours later, Clinton's doctor released a statement revealing that she was, quote, \"overheated and dehydrated\" after being diagnosed with pneumonia on Friday.\nNow, Clinton's campaign, which is under fire for not disclosing her diagnosis immediately after the incident, says it will be releasing additional medical records in the days to come. The campaign also canceled her planned events for today and tomorrow so that the Democratic nominee can stay home and rest.\nAs for Donald Trump, he says he hopes Hillary Clinton gets well soon and announced that he will be also releasing results from a recent physical later this week.\nHere now with reaction, former speaker of the House, FOX News contributor Newt Gingrich. Look, nobody wishes anybody ill will here, but there are real questions that have emerged. (AUDIO GAP) the FBI releasing notes as it relates to their investigation into the e-mail server. She cited a concussion for not being able to remember what she was briefed on in terms of security as secretary of state. And security briefings tell her what to do. So she used that as an excuse.\nWe have these other incidents. I'm going to just run some of the video, her falling, her twitching, her coughing. I mean, it all comes together.  They waited hours to tell us the pneumonia excuse. What do you think is going on here?\nNEWT GINGRICH, R-FMR. HOUSE SPEAKER, FOX CONTRIBUTOR: Well, it's a little hard to know. I thought it was a great irony this morning that The Washington Post, which, of course, has been ridiculing concerns by a number of people about her health suddenly said this morning, OK, now the concerns are real and she's going to have to deal with them.\nI think the great concern from her perspective is that this is not like running for the U.S. Senate or even running for governor. The president of the United States is commander-in-chief in a very, very dangerous world.  And she, of course, knew that, which is why she ran the famous 3:00 o'clock in the morning phone call when she was campaigning against Barack Obama back in 2008.\nI think that the effect of yesterday is going to raise a lot of questions, Democrats, Republicans, independents saying, Wait a second. If you want us to think you can be commander-in-chief, but you can't remember your security briefing and you can't go to the 9/11 event without collapsing, what is it you have to do to convince us that you are capable of being commander-in-chief?\nAnd I think she now has to really think deeply about that. I don't think just getting a doctor's report is going to count because the doctors, frankly, have not been very forthcoming and haven't been very open to the press asking questions.\nHANNITY: Well, but this is her whole thing. And then, you know, the whole idea that they didn't take her to a hospital, the whole idea that she's being propped up, the whole idea that she fully collapsed? If you had pneumonia, then it raises questions, when did you begin your -- your IV -- your antibiotic treatment because she's seen in pictures with children.  Pneumonia's contagious. We'll talk to our experts in a minute. You know, Tom Brokaw is even suggesting she see a neurologist, Cokie Roberts saying some Democrats are nervously whispering about a possible replacement for her.\nI just don't know. I mean, in light of her lying about everything, I just don't know if we can trust her.\nGINGRICH: Look, no, no, you know, you know you can't trust her, which is part of what makes this unusually difficult. Now, I remember way back in 1976, when Gerald Ford was president, having succeeded Nixon. And Ford had actually been a national class athlete when he was younger. But he stumbled a couple of times, and Chevy Chase made his career on \"Saturday Night Live\" pretending to be Gerald Ford and falling all over the place.\nPart of the risk that Hillary now runs is when the comedians of \"Saturday Night Live\" decides to start going after her on the grounds that she can't remember this, she can't remember that, she can't show up for this, she can't show up for that. All of a sudden, that begins the definition -- remember, she ran originally as the very experienced, very knowledgeable insider against this amateur Donald Trump. Now she's lost the national security debate decisively, in the opinion of most people, to Donald Trump, and that should have been her strength.\nHANNITY: Yes.\nGINGRICH: And now we have, of course, this vivid example that for any normal, reasonable person at least raises legitimate concerns.\nHANNITY: All right, let's go to her other comment of the weekend.  Apparently, we're a member of a club. We didn't know that until this weekend. But her comments about the basket of deplorables, of which we belong to, at least I do -- I won't put you in the club unless you want to be in. But this is what she said.\n(BEGIN VIDEO CLIP)\nHILLARY CLINTON, D-PRESIDENTIAL NOMINEE: You know, to just be grossly generalistic, you could put half of Trump's supporters into what I call the basket of deplorables.\n(LAUGHTER)\nH. CLINTON: Right? The racists, sexists, homophobic, xenophobic, Islamophobic, you name it.\n(END VIDEO CLIP)\nHANNITY: \"The basket of deplorables.\" You know, is this the same woman that took money she's going to talk about misogyny and racist and sexist and homophobes and she takes money from Saudi Arabia, where they kill gays and lesbians, she takes money from all these other Saudi -- sharia countries which treat women horribly, and she's going to say that?\nGINGRICH: Look, I think, to be academic for half a second, what I was really struck with was the audience reaction.\nHANNITY: Laughing.\nGINGRICH: This is a perfect example of what -- it's a perfect example of what Charles Murray wrote about in a remarkable book called \"Coming Apart,\" where he describes the emergency of a liberal elite so out of touch with normal life that they have absolute contempt for about 90 percent of the American people.\nAnd that's what you were seeing that night. Those people love the idea of their moral superiority to these normal people. You know, and in a very real sense, Archie Bunker went from being a figure in a very famous situation comedy to now being somebody that these people can hold in contempt and can despise.\nAnd that's what she was playing against. She was creating a new class warfare of the elite intellectuals against the rest of us, and they were playing into it because they love thinking that they're morally superior, they're intellectually superior. They're certainly economically superior.  And so who are the rest of us to think that we have a right to try to govern America?\nHANNITY: But this is -- but this is the standard...\nGINGRICH: In that sense, it was a very...\nHANNITY: Yes. Go ahead. Finish.\nGINGRICH: Well, I was going to say I think that's what make this such a stunningly powerful moment in American history because you have the combination of this whole litany of hostility with the propensity to lie.  And it's the two together that I think begin to teach us just how sick modern liberalism has become and how out of touch with reality it is.\nHANNITY: All right, she can't run, as she says, to continue Obama's economic record. She can't run on Libya. She can't run on North Africa.  She can't run on supporting Muhammad Morsi or the Iranian deal or Syria or Iraq or Afghanistan or the Russian reset.\nSo every election -- and I've proven this many times on this program -- this is their old playbook. Republicans are racist. They're sexist.  They're homophobic. They're xenophobic, if you believe in the rule of law, which, by the way, she once supported building a wall -- or Islamophobic now is -- you know, she can't say \"radical Islam.\" Anyone that can, I guess, is an Islamophobic, is suffering from Islamophobia of some kind.\nThis is their old playbook. Will it work this time? It has worked in the past. Obama said bitter people clinging to their guns and religion and bibles with an antipathy towards those that are not like us or like them.  It's the same comment to me, \"basket of deplorables,\" isn't it?\nGINGRICH: Look, well, I think if Trump sticks to his guns and continues to methodically reach out, as he did in that Detroit church, as he did in Milwaukee, if he continues to criss-cross the country telling the American people the truth and then offering positive solutions, I think that he has a very real chance to break through.\nI just did an event today at Kennesaw State in Georgia. I had a surprising number of young African-Americans there who were asking serious questions about what did the Detroit speech mean and how would he really change things and what would he really do, a level of interest among African- Americans I have never seen in a Republican candidate for president before.\nSo I think he's right at the edge of touching some nerves that could be really a profound revolution in American politics.\nHANNITY: You know, I keep saying that the biggest campaign contributor for Hillary this election season is the media. It was 77 degrees, cool and breezy, a nice day yesterday morning by any definition. It was not hot.  It was not sweltering, not the type of heat that athletes play in, for example. And this is how the media defends her collapse. Listen to this.\n(BEGIN VIDEO CLIP)\nUNIDENTIFIED FEMALE: Secretary Clinton left rather unceremoniously, having become overheated. We should say the weather has been horrific, very not, extremely humid temperatures. She was adorned in a long-sleeved coat, a pants suit.\nUNIDENTIFIED FEMALE: Let's put into context, as well, the weather today, which speaking from my experience walking into work today and not even wearing as much attire as I am now -- I mean, shorts and a T-shirt, and it was pretty miserable.\nUNIDENTIFIED FEMALE: It was sweltering there this morning. So not overly surprising that someone would become overheated.\n(END VIDEO CLIP)\nHANNITY: Mr. Speaker, 77, a cool breeze. It was not sweltering by any definition! It was a cool day. But this is how they spin for her.\nGINGRICH: No. See, now you're starting to sound like Matt Lauer.\n(LAUGHTER)\nGINGRICH: You are just another of those guys...\nHANNITY: I know!\nGINGRICH: ... who is prejudiced against Hillary. And you know, I mean, it had to have been sweltering. If it wasn't sweltering, her collapse would look even worse. And I'll bet it was actually about 120 and about 98 percent humidity. I mean, it had to be that bad because, otherwise a heroic figure like Secretary Clinton would never have collapsed.\nHANNITY: Yes.\nGINGRICH: So if you're a left-wing reporter, you have to invent a scenario. This is why we get to such dishonesty. You have to invent a scenario -- remember Benghazi? Well, there had to have been an American- made movie or it would have been, you know, terrorists. And so again and again, every time you turn around, there's some other explanation.\nHANNITY: Let me ask you this because I want to go back to -- I'm bouncing back and forth. Follow the bouncing host ball here, if you can for a moment.\nGINGRICH: I know.\nHANNITY: I know...\nGINGRICH: I'm afraid you're going to start singing next.\nHANNITY: What's that? No. So...\nGINGRICH: I'm afraid you're going to start singing.\nHANNITY: Last week, Chelsea Clinton suggests, Oh, Donald Trump's sexist.  He's misogynist. Bill Clinton last week said that making America great again is -- well, we know what that means in the South. We know when he's saying make America great again. Then we got a tape of Bill Clinton saying this. Watch.\n(BEGIN VIDEO CLIP)\nBILL CLINTON, FORMER PRESIDENT: I believe that together, we can make America great again.\nI want to attack these problems and make America great again.\nUNIDENTIFIED MALE: Paid for by Clinton for president.\nB. CLINTON: And now you are being called upon, every one of you, to secure a better future for your children and your grandchildren and to make America great again economically, educationally and socially.\nIt's time for another comeback, time to make America great again. I know Hillary is the one who can do it.\nUNIDENTIFIED MALE: Paid for by Hillary Clinton for President.\nH. CLINTON: I'm Hillary Clinton, candidate for president, and I approved this message.\n(END VIDEO CLIP)\nHANNITY: So he says, \"Make America great again\" is, if you're a white Southerner, you support -- you know exactly what that means, that we'll give you an economy that you had 50 years ago. Do you see timing relative to these attacks?\nGINGRICH: Look, first of all, they -- I want to make two points. One, they're desperate! The whole thing's falling apart. They spent over $100 million in ads. They can't make a dent. They're discovering what the other 16 Republicans discovered running against Trump. The country is tuned into bigger issues, bigger themes, bigger truths.\nAnd they're beginning to fall apart, I mean, almost to a point where just last week, I really thought Hillary was right at the edge of just really flipping out because she's so rattled by what's going on.\nBut there's a second part, which I'm surprised at, Sean. You told me earlier today you've been radio for 30 years.\nHANNITY: I'm in my 30th year.\nGINGRICH: So you've been at this a long time. Right. You've been at this a long time. If Donald Trump says, Make America great again, you know it's a racist term. And if Bill Clinton says, Make America great again, you know it's an idealistic term. I don't understand why you're confused!\nHANNITY: You know...\nGINGRICH: Because Bill Clinton, of course...\nHANNITY: You would think in 30 years...\n(CROSSTALK)\nHANNITY: I'm about the start my 21st year here at Fox. You'd think I would have learned a thing or two. But obviously, I'm so dumb...\nGINGRICH: You know...\nHANNITY: You know, I -- I'm dumb.\nGINGRICH: I really -- I am just -- I am just shocked because I believe it's very obvious. When a liberal says something...\nHANNITY: Yes.\nGINGRICH: ... because they're pure of heart, it must be true.\nHANNITY: Yes.\nGINGRICH: When a conservative says something...\nHANNITY: It's got to be...\nGINGRICH: ... it must be false. Now, surely, you could get this pattern down right. And you don't even have to read The New York Times once you learn this.\nHANNITY: All right, Mr. Speaker...\nGINGRICH: I mean, it'll just be obvious to you every morning.\nHANNITY: Thank you so much for being with us.\nAnd up next tonight here on \"Hannity\"...\n(BEGIN VIDEO CLIP)\nBRIAN FALLON, CLINTON CAMPAIGN SPOKESMAN: I think that as she was getting to the vehicle, she got a bit dizzy and she was helped into the vehicle.  But immediately upon being seated there, she was talking to staff, and like I said, making calls.\n(END VIDEO CLIP)\nHANNITY: Making calls? She didn't even need to go to a hospital. She didn't want to wait 16 hours, like the rest of us do because of \"Obama care.\" Hillary Clinton's press secretary revealing some details about her health scare, but I don't think he's telling the truth, downplaying the incident. How concerned should you, the voters, be? We'll check in with our medical A-team\nAnd later, Laura Ingraham is here to tell us how Clinton's health could impact this race. That and more tonight on this busy news night here on \"Hannity.\"\n(COMMERCIAL BREAK)\n(NEWSBREAK)\nHANNITY: Welcome back to \"Hannity.\" The Hillary Clinton spin machine is running full speed after the Democratic presidential candidate suffered a, quote, \"medical episode\" yesterday. Now, Clinton's press secretary, Brian Fallon, tried to downplay the incident earlier today. Take a look.\n(BEGIN VIDEO CLIP)\nFALLON: From those that were there, I believe what it was, was she was feeling hot, which a lot of the other attendees described also feeling. She left on her own accord. I think that as she was getting to the vehicle, she got a bit dizzy and she was helped into the vehicle. But immediately upon being seated there, she was talking to staff, and like I said, making calls. And she was up running around in her daughter's apartment, chasing her grandkids around.\n(END VIDEO CLIP)\nHANNITY: I just don't believe a thing these people say. You can't trust them.\nAll right, joining us now with reaction from the Fox News medical A-team, Dr. David Samadi and anesthesiologist, pain management doctor Anita Gupta is with us. Anita, good to see you. Dr. Samadi, good to see you.\nDR. ANITA GUPTA, ANESTHESIOLOGIST: Thank you.\nDR. DAVID SAMADI, FOX NEWS CONTRIBUTOR: Thank you.\nHANNITY: All right, let me -- let me roll this video in slow motion here because this is a collapse! All right, you can see she's walking -- you know, she's being held up right here, right? Look, she's being held up.  She buckles. Now the guy comes in, helps, now we got two people holding her up. Now she's making one step, two steps -- boom! That's a collapse, isn't that? Is that a fair description?\nSAMADI: Yes, she obviously was very weak and she was -- you know...\nHANNITY: If nobody was there, she's on her face!\nSAMADI: Right. That's true. So the question is, they diagnosed her, based on what the doctor's mentioned, with pneumonia on Friday. How many days before that she actually had the symptoms...\nHANNITY: I don't even know if I believe that! Why did they wait for hours, saying, Oh, she just had this little, you know, spell. She needs to be hydrated. Why did they tell that -- why didn't they say it right away?\nSAMADI: You know, that's something that we have to ask the campaign and the doctors. But the bottom line is over the weekend, if she had the pneumonia, dehydration, she may have had fever, so she's losing a lot of fluid just without knowing...\nHANNITY: Is it contagious? Because she was up in people's grill, you know, a little girl, she was -- you know?\nSAMADI: Depends on what kind of pneumonia. If it's a bacterial pneumonia, she probably has a chance of getting -- by the way...\nHANNITY: My wife had bacterial pneumonia and nearly died! Probably, according to her doctor, was within 24 hours of death!\nSAMADI: Sean, it is a serious medical issue and it has to be dealt -- and I'm sure her team are taking good care of her. She needs to have IV fluid.  She needs to get...\n(CROSSTALK)\nHANNITY: When do you go to an apartment after you collapse? Don't you go to a doctor? Don't you go to a hospital when you -- if I collapsed, what would you tell me?\nSAMADI: Yes, I think...\nHANNITY: You'd tell me to go to the hospital.\nSAMADI: I would absolutely take you to the hospital...\nHANNITY: Take me to the hospital, I have to wait 16 hours because of \"Obama care\"!\nSAMADI: Well, I don't know what insurance...\n(LAUGHTER)\nHANNITY: So maybe I wouldn't go.\n(CROSSTALK)\nHANNITY: I would be as stubborn as she -- all right now, if I can, Dr. Gupta, we know she says to the FBI she had a concussion and couldn't remember ever being briefed on security issues related to and protocol related to her e-mail server. She said that. We know that she had a fall which led to the concussion. We know she has coughing fit after coughing fit. We know she's on coumadin. I'm just trying to stick to the facts here. And then she has this collapse, Oh, we won't tell you the truth, but after the media keeps asking, Oh, she was diagnosed with pneumonia on Friday. What are your thoughts on this?\nGUPTA: I can't agree with you, even -- you know -- you know, more than what you're saying. There was a spectrum of symptoms that we see. There's concussion. There's coughing spells and now a diagnosis of pneumonia. So there's many different things going on that could indicate a much bigger serious medical problem. So if I were her doctor or if I were on her team of doctors, I would want to do routine tests...\nHANNITY: She collapsed...\nGUPTA: ... to make sure she's OK.\nHANNITY: If anybody you knew and loved collapsed like that, would you let them go to their daughter's house and -- or would you send them to the hospital?\nGUPTA: Well, this has so little do with who it is. If it's your family member, a mother, friend, anyone that has a near collapse like she did yesterday, you would want to take them to the hospital. And what was alarming...\nHANNITY: Immediately. Immediately.\nGUPTA: Yes.\nHANNITY: So what they did was wrong?\n(CROSSTALK)\nSAMADI: I think that we know -- we know that she was taking some antihistamine that can sedate her. Her blood pressure probably has been low from dehydration, traveling all of the time. She's on multiple medications.\nHANNITY: (INAUDIBLE) she had deep vein thrombosis. She had a blood clot.  She had -- she's using coumadin, coughing, the fall, the concussion. Now this collapse.\nSAMADI: Well, the question is...\nHANNITY: If she has medical problems -- of you're looking at the outside, all of this together, is this a problem?\nSAMADI: Well, yes. The question is whether she has some sort of bronchitis that eventually caused this kind of pneumonia or was really pneumonia that caused all of those coughing spells.\nHANNITY: All right...\nSAMADI: And they didn't treat it quickly. Either way, you know, her team need to get a good pulmonary consult, make sure her lungs are clear...\nHANNITY: You think they're lying to us?\nSAMADI: ... get a chest -- look, as a doctor, I can only go with what the facts are. We need to...\nHANNITY: She should have been in the hospital yesterday.\nSAMADI: Yes, I think it would be safer for someone who has a pneumonia and is weak to get an IV, be in a setting, a monitored set-up...\nHANNITY: She collapsed!\nSAMADI: Yes. So we have to look at her records...\nHANNITY: If you collapsed, I'd take you to the hospital.\nSAMADI: You're very kind.\nHANNITY: And I'd use your name to get in the door faster.\n(LAUGHTER)\nHANNITY: All right, I got to run.\n(CROSSTALK)\nSAMADI: Thank you, Sean.\nHANNITY: When we come back, Laura Ingraham will be here to react to Hillary's health, and of course, all the other controversies of the week.\nThen later tonight...\n(BEGIN VIDEO CLIP)\nDONALD TRUMP, R-PRESIDENTIAL NOMINEE: These were among the countless Americans that Hillary Clinton called deplorable, irredeemable and un- American.\n(END VIDEO CLIP)\nHANNITY: I guess that's me. Trump hitting back after Clinton calls his supporters the \"basket of deplorables.\"\nThat and more as we continue straight ahead.\n(COMMERCIAL BREAK)\nHANNITY: And welcome back to \"Hannity.\" Joining us now with reaction to Hillary Clinton's health scare and, of course, her \"basket of deplorables,\" editor-in-chief of Lifezette, Fox News contributor, national syndicated radio host Laura Ingraham. How are you?\nLAURA INGRAHAM, FOX NEWS CONTRIBUTOR: Sean, was it a wicker basket we were in, or is it one of those...\nHANNITY: Well, by the way, it's not just that.\nINGRAHAM: Is it a cloth basket?\nHANNITY: We're irredeemable, racist, sexist, homophobic, xenophobic, Islamophobic...\nINGRAHAM: Blah, blah, blah.\nHANNITY: ... and irredeemable! But Bill's redeemable. He's -- he's...\nINGRAHAM: Well, I -- I can be agoraphobic and claustrophobic and whatever that thing is when you're afraid of heights. So she needs to throw in a few more phobics. Then we'll be all set.\nHANNITY: Well, it's, you know, but -- as I was discussing with Newt, you know, this is -- this is their standard playbook. This is every election.  This is Bill Clinton last week saying, Well, we all know in the South 50 years ago, we want to go back 50 years -- meanwhile, he said \"Make America great.\"\nChelsea Clinton saying Donald Trump, sexist, misogynist -- she's taken money from the Saudis, the UAE, the Kuwaitis, all these countries that practice sharia, which are guilty of all of these things, and she doesn't criticizes them!\nINGRAHAM: No, no...\nHANNITY: Maybe if I just gave her money, she wouldn't call us that.\nINGRAHAM: Yes, no, we -- we -- that's -- we have to have a blanket and complete protection. It's like the mob gives you protection. You have to pay off, you know, the mob, and then they won't smash your windows and rob your stores. You have to pay them off, and then you don't get maligned by the Clintons. It works well that way.\nBut Sean, the big question there -- here is how is the -- are the press so uncurious about all of this? I mean, this has been a story that they've wanted to either cover up or they've wanted to malign those who raise the issue of her health now for, I mean, more than a few weeks. This has been going on and on. And finally...\nHANNITY: Hey, by the way, I've been called a conspiracy theorist more time on CNN...\nINGRAHAM: Oh, yes. They love that. You're going to get your apology...\n(CROSSTALK)\nHANNITY: I want my apology. You know, where that's pipsqueak Stelter? I want it.\nINGRAHAM: Oh, yes, yes. No, there -- they're also Sean, now blaming misogyny for the questions about Hillary's health problems.\nHANNITY: Oh!\nINGRAHAM: I kid you not. CNN's media guy was saying that, then another professor on Mess-NBC (sic) was saying that today. This is -- it's the damsel in distress. We're all how supposed to feel sympathy for Hillary...\nHANNITY: Did you see what I just played?\nINGRAHAM: ... so we all can't be mean to her.\nHANNITY: I just played, you know, a montage of media saying, Oh, it was so miserably hot. It was 77 degrees...\nINGRAHAM: Sean...\nHANNITY: ... and a slight breeze!\nINGRAHAM: ... I was in Manhattan -- I was -- I was in Manhattan yesterday for 9/11, and it was beautiful. I mean, it was -- it was mild. It's -- it broke. The weather broke yesterday, so I mean...\nHANNITY: It was great yesterday!\nINGRAHAM: It was great! And in downtown, it was great. Maybe -- I don't know, it was maybe 74 degrees. I was there (INAUDIBLE), Oh, sweltering hot. I think, Wait a second, it wasn't sweltering hot at all. What's he talking about?\nHANNITY: All right, where is this all going to go? I don't trust her. We now she's -- she's kind of congenital, pathological liar. I think people get that. I think she's dishonest and corrupt. I think she sold out her office. She can't run on any policy, foreign policy or economic policy.\nSo this is where they stand. They continue to lie about other issues, as well. Where does this end up in 57 days, Laura Ingraham?\nINGRAHAM: Well, I think right now, you looked at a couple of the major betting houses in London, and they're moving money over to Trump's side, which is interesting. It's about a 5-to-4 odds right now in two of the major betting houses, which is not insignificant. That's where people are putting their money who actually could lose money if Hillary wins or Trump wins. So I thought that was significant.\nBut also going to the issue of credibility, Sean. She has an allergy to transparency. And as you've pointed out, and you've done such a great job on this, and you've been vilified for having done so, whether it's Benghazi, whether it's going back to Lewinsky, whether it's the Rose Law Firm billing records, whether it's the health issue, the first reaction is to deny, then it's to demonize the questioner, the critic, and then it's to deflect. That's what she has done and that's what she will always do. I don't care how many health reports she puts out. On the major issues of controversy or inconvenient facts, she will also deny until there's physical evidence to the contrary.\nHANNITY: If anybody collapsed in front of me, including Hillary, I would take her to the hospital.\nINGRAHAM: Yes.\nHANNITY: And I think the fact that they waited, oh, she's fine. Then they hit the fact that she had pneumonia. I don't even know if I can believe that she has pneumonia at this point. No details about her health.  There's something going on that's not right here.\nINGRAHAM: Look at that little girl, Sean. Have you tracked down that little girl? Has anyone checked her for pneumonia? All of people she has come into contact with even at the 9/11 ceremony. She was in close proximity to a lot of people. We don't have any information about this pneumonia. How many people has she infected?\nHANNITY: I think they avoided the ER to avoid disclosure of her real medical condition.\nINGRAHAM: Absolutely, scrutiny.\nHANNITY: I have talked to a lot of doctors and a lot of them are saying they know what this is and it's not what she's saying.\nINGRAHAM: I have heard a lot from friends here at G.W. and other hospitals. I've heard the word \"seizure.\" I'm not a medical doctor. I have no idea. But people who do know think the pattern --\nHANNITY: Remember WikiLeaks had the report that they were looking up, at least her staff was looking up Parkinson's medicines.\nINGRAHAM: I hope she doesn't have that.\nHANNITY: Thank you.\nComing up next tonight on \"Hannity.\"\n(BEGIN VIDEO CLIP)\nTRUMP: Hillary Clinton spoke with hatred and derision for the people who make this country run.\n(END VIDEO CLIP)\nHANNITY: Donald Trump going after Hillary Clinton for her calling his supporters a \"basket of deplorables.\" That's coming up next.\nAlso brand-new poll numbers show a very close race in four swing states.  Monica Crowley, Doug Schoen, they're here with reaction and more tonight on \"Hannity.\"\n(COMMERCIAL BREAK)\nTRUMP: I was just deeply shocked and alarmed this Friday to hear my opponent attack, slander, smear, demean these wonderful, amazing people who are supporting our campaign. We have the support of cops and soldiers, carpenters and welders, the young and the old, and millions of working class families who just want a better future.\n(END VIDEO CLIP)\nHANNITY: Donald Trump earlier today responding to Hillary Clinton calling half of his supporters the \"basket of deplorables.\" And that's not all. In response to Clinton's comment, the Trump campaign also released this brand- new political ad. Take a look.\n(BEGIN VIDEO CLIP)\nUNIDENTIFIED FEMALE: Speaking to wealthy donors, Hillary Clinton calls tens of millions of Americans deplorable.\nCLINTON: You could put half of Trump's supporters into what I call a basket of deplorables. The racist, sexist, homophobic, xenophobic, Islamophobic, you name it.\nUNIDENTIFIED FEMALE: People like you, you, and you, deplorable. You know what's deplorable? Hillary Clinton viciously demonizing hardworking people like you.\n(END VIDEO CLIP)\nHANNITY: Here with reaction, Salem nationally syndicated radio host Larry Elder, Washington Times columnist Charlie Hurt, and former senior adviser to the U.K. prime minister David Cameron and CEO of Crowdpac, a political crowd funding and data site Steve Hilton is with us.\nLarry Elder, welcome to the club. I guess I'm part of the deplorable club.\n(LAUGHTER)\nHANNITY: Whatever happened to liberal tolerance, liberal acceptance? We have to accept people for who they are. Let's not be so judgmental.  Sounds judgmental, pretty harsh, even saying irredeemable and un-American.\nLARRY ELDER, SALEM NATIONAL SYNDICATED RADIO HOST: Standard operating procedure for Democrats. Remember when Claire McCaskill ran for Senate in Missouri, she said that George W. Bush let people die on roof tops in New Orleans because they were poor and black. Well before Donald Trump came on the scene, Debbie Wasserman Schultz, the chair of the DNC, said they want to drag us back to Jim Crow. Barney Frank said that George W. Bush responded sluggishly to Hurricane Katrina because he wanted ethnic cleansing by inaction. Charlie Rangel, used to be the head of the House Ways and Means Committee, said they don't say \"n-word\" anymore, or \"f-word\" anymore. They just say let's cut taxes, all this well before Donald Trump came on the scene. Water is wet, grass is green, the sky is blue, Republicans are racist. That's what they do. They can't run on the record. They can't run on Obama's economy because this is the worst economic recover since the Second World War. They have to attack, attack, attack and call the opponent racist. That's what Democrats do.\nHANNITY: Yes. You know what, Charlie, I can't argue with a thing they do.  That's what they do and it often works. Will it work here?\nCHARLES HURT, POLITICAL COLUMNIST, WASHINGTON TIMES: I'm afraid that it will certainly work within the confines of her base in terms of getting them out. I don't think it works. I think it hurts her in the broader scope, you know, in terms of independents.\nHANNITY: Obama got away with those bitter clingers of Bibles, guns and religion who have an antipathy towards those who are not like him.\nHURT: Absolutely, but it did hurt him. It hurt him in the primary in West Virginia.\nHANNITY: Not enough.\nHURT: Exactly, not enough. But here's the thing that's really interesting about this. People say that a gaffe in Washington is when a politician accidentally tells the truth about what they think about. This is not a gaffe.\nHANNITY: She believes it. She doubled down on it.\nHURT: But more than that, I think she wanted this to be recorded. She wanted to be on the record saying this because it's a dog whistle signal to her base that, yes, either you are supporting me or you're supporting a racist.\nHANNITY: See, I agree with you. Let me go back to Larry and then we'll go to David -- Steve in a minute here, because what -- I think Charlie is on to something here. It is a dog whistle, and this goes to the Republicans are racist, sexist, homophobic, Islamophobic, xenophobic, I can't even remember all of the phobias we're suffering from.\n(LAUGHTER)\nHURT: She even ran out of gos going through all the phobics.\nHANNITY: I had no idea I had all these mental conditions. Apparently I'm a normal American, and by her definition she wants to slander, smear, besmirch. And meanwhile she's taking money from the Saudis that are anti- gay, that kill gays and lesbians, that abuse women, abuse Christians and Jews. There's a serious side of this, Larry.\nELDER: There's a bit of hypocrisy there. But let's remember what they did to Mitt Romney in 2012. Joe Biden gives a speech before a black audience, predominately black audience and talks about Mitt Romney's opposition to further regulating Wall Street. \"They want to unchain Wall Street. They want to put y'all back in chains.\" Really? Hillary goes to a black church and says the house had been run like a plantation, and you know what I'm talking about. Really, talk about condescending, talk about offensive, talk about playing the race card. That's what they do.\nBut I agree with Charlie. They do it because they believe it. They believe in you have a different view about abortion, about immigration, about gun control, about religious freedom, you're not just wrong. There's something is fundamentally wrong with you.\nHANNITY: Steve?\nSTEVE HILTON, CEO, CROWDPAC: Hi, Sean, good to be with you.\nHANNITY: Nice to be with you.\n(LAUGHTER)\nHILTON: When I see this at that glitzy fundraiser, you're right, Charlie.  What you're seeing here is the authentic voice of our arrogant ruling elite. And the really disgusting thing for me is that for years it's been their ideas and their policies that have undermined the economic security and the social stability of working people. But instead of apologizing for their failures, they go around insulting the victims of their failures.  And it reminds me exactly of what we saw a few months ago in the Brexit vote where you had the same arrogance of the ruling establishment toward people who have suffered as a result of their policies.\nHANNITY: You see the similarities here. In other words would you expect the same outcome in the end?\nHILTON: I think that one thing that's really similar is the way that the elite feels completely unthreatened. They're so complacent. They can't quite believe that people would really support something like Brexit. In the same way I think you see them saying, how could they possibly vote for someone like Donald Trump? And I think they'll get the same kind of shock.  Now, it's much too early to predict the exact outcome, but I think that complacency on the part of the elite is exactly the same.\nHANNITY: Yes. All right, guys, good to see you. I wish we had more time.  We're running out.\nAnd coming up, highlights of Donald Trump's rally from earlier tonight.  Plus brand-new polls out of four key swing states. The race is tightening.  We'll explain why Hillary should be very worried tonight. Monica Crowley, Doug Schoen, they're next.\n(COMMERCIAL BREAK)\nHANNITY: Welcome back to \"Hannity.\" So Donald Trump he continues to hit the campaign trail hard. Earlier tonight the candidate held a rally in North Carolina. Let's take a look.\n(BEGIN VIDEO CLIP)\nTRUMP: Wow. Thank you very much, everybody. I love North Carolina.  We're going to have a big victory in North Carolina. In 56 days we are going to win this state and we're going to win back the White House.  Believe me.\n(APPLAUSE)\nTRUMP: Our vision of hope stands in stark contrast to my opponent's campaign of hate. Hillary Clinton has been running a hate-filled and negative campaign with no policy, no solutions, and no new ideas.\n(BOOS)\nTRUMP: By contrast, I've been going around the country offering very detailed plans for reform and change. All of these reform plans are available on our website, and they're extensive. But we have no choice.  We have no choice. While my opponent slanders you as deplorable and irredeemable, I call you hardworking American patriots who love your country and want a better future for all of our people.\n(END VIDEO CLIP)\nHANNITY: Also tonight, new polls show the race is tightening. In a brand new NBC News/\"Wall Street Journal\"/Marist poll that includes third-party candidates, Trump is now leading Clinton 40 to 38 in Arizona, he's up in Georgia, leading Clinton by two points 44 to 42. In Nevada, it's Trump, 42 percent, Clinton, 41 percent. And the race too close to call in New Hampshire. Clinton has a two-point lead there.\nHere with reaction, Fox News contributor Monica Crowley, Doug Schoen. It seems like he's up in Florida. He was up in the latest Ohio poll. He has one poll up and one down in North Carolina. Virginia tightened quite a bit. I mean, honestly this is as about as close poll-wise as I've seen in a long time.\nMONICA CROWLEY, FOX NEWS CONTRIBUTOR: Yes. I think you're seeing an actual tightening of the polls which a lot of people expected anyway. But one of the big reasons, well, there are two reasons why. One, Donald Trump now is a lot more focused and disciplined. He is staying on message. His tone is pitch perfect, especially when he is talking about Mrs. Clinton.  It's more of a tone of sorrow rather than anger.\nHANNITY: By the way, anyone expected Trump would probably say something about the health, and he said I wish you well on \"Fox & Friends\" this morning.\nCROWLEY: It was pitch perfect.\nThe other problem now is that Mrs. Clinton has two challenges in front of her. One, she's got a health issue which she has resisted addressing. She might release some of her records, maybe not. But that sort of undermines her argument that she is ready for this job on day one. So she's got to address that.\nHANNITY: It looks horrible when a presidential candidate collapses like that. I wish her well, but it does look horrible.\nCROWLEY: But wait. Just one final point. The campaign lied about her condition. They didn't tell us she had pneumonia if that's in fact what's going on here or if there's something more serious.\nHANNITY: New York Post says that they did it on purpose because they don't want her real condition getting out.\nCROWLEY: And we know the most problematic scandals for any presidential candidates are the ones that reinforce a preexisting negative notion, that she is a liar and dishonest. She has to address both of those things.\nHANNITY: And by the way, Doug, this is your worst nightmare. Donald Trump didn't go there.\nDOUG SCHOEN, FOX NEWS CONTRIBUTOR: Look, Sean, the race is a dead heat.  She has a slight advantage, but it's within the margin of error. But here is what I would do. I would keep her off the campaign trail two weeks.  Get her healthy. She has a good debate. Do you know what? People will forget this. But Monica raises real questions about what happened and her underlying health that are not helpful and probably potentially harmful.\nHANNITY: You know what, I think it's much deeper than what they're telling us. And I suspect that based on the history of lying about everything else.\nSCHOEN: We don't know, Sean. And I don't think we're going to know. But what we do know is that there is a debate. And if she can win the debate she'll be back on even keel. Right now the momentum is with Donald Trump.\nCROWLEY: Here is the problem. Speculation is running wild. Some people are speculating she may have Parkinson's disease. Other people are speculating --\nHANNITY: That is because of the WikiLeaks discovery about the medical, the drugs, the pharmaceuticals.\nCROWLEY: There was a search on Alzheimer's and Parkinson's disease, other grave illnesses. People are speculating all over the place. The only way she can put any of this to bed is to release her full medical records, and even then people won't quite believe it.\nHANNITY: And what doctor wouldn't force her to go to a hospital? The reason she didn't go to the hospital is I believe the New York Post is right, because she doesn't want anybody knowing the real truth about her medical condition.\nSCHOEN: Sean, it was a political decision.\nHANNITY: She just collapsed, Doug. Doesn't her health transcend that?\nSCHOEN: All I can say is I'm not a doctor, but the medical protocol in these situations it so go to a hospital for a full neurological --\nHANNITY: If you collapsed, I hate to tell you, I would take you to a hospital.\nSCHOEN: Sean, I have collapsed. I have gone to the hospital. I have had full neurological testing in similar circumstances. Fortunately, and I'm OK. We have to understand she is the type --\nHANNITY: You're the only halfway reasonable Democrat left in the country.\nSCHOEN: I want her to win. I want her to be healthy.\nHANNITY: You die, you're extinct.\nSCHOEN: I'm not going to do any good for the \"Hannity\" show and any other show if I'm extinct.\n(LAUGHTER)\nSCHOEN: I want to make it through Election Day.\nHANNITY: Up next, we need your help, a very important \"Question of the Day\" straight ahead.\n(COMMERCIAL BREAK)\nHANNITY: Time for our \"Question of the Day.\" So do you think Hillary Clinton is being transparent, honest, and truthful about her health? She's not honest about anything else. We want to hear from you. Go to Facebook.com/SeanHannity, @SeanHannity on Twitter.\nAnd before we go, quick programming note. Tomorrow night, 10:00 eastern, the Republican nominee Donald Trump will be here. We'll ask him about the, well, group of deplorables I guess of which I'm part of, and about Hillary's health and much more, the issues of the day.\nThanks for being here. We'll see you back here tomorrow night.\n\nContent and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.", "external_links": [], "published": "2016-09-13T03:00:00.000+03:00", "crawled": "2016-09-13T21:48:13.521+03:00", "highlightTitle": ""}