{"organizations": [], "uuid": "6c5f7a11382c33a3027178744c3beca4d8b7ae77", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 3, "shares": 3, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/694940094001_5117361869001_3145ee95-6ae7-4d00-9726-3d904b91ba48.jpg", "site_section": "http://www.foxnews.com/yourworld/", "section_title": "Your World with Neil Cavuto | Fox News", "url": "http://www.foxnews.com/transcript/2016/09/08/no-excuse-gary-johnson-explains-blanking-on-aleppo/", "country": "IT", "domain_rank": 185, "title": "'No excuse': Gary Johnson explains blanking on 'Aleppo'", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "'No excuse': Gary Johnson explains blanking on 'Aleppo' | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2016-09-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "6c5f7a11382c33a3027178744c3beca4d8b7ae77"}, "author": "FoxNews.com", "url": "http://www.foxnews.com/transcript/2016/09/08/no-excuse-gary-johnson-explains-blanking-on-aleppo/", "ord_in_thread": 0, "title": "'No excuse': Gary Johnson explains blanking on 'Aleppo'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Published September 08, 2016\nThis is a rush transcript from \"Your World,\" September 8, 2016. This copy may not be in its final form and may be updated.\nNEIL CAVUTO, HOST: Gary Johnson is here. He is here to answer for this:\n(BEGIN VIDEO CLIP)\nMIKE BARNICLE, MSNBC: What would you do if you were elected about Aleppo?\nGARY JOHNSON, LIBERTARIAN PRESIDENTIAL CANDIDATE: About Aleppo. And what is Aleppo?\nBARNICLE: You're kidding.\nJOHNSON: No.\nBARNICLE: Aleppo is in Syria. It's the epicenter of the refugee crisis.\nJOHNSON: OK. Got it. Got it.\n(END VIDEO CLIP)\nCAVUTO: To hear the media tell, it Libertarian presidential candidate Gary Johnson can now kiss his presidential dreams goodbye? Is that fair? Is that right?\nLooking at Politico and The New York Times and a host of others, calling it all but his Rick Perry moment, and still others saying that he lost any chance of being invited to a presidential debate. Is the stumble more suicidal?\nWith me now, Gary Johnson.\nGovernor, how are you holding up?\nJOHNSON: Neil, I'm holding up all right.\nI'm going to try to make lemonade out of this, is what I'm going to try and do, which is to talk about the policy in Syria right now, and Aleppo is at the epicenter of that policy.\n(CROSSTALK)\nCAVUTO: But you didn't seem to know that.\nJOHNSON: Well, I was thinking acronym when he said Aleppo, and guilty.\nCAVUTO: Yes.\nJOHNSON: No excuse whatsoever.\nCAVUTO: But did you see, as you appreciated the magnitude of that, that you were kissing your chances goodbye?\nJOHNSON: No. Well, if it is kissing my chances goodbye, so be it.\nBut I have always been served really well by telling. And you tell the truth, and you can get your way thing through things.\nCAVUTO: So you thought it was a fair question?\nJOHNSON: Yes, absolutely. Anything is fair. I'm running for president of the United States. So, no complaints, no complaints.\nCAVUTO: Do you fear, though, that just as you were gaining, momentum that -- and you and I were just chatting not too long ago about trying to get up to that 15 percent, so that you could be invited to the debates, but might not happen, probably won't happen.\nJOHNSON: Well, let me just for a second, though, talk about the policy right now in Syria.\nAnd if I have got this wrong, you tell me that I have it wrong. But we have Assad. We have the administration on the east side, administration. We have the regime of Assad on the east side of Aleppo.\nOn the west side...\nCAVUTO: So, you knew Aleppo? You knew about the city in Northern Syria?\n(CROSSTALK)\nJOHNSON: Yes. Yes. Yes. Yes.\nCAVUTO: I'm sorry. I do want to understand that. But so you just didn't what Mike Barnicle was talking about at the time?\nJOHNSON: Well, I thought it was -- I thought he was talking about an acronym.\nCAVUTO: I see.\nJOHNSON: I was thinking about American -- American -- I don't know, A.L.\nCAVUTO: That's right.\nJOHNSON: But back to the policy.\nAnd people -- I would love to have a debate and a discussion in this country about the policy, and it's as follows. You got the regime of Assad on the east side of Aleppo. On the west side, you have the Free Syrian Army which is allied with the Islamists, ISIS, whom we actually were paying Assad at one point to fight ISIS.\nBut the two of them are aligned. So you have this arms transfer between the two. And then we're also supporting the Kurds which are fighting ISIS that are crossways with our ally Turkey.\nCAVUTO: But you didn't say or get into any of that this morning.\nJOHNSON: Well, no, because I was just...\nCAVUTO: So, I'm almost -- a cynic in me could say, well, now he's trying to make up and sound smart on this.\nJOHNSON: And be as cynical as you want, Neil. It is what it is.\nAnd the fact that we support regime changes in these countries put us in this position, the reason for Aleppo, the reason for these atrocities. And talking about the atrocities, I would just maintain that as atrocious as these genocides are, we go in, we try and improve on those situations, and, at best, they end up being the same, and in many cases actually end up being worse.\nCAVUTO: Do you think, Governor, that this whole thing, whether it's Aleppo, and you were caught off-guard, refuels an attack line that some have used against you that you're a noninterventionist, you don't like getting involved in this, and that's because it's so against you, you're not up to speed on it, and that it's so -- you're viscerally against the involvements, and that you're just not a good anti-terror, deal with really bad guys type of leader, and that, if you're looking for that, don't look to Gary Johnson?\nJOHNSON: No, look, we should provide for an invincible national defense. We should exhibit military superiority.\nI think I may have mentioned on your show that, in a poll done on active military personnel here three weeks ago, I was the choice to be the next president of the United States.\nCAVUTO: Do you think you still would be after this?\nJOHNSON: Well, I would hope so, because I'm still talking about the policy, which is military intervention, the policy , which is all about us going in and trying to accomplish regime change that, in my lifetime, has just not worked out.\n(CROSSTALK)\nCAVUTO: So, do you think any of this hurts you, though? Because I wanted you to react to this, because Hillary Clinton was asked about this earlier today. Let's take a look at this, guys.\n(BEGIN VIDEO CLIP)\nQUESTION: Secretary Clinton, Gary Johnson said he doesn't know where Aleppo is. Do you think Gary Johnson is capable of being commander in chief? Please.\nHILLARY RODHAM CLINTON, D, PRESIDENTIAL CANDIDATE: Well, you can look on the map and find Aleppo.\n(END VIDEO CLIP)\nCAVUTO: What did you think of that?\nJOHNSON: Well, Hillary has got the map down. Hillary has got the names down, but Hillary is responsible for these policies, Hillary and Clinton -- or -- excuse me -- Hillary and Obama both, and not intentional.\nCertainly, you can't do this intentionally. But this is just how mixed up it is. And I go back to my earlier dialogue. People need to recognize just how complex this is and how we're working both sides and somehow magically it's going to work out in end?\nI do have a promise, Neil. And the promise is, I'm going to make mistakes going forward also. I would make mistakes as president of the United States, but I would be transparent, in that, hey, made a mistake, shouldn't have said what I said or whatever it happens to be. Move on.\nWhether or not that disqualifies me as being president of the United States, that will be for people to determine.\n(CROSSTALK)\nCAVUTO: Have your people told you or expressed regret that this killed it for you?\nJOHNSON: Well, no, because this day was going to happen.\nCAVUTO: Right.\nJOHNSON: I expected this to happen sometime.\nWas it Aleppo that I was -- learning from this, gee, what subjects are going to be discussed today?\nCAVUTO: Well, I guess what I'm asking you is that only yesterday, you had Mitt Romney tweeting that you and the governor, Weld, who is your running mate, William Weld, the former governor of Massachusetts, should be on that -- on the debate stages this fall. Have you heard from him?\nJOHNSON: No, and he is probably ruing what he wrote, which is that we should be on the debate stage.\nCAVUTO: Well, there had been talk that he was going to endorse you.\nJOHNSON: Well, I hope I still am on the debate stage talking about the policy, not the place. And like I say...\nCAVUTO: Not -- I'm asking whether Governor Romney, has he talked to you post-this?\nJOHNSON: No. No. No.\nCAVUTO: So, the talk that he would formally endorse you for the presidency, is that out the window now?\nJOHNSON: Well, I don't know, Neil. I was...\nCAVUTO: Have you reached out to him?\nJOHNSON: No, I haven't.\nI was heartened by what he wrote yesterday, which is to include me in the debates. And with regard to the debates, I think what I'm pointing out here is contrary to what the policies will be going forward, which at best are really convoluted, and have us in this situation to begin with, the fact we did get involved in regime change. And this goes back to Iraq.\nCAVUTO: Have you done any snap polling on this or whether people who heretofore had not heard of you, now they're hearing all that about you, and Hillary Clinton's responding to this and all, it like out of the woodwork?\nJOHNSON: Well, it is. It's kind of amazing.\nAnd I'm, like I say, trying to make lemonade out of this, that we shouldn't be discussing the place Aleppo. What we should be talking about is the policy, which is so convoluted. And it's the result of our foreign policy that starts with regime change.\nCAVUTO: But do you think find it weird that people who ignored you and everything you were saying are really focused on this? And I'm just wondering why you think that is.\nJOHNSON: Well, when I was running for governor of New Mexico, there were these extreme areas of poverty around the border, Mexico, New Mexico. I was very aware of it. No water, no sewage.\nI was asked the question, what do you think about Colonias? This was when I was running for governor of New Mexico. I said, Colonias? What's Colonias?\nColonias, it was all headlines all across New Mexico. Johnson doesn't know what a Colonias is. Well, it was the actual term applied to these poverty-stricken areas of which I was very aware.\nWell, if this is going to disqualify me from being governor of New Mexico so be it, but it's what happened.\nCAVUTO: Do you think that if let's say you are able to make it to that debate stage, that you siphon more votes from Hillary Clinton than you do Donald Trump? An even mix? What do you think?\nJOHNSON: Well, I think it's an even mix. And I think the polls to this point have shown that.\nCAVUTO: Actually, they haven't. When it's just the two of them going, Hillary Clinton's lead is bigger. When it's -- when you're in included, it's narrower.\nJOHNSON: Well, I think if it goes -- when I it goes to the election, that it will end up being 50/50. That's what I think.\nAnd I wouldn't be doing this if I didn't think that there is still the opportunity to win. And I'm making the pitch here that I'm a transparent guy, that I do tell the truth.\nAnd telling the truth, hey, if that results in this crashing and burning, you know what? So be it. It's what I have. It's who I am. It's the filter that I have. And the filter that I have is start with the truth. And you just don't go wrong with the truth.\nCAVUTO: You had said later in the day, Governor, that you would have obviously -- as president, you would have foreign policy briefings and updates on security affairs and that you have people for this, which is all well and good.\nBut it has fueled a debate where Gary Johnson himself, an accomplished two-term governor, has done a great deal, is just not up to speed running the foreign policy for this country.\nJOHNSON: Well, and based on what happened this morning, look, I will heap it on. Guilty. Guilty.\nBut going forward, you know, all you can do is wake up tomorrow, smile on your face, keep after it. And, really, this is...\nCAVUTO: Would you be tough on terror? Would you deal with this refugee crisis?\nJOHNSON: Well, what we need to understand is -- and we're going to see this -- and we're going to see this through, and by that, terrorism, ISIS, but there -- there will be a void at the end of the day.\nThere's going to be a void at the end of the day. And who is that void going to get filled by? Well, in this case, we didn't even hear about ISIS until a couple of years ago. And a lot of this has to do with what happened in Iraq as a result of us going in and supporting regime change, and the fact that a lot of this is those that have fled from Iraq.\nSo, it needs to be regionally contained. And Congress needs to get involved in a policy position going forward, a declaration of war. But, yes, we are going to see this through. We're going to -- we're not going to -- we are going to be tough on terror, but not make these mistakes that have created this in the first place.\nCAVUTO: Have you talked to your running mate, Governor Weld? Did he just say, well, thanks a lot, you just kissed this thing goodbye?\nJOHNSON: No, Bill is really supportive. And...\nCAVUTO: What did he say?\nJOHNSON: Well, he just said, look, much to do. I don't want to paraphrase, but you're OK. We're both OK.\nWe made a pledge to ourselves that we will tell the truth, and if you tell the truth, you don't have to remember anything. And, really, both of us, I think, have excellent instincts on all this. And this is based on both of us having been former governors, and former governors in heavily Democrat states. I think we're right down the middle between Clinton and...\n(CROSSTALK)\nCAVUTO: You think all of that will more than offset the nastiness you have gotten from this?\nJOHNSON: I don't want to make that claim either, Neil. Who is to say how this all falls out?\nCAVUTO: But, what, do you drill into your head now Aleppo, Aleppo, Aleppo, Aleppo?\nJOHNSON: Aleppo, Aleppo, lah, lah, lah, lah, lah.\n(LAUGHTER)\nCAVUTO: Governor Johnson, thank you very, very much. Very good seeing you, Gary Johnson.\nContent and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.", "external_links": [], "published": "2016-09-08T03:00:00.000+03:00", "crawled": "2016-09-09T22:17:03.777+03:00", "highlightTitle": ""}