{"organizations": [], "uuid": "22ed46a3bbb4fda5b89d7c773ab889958ab8f95f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 20, "shares": 20, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/politics/0/0/166242474.jpg", "site_section": "http://feeds.latino.foxnews.com/home/feed", "section_title": "FOX News", "url": "http://latino.foxnews.com/latino/opinion/2016/09/01/opinion-why-both-clinton-and-trump-are-in-decline-with-hispanics-and-it-is-not/", "country": "US", "domain_rank": 185, "title": "Opinion: Why both Clinton and Trump are in decline with Hispanics, and it's not immigration | Fox News Latino", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "Opinion: Why both Clinton and Trump are in decline with Hispanics, and it's not immigration | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2016-09-01T03:00:00.000+03:00", "replies_count": 0, "uuid": "22ed46a3bbb4fda5b89d7c773ab889958ab8f95f"}, "author": "Lili Gil Valletta", "url": "http://latino.foxnews.com/latino/opinion/2016/09/01/opinion-why-both-clinton-and-trump-are-in-decline-with-hispanics-and-it-is-not/", "ord_in_thread": 0, "title": "Opinion: Why both Clinton and Trump are in decline with Hispanics, and it's not immigration | Fox News Latino", "locations": [], "entities": {"persons": [{"name": "lili gil valletta", "sentiment": "negative"}, {"name": "clinton", "sentiment": "negative"}, {"name": "trump", "sentiment": "negative"}, {"name": "liliana gil-valetta", "sentiment": "none"}], "locations": [{"name": "america", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}, {"name": "colorado", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}, {"name": "nevada", "sentiment": "none"}], "organizations": [{"name": "fox news latino getty", "sentiment": "negative"}, {"name": "fox news latino", "sentiment": "none"}, {"name": "fox news", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "xl alliance", "sentiment": "none"}, {"name": "facebook  follow us on twitter & instagram", "sentiment": "none"}, {"name": "harvard kennedy school women's leadership board", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Lili Gil Valletta \nPublished September 01, 2016 Fox News Latino Getty Images \nAs we witness a Trump makeover in the last few weeks, analysts and strategists today wonder whether this evolution will make a difference with one of America’s fastest growing population segments: Hispanics. \nBetween 2000 and 2012, Hispanics grew by nearly 49 percent according to census data, while growth has only been 5.8 percent for the rest of the population. \nIt is not just what he is saying but how he is saying it what is driving negative opinion among Hispanics. - Liliana Gil-Valetta\nThis year there are an estimated 27.3 million eligible Hispanic voters, of which half are millennials. And, particularly in key states such as Florida, Colorado and Nevada, Latinos will make a winning or loosing difference. \nBut is immigration the winning topic? \nIt seems both campaigns are banking on it, with a new ad from the Clinton campaign highlighting Trump’s harsh immigrations remarks while Trump acts diplomatic in Mexico and later hosts a big immigration speech. \nPutting assumptions and emotion aside, what does the analysis of the unbiased voice and opinion generated by hundreds of thousands of Hispanic digital discussions reveal about the candidates? Net, net, it is not about immigration alone. \nBack in June, as published on Fox News Latino, we ran a report using a proprietary big data methodology, CulturIntel™, including search, artificial intelligence and machine learning tools which revealed a rise in positive opinion among Hispanics for Trump at 37 percent; while Clinton was at 41 percent. \nWhile the skeptics personally questioned me live on shows like The O’Reilly Factor, it was hard to argue against over a million Hispanic discussion data points. This is why, in the advent of much discussion surrounding immigration we decided to run yet one more report to get to the facts behind Trump’s and Clinton’s drivers and barriers among Hispanics. \nRecent analysis of almost 300,000 Hispanic discussions from June 1 to August 21, 2016 reports Trump declining from 37 percent as of June 1, to 13 percent positive opinion among Hispanics and Clinton at 31 percent versus 41 percent positive opinion among Hispanics as of June 1, revealing that both are declining among this important segment. \nFurther analysis outlines the drivers and barriers for each candidate among Hispanics, which reveal important levers the candidates, and their campaign advisors could pull, beyond immigration. \nBottom line, jobs and the economy are the top issue for Hispanics, based on analysis of over 142 million Hispanic discussions over 12 months, as of June 10, 2016, followed by education and health care. In fact, immigration ranks as the number seven key issue for Hispanics overall and ranks as the number four issue for Hispanic millennials, who make up almost half of Latino voters.\nhttp://culturintel.tumblr.com/post/149780506878 \nPositive opinion for Trump among Hispanics is driven primarily by the fact that he is not a politician, at 38 percent, followed by his economic and business experience at 28 percent. Clinton’s positive opinion among Hispanics is driven by her political experience at 26 percent followed by her domestic policies at 24 percent. In fact, immigration gets the lower percentage of all factors driving her positive opinion, at 16 percent. \nIn contrast, the negative views among Hispanics for Trump are his temperament at 26 percent, intolerance at 26 percent, with immigration as the number-three barrier at 21 percent. Clinton’s negative opinion is driven by an overwhelming 43 percent who do not trust her followed by gender bias at 13 percent, followed by her establishment profile at 12 percent.\nhttp://culturintel.tumblr.com/post/149780423393 \nWhile both campaigns are probably reacting to day-to-day polls, that use traditional methods, why not look a new digital ways to inform strategy? \nWhether you like his style or not, especially for many undecided Latinos or independents in decision-limbo, data reveals that Trump actually has the best alignment of positive drivers, as a non-politician and business expert that align to the top issue that matter to Hispanics — jobs and the economy.\nhttp://culturintel.tumblr.com/post/149780406278 \nSo while many speculate that immigration is an issue to be placed center stage to appeal or repeal Hispanics, this data reveals that Trump’s negative opinion is driven by temperament and a style that seems bias and intolerant, but not by a harsh immigration stance per se. \nIt is not just what he is saying but how he is saying it what is driving negative opinion among Hispanics. \nOn the other hand, Clinton has a lot of work to do with trust to be emphasized and earned not with a message anchored on demonizing her opponent’s immigration policies, but by focusing on her track record, experience and domestic policies, which drive the positives among Hispanics. \nIn summary, Hispanics voters are not a single-issue community to be persuaded by immigration, but a hard-working community concerned about jobs and the economy as a top issue. Candidates must understand that credibility and trust are not earned with immigration promises, but with relevant and genuine messages that avoid stereotyping, pandering and criminalizing the group that represents America’s largest minority group at 55 million strong. \nIt is a basic human rule; it is called respeto, respect.\n\nLili Gil Valletta  is an award-winning entrepreneur, multicultural marketing strategist, Fox News independent contributor and co-founder of XL Alliance. She is a World Economic Forum Young Global Leader and member of the Harvard Kennedy School Women's Leadership Board. \nLike us on Facebook \nFollow us on Twitter & Instagram", "external_links": [], "published": "2016-09-01T03:00:00.000+03:00", "crawled": "2016-09-01T17:41:11.070+03:00", "highlightTitle": ""}