{"organizations": [], "uuid": "e63e440e539badc47195b5c2df0d25607f7f5b11", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "drugpolicycentral.com", "main_image": "", "site_section": "http://drugpolicycentral.com/bot/rss", "section_title": "breaking drug news latest 25", "url": "http://drugpolicycentral.com/bot/article/cbsnews6711.htm", "country": "CA", "title": "CBS News", "performance_score": 0, "site": "drugpolicycentral.com", "participants_count": 1, "title_full": "[BOT] CBS News", "spam_score": 0.0, "site_type": "news", "published": "2016-08-31T03:00:00.000+03:00", "replies_count": 0, "uuid": "e63e440e539badc47195b5c2df0d25607f7f5b11"}, "author": "drugpolicycentral.com", "url": "http://drugpolicycentral.com/bot/article/cbsnews6711.htm", "ord_in_thread": 0, "title": "CBS News", "locations": [], "entities": {"persons": [{"name": "clinton", "sentiment": "none"}, {"name": "wayne hall", "sentiment": "none"}, {"name": "huma abedin", "sentiment": "none"}, {"name": "compton", "sentiment": "none"}, {"name": "ashley welch", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "weiner  clinton", "sentiment": "none"}, {"name": "wilson m. compton", "sentiment": "none"}, {"name": "chris brown", "sentiment": "none"}, {"name": "zika", "sentiment": "none"}, {"name": "paula reid", "sentiment": "none"}], "locations": [{"name": "us", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "oregon", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "mississippi", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}, {"name": "alaska", "sentiment": "none"}, {"name": "norway", "sentiment": "none"}, {"name": "colorado", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}, {"name": "los angeles", "sentiment": "none"}], "organizations": [{"name": "cbs news", "sentiment": "none"}, {"name": "dea", "sentiment": "none"}, {"name": "zika  consumer reports", "sentiment": "none"}, {"name": "cbs evening news", "sentiment": "none"}, {"name": "comptom", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "national institute on drug abuse", "sentiment": "none"}, {"name": "cbs n", "sentiment": "none"}, {"name": "national institutes of health", "sentiment": "none"}, {"name": "university of queensland", "sentiment": "none"}, {"name": "cbs interactive inc", "sentiment": "none"}, {"name": "united", "sentiment": "none"}, {"name": "cbs news app", "sentiment": "none"}, {"name": "cbs", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "  \nUS: CBS News \nFound: Wed Aug 31 16:01:32 2016 PDT\nWebpage: http://www.cbsnews.com/news/marijuana-stud... [translate] \nNewshawk:   prison was NOT mentioned \npropaganda analysis \nCBS News More U.S. adults use pot as laws, attitudes shift - CBS News \nThe all new \nCBS News App for Android. for iPad. for iPhone. \nFully redesigned. Featuring CBS N, 24/7 live news. Get the App ╳ \n* CBS News \n* CBS Evening News \n* CBS This Morning \n* 48 Hours \n* Local \n* In Depth \n* CBS News Store \nBy Ashley Welch CBS News August 31, 2016, 6:52 PM \nMore U.S. adults use pot as laws, attitudes shift \nGetty Images/iStockphoto \n* Comment \n* Share \n* Tweet \n* Stumble \n* Email \nAn increasing number of U.S. adults are using marijuana , and attitudes about the drug are shifting - fewer people perceive pot as harmful , according to a new study published in The Lancet Psychiatry. \nThough the study cannot answer the question of why more Americans are using marijuana , the researchers say the data is consistent with other, similar research. The trend comes as a growing number of states are changing laws to legalize medical, and to a lesser extent, recreational marijuana , which may be playing a role in public perception of the drug . \n\"Understanding patterns of marijuana use and dependence, and how these have changed over time is essential for policy makers who continue to consider whether and how to modify laws related to marijuana and for health-care practitioners who care for patients using marijuana ,\" study author Dr. Wilson M. Compton of the National Institute on Drug Abuse , part of the National Institutes of Health, said in a statement. \nPlay VideoCBSN \nFederal government won't loosen up on marijuana restrictions \nA petition to loosen restrictions on marijuana use has been rejected by the DEA . CBS News justice reporter Paula Reid joins CBS N with more detail... \nFor the study, Comptom and his team analyzed data from 596,500 adults aged 18 or older who took part in an annual, nationally-representative government survey from 2002 to 2014. \nThe participants were asked questions about whether or not and how often they used marijuana ; first-time marijuana use ; and whether they had a marijuana use disorder. They were also asked their views about the drug and state legalization of marijuana use for medical purposes. The study period concluded before Colorado, Washington, Oregon, and Alaska legalized marijuana for recreational use. \nThe results showed that marijuana use - which was defined as having used marijuana any time in the previous year - rose from 10.4 percent of adults in 2002 to 13.3 percent in 2014. \nWhen extrapolated to the whole U.S. population, that means the overall number of marijuana users increased from an estimated 21.9 million people in 2002 to 31.9 million in 2014. \nThe report also found that about 1.4 million adults first started using marijuana in 2014, up from about 823,000 first-time users in 2002. \nAnd in what Compton called a somewhat surprising finding, the number of daily or almost-daily marijuana users rose from 3.9 million in 2002 to 8.4 million 2014. \n\"This translates to a more than doubling of the number of adults using marijuana daily or near daily,\" Compton told CBS News. \nThe growing number coincided with a decrease in the proportion of people perceiving \"great risk of harm \" from smoking marijuana once or twice a week. Half of Americans surveyed expressed that concern in 2002, but it dropped to 33 percent in 2014. \nThese trends - increasing marijuana use , and decreasing perception of harm - generally began in 2007. \nPlay VideoCBS This Morning \nHow Calif. vote for recreational pot could change national debate \nThe campaign to legalize recreational marijuana is officially underway in California. A similar ballot initiative failed in 2010, but a recent po... \nThe prevalence of marijuana abuse or dependence among adults in the general population remained stable at about 1.5 percent between 2002 and 2014, while the number of those with these disorders among users declined from about 15 percent to 11 percent during this time period. \nPeople who used marijuana were more likely to develop dependence if they were male, younger, had low education, were not working full-time, were depressed, and used tobacco or other substances. \nCompton said the findings have important implications for the health care system. \n\"As a clinician, I want to make sure that my medical colleagues are aware of this so that they begin to ask their patients more routinely about use of marijuana ,\" Compton said, \"because if you don't ask people won't necessarily tell you about it, and yet it could interact with medical treatments that you have in mind or conditions that you're treating.\" \nIn an accompanying editorial, Professor Wayne Hall of the University of Queensland in Australia points out that changes in the prevalence of marijuana use occurred during a period when many states legalized the drug for medicinal use, but before four states went on to legalize it for recreational use. Therefore, he argues, continued monitoring is needed as the legislative and social landscape regarding the drug continue to shift. \n\"It is probably too soon to draw conclusions about the effects of these legal changes on rates of cannabis use and cannabis related harms , but it is likely that these policy changes will increase the prevalence and frequency of cannabis use and, pot entially, cannabis use disorders in the longer term,\" he writes. \n(c) 2016 CBS Interactive Inc. All Rights Reserved. \n* Comment \n* Share \n* Tweet \nFeatured in Health \nBest bug sprays for fighting Zika \nConsumer Reports tested insect repellents and came up with the best brands for fending off mosquitoes that could spread Zika virus \n7 bad habits that could be wrecking your diet \nIf you're having a hard time shedding pounds, try adjusting these common eating habits \nPopular \nMost Popular \nMore than 300 reindeer killed \"in one moment\" in Norway \n117757 views \nRussian man volunteers for first human head transplant \n103569 views \nPolice make arrest in killings of 2 Mississippi nuns \n93083 views \n2 United pilots arrested for suspected drunkenness \n42926 views \nChris Brown emerges from home after police serve warrant \n42712 views \nWatch CBS N Live \nBlack Dad Finds Touching Note On His Car \nLAPD Arrests Chris Brown After Standoff \nChris Brown Arrested At Los Angeles Home After Standoff \nFlorida, Gulf Coast Brace For Heavy Storm Impact \nClinton ties Trump's campaign to the extreme right-wing \nHow immigration hardliners are reacting to confusion over Trump's stance \nMexican president under fire over Trump meeting \nClinton aide Huma Abedin announces separation from Weiner \nClinton's absence from the public eye comes at a price \nNew Apple TV App \nCBS News.com * Site Map \n* Help", "external_links": [], "published": "2016-08-31T03:00:00.000+03:00", "crawled": "2016-09-01T02:08:33.876+03:00", "highlightTitle": ""}