{"organizations": [], "uuid": "3b6d3a25502daa426c347391dff992c3285ae654", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/694940094001_5107510509001_716f4e90-2e4b-4e58-8644-f1f4ef0f893d.jpg", "site_section": "http://www.foxnews.com/hannity/", "section_title": "Hannity | Sean Hannity | Fox News", "url": "http://www.foxnews.com/transcript/2016/08/31/ingraham-trump-gave-powerful-specifics-on-immigration-comparing-candidates/", "country": "IT", "domain_rank": 185, "title": "Ingraham: Trump gave powerful specifics on immigration; Comparing the candidates' immigration policies", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "Ingraham: Trump gave powerful specifics on immigration; Comparing the candidates' immigration policies | Fox News", "spam_score": 0.004, "site_type": "news", "published": "2016-08-31T03:00:00.000+03:00", "replies_count": 0, "uuid": "3b6d3a25502daa426c347391dff992c3285ae654"}, "author": "FoxNews.com", "url": "http://www.foxnews.com/transcript/2016/08/31/ingraham-trump-gave-powerful-specifics-on-immigration-comparing-candidates/", "ord_in_thread": 0, "title": "Ingraham: Trump gave powerful specifics on immigration; Comparing the candidates' immigration policies", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "negative"}, {"name": "ingraham", "sentiment": "negative"}, {"name": "trump", "sentiment": "negative"}, {"name": "castro", "sentiment": "none"}, {"name": "michelle root", "sentiment": "none"}, {"name": "lisa", "sentiment": "none"}, {"name": "lisa boothe", "sentiment": "none"}, {"name": "michelle", "sentiment": "none"}, {"name": "dominic", "sentiment": "none"}, {"name": "laura ingraham", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "laura wilkerson", "sentiment": "none"}, {"name": "a.j.", "sentiment": "none"}, {"name": "nieto", "sentiment": "none"}, {"name": "juan williams", "sentiment": "none"}, {"name": "hannity", "sentiment": "none"}, {"name": "williams", "sentiment": "none"}, {"name": "wilkerson", "sentiment": "none"}, {"name": "josh", "sentiment": "none"}, {"name": "sabine", "sentiment": "none"}, {"name": "rick perry", "sentiment": "none"}, {"name": "laura wilkerson", "sentiment": "none"}, {"name": "durden", "sentiment": "none"}, {"name": "laura", "sentiment": "none"}, {"name": "boothe", "sentiment": "none"}, {"name": "lisa boothe", "sentiment": "none"}, {"name": "jorge ramos", "sentiment": "none"}, {"name": "juan", "sentiment": "none"}, {"name": "delgado", "sentiment": "none"}, {"name": "obama", "sentiment": "none"}, {"name": "a.j. delgado", "sentiment": "none"}, {"name": "sean", "sentiment": "none"}, {"name": "clinton", "sentiment": "none"}, {"name": "juan williams", "sentiment": "none"}, {"name": "sabine durden", "sentiment": "none"}, {"name": "hillary", "sentiment": "none"}, {"name": "laura ingraham", "sentiment": "none"}, {"name": "a.j. delgado", "sentiment": "none"}], "locations": [{"name": "omaha", "sentiment": "none"}, {"name": "iran", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "michigan", "sentiment": "none"}, {"name": "sabine durden", "sentiment": "none"}, {"name": "oval office", "sentiment": "none"}, {"name": "china", "sentiment": "none"}], "organizations": [{"name": "fox news", "sentiment": "none"}, {"name": "american legion", "sentiment": "none"}, {"name": "quick mart", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Published August 31, 31, Donald Trump just finished delivering a major speech on immigration, promising to build a wall along the southern border, deport criminal illegal immigrants, and sanctuary cities and so much more. Ending on a very powerful note with what he called \"angel moms,\" parents that, in fact, lost their children to illegal immigrants. He also laid out a 10-point plan. We have a lot of ground to cover, little time to do it.\nHere with reaction, editor in chief, Lifezette.com, Fox News contributor, nationally syndicated radio talk show host Laura Ingraham. As I analyze not just this speech, but analyze him with President Nieto earlier today, Laura, and you were with him I understand. Is that true?\nLAURA INGRAHAM, EDITOR IN CHIEF, LIFEZETTE.COM: I was not. I would have loved to have been there. It looked pretty dramatic. I wish I was there, but no, I wasn't there.\nHANNITY: It seems that this probably turned out for Donald Trump to be a pivotal moment and I would argue probably the best day of his campaign. He looked presidential in Mexico. He gave a powerful speech. He laid out a very powerful case. He compared and contrasted his vision on immigration versus Hillary. He talked about the cost, the impact, criminal justice system, health care system, educational system. He talked about how it has impacted families like those angel moms behind. Very powerful day, I would argue, for him.\nINGRAHAM: Yes. I think when you hear the critics of Trump, they often will say, well, he speaks in broad generalities. It's make America great again, I'm going to build a beautiful wall. But this speech, and it was lengthy, it went into specific after specific. I mean, getting down to the 287-G program, which is cooperation of the states and the federal government, which he's going to reinvigorate.\nObviously, the big kicker on catch and release, that we're no longer just going to allow people who walk across the border to stay here. We're immediately going to deport them, including to the countries who refuse to take deported illegal immigrants today. He went into specific after specific on the impact of the American people on crime, on our security, on jobs, and the impact on the rule of law, Sean, which I think goes to the commonsense desire to really have an immigration enforcement system that works for the American people.\nAnd I think at the beginning it was really important to stress that he said how much he loves the Mexican people and has such great respect for Mexican-Americans immigrants to this country who work so hard, believe in strong families. And it gave a big hat tip to President Nieto who I know is hammered tonight in Mexico for even meeting with president Trump, and there's a lot of strong feelings after that meeting.\nBut I think it was a -- it was a big day for this campaign. And the critics will be the critics, but I think the speech stands on its own as a major, major policy shift away from open borders and permissive or nonexistent enforcement.\nHANNITY: I think if I'm Hillary Clinton tonight I'm very worried.\nINGRAHAM: Yes. Today she was giving a lackluster speech at the American Legion, Sean. She received tepid, polite applause. And meanwhile Donald Trump was standing side by side with one of our most important allies. We have had a rocky relationship with Mexico, not just Trump's tough language but the relationship isn't great over the last seven-and-a-half years hasn't been great. It's frankly been withering on the vine. He goes down there and says, look, we are going to disagree on things, but this is the beginning of a reinvigorated relationship. We need to have a strong relationship. I thought that was powerful. And again, I think President Nieto deserves a lot of credit for meeting with him.\nHANNITY: I agree with you.\nINGRAHAM: And he is getting hammered by the Jorge Ramos types badly for having hosted Donald Trump. I think it was a good thing.\nHANNITY: The objective journalist guy that says every media person should be against Donald Trump.\nYou know what was amazing about this? Think of the first day Donald Trump announced and he talked about -- he mentioned crime and murder and he mentioned rape, but he also talked about that time he talked about all the other -- many are good people. He did say that.\nINGRAHAM: Yes.\nHANNITY: That always got distorted from the very beginning.\nBut here's I think what I take out of today, especially the meeting with President Nieto, is that Donald Trump took a strong, powerful stand. Donald Trump still got an invitation and Donald Trump obviously charmed the Mexican president. And they both said they could work together. And they both talked about solving problems with Trump --\nINGRAHAM: Real problems.\nHANNITY: -- with the cartels and guns and illegal immigration. At the end of the day, peace through strength, the evil empire, I got the idea that a lot of people thought Donald Trump's tough language would hurt our relations with people, I think he proved just the opposite tonight.\nINGRAHAM: Sean, you're absolutely right. A strong America is better for allies. A weak America and an America in decline is terrible for our allies. It might momentarily make the snipers feel good, but if America is in decline, freedom is in danger around the world.\nAnd I think he seemed to convey that in his remarks today in Mexico. It is critical that we have a good and powerful and honest relationship with Mexico. We're not going to agree with Mexico on everything. We don't agree with the EU on everything. We don't agree with German, we know, on everything. But we work with people.\nThink about this Sean. We have Republicans who had no problem with the administration sitting down with Iran and going to visit despots in Castro and negotiating with China despite what they do to their political prisoners. They have no problem with any of that. Today, they're all grousing, how could Trump go to Mexico? And Trump has no business going to Mexico. I'm thinking, are you kidding me? You sold out this country in negotiation after negotiation. He goes down to Mexico and is statesman like and respectful but also talks about American priorities. That is what we want in an American president in my view.\nHANNITY: It was funny because Hillary did blast Trump for going to Mexico, but you know she would have blasted him if he didn't go to Mexico.\nINGRAHAM: You can't win.\nHANNITY: You know they're panicked tonight in the Clinton campaign especially in the light of the dropping poll numbers. And you've got a lot of these swing states come back into play. This is a brand new ball game. I'd like to see the polls one week from tonight.\nLaura, as alwyas, thank you for staying up late. Thanks for being with us, appreciate it.\nINGRAHAM: All right, take care.\nHANNITY: Joining us now, if you just heard Donald Trump introduce \"angel moms,\" mothers whose children were killed by illegal immigrants. Joining us now, Michelle Root and Sabine Durden is with us. That was a very powerful moment. Michelle, what was your reaction to that, and also his challenge to the media to say, hey, wait a minute. You have an obligation to ask questions on behalf of these families that lost their children because of illegal immigration.\nMICHELLE ROOT, DAUGHTER KILLED BY ILLEGAL IMMIGRANT: I thought it speech was wonderful, what I could hear of it, because I was traveling to the studio. Like most of the parents on stage said, you know, I wish he was in office and then maybe our children would be alive today. And I agree with him. The media needs to start speaking out for our families that have lost our loved ones to illegal aliens, and hopefully that will start happening.\nHANNITY: Yes. Well, when he specifically challenged the media, do you feel the media did justice in the case of you losing your child?\nROOT: I do here, locally, in Omaha and Council Bluffs, but I can't speak for any of the other victims who have lost loved ones. But I do think they did great for us locally, our local media did.\nHANNITY: Yes. Sabine, what is your take?\nSABINE DURDEN, SON DOMINIC KILLED BY AN ILLEGAL IMMIGRANT: My take is that my shattered heart is smiling tonight because I listened to our next president. I listened to President Donald Trump. And if he was in office, like many said, I would have my son with me, not his ashes.\nHANNITY: I know. I've had the chance to meet you and interview you now a number of times.\nDURDEN: Yes.\nHANNITY: I have such compassion for you, and sympathy for you.\nDURDEN: Thank you.\nHANNITY: You did not deserve what happened to you and your family, and it breaks our heart. And to see those mothers up there with Donald Trump, it is about time we ask these questions.\nDURDEN: Yes.\nHANNITY: I sat through a security briefing with Rick Perry, 642,000 crimes committed by illegal immigrants in Texas alone over a seven year period. I learned that in that briefing. That is unacceptable to this country. The cost of $113 billion a year is unacceptable. Both of you are in our prayers. I know about Mr. Trump. We're long tonight, and we didn't have enough time. But thank you, and we really appreciate it and you're in our prayers.\nDURDEN: Thank you, Sean, thank you so much.\nROOT: Thank you, Sean.\nHANNITY: She was just on stage with Donald Trump. Laura Wilkerson is back with us. I've known Laura now for a long time and she, too, has a tale to tell, one of the angel moms up there. Laura, thank you for being with us.\nLAURA WILKERSON, SON JOSH KILLED BY AN ILLEGAL IMMIGRANT: Thank you.\nHANNITY: What is it like for you, Laura, to have a presidential candidate, and I've known you now for a while. I think the world of you as well. And my prayers go out to you and all of those mothers up there. What did it mean to you to have a presidential candidate say this has got to stop? We can't keep losing children because our government is failing us this way?\nWILKERSON: You're absolutely right. It was so awesome to be here tonight. And I think Mr. Trump did not let us down one bit. He's doing what he said he would do, and I, for one, am fired up about it.\nHANNITY: I am sorry. I missed what you're saying. What is the last thing you said?\nWILKERSON: I said I'm absolutely fired up about it. He did what he said he was going to do, and I'm so excited about it.\nHANNITY: Yes. Tell us real briefly, Laura, what happened in your case with your family?\nWILKERSON: Sorry. Say that again?\nHANNITY: Tell everybody what happened.\nWILKERSON: Well, we were up there, standing behind stage while he was speaking, and we could hear what he was saying. And it is exactly what he promised us in the beginning. He had to get a plan down to implement. And I think he's done just that.\nHANNITY: Yes. Well, Laura, God bless you. You're in our prayers. Thank you for being with us. Very powerful moment tonight that you were a part of, thank you.\nJoining us now, Trump campaign surrogate, A.J. Delgado. A.J. I would argue probably for Donald Trump, political he looked presidential. He fit the role. He was with the president of Mexico. He was accepted and stood strong on his positions. You know, as I was watching him today I was thinking of President Obama's apology tour. And Donald Trump said three times, \"I love America. I love my country.\" Very different from what we've experienced the last eight years.\nA.J. DELGADO, TRUMP SURROGATE: You know, Sean, I have to be honest. I cried today watching him with President Nieto because he was every bit the president that I know he will be come January in the Oval Office. And then to top it off this outstanding immigration speech that was just a lifeline of hope and fairness to the American public just filled with optimism. It couldn't have been a better day. The only thing I'm disappointed is we have to wait until January to put this great man in office.\nHANNITY: Juan Williams is also with us. Hillary, she has flip-flopped on, let's see, driver's licenses, sanctuary cities, border security. She wanted to build a 700 mile fence. Health care benefits she's flipped on. She's flipped on undocumented immigrants and saying illegal immigrants. Wait a minute. This is your candidate. You love this woman. You saw those angel moms up there. We just had three of them on this program. They died because our country is not protecting our border what. What do you say to those moms, Juan?\nJUAN WILLIAMS, SENIOR EDITOR, THE HILL: What I say, you know what the news is not this, Sean. You're off the target. The target is that Donald Trump has not shifted, has not pivoted in terms of his stand on immigration. This is not outreach. He's giving red meat, again, to the Republican base.\n(CROSSTALK)\nDELGADO: I'm just telling you.\nHANNITY: I asked you, our government policies resulted in dead children as evidenced by those mothers and if our government.\nWILLIAMS: That is so --\nHANNITY: Wait a minute. I interviewed a guy from Michigan. His son, 21 years old, Donald Trump talked about him. I interviewed the father, killed. He was working at a Quick Mart at 4:00 in the morning. A guy who had raped a woman and kept her kidnapped for a week and our government let him back on the street. That is government failure.\nWILLIAMS: That is a failure but not a failure you would then use to demonize all illegal immigrants.\nHANNITY: Excuse me, Hillary wants a bridge, not a wall. Shall we build a wall?\nWILLIAMS: Are you going to kick out every American who has committed a crime?\n(CROSSTALK)\nWILLIAMS: The wall won't protect the mothers, Sean.\n(CROSSTALK)\nEven Donald Trump said tonight you've got to reform the system. If he wants something done, do it rationally. Don't just throw red meat and play --\nDELGADO: Juan? Juan? We don't need to import crime. Yes, there's crime here. We don't need to bring it in. And Hillary Clinton, Juan, tell me if you agree with the fact that Hillary Clinton has said she will only deport Quote: -unQuote: , \"violent criminal illegal aliens.\" You're OK with that? Somebody who had a DUI doesn't need to be deported and you're OK with that?\nHANNITY: Lisa Boothe, I've got to go to you. She's been standing by very patiently. Lisa, let's bring you in on this debate. I'm sorry. I wish we had more time.\nLISA BOOTHE, It's OK. Look, Hillary Clinton believes in lawlessness. We saw that at the Democratic National Convention. What she did was actually gave the stage to illegal immigrants. She has illegal immigrants working on her campaign on voter registration. That is her policy on immigration is lawlessness.\nHANNITY: She said she's going to expand on what Obama --\nBOOTHE: Exactly, lawlessness.\nHANNITY: And un-vetted refugees.\nWILLIAMS: You would never know that immigration boosts the American economy, helps the American --\nHANNITY: Tell that to the 95 million Americans --\nDELGADO: It brings down our wages.\nWILLIAMS: -- so many of our high-tech companies, you play the fair card time and again.\nHANNITY: And 95 million Americans out of the labor force, 11 million illegal immigrants competing for jobs, driving down wages, and it's a risk to national security.\n(CROSSTALK)\nWILLIAMS: No change --\n(CROSSTALK)\nHANNITY: That is all the time we have left this evening. Thanks for being with us. And we'll see you back here tomorrow night.\n ", "external_links": [], "published": "2016-08-31T03:00:00.000+03:00", "crawled": "2016-09-01T21:13:50.781+03:00", "highlightTitle": ""}