{"organizations": [], "uuid": "e048d2a4e849d894ad44163b17d0124bc7e1f62d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 14, "shares": 14, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/images.foxnews.com/content/fox-news/opinion/2016/09/20/call-to-action-on-world-refugee-day/_jcr_content/par/featured-media/media-0.img.jpg/0/0/1474298679158.jpg?ve=1", "site_section": "http://feeds.feedburner.com/foxnews/affiliates/kpth?format=xml", "section_title": "FOX News", "url": "http://www.foxnews.com/opinion/2016/09/20/call-to-action-on-world-refugee-day.html", "country": "US", "domain_rank": 185, "title": "A call to action on World Refugee Day", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "A call to action on World Refugee Day | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2016-09-20T03:00:00.000+03:00", "replies_count": 0, "uuid": "e048d2a4e849d894ad44163b17d0124bc7e1f62d"}, "author": "FoxNews.com", "url": "http://www.foxnews.com/opinion/2016/09/20/call-to-action-on-world-refugee-day.html", "ord_in_thread": 0, "title": "A call to action on World Refugee Day", "locations": [], "entities": {"persons": [{"name": "morgan ortagus", "sentiment": "negative"}, {"name": "samantha vinogram", "sentiment": "negative"}, {"name": "samantha vinograd", "sentiment": "none"}, {"name": "ghirda", "sentiment": "none"}], "locations": [{"name": "united states", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "greece", "sentiment": "none"}, {"name": "syria", "sentiment": "none"}, {"name": "idomeni", "sentiment": "none"}, {"name": "africa", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "central america", "sentiment": "none"}], "organizations": [{"name": "unicef", "sentiment": "none"}, {"name": "fox news", "sentiment": "none"}, {"name": "morgan ortagus", "sentiment": "none"}, {"name": "usa today", "sentiment": "none"}, {"name": "ap", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Morgan Ortagus, Samantha Vinogram \n  FILE- Migrant children play jumping on a muddy mattress at the northern Greek border point of Idomeni, Greece, Friday, March 18, 2016.  (AP Photo/Vadim Ghirda) \nAs the school year kicks off and the presidential campaign swings into high gear, many American kids are seeing their global counterparts (via the news or social media)  — hungry, alone and scared — in countries like Syria, Central America, Africa and elsewhere.  \nWe would be hard pressed to find anyone whose heart didn’t ache when these images flash across the screen.  But American policy towards refugees, here and abroad, is as divisive as ever and millions of children remain unwilling pawns in civil wars and political games.\nIn a report published in early September, UNICEF estimates that an astounding 50 million children around the world have been uprooted.   In Europe alone, UNICEF has also estimated that nearly 100,000 unaccompanied children applied for asylum. The USA Today reported that in Europe alone, 26,000 unaccompanied children entered Europe.\nAmerican children likely can’t help but see on the news, images of their global counterparts in countries like Syria, Central America, Africa, and elsewhere hungry, alone, and scared.  It would be hard to find someone whose heart didn’t ache when these images flash across the screen.\nWhen civil wars go unresolved, refugee and migrant children may be hurt or killed by violence, lose their parents, may have to flee their homes or countries, risk danger, trafficking and exploitation on their journeys to safety, and will go without education, leaving them vulnerable and susceptible to radical influences. \nWhen civil wars go unresolved, refugee and migrant children may be hurt or killed by violence, lose their parents, may have to flee their homes or countries, risk danger, trafficking and exploitation on their journeys to safety, and will go without education, leaving them vulnerable and susceptible to radical influences.  \nThis is a major humanitarian, economic, and security risk. Republicans and Democrats will disagree on how to handle this situation and the war in Syria, but as individuals we can still help vulnerable children.\nNo matter what your political affiliation, this dire situation should prompt us to act to protect these defenseless children. While both parties may disagree on policy related to resettlement to the United States, the enormity of the child refugee problem can make us begin to question what we -- as individuals -- can actually do. Here are some concrete steps we can all take:\nFirst, our children can take action. They represent important voices for kids their age around the world. \nIn our schools, collecting money to support programs for displaced children run by charities like UNICEF is a great option.  Kids can volunteer with organizations that help to educate about issues facing vulnerable children globally and how they can play a role in advocating for those kids.   \nThey can work with teachers on letter writing campaigns to their elected officials to call attention to the urgent needs of children in the developing world.  \nThis dissemination of knowledge is empowering- educating our children about global citizenship and child rights engages them in an exploration of humanitarian issues and can inspire them to take action to improve their world.\nSecond, as adults, we have the opportunity to push our schools to urge students to learn about the world around them. Naturally some images and topics will be too disturbing, but there is valuable content that can be part of a curriculum. This will not only educate kids but also perhaps lay the groundwork for future action as they grow and mature.  \nThird, policymakers also have a critical role to play. As individuals we should push them to design policies that focus on the needs of vulnerable children globally and address the civil wars that are the pervasive cause of displaced children.\nIt’s time for all of us to do more to protect the world’s most vulnerable children. Let’s not lose any more time.\nMorgan Ortagus and Samantha Vinograd and are leading advocates of the U.S. Fund for UNICEF. Both have served in various capacities for the U.S. government both domestically and abroad. Morgan Ortagus is also a Fox News contributor.", "external_links": [], "published": "2016-09-20T03:00:00.000+03:00", "crawled": "2016-09-20T08:29:02.583+03:00", "highlightTitle": ""}