{"organizations": [], "uuid": "040e8c421e6edcdef37e83a068eca61e5a9cabe1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 12, "shares": 12, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/news/0/0/Immigrant%20Drivers%20arizona%20latino.jpg", "site_section": "http://feeds.latino.foxnews.com/home/feed", "section_title": "FOX News", "url": "http://latino.foxnews.com/latino/politics/2016/09/16/opponents-az-immigration-law-agree-to-deal-allowing-officers-to-question-status/", "country": "US", "domain_rank": 185, "title": "Opponents of AZ immigration law agree to deal allowing officers to question status", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "Opponents of AZ immigration law agree to deal allowing officers to question status | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2016-09-16T03:00:00.000+03:00", "replies_count": 0, "uuid": "040e8c421e6edcdef37e83a068eca61e5a9cabe1"}, "author": "Fox News Latino", "url": "http://latino.foxnews.com/latino/politics/2016/09/16/opponents-az-immigration-law-agree-to-deal-allowing-officers-to-question-status/", "ord_in_thread": 0, "title": "Opponents of AZ immigration law agree to deal allowing officers to question status", "locations": [], "entities": {"persons": [{"name": "wang", "sentiment": "none"}, {"name": "cecillia wang", "sentiment": "none"}, {"name": "brnovich", "sentiment": "none"}, {"name": "mark brnovich", "sentiment": "none"}], "locations": [{"name": "phoenix", "sentiment": "none"}, {"name": "arizona", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}], "organizations": [{"name": "ap", "sentiment": "negative"}, {"name": "u.s. supreme court", "sentiment": "none"}, {"name": "facebook  follow us on twitter & instagram", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "  ap \nPHOENIX (AP) –   A coalition of civil rights groups agreed to end its challenge of Arizona's landmark 2010 immigration law in a deal in which the state issued guidelines on how police officers must enforce the law's most contentious section.\nThe agreement unveiled Thursday ends the last of seven challenges to the law that was criticized for requiring officers, while enforcing other laws, to question the immigration status of people suspected of being in the country illegally.\nCourts barred enforcement of other sections of the law, but the questioning requirement was ultimately upheld by the U.S. Supreme Court, despite racial profiling concerns raised by critics of the statute.\nThe enforcement guidelines, issued by Arizona Attorney General Mark Brnovich's office, include a requirement that officers document the reasons for their suspicion that a particular person is in the country illegally.\nThe guidelines say local and state officers generally lack the power to detain people for civil immigration violations and forbid officers from prolonging traffic stops and detentions solely for the purpose of verifying a person's immigration status.\nOfficers would have the discretion not to check people's immigration status if doing so prolongs detentions, hinders investigations or isn't practical because of emergencies, the unavailability of backup officers and other factors.\nOpponents of the law said the changes bring accountability to the enforcement of the statute and said the law is now a watered down version of what it once was.\nArizona Attorney General Mark Brnovich emphasized in a statement that the agreement means the questioning requirement remains in the law.\n\"Our goal while negotiating this settlement was to find a common sense solution that protects Arizona taxpayers while helping our great state move forward,\" Brnovich said.\nCecillia Wang, one of the lawyers who pressed the challenge, said the requirement that officers document the reasons for questioning people about their immigration status brings accountability to the law.\n\"It gives us the hook to investigate cases where a cop actually does cross the line,\" Wang said.\nThe law grew out of a movement formed a decade ago over Arizona's frustrations with federal enforcement of the state's border with Mexico. Proponents of toughening enforcement wanted local police officers to break from tradition and start confronting illegal immigration.\nWhen the law was passed in 2010, it touched off a national furor with supporters calling for similar legislation for their own states and detractors calling for an economic boycott of Arizona.\nIn the end, the courts barred enforcement of the law's requirement that immigrants carry registration papers. It also blocked enforcement of a provision aimed at immigrants that prohibited people blocking traffic when offering or seeking day-labor services on streets.\nAs part of the agreement, the state also agreed to pay $1.4 million in attorney fees and other costs to the coalition.\nThe coalition agreed to drop its appeal of a September 2015 lower-court decision that dismissed the coalition's challenge and concluded the law's critics failed to show police would enforce the law differently for Latinos than it would for people of other ethnicities.\nSeveral of Arizona's other immigration laws have been thrown out by the courts in recent years.\nThe state's immigrant smuggling ban was struck down in 2014 after a judge concluded it conflicted with the federal government's immigration powers.\nA voter-approved law that denied bail to immigrants who are in the U.S. illegally and charged with certain crimes was thrown by an appeals court that ruled in 2014 that it violated due-process rights by imposing punishment before trial.\nLike us on Facebook \nFollow us on Twitter & Instagram", "external_links": [], "published": "2016-09-16T03:00:00.000+03:00", "crawled": "2016-09-16T15:29:40.117+03:00", "highlightTitle": ""}