{"organizations": [], "uuid": "77d13bb9ca1ddf8b93a8842126e7cfe6b43e3cac", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "latino.foxnews.com", "main_image": "http://global.fncstatic.com/static/v/all/img/fn_latino_128x128.png", "site_section": "", "section_title": "", "url": "http://latino.foxnews.com/latino/entertainment/2016/09/21/sigourney-weaver-strong-women-also-have-vulnerable-side/", "country": "US", "domain_rank": 185, "title": "Sigourney Weaver: Strong women also have a vulnerable side | Fox News Latino", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Sigourney Weaver: Strong women also have a vulnerable side | Fox News Latino", "spam_score": 0.571, "site_type": "news", "published": "2016-09-22T02:15:00.000+03:00", "replies_count": 0, "uuid": "77d13bb9ca1ddf8b93a8842126e7cfe6b43e3cac"}, "author": "", "url": "http://latino.foxnews.com/latino/entertainment/2016/09/21/sigourney-weaver-strong-women-also-have-vulnerable-side/", "ord_in_thread": 0, "title": "Sigourney Weaver: Strong women also have a vulnerable side | Fox News Latino", "locations": [], "entities": {"persons": [{"name": "sigourney weaver", "sentiment": "negative"}, {"name": "neill blomkamp", "sentiment": "none"}, {"name": "jim cameron", "sentiment": "none"}, {"name": "ang lee", "sentiment": "none"}, {"name": "jane hamilton", "sentiment": "none"}, {"name": "j.a. bayona", "sentiment": "none"}, {"name": "david fincher", "sentiment": "none"}, {"name": "ridley scott", "sentiment": "none"}, {"name": "ellen ripley", "sentiment": "none"}, {"name": "cameron", "sentiment": "none"}, {"name": "roman polanski", "sentiment": "none"}, {"name": "magdalena tsanis", "sentiment": "none"}, {"name": "scott elliott", "sentiment": "none"}, {"name": "peter weir", "sentiment": "none"}, {"name": "ripley", "sentiment": "none"}, {"name": "weaver", "sentiment": "none"}, {"name": "meryl streep", "sentiment": "none"}, {"name": "diane fossey", "sentiment": "none"}], "locations": [{"name": "san sebastian", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "ripley", "sentiment": "none"}, {"name": "hollywood", "sentiment": "none"}, {"name": "rwanda", "sentiment": "none"}], "organizations": [{"name": "efe  san seb", "sentiment": "neutral"}, {"name": "stanford", "sentiment": "none"}, {"name": "yale school of drama", "sentiment": "none"}, {"name": "efe", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Sigourney Weaver: Strong women also have a vulnerable side Published September 21, 2016 EFE \nSan Sebastian – Sigourney Weaver's career has been marked by two main factors: her height (1.83 meters, or 6 feet) and the role that changed her life, that of Warrant Officer Ellen Ripley in Ridley Scott's 1979 classic blockbuster \"Alien.\" \nThe Manhattan-born 66-year-old actor granted an exclusive interview to EFE hours before receiving the Donostia Award in the San Sebastian Film Festival, where her latest film, \"A Monster Calls\" by Spanish director J.A. Bayona, saw its European premiere _ as part of the Official Selection, but out of competition _ on Tuesday. \nIn the interview, Weaver said she was used to playing strong lead roles, as she was too tall for more conventional love stories. \n\"Part of the reason I've been given these parts is that I'm so tall that people don't give me love stories to do _ or very rarely _ and I'm not playing the girlfriend or the sidekick,\" she said. \n\"I take up so much room that they have to give me an interesting part,\" the triple Academy Award nominee added. \nApart from her legendary portrayal of Ripley, Weaver has played on the silver screen fierce women such as American primatologist Diane Fossey in \"Gorillas in the Mist\" (1988) and an ambitious Wall Street executive in the 1988 rom-com \"Working Girl.\" \n\"Are these women strong? Yes, in many ways they are,\" Weaver said. \n\"I've often played women who were conflicted and very isolated, like Diane Fossey, who lived in Rwanda for many years. At the same time she was a very fragile person, a very vulnerable person,\" she added. \n\"So I don't think that's the whole story when you play a strong woman. Yes, they don't give up, because there's no one to help them, but it's usually a more complicated set of facts than that,\" Weaver concluded. \nThe veteran thespian, who has worked with the likes of Ridley Scott, David Fincher, Peter Weir, Roman Polanski and Ang Lee, has starred in acclaimed films such as \"The Year of Living Dangerously\" (1982), \"Death and the Maiden\" (1994) and \"The Ice Storm\" (1997). \nIt was the \"Alien\" saga, however _ to which she is set to return in Neill Blomkamp's upcoming sequel _ that catapulted Weaver to fame as the first modern female action hero. \n\"I was very fortunate to play a character like Ripley, because she is sort of an everyman character, a realistic person in the world of the future,\" she said in the interview. \n\"Science fiction is one of these genres that I don't think is held in high esteem, and yet it is an area in where people get to imagine life in the future, which I think is very compelling,\" Weaver added. \n\"In America, it's a space where people kind of expect a lot of special effects, or 'transformers' and stuff like that, and it really isn't about that: as Jim Cameron said, it's about what it means to be human.\" \nShe added that this makes Ripley's character still relevant in some way, because \"that future hasn't happened yet; now we're in a world where women would have those jobs, but at that time, she was ahead.\" \nWeaver is set to once again work under Cameron's direction in the upcoming three \"Avatar\" sequels. \nThe daughter of a TV executive and a former British actress, Weaver studied English Literature at Stanford and Acting at the Yale School of Drama, where she coincided with Meryl Streep. \nAsked about why she decided to enter the acting profession, she said: \"I had a very shallow reason, really; I thought it was fun. I didn't know what else to do.\" \n\"I couldn't decide whether I wanted to be a marine biologist or a journalist, or this or that; and I thought, well, I'll just be an actor for a while, and eventually I'll play a role and I'll go 'Oh, that's what I should be doing.'\" \nThat moment, of course, never came, as Weaver has continued being a prominent star in Hollywood ever since \"Alien\" shattered the box office. \n\"It's a great job, because you work all over the world, you meet people from all over the world, and I do believe that what we do, being storytellers, is of service to people.\" \n\"I feel that films are potentially very illuminating, transforming, at least an escape... and I consider it _ whatever its problems _ a great industry,\" she declared. \nThis is the third time Weaver has been to San Sebastian. In 1979, she presented \"Alien\" and, exactly two decades later, Scott Elliott's adaptation of the Jane Hamilton novel \"A Map of the World.\" \nBy Magdalena Tsanis ", "external_links": [], "published": "2016-09-22T02:15:00.000+03:00", "crawled": "2016-09-21T21:41:12.513+03:00", "highlightTitle": ""}