{"organizations": [], "uuid": "5248369db769a5c7c51ce227c30c9482f3b38f47", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 6, "shares": 6, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/news/0/0/Iowa%20Child%20Migrants.jpg", "site_section": "http://feeds.latino.foxnews.com/home/feed", "section_title": "FOX News", "url": "http://latino.foxnews.com/latino/politics/2016/09/21/federal-appeals-court-rejects-lawsuit-over-lawyers-for-unaccompanied-minors/", "country": "US", "domain_rank": 185, "title": "Federal appeals court rejects lawsuit over lawyers for unaccompanied minors", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "Federal appeals court rejects lawsuit over lawyers for unaccompanied minors | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2016-09-21T03:00:00.000+03:00", "replies_count": 0, "uuid": "5248369db769a5c7c51ce227c30c9482f3b38f47"}, "author": "Fox News Latino", "url": "http://latino.foxnews.com/latino/politics/2016/09/21/federal-appeals-court-rejects-lawsuit-over-lawyers-for-unaccompanied-minors/", "ord_in_thread": 0, "title": "Federal appeals court rejects lawsuit over lawyers for unaccompanied minors", "locations": [], "entities": {"persons": [{"name": "john moore/getty images", "sentiment": "negative"}, {"name": "mckeown", "sentiment": "none"}, {"name": "eric holder", "sentiment": "none"}, {"name": "barack obama", "sentiment": "none"}, {"name": "milan smith jr.", "sentiment": "none"}, {"name": "thomas zilly", "sentiment": "none"}, {"name": "mary margaret mckeown", "sentiment": "none"}, {"name": "matt adams", "sentiment": "none"}], "locations": [{"name": "united states", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "southern california", "sentiment": "none"}, {"name": "seattle", "sentiment": "none"}, {"name": "central america", "sentiment": "none"}], "organizations": [{"name": "northwest immigrant rights project", "sentiment": "none"}, {"name": "associated press", "sentiment": "none"}, {"name": "congress", "sentiment": "none"}, {"name": "9th u.s. circuit court of appeals", "sentiment": "none"}, {"name": "american civil liberties union", "sentiment": "none"}, {"name": "district court", "sentiment": "none"}, {"name": "facebook  follow us on twitter & instagram", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "  (Photo by John Moore/Getty Images) \nA federal appeals court rejected a class-action lawsuit that would have forced the federal government to provide lawyers to unaccompanied minors arriving at the U.S. border.\nThe lawsuit was filed two years ago in Seattle by immigrant rights advocates following a flood of children, mostly from Central America, who were illegally crossing the border. It sought to force the government to appoint lawyers for the children since immigration judges don't have that authority now.\nU.S. District Judge Thomas Zilly ruled that the children could pursue their claims that being denied lawyers violated their due-process rights, but three judges from the 9th U.S. Circuit Court of Appeals overturned that decision. The appeals court panel said federal immigration law precludes such claims from being filed in U.S. District Court.\nInstead, the judges said, such claims must be brought individually and filed directly in federal appeals courts after deportations proceedings are exhausted.\n\"I cannot let the occasion pass without highlighting the plight of unrepresented children who find themselves in immigration proceedings,\" Judge Mary Margaret McKeown wrote in a concurrence to her own unanimous opinion for the panel. \"I write to underscore that the Executive and Congress have the power to address this crisis without judicial intervention. What is missing here? Money and resolve — political solutions that fall outside the purview of the courts.\"\nAdvocates for the children, including the Northwest Immigrant Rights Project and the American Civil Liberties Union chapters of Washington state and Southern California, said they would seek a new hearing with more judges. They say it's unreasonable to expect children who are ordered deported to then file an appeal, file briefs with arguments, obtain a final order on appeal, and then bring their case to a federal appeals court — the point at which they would be allowed to raise the issue that being deprived of a lawyer violated their rights.\n\"Unrepresented kids aren't able to go through that process. They don't have the capacity,\" said Matt Adams, legal director of the Northwest Immigrant Rights Project. \"On the one hand the judges recognize the gravity of the situation. But the court has the responsibility to resolve an issue where there's no other meaningful forum. You can't duck the matter by saying, 'Well Congress can fix this, the president can fix it.'\"\nMore than 60,000 unaccompanied minors arrived in the United States in the 2014 fiscal year, many of them fleeing violence in Central America. The numbers dipped in 2015 before jumping again this year. Former U.S. Attorney General Eric Holder said the nation has a moral obligation to provide the children with lawyers for immigration proceedings, even if they aren't constitutionally entitled to one, and President Barack Obama's administration has taken some steps to improve representation, such as by spending $1.8 million on living expenses for 100 legal fellows who focus on such cases around the country.\nNevertheless, McKeown wrote, such measures are merely a drop in the bucket: Tens of thousands of children remain unrepresented.\nMcKeown suggested that eventually, cases that are properly brought will reach the appeals court, at which point judges can consider the merits of the children's claims. But in her concurrence, also signed by Judge Milan Smith Jr., she urged Congress and the president not to wait that long.\n\"The stakes are too high,\" she said.\nBased on reporting by The Associated Press. \nLike us on Facebook \nFollow us on Twitter & Instagram", "external_links": [], "published": "2016-09-21T03:00:00.000+03:00", "crawled": "2016-09-21T20:14:26.611+03:00", "highlightTitle": ""}