{"organizations": [], "uuid": "22b97fae4eaf7633894eaad749d270dc8bb83469", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/images.foxnews.com/content/fox-news/world/2016/09/13/latest-romanian-tv-2-migrants-die-in-danube-capsizing/_jcr_content/par/featured-media/media-0.img.jpg/0/0/1473771764648.jpg?ve=1", "site_section": "http://feeds.foxnews.com/foxnews/world", "section_title": "FOX News", "url": "http://www.foxnews.com/world/2016/09/13/latest-romanian-tv-2-migrants-die-in-danube-capsizing.html", "country": "IT", "domain_rank": 185, "title": "The Latest: Romanian TV: 2 migrants die in Danube capsizing", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "The Latest: Romanian TV: 2 migrants die in Danube capsizing | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2016-09-13T03:00:00.000+03:00", "replies_count": 0, "uuid": "22b97fae4eaf7633894eaad749d270dc8bb83469"}, "author": "Associated Press", "url": "http://www.foxnews.com/world/2016/09/13/latest-romanian-tv-2-migrants-die-in-danube-capsizing.html", "ord_in_thread": 0, "title": "The Latest: Romanian TV: 2 migrants die in Danube capsizing", "locations": [], "entities": {"persons": [{"name": "jonquil nicholl", "sentiment": "none"}, {"name": "newman otas", "sentiment": "none"}, {"name": "szijjarto", "sentiment": "none"}, {"name": "jean asselborn", "sentiment": "none"}, {"name": "asselborn", "sentiment": "none"}, {"name": "kofi annan", "sentiment": "none"}, {"name": "euler", "sentiment": "none"}, {"name": "anne hidalgo", "sentiment": "none"}, {"name": "nelson mandela", "sentiment": "none"}, {"name": "manuela carmena", "sentiment": "none"}, {"name": "peter szijjarto", "sentiment": "none"}], "locations": [{"name": "danube", "sentiment": "none"}, {"name": "serbia", "sentiment": "none"}, {"name": "greece", "sentiment": "none"}, {"name": "athens", "sentiment": "none"}, {"name": "turkey", "sentiment": "none"}, {"name": "madrid", "sentiment": "none"}, {"name": "luxembourg", "sentiment": "none"}, {"name": "libya", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "sofia", "sentiment": "none"}, {"name": "hungary", "sentiment": "none"}, {"name": "mediterranean", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "athens", "sentiment": "none"}, {"name": "ankara", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}, {"name": "romania", "sentiment": "none"}, {"name": "mediterranean sea", "sentiment": "none"}, {"name": "bulgaria", "sentiment": "none"}, {"name": "bratislava", "sentiment": "none"}, {"name": "river danube", "sentiment": "none"}, {"name": "sabratha", "sentiment": "none"}, {"name": "ritsona", "sentiment": "none"}], "organizations": [{"name": "coast guard", "sentiment": "none"}, {"name": "u.n.", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "samos", "sentiment": "none"}, {"name": "associated press", "sentiment": "none"}, {"name": "ap photo/petros giannakouris", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "frontex", "sentiment": "none"}, {"name": "ap", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "  In this photo taken on Saturday Sept. 10, 2016, African refugees and migrants wait aboard a partially punctured rubber boat to be assisted, during a rescue operation on the Mediterranean Sea, about 13 miles North of Sabratha, Libya. (AP Photo/Santi Palacios)   \nA little girl runs among tents at Ritsona refugee camp which hosts about 600 refugees and migrants, north of Athens, Monday, Sept. 12, 2016. The European Union will add 115 million euros ($129 million) in funding to humanitarian organizations in Greece to assist programs for refugees and migrants before the winter, officials said Saturday. (AP Photo/Petros Giannakouris)   \nMayor of Paris Anne Hidalgo, left, points the direction to Mayor of Madrid Manuela Carmena as they visit a construction site of a reception center for migrants in Paris, Monday, Sept. 12, 2016. A new reception center for migrants in the French capital, is scheduled to open next month, in an unusual and controversial effort to cope with Europe's migrant crisis. (AP Photo/Michel Euler)   ATHENS, Greece –   The Latest on Europe's migration crisis (all times local):\n2:45 p.m.\nA Romanian television station is reporting that two migrants, including a 5-year-old boy, have drowned and six are missing after their boat sank last week crossing the River Danube from Bulgaria to Romania.\nRomanian television Digi24, reporting from Bulgaria on Tuesday, says the bodies were found in the Bulgarian waters of the Danube after their boat capsized on Thursday. Authorities are searching for six others in the river, which forms part of the border between Bulgaria and Romania.\nThe station reported that another four migrants were rescued and were taken to the Bulgarian capital, Sofia. The station said the migrants had come from Turkey and were trying to avoid Serbia, where border controls have been tightened up.\nThe station reported authorities found the body of a 5-year-old boy and a teenager on Sunday.\nBorder police in the Bulgarian port of Ruse didn't immediately respond to calls from The Associated Press. Romanian border police on the other side of the Danube declined to comment.\n___\n1:45 p.m.\nA group of senior international diplomats has harshly criticized the European Union's deal with Turkey to send back migrants in return for financial aid, calling it a \"bad example\" to other countries.\nThe Elders, a global human rights group founded by the late Nelson Mandela, say the agreement between Brussels and Ankara \"is morally dubious\" and may be illegal under international law.\nIn a report published Tuesday, they say the deal \"sets a troubling precedent\" that other countries with bad human rights records may use to demand payment in return for preventing migrants from traveling to Europe.\nFormer U.N. Secretary-General Kofi Annan said the group was \"raising the alarm\" about the agreement and compared it to the way civil liberties had been curtailed around the world after the 9/11 attacks.\n___\n12:55 p.m.\nHungary's foreign minister rebuked his Luxembourg counterpart, who said that Hungary should be temporarily or even permanently expelled from the European Union over its approach to refugees and other issues.\nPeter Szijjarto said Luxembourg Foreign Minister Jean Asselborn was \"a frivolous figure.\"\nHungary is holding a government-sponsored referendum Oct. 2 seeking support for rejecting any future EU plan to resettle migrants among member states.\nSzijjarto said the referendum would give Hungarians the opportunity to voice their opinion about \"illegal immigrants, Brussels' quota package and the Jean Asselborn-type figures.\"\n___\n11 a.m.\nJust 24 hours after his family was rescued from an overcrowded rubber boat, a baby boy has been born aboard a rescue vessel in the Mediterranean Sea.\nDoctors Without Borders, one of the operators of the rescue ship Aquarius, said the boy was born to Nigerian parents in international waters Monday morning. He was named Newman Otas.\nJonquil Nicholl, a midwife with the aid group who delivered the baby, said it was \"a very normal birth in dangerously abnormal conditions.\"\nParents Otas and Faith and older brothers Victory and Rollres were rescued from a rubber boat trying to cross the Mediterranean from Libya a day previously.\nThe baby's mother said she was panicking before the rescue that she would go into labor, and had been having contractions for three days.\n___\n9:35 a.m.\nLuxembourg's foreign minister says Hungary should be temporarily or even permanently expelled from the European Union over its approach to refugees and other issues.\nJean Asselborn's comments in German daily Die Welt came days before 27 EU leaders meet in Bratislava to discuss the bloc's future. He said the EU can't tolerate fundamental values being violated.\nAsselborn was quoted Tuesday as saying: \"Anyone who, like Hungary, builds fences against refugees from war or who violates press freedom and judicial independence should be excluded temporarily, or if necessary for ever, from the EU.\" He argued it's the only way to \"preserve the cohesion and values of the European Union.\"\nHungary is holding a government-sponsored referendum Oct. 2 seeking support for rejecting any future EU plan to resettle migrants among member states.\n___\n9:30 a.m.\nGreece's coast guard says a search and rescue operation is underway for dozens of migrants on board a boat near the Greek island of Samos, after someone on board called emergency services.\nThe coast guard said a helicopter and vessel from the European border patrol agency Frontex and a coast guard vessel are searching north of Samos for the vessel, which the caller said was carrying about 40 people.\nThe short but often-dangerous crossing from the Turkish coast to nearby Greek islands has been the preferred route for more than a million refugees and migrants hoping for better lives in the European Union. But an EU deal with Turkey reached in March and Balkan border closures have severely restricted the flow.", "external_links": [], "published": "2016-09-13T03:00:00.000+03:00", "crawled": "2016-09-13T16:39:26.709+03:00", "highlightTitle": ""}