{"organizations": [], "uuid": "8787530f1e1ca50704785de7ab3a47cde587f569", "thread": {"social": {"gplus": {"shares": 2}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 23, "shares": 23, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/images.foxnews.com/content/fox-news/opinion/2016/09/06/phyllis-schlafly-was-conservative-movement-s-mother-superior-here-s-how-got-her-to-laugh/_jcr_content/par/featured-media/media-0.img.jpg/0/0/1473183662353.jpg?ve=1", "site_section": "http://www.foxnews.com/", "section_title": "Fox News - Breaking News Updates | Latest News Headlines | Photos &amp; News Videos", "url": "http://www.foxnews.com/opinion/2016/09/06/phyllis-schlafly-was-conservative-movement-s-mother-superior-here-s-how-got-her-to-laugh.html", "country": "IT", "domain_rank": 185, "title": "Phyllis Schlafly was the conservative movement’s Mother Superior. Here’s how I got her to laugh", "performance_score": 0, "site": "foxnews.com", "participants_count": 11, "title_full": "Phyllis Schlafly was the conservative movement’s Mother Superior. Here’s how I got her to laugh | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2016-09-06T03:00:00.000+03:00", "replies_count": 10, "uuid": "8787530f1e1ca50704785de7ab3a47cde587f569"}, "author": "FoxNews.com", "url": "http://www.foxnews.com/opinion/2016/09/06/phyllis-schlafly-was-conservative-movement-s-mother-superior-here-s-how-got-her-to-laugh.html", "ord_in_thread": 0, "title": "Phyllis Schlafly was the conservative movement’s Mother Superior. Here’s how I got her to laugh", "locations": [], "entities": {"persons": [{"name": "phy", "sentiment": "negative"}, {"name": "phyllis schlafly", "sentiment": "negative"}, {"name": "arthur herman", "sentiment": "negative"}, {"name": "phyllis", "sentiment": "none"}, {"name": "aristotle", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "reuters/aaron p. bernstein", "sentiment": "none"}, {"name": "bush", "sentiment": "none"}, {"name": "larry elder", "sentiment": "none"}, {"name": "schlafly", "sentiment": "none"}, {"name": "mother superior", "sentiment": "none"}, {"name": "rush limbaugh", "sentiment": "none"}, {"name": "goldwater", "sentiment": "none"}, {"name": "sean hannity", "sentiment": "none"}, {"name": "g. gordon liddy", "sentiment": "none"}, {"name": "ronald reagan", "sentiment": "none"}, {"name": "gandhi", "sentiment": "none"}, {"name": "hersheys", "sentiment": "none"}, {"name": "pat buchanan", "sentiment": "none"}, {"name": "schafly", "sentiment": "none"}, {"name": "douglas macarthur", "sentiment": "none"}, {"name": "brian kilmeade", "sentiment": "none"}], "locations": [{"name": "america", "sentiment": "none"}, {"name": "d.c", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "hershey", "sentiment": "none"}, {"name": "hudson institute", "sentiment": "none"}, {"name": "economist", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "random house", "sentiment": "none"}, {"name": "british navy", "sentiment": "none"}, {"name": "new york times", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Arthur Herman\n FoxNews.com livefyre Email Print FILE -- March 11, 2016: Conservative activist Phyllis Schlafly introduces Republican presidential candidate Donald Trump at the (REUTERS/Aaron P. Bernstein)\nBefore there was Rush Limbaugh, before Sean Hannity, Pat Buchanan and even before Ronald Reagan, there was Phyllis Schlafly.\nFor half a century, she stood rock solid on conservative principles. She single-handedly turning America’s rightwing into a powerful political movement, one that saved our country from disappearing completely down the social and intellectual rat hole known as liberalism.\nI was fortunate enough to see another side of Phyllis Schlafly, one the media won’t mention but with a perspective I won’t forget.\nShe was the Mother Superior of the conservative movement: stern, utterly consistent, unyielding in her adherence to the principles that the Goldwater campaign of 1964 had symbolized and that would eventually put Ronald Reagan into the White House. Those principles were a commitment to limited government, the rule of law and constitutional principles, and a strong America aboard and a morally virtuous America at home: the bedrock of American conservatism that Schlafly fought for all her life.\nJust as Rush Limbaugh turned AM radio into a tool for conservative ideas, Phyllis Schlafly turned direct mail into a potent tool for promoting and extending that conservative faith. And when Republicans turned away from that faith, as they did during the Bush years—particularly on illegal immigration--they felt the sting of the Mother Superior’s steel ruler across their knuckles.\nShe was utterly fearless and utterly consistent and not a little intimidating in person, which I discovered first hand when meeting her at a conference a few years ago.\nI was there to sign copies of my book \" Freedom’s Forge ,\" about how American businessmen built the arsenal of democracy that sustained America and the Allies during World War Two, and eventually won the war. She was immediately intrigued, bought a copy and had me inscribe it.\nA few days later I got a call from her producer: Phyllis Schlafly wanted to discuss \" Freedom’s Forge \" on her radio show. I had done many radio shows in the past—Larry Elder, Sean Hannity, Brian Kilmeade, G. Gordon Liddy, even Rush Limbaugh had read excerpts from one of my books on the air—but this invitation was special.\nWe had a wonderful time. Afterwards Phyllis called me up to thank me and tell me how much she enjoyed doing the show.\nThe highlight of the interview came at the very end, when Phyllis asked me if I had any stories about the arsenal of democracy that weren’t in the book. I told the story about Hersheys and D Rations, the special rations that were to be issued to airmen and sailors to insert in their life vests, in case they had to ditch in the ocean or abandon ship that would keep them alive for two or more days when there was no other food or water. The navy scientists thought about a chocolate bar and approached the Hershey company, which was already shipping hundreds of thousands of chocolate bars to American service personnel around the world.\nCould Hershey make the D ration bar, they asked, but with one stipulation: it had to have the taste of boiled potatoes, so that service men wouldn’t be tempted to eat the D Ration instead of leaving it in their vests.\nThe Hershey executives had never been asked before to produce a chocolate that tasted terrible, I told Schafly and her audience, but they put on a straight face and said yes, they could figure out how to do it, and did—producing D Rations by the billions.\nWhen I finished the story, Phyllis Schlafly laughed so loud and long she could barely close out the show.\nYes, I actually heard Phyllis Schlafly laugh. It’s a memory I always treasure, just as America should and will always treasure this remarkable, fearless icon.\nHistorian Arthur Herman is a senior fellow at the Hudson Institute in Washington, D.C. He is author of eight books, including New York Times bestseller \"How the Scots Invented the Modern World\" (2001); the Pulitzer Prize Finalist \"Gandhi and Churchill\"(2008); \"To Rule the Waves: How the British Navy Shaped the Modern World\" (nominated for the UK's Mountbatten Prize); and the highly acclaimed \"Freedom's Forge: How American Business Produced Victory in World War II,\" which The Economist magazine picked as one of the Best Books of 2012, as well as \" The Cave and the Light: Plato Versus Aristotle, and the Struggle for the Soul of Western Civilization \" (Random House 2013). His latest book, \" Douglas MacArthur: American Warrior \", was released by Random House on June 14. A Senior Fellow at the Hudson Institute, he can be reached on Twitter @ArthurLHerman.", "external_links": ["http://www.amazon.com/exec/obidos/ASIN/0812982045", "https://w.graphiq.com/w/41VWBTudNeB", "http://www.hudson.org/about", "http://www.amazon.com/exec/obidos/ASIN/0812994884", "http://www.amazon.com/exec/obidos/ASIN/0553807307"], "published": "2016-09-06T03:00:00.000+03:00", "crawled": "2016-09-06T23:39:29.757+03:00", "highlightTitle": ""}