{"organizations": [], "uuid": "e35961821757dfdaeea8865a8dcef8370f1c9096", "thread": {"social": {"gplus": {"shares": 3}, "pinterest": {"shares": 1}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 184, "shares": 184, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/politics/0/0/arizona%20licenses%20immigration.jpg", "site_section": "http://feeds.latino.foxnews.com/home/feed", "section_title": "FOX News", "url": "http://latino.foxnews.com/latino/politics/2016/09/14/group-sues-arizona-for-denying-driver-licenses-to-immigrants-who-may-qualify/", "country": "US", "domain_rank": 185, "title": "Group sues Arizona for denying driver's licenses to immigrants who may qualify | Fox News Latino", "performance_score": 1, "site": "foxnews.com", "participants_count": 1, "title_full": "Group sues Arizona for denying driver's licenses to immigrants who may qualify | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2016-09-14T03:00:00.000+03:00", "replies_count": 0, "uuid": "e35961821757dfdaeea8865a8dcef8370f1c9096"}, "author": "Fox News Latino", "url": "http://latino.foxnews.com/latino/politics/2016/09/14/group-sues-arizona-for-denying-driver-licenses-to-immigrants-who-may-qualify/", "ord_in_thread": 0, "title": "Group sues Arizona for denying driver's licenses to immigrants who may qualify | Fox News Latino", "locations": [], "entities": {"persons": [{"name": "daniel scarpinato", "sentiment": "none"}, {"name": "victor viramontes", "sentiment": "none"}, {"name": "jan brewer", "sentiment": "none"}, {"name": "doug ducey", "sentiment": "none"}, {"name": "viramontes", "sentiment": "none"}], "locations": [{"name": "arizona", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "fox news latino", "sentiment": "negative"}, {"name": "associated press", "sentiment": "none"}, {"name": "deferred action for childhood arrivals", "sentiment": "none"}, {"name": "mexican american legal defense and educational fund", "sentiment": "none"}, {"name": "facebook  follow us on twitter & instagram", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Published September 14, 2016 Fox News Latino \nA new federal lawsuit is accusing Arizona of illegally denying undocumented immigrants the right to get a driver's license despite being eligible to do so.\nThe lawsuit, filed by a group of advocacy organizations, states that according to the Constitution some immigrants who have been granted deferred action from deportation qualify for that right.\nFor example, the lawsuit argues, that would be the case of a single mother battling cancer and a victim of domestic abuse.\nThe organizations behind the lawsuit are the Mexican American Legal Defense and Educational Fund, the National Immigration Law Center and the Ortega Law Firm.\nArizona is the only state that denies licenses to some immigrants who take part in years-old programs that allow them to work in the U.S. and avoid deportation for a variety of reasons, said Victor Viramontes, an attorney with the fund. \nThat includes crime victims who cooperate with law enforcement, those who come to the U.S. for humanitarian reasons and survivors of terrorism, among others.\nDaniel Scarpinato, a spokesman for Gov. Doug Ducey, said Tuesday that state lawyers were reviewing the lawsuit and that he could not immediately answer specific questions about the policy.\nThe suit comes less than two years after a federal judge forced the state to grant driver's licenses to recipients of the federal Deferred Action for Childhood Arrivals, or DACA — a program for young people brought to the U.S. illegally as children that protects them from deportation and allows them to work.\nIt followed a long legal battle that began when then-Gov. Jan Brewer issued a directive banning them from getting licenses. She said the decision grew out of liability concerns and the desire to reduce the risk of the licenses being used to improperly access public benefits.\nImmigrants protected from deportation for reasons other than being childhood arrivals were then banned from getting licenses after a federal court ruled that the state's policy on DACA recipients was unconstitutional in part because it excluded one group of immigrants while including another.\nFive Arizona immigrants who have deferred action because they are victims of domestic abuse or are children of victims say the state must give them licenses because they have authorization to be in the country.\nThe lawsuit names one woman who has cancer and cannot always get to her treatment appointments because she does not have a license, but lawyers say thousands of immigrants are affected by the revised policy.\nAnother woman is awaiting approval of a special visa for victims of domestic violence and has received deferred action in the meantime. She says she can't get a better job because she can't get a license.\nViramontes said the state should have started allowing all deferred action recipients to get licenses following the federal court ruling instead of letting some get them but denying them to others.\n\"They should have stopped discriminating the minute this policy was declared unconstitutional, but they keep doing it,\" Viramontes said.\nBased on reporting by the Associated Press. \nLike us on Facebook \nFollow us on Twitter & Instagram", "external_links": [], "published": "2016-09-14T03:00:00.000+03:00", "crawled": "2016-09-14T15:17:42.518+03:00", "highlightTitle": ""}