{"organizations": [], "uuid": "251b8e10978f2ae30ffa959499c8740e5fc58b25", "thread": {"social": {"gplus": {"shares": 2}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 195, "shares": 195, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/images.foxnews.com/content/fox-news/opinion/2016/09/21/john-stossel-why-worry-about-hillary-trump-and-supreme-court/_jcr_content/par/featured-media/media-0.img.jpg/0/0/1474395187276.jpg?ve=1", "site_section": "http://feeds.foxnews.com/foxnews/opinion", "section_title": "FOX News", "url": "http://www.foxnews.com/opinion/2016/09/21/john-stossel-why-worry-about-hillary-trump-and-supreme-court.html", "country": "CH", "domain_rank": 185, "title": "John Stossel: Why I worry about Hillary, Trump and the Supreme Court", "performance_score": 1, "site": "foxnews.com", "participants_count": 3, "title_full": "John Stossel: Why I worry about Hillary, Trump and the Supreme Court | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2016-09-21T03:00:00.000+03:00", "replies_count": 2, "uuid": "251b8e10978f2ae30ffa959499c8740e5fc58b25"}, "author": "FoxNews.com", "url": "http://www.foxnews.com/opinion/2016/09/21/john-stossel-why-worry-about-hillary-trump-and-supreme-court.html", "ord_in_thread": 0, "title": "John Stossel: Why I worry about Hillary, Trump and the Supreme Court", "locations": [], "entities": {"persons": [{"name": "john stossel", "sentiment": "negative"}, {"name": "hillary clinton", "sentiment": "negative"}, {"name": "hillary", "sentiment": "negative"}, {"name": "trump", "sentiment": "negative"}, {"name": "shapiro", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "napolitano", "sentiment": "none"}, {"name": "thomas edison", "sentiment": "none"}, {"name": "george w. bush", "sentiment": "none"}, {"name": "andrew napolitano", "sentiment": "none"}, {"name": "garland", "sentiment": "none"}, {"name": "scalia", "sentiment": "none"}, {"name": "gary johnson", "sentiment": "none"}, {"name": "mark zuckerberg", "sentiment": "none"}, {"name": "obama", "sentiment": "none"}, {"name": "merrick garland", "sentiment": "none"}, {"name": "clinton", "sentiment": "none"}, {"name": "johnson", "sentiment": "none"}, {"name": "ilya shapiro", "sentiment": "none"}, {"name": "franklin roosevelt", "sentiment": "none"}, {"name": "fox", "sentiment": "none"}, {"name": "abe lincoln", "sentiment": "none"}, {"name": "stossel", "sentiment": "none"}], "locations": [{"name": "america", "sentiment": "none"}, {"name": "new mexico", "sentiment": "none"}, {"name": "guantanamo bay", "sentiment": "none"}], "organizations": [{"name": "ap", "sentiment": "negative"}, {"name": "supreme court", "sentiment": "negative"}, {"name": "treasury department", "sentiment": "none"}, {"name": "u.n.", "sentiment": "none"}, {"name": "congress", "sentiment": "none"}, {"name": "fox news channel", "sentiment": "none"}, {"name": "fnc", "sentiment": "none"}, {"name": "chicago law school", "sentiment": "none"}, {"name": "cato institute's supreme court review", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By John Stossel \nPublished September 21,   livefyre Email Print  (AP) \nHillary Clinton and her fellow progressives shout things like \"Health care is a right!\" They've also said that education, decent housing and child care are \"rights.\"\nThe U.N. goes further. Its bureaucrats declared that every person has a \"right\" to rest and leisure, food, clothing, housing, \"necessary\" social services, free education, periodic holidays with pay and protection from unemployment.\nWow. I guess Abe Lincoln, Thomas Edison and Mark Zuckerberg were denied basic human rights.\nClinton and the U.N. busybodies are wrong. Health care, housing and food are not \"rights.\" They are \"gifts\" bestowed by politicians. These \"gifts\" violate other people's rights because politicians take from people to give to favored groups.\nWhen America's founders talked about rights, they had something else in mind.\nIn the Bill of Rights, each right is a right to not be meddled with, a right to be free from government -- the right not to have your speech abridged, your religion banned, your guns taken or your property searched without a warrant.\n2016 Election Headquarters The latest headlines on the 2016 elections from the biggest name in politics. See Latest Coverage → \nThe founders were tired of kings and dictators bossing them around. In their new country, they wanted to vote for presidents and other officials. But they also knew that over time even elected officials lust for more power. So they wanted clear limits on what those officials could do.\nThey created three branches of government -- to check each other.\n\"Gridlock is a feature, not a bug,\" says Ilya Shapiro, editor-in-chief of the Cato Institute's Supreme Court Review journal. \"The founding system was not to make government more efficient. It was meant to pass policies that have large agreement that's sustained across time.\"\nBecause presidents think Congress is failing when it doesn't pass legislation they like, they nominate Supreme Court justices who may give them leeway. Franklin Roosevelt tried to increase the size of the Court to squeeze in more justices who supported his programs. George W. Bush nominated his own White House Counsel.\nThe media call President Obama's current nominee, Merrick Garland, \"a centrist.\" But he is \"centrist\" only in that he sides with Democrats who want to ban guns and Republicans who want government left free to do most anything in Guantanamo Bay. Garland repeatedly supports increased government power -- and fewer checks.\nShapiro went to Chicago Law School when Obama was a professor there. He says Obama understands the limits the Constitution places on presidents but ignores them. He ignores them so often that the Supreme Court has overruled Obama unanimously more often than any modern president.\nWhen Congress rejected Obama's immigration plan, he just imposed it via executive order. The Supreme Court overturned that, but the final vote blocking it was close, 4-4. But what will the next court do?\nI hope Hillary Clinton doesn't get to replace Justice Scalia because she sounds a lot like President Obama. On her website, she says things like, \"If Congress won't act, I will ask the Treasury Department ... to use its regulatory authority!\"\nDonald Trump is no better. He says he'll impose the death penalty on anyone who kills a cop.\n\"But the executive has no say over that,\" points out Shapiro.\nPresidents cannot pass laws. They execute laws passed by Congress. Congress is supposed to reject legislation it doesn't like. That's its job. Most legislation is bad.\nFormer New Mexico governor Gary Johnson understands that. The Libertarian presidential candidate promises to only appoint judges who will ask whether any power or program proposed by the government can be found in the Constitution.\nOne judge he mentions as a possible Supreme Court pick is my fellow Fox commentator, Judge Andrew Napolitano.\n\"I'm flattered by that,\" says Napolitano. \"Johnson would clearly choose a small government, maximum individual-freedom court.\"\nGary Johnson understands that the Constitution keeps us free by restraining government.\nHillary Clinton and Donald Trump, like many politicians, treat the Constitution as an annoying obstacle.\nIt is an obstacle to their plans. Good.\nBut I worry. The current court is not young. Our next president may get to choose five new justices. \n\nJohn Stossel is the author of \"No They Can't! Why Government Fails -- But Individuals Succeed\" and host of \"Stossel\" (Fridays at 9 PM/ET) , a weekly program highlighting current consumer issues with a libertarian viewpoint. Stossel also appears regularly on Fox News Channel (FNC) providing signature analysis. Click here for more information on John Stossel .", "external_links": [], "published": "2016-09-21T03:00:00.000+03:00", "crawled": "2016-09-21T15:15:34.620+03:00", "highlightTitle": ""}