{"organizations": [], "uuid": "e97a8a783b562984774b62c05f2ccd8944ade618", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 3, "shares": 3, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.foxnews.com", "main_image": "http://www.foxnews.com/content/dam/fox-news/logo/og-fn-foxnews.jpg", "site_section": "http://feeds.foxnews.com/foxnews/national", "section_title": "FOX News", "url": "http://www.foxnews.com/us/2016/09/13/latest-british-man-pleads-guilty-in-trump-attack-case.html", "country": "CH", "domain_rank": 185, "title": "The Latest: British man pleads guilty in Trump attack case", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "The Latest: British man pleads guilty in Trump attack case", "spam_score": 0.0, "site_type": "news", "published": "2016-09-14T05:09:00.000+03:00", "replies_count": 0, "uuid": "e97a8a783b562984774b62c05f2ccd8944ade618"}, "author": "", "url": "http://www.foxnews.com/us/2016/09/13/latest-british-man-pleads-guilty-in-trump-attack-case.html", "ord_in_thread": 0, "title": "The Latest: British man pleads guilty in Trump attack case", "locations": [], "entities": {"persons": [{"name": "michael sandford", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "lynne sandford", "sentiment": "none"}, {"name": "saimo chahal", "sentiment": "none"}, {"name": "michael steven sandford", "sentiment": "none"}, {"name": "sandford", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "las vegas", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "las vegas", "sentiment": "none"}, {"name": "las vegas strip", "sentiment": "none"}, {"name": "united kingdom", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "nevada", "sentiment": "none"}], "organizations": [{"name": "associated press", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "itv", "sentiment": "none"}, {"name": "district court", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LAS VEGAS – The Latest on criminal charges in a U.S. court against a British man stemming from an incident in which he grabbed a police officer's gun with a plan to shoot Donald Trump in Las Vegas (all times local): \n2:05 p.m. \nA British man has pleaded guilty to federal charges stemming from an incident in which he grabbed a police officer's gun with a plan to shoot Donald Trump at a campaign rally in Las Vegas. \nMichael Steven Sandford could face about two years in a U.S. prison and be deported for his pleas Tuesday to being an illegal alien in possession of a firearm and disrupting an official function. \nThe 20-year-old Sandford could have faced up to 20 years in prison if he'd been convicted at trial of both charges. \nCourt documents say Sandford acknowledged reaching for the gun while Trump was on stage June 18 at a Las Vegas Strip hotel-casino. \nSandford didn't get the gun before he was arrested, and no shots were fired. \nThe documents say Sandford later told a federal agent that he drove from California to Las Vegas with a plan to kill Trump. \nFamily attorney Saimo Chahal says Sandford was delusional at the time. \n___ \n9:15 a.m. \nA British man could face about two years in a U.S. prison before being deported for trying to grab a police officer's gun to shoot Republican presidential nominee Donald Trump at a June campaign rally in Las Vegas. \nMichael Steven Sandford is due to plead guilty Tuesday in U.S. District Court in Nevada to firearm possession as an illegal immigrant and disrupting an official function charges. \nThe plea deal avoids trial, which had been set to start Oct. 3. \nIt was reached after Sandford's mother and a lawyer from London arrived in the U.S. and met with him in custody last week. \nAttorney Saimo Chahal says Sandford needs medical care for several health problems, including seizures, obsession compulsion, depression and autism spectrum disorders and delusions. \nShe says his plea is a bid to get back to the United Kingdom as quickly as possible. \nSandford was 20 when he was arrested June 18. \nHe could have faced up to 20 years in a U.S. prison if he was convicted. \n____ \n5:05 a.m. \nThe mother of a man accused of attempting to shoot Donald Trump has told British television he will plead guilty to lesser charges in a U.S. court. \nThe ITV News report says Lynne Sandford, the mother of Michael Sandford, told the station her son has signed a plea agreement in advance of a Nevada court appearance Tuesday. \nShe told ITV he had agreed to plead guilty to being an illegal alien in possession of a firearm and disrupting government business. \nMichael Sandford, 20, was accused after an incident at a Trump rally in June in which he allegedly tried to grab a policeman's gun to attack Trump. \nFamily lawyer Saimo Chahal told The Associated Press Michael Sandford would enter the plea agreement in court Tuesday. Advertisement", "external_links": [], "published": "2016-09-14T05:09:00.000+03:00", "crawled": "2016-09-14T00:53:28.230+03:00", "highlightTitle": ""}