{"organizations": [], "uuid": "9e686b18a296adfb80577e4746a7a276b94b0a7a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs58.com", "main_image": "http://WDJT.images.worldnow.com/images/11860375_G.png", "site_section": "", "section_title": "", "url": "http://www.cbs58.com/story/33126044/several-being-questioned-in-probe-of-nyc-blast-fbi", "country": "US", "title": "CBS 58 - Several being questioned in probe of NYC blast: FBI", "performance_score": 0, "site": "cbs58.com", "participants_count": 0, "title_full": "CBS 58 - Several being questioned in probe of NYC blast: FBI", "spam_score": 0.001, "site_type": "news", "published": "2016-09-19T08:00:00.000+03:00", "replies_count": 0, "uuid": "9e686b18a296adfb80577e4746a7a276b94b0a7a"}, "author": "", "url": "http://www.cbs58.com/story/33126044/several-being-questioned-in-probe-of-nyc-blast-fbi", "ord_in_thread": 0, "title": "CBS 58 - Several being questioned in probe of NYC blast: FBI", "locations": [], "entities": {"persons": [{"name": "anthony zayas", "sentiment": "none"}, {"name": "bill de blasio", "sentiment": "none"}, {"name": "ahmad khan rahami", "sentiment": "none"}, {"name": "elizabeth mayor christian bollwage", "sentiment": "none"}, {"name": "madisen shannon", "sentiment": "none"}, {"name": "alam", "sentiment": "none"}, {"name": "andrew cuomo", "sentiment": "none"}, {"name": "vikings", "sentiment": "none"}, {"name": "demetrius hollingsworth", "sentiment": "none"}, {"name": "vladimir putin", "sentiment": "none"}, {"name": "martin golden", "sentiment": "none"}, {"name": "calvin white", "sentiment": "none"}, {"name": "kelly langmesser", "sentiment": "none"}], "locations": [{"name": "united states", "sentiment": "none"}, {"name": "fla", "sentiment": "none"}, {"name": "tannerite", "sentiment": "none"}, {"name": "n.c.", "sentiment": "none"}, {"name": "syria", "sentiment": "none"}, {"name": "charlotte", "sentiment": "none"}, {"name": "chelsea", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}, {"name": "seaside park", "sentiment": "none"}, {"name": "virginia", "sentiment": "none"}, {"name": "quantico", "sentiment": "none"}, {"name": "brooklyn", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "rockingham", "sentiment": "none"}, {"name": "rockingham", "sentiment": "none"}, {"name": "canberra", "sentiment": "none"}, {"name": "queens", "sentiment": "none"}, {"name": "new york city", "sentiment": "none"}, {"name": "manhattan", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "boston marathon", "sentiment": "none"}, {"name": "united russia", "sentiment": "none"}, {"name": "north carolina", "sentiment": "none"}, {"name": "minneapolis", "sentiment": "none"}, {"name": "madison avenue", "sentiment": "none"}, {"name": "new jersey", "sentiment": "none"}, {"name": "tampa", "sentiment": "none"}, {"name": "elizabeth", "sentiment": "none"}], "organizations": [{"name": "fbi cbs", "sentiment": "none"}, {"name": "fbi", "sentiment": "none"}, {"name": "cbs", "sentiment": "none"}, {"name": "joint terrorism task force", "sentiment": "none"}, {"name": "nfl", "sentiment": "none"}, {"name": "minnesota vikings", "sentiment": "none"}, {"name": "new york police department", "sentiment": "none"}, {"name": "interfax", "sentiment": "none"}, {"name": "cnn", "sentiment": "none"}, {"name": "cbs news", "sentiment": "none"}, {"name": "national guard", "sentiment": "none"}, {"name": "shannons", "sentiment": "none"}, {"name": "amtrak", "sentiment": "none"}, {"name": "green bay packers", "sentiment": "none"}, {"name": "u.s. bank stadium", "sentiment": "none"}, {"name": "university of god’s chosen", "sentiment": "none"}, {"name": "associated press", "sentiment": "none"}, {"name": "northeast corridor", "sentiment": "none"}, {"name": "united nations", "sentiment": "none"}, {"name": "ap", "sentiment": "none"}, {"name": "wcco", "sentiment": "none"}, {"name": "tampa police", "sentiment": "none"}, {"name": "wbtv", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CBS 58 - Several being questioned in probe of NYC blast: FBI Member Center: Several being questioned in probe of NYC blast: FBI Posted: Updated: Monday, May 30 2016 5:28 PM EDT 2016-05-30 21:28:32 GMT \nCANBERRA, Australia (CBS NEWS) - A woman says she and a friend were injured when they were jumped by a kangaroo while cycling in an Australian wine region. \nCANBERRA, Australia (CBS NEWS) - A woman says she and a friend were injured when they were jumped by a kangaroo while cycling in an Australian wine region. Updated: Monday, September 19 2016 11:48 AM EDT 2016-09-19 15:48:31 GMT \nNew York (CNN)[Breaking news update at 11:23 a.m. ET] Ahmad Khan Rahami, the man suspected in bombings in New York and New Jersey, is now in custody after a shootout with police, sources said. \nNew York (CNN)[Breaking news update at 11:23 a.m. ET] Ahmad Khan Rahami, the man suspected in bombings in New York and New Jersey, is now in custody after a shootout with police, sources said. Updated: Monday, September 19 2016 11:29 AM EDT 2016-09-19 15:29:46 GMT TAMPA, Fla (CBSNews). -- Authorities are investigating the fatal shooting of a 17-month-old child at an apartment complex. Tampa Police said in a statement Sunday night that received a call at 4:12 p.m. about an injured child at the Clipper Bay Apartments. Police say that while the investigation is ongoing it has been determined that the toddler died of a gunshot wound. Tampa Police are conducting interviews with family members to determine what happened, CBS ... TAMPA, Fla (CBSNews). -- Authorities are investigating the fatal shooting of a 17-month-old child at an apartment complex. Tampa Police said in a statement Sunday night that received a call at 4:12 p.m. about an injured child at the Clipper Bay Apartments. Police say that while the investigation is ongoing it has been determined that the toddler died of a gunshot wound. Tampa Police are conducting interviews with family members to determine what happened, CBS ... Monday, September 19 2016 6:37 AM EDT 2016-09-19 10:37:51 GMT CBS.com \nFBI agents pulled over a car on a highway in Brooklyn on Sunday night and were questioning its occupants in connection with the investigation into the weekend New York City bombing that injured 29 people, authorities said. Agents stopped “a vehicle of interest in the investigation” at 8:45 p.m. Sunday, according to FBI spokeswoman Kelly Langmesser She wouldn’t provide further details. \nFBI agents pulled over a car on a highway in Brooklyn on Sunday night and were questioning its occupants in connection with the investigation into the weekend New York City bombing that injured 29 people, authorities said. Agents stopped “a vehicle of interest in the investigation” at 8:45 p.m. Sunday, according to FBI spokeswoman Kelly Langmesser She wouldn’t provide further details. Updated: Monday, September 19 2016 3:46 AM EDT 2016-09-19 07:46:09 GMT \nRussian President Vladimir Putin's political party, United Russia, has won a majority in the country's parliamentary elections. According to a report from Russian state-run news agency Interfax, United Russia won 54.21% of the vote, with 90% of all votes counted. \nRussian President Vladimir Putin's political party, United Russia, has won a majority in the country's parliamentary elections. According to a report from Russian state-run news agency Interfax, United Russia won 54.21% of the vote, with 90% of all votes counted. Updated: Monday, September 19 2016 3:38 AM EDT 2016-09-19 07:38:39 GMT \nDrivers in the Southeast are feeling the effects of the region's big pipeline problem. Commuters risk sticker shock at the pump on Monday, and some may have a headache finding any gas at all. A leak earlier this month caused the closure of a key pipeline that carries gas to the eastern United States, a disruption that's already causing inconveniences for consumers in the region. \nDrivers in the Southeast are feeling the effects of the region's big pipeline problem. Commuters risk sticker shock at the pump on Monday, and some may have a headache finding any gas at all. A leak earlier this month caused the closure of a key pipeline that carries gas to the eastern United States, a disruption that's already causing inconveniences for consumers in the region. Updated: Sunday, September 18 2016 3:31 PM EDT 2016-09-18 19:31:11 GMT New York (CNN) A day after a bombing injured 29 people in a Manhattan neighborhood, police are scouring the area for clues about who was responsible for the explosion and why it happened. \"We know it was a very serious incident, but we have a lot more work to do to be able to say what kind of motivation was behind this,\" New York Mayor Bill de Blasio told reporters Sunday. \"Was it a political motivation? Was it a personal motivation? We do not know that yet.&quot... New York (CNN) A day after a bombing injured 29 people in a Manhattan neighborhood, police are scouring the area for clues about who was responsible for the explosion and why it happened. \"We know it was a very serious incident, but we have a lot more work to do to be able to say what kind of motivation was behind this,\" New York Mayor Bill de Blasio told reporters Sunday. \"Was it a political motivation? Was it a personal motivation? We do not know that yet.&quot... Updated: Sunday, September 18 2016 2:42 PM EDT 2016-09-18 18:42:47 GMT \nROCKINGHAM, N.C. (CBS NEWS) State troopers say four people were killed and more than 40 were injured in a charter bus crash Saturday near Rockingham, North Carolina. Between 40 and 50 people were hurt in the crash and all have been transported to hospitals, Hamlet Fire and Rescue Chief Calvin White told CBS affiliate WBTV in Charlotte . The extent of their injuries was not immediately known. University of God’s Chosen coach Demetrius Hollingsworth said that football ... \nROCKINGHAM, N.C. (CBS NEWS) State troopers say four people were killed and more than 40 were injured in a charter bus crash Saturday near Rockingham, North Carolina. Between 40 and 50 people were hurt in the crash and all have been transported to hospitals, Hamlet Fire and Rescue Chief Calvin White told CBS affiliate WBTV in Charlotte . The extent of their injuries was not immediately known. University of God’s Chosen coach Demetrius Hollingsworth said that football ... Updated: Saturday, September 17 2016 11:43 PM EDT 2016-09-18 03:43:23 GMT \n(CNN)A explosion in the Chelsea neighborhood of New York on Saturday night injured at least 25 people, the fire department said. Gas has been ruled out as the cause of the explosion, a law enforcement source said. \n(CNN)A explosion in the Chelsea neighborhood of New York on Saturday night injured at least 25 people, the fire department said. Gas has been ruled out as the cause of the explosion, a law enforcement source said. Saturday, September 17 2016 11:01 AM EDT 2016-09-17 15:01:07 GMT © WCCO MINNEAPOLIS (WCCO) — The Minnesota Vikings and the Green Bay Packers have been playing each other for 55 years, and they have one of the best rivalries in the NFL. But it is the first year that games will count inside U.S. Bank Stadium. “I cried when I showed up to the stadium,” said Vikings fan Madisen Shannon. This will be the first-ever NFL game for the Shannons — and they paid for it. “We paid $1,300 for two tickets and we... MINNEAPOLIS (WCCO) — The Minnesota Vikings and the Green Bay Packers have been playing each other for 55 years, and they have one of the best rivalries in the NFL. But it is the first year that games will count inside U.S. Bank Stadium. “I cried when I showed up to the stadium,” said Vikings fan Madisen Shannon. This will be the first-ever NFL game for the Shannons — and they paid for it. “We paid $1,300 for two tickets and we... CBS - \nNEW YORK -- FBI agents pulled over a car on a highway in Brooklyn on Sunday night and were questioning its occupants in connection with the investigation into the weekend New York City bombing that injured 29 people, authorities said. \nAgents stopped “a vehicle of interest in the investigation” at 8:45 p.m. Sunday, according to FBI spokeswoman Kelly Langmesser \nShe wouldn’t provide further details, but a government official and a law enforcement official who were briefed on the investigation said five people in the car were being questioned at an FBI building in lower Manhattan. \nThe officials spoke on condition of anonymity because they were not authorized to speak about the ongoing investigation. \nNo one has been charged with any crime and the investigation is continuing, Langmesser said.State Sen. Martin Golden said on Instagram that the incident may be connected to the Chelsea bombing, but that hadn’t been confirmed, reports CBS New York. \nThe bomb that rocked a bustling Manhattan neighborhood contained residue of an explosive often used for target practice that can be picked up in many sporting goods stores, a federal law enforcement official said Sunday, as authorities tried to unravel who planted the device and why. \nThe discovery of Tannerite in materials recovered from the Saturday night explosion may be important as authorities probe whether the blast was connected to an unexploded pressure-cooker device found by state troopers just blocks away, as well as a pipe bomb blast in a New Jersey shore town earlier in the day. \nGov. Andrew Cuomo, touring the site of the blast in Manhattan’s Chelsea neighborhood, known for its vibrant arts scene and large gay community, said there didn’t appear to be any link to international terrorism. He said the second device appeared “similar in design” to the first, but didn’t provide details. \n“We’re going to be very careful and patient to get to the full truth here,” Mayor Bill de Blasio said Sunday. “We have more work to do to be able to say what kind of motivation was behind this. Was it a political motivation? A personal motivation? What was it? We do not know that yet.” \nCell phones were discovered at the site of both bombings, but no Tannerite residue was identified in the New Jersey bomb remnants, in which a black powder was detected, said the official, who spoke to The Associated Press on condition of anonymity because the official was not authorized to comment on an ongoing investigation.Authorities said the Manhattan bombing and the blast 11 hours earlier at the site of a 5K race to benefit Marines and sailors in Seaside Park, New Jersey, didn’t appear to be connected, though they weren’t ruling anything out. The New Jersey race was cancelled and no one was injured. \nOfficials haven’t revealed any details about the makeup of the pressure-cooker device, except to say it had wires and a cellphone attached to it. \nTechnicians in Quantico, Virginia, were examining evidence from the Manhattan bombing, described by witnesses as a deafening blast that shattered storefront windows and injured bystanders with shrapnel in the mostly residential neighborhood on the city’s west side. All 29 of the injured people were released from the hospital by Sunday afternoon. \nOn Sunday night, investigators examined a suspicious device found in a trash can near a train station in Elizabeth, New Jersey?, that forced the suspension of service on the busy Northeast Corridor line. Amtrak said later Northeast Corridor service would operate on a modified schedule Monday. \nElizabeth Mayor Christian Bollwage said two men called police and reported seeing wires and a pipe coming out of the package after finding it at about 9:30 p.m. Sunday. \nEarlier Sunday, a team of five FBI agents searched an Uber driver’s vehicle that had been damaged in the Manhattan blast, ripping off the door panels inside as they examined it for evidence. \nThe driver, MD Alam, of Brooklyn, had just picked up three passengers and was driving along 23rd Street when the explosion occurred, shattering the car’s windows and leaving gaping holes in the rear passenger-side door. \n“It was so loud,” the 32-year-old Alam said. “I was so scared. There was a loud boom and then smoke and I just drove away.” \nAlam said he hit the gas and tried to take his passengers to their destination in Queens, but pulled over along Madison Avenue and 39th Street. He went to a local police precinct to file a report for his insurance company and police contacted the FBI. \nThe explosion left many rattled in a city that had marked the 15th anniversary of the 9/11 terrorist attacks only a week earlier and where a United Nations meeting to address the refugee crisis in Syria was scheduled on Monday. \n“People didn’t know what was going on, and that’s what was scary,” said Anthony Zayas, an actor who was in the Chelsea neighborhood Saturday night when the bomb went off. “You didn’t know if was coming from the subway beneath you, you didn’t know if there were other bombs, you didn’t know where to go.” \nTannerite, which is often used in target practice to mark a shot with a cloud of smoke and small explosion, is legal to purchase and can be found in many sporting goods stores. Experts said a large amount would be required to create a blast like the one Saturday night, as well as an accelerant or other ignitor. \nPolice and federal spokespeople wouldn’t comment on the presence of explosive material recovered at the scene. \nThe bomb in Manhattan appeared to have been placed near a large dumpster in front of a building undergoing construction, another law enforcement official, speaking on condition of anonymity to discuss the ongoing investigation, told the AP. The second device, described by the same official as a pressure cooker with wires and a cellphone attached to it, was removed early Sunday by a bomb squad robot and New York City police blew it up in a controlled explosion Sunday evening, authorities said. \nHomemade pressure cooker bombs were used in the Boston Marathon attacks in 2013? that killed three people and injured more than 260. \nOfficials solicited tips from the public, telling reporters at a news conference in the New York Police Department’s headquarters that they didn’t know who set off the bomb or why. \nAn additional 1,000 state troopers and members of the National Guard were placed at transit hubs and other points throughout New York City and extra police officials were patrolling Manhattan, officials said. Members of the FBI’s Joint Terrorism Task Force were investigating the blast along with New York Police Department detectives, fire marshals and other federal investigators. \nMeanwhile, a law enforcement official said federal investigators had discounted a claim of responsibility on the social blogging service Tumblr. Investigators looked into it and didn’t consider it relevant to the case, said the official who spoke on condition of anonymity to discuss an ongoing investigation. News ", "external_links": [], "published": "2016-09-19T08:00:00.000+03:00", "crawled": "2016-09-19T19:17:48.820+03:00", "highlightTitle": ""}