{"organizations": [], "uuid": "46a0ebf8bce713f7b7e866e7441507facba71406", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 1}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 691, "shares": 691, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/media2.foxnews.com/BrightCove/694940094001/2016/09/20/0/0/694940094001_5133122172001_092016-obama-un-1280.jpg?ve=1", "site_section": "http://feeds.foxnews.com/foxnews/latest", "section_title": "FOXNews.com", "url": "http://www.foxnews.com/politics/2016/09/20/obama-in-final-un-speech-urges-more-help-for-refugees.html", "country": "CH", "domain_rank": 185, "title": "UN halts all convoys in Syria after attack on aid trucksObama, in final UN speech, urges more help for refugees", "performance_score": 6, "site": "foxnews.com", "participants_count": 1, "title_full": "UN halts all convoys in Syria after attack on aid trucksObama, in final UN speech, urges more help for refugees", "spam_score": 0.0, "site_type": "news", "published": "2016-09-21T00:34:00.000+03:00", "replies_count": 0, "uuid": "46a0ebf8bce713f7b7e866e7441507facba71406"}, "author": "foxnewsonline@foxnews.com (Fox News Online)", "url": "http://www.foxnews.com/politics/2016/09/20/obama-in-final-un-speech-urges-more-help-for-refugees.html", "ord_in_thread": 0, "title": "UN halts all convoys in Syria after attack on aid trucksObama, in final UN speech, urges more help for refugees", "locations": [], "entities": {"persons": [{"name": "obama", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}, {"name": "samantha power", "sentiment": "none"}, {"name": "vladimir putin", "sentiment": "none"}], "locations": [{"name": "syria", "sentiment": "none"}, {"name": "minnesota", "sentiment": "none"}, {"name": "ukraine", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}, {"name": "ethiopia", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "jordan", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "new jersey", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}, {"name": "middle east", "sentiment": "none"}, {"name": "sweden", "sentiment": "none"}], "organizations": [{"name": "facebook", "sentiment": "negative"}, {"name": "un", "sentiment": "negative"}, {"name": "u.n.", "sentiment": "none"}, {"name": "isis", "sentiment": "none"}, {"name": "associated press", "sentiment": "none"}, {"name": "u.n", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "department of homeland security", "sentiment": "none"}, {"name": "u.n. general assembly", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Obama, in final UN speech, urges more help for refugees Published September 20, 2016 Facebook 0 Twitter 0 livefyre Email Print \nPresident Obama, in his final address as president before the U.N. General Assembly, called Tuesday for more global cooperation especially in helping refugees from war-torn countries – while making only passing reference to the Islamic State and the ever-expanding scourge of like-minded terror groups. \nThe president called for a “course correction” for globalization to ensure nations don't retreat into a more sharply divided world, while pushing back against an isolationist approach gaining popularity in many countries. He advocated for open democracies and open economies, while railing against the example set by Russia and calling for more tolerance in all nations. \nHe also took what appeared to be a jab at Donald Trump, saying: “The world is too small for us to simply be able to build a wall” and prevent extremism from affecting societies. \nWith that message in hand, Obama urged nations to “follow through even when the politics are hard,” in helping refugees fleeing conflict. \n“We have to open our hearts and do more to help refugees who are desperate for a home,” he said. “We have to have the empathy to see ourselves.” \nThe appeal comes ahead of a refugee summit Obama was hosting Tuesday afternoon with the leaders of Jordan, Mexico, Sweden, Germany, Canada and Ethiopia, along with U.N. Secretary-General Ban Ki-moon. \nYet despite Obama’s focus toward the end of his speech on the refugee crisis, he made little mention of terrorism, aside from describing how persecution and intolerance in the Middle East contributed to the Syrian civil war and the “mindless medieval menace” of ISIS – and saying this violence \"will not be quickly reversed.\" \nThe president, though, was unabashed in his critique of Russia as he laid out his diagnosis of the world's ills. Obama's longstanding differences with Russian President Vladimir Putin over his actions in Ukraine have accompanied intense disagreement over Syria's future and a series of failed attempts by Russia and the U.S. to resolve the civil war there together. \n\"In a world that left the age of empire behind, we see Russia attempting to recover lost glory through force,\" Obama said. \nThe president's focus on refugees comes after Obama was criticized by other nations for not doing enoughto help those fleeing their countries because of war or for other reasons. \nCountries participating in the summit Tuesday are expected to announce individual pledges that are in line with a U.S. goal of increasing humanitarian aid by $3 billion, doubling resettlement and providing access to jobs and education, said Samantha Power, U.S. ambassador to the U.N. \nLast week, the White House announced that the U.S. would resettle 110,000 refugees in the coming year, a 30 percent increase over the 85,000 allowed in this year. \nObama also faces security concerns at home, though, over the prospect of admitting more refugees. Republican presidential nominee Donald Trump has made warnings about such refugees a centerpiece of his campaign -- the candidate renewed those warnings in the wake of weekend terror attacks in Minnesota, New York and New Jersey involving foreign-born suspects. He and other Republicans also seized on a new watchdog report finding more than 800 immigrants from countries of concern who were set for deportation were mistakenly granted U.S. citizenship because the Department of Homeland Security didn’t have their fingerprints on file. \nWorld leaders, though, are grappling with the largest crisis of displaced persons since World War II -- more than 65 million people who have fled their homes because of armed conflict or persecution, or because they are seeking asylum or a better way of life. \nPower said the U.N. summit wouldn't be a \"panacea\" for the crisis, but would show what the U.S. can achieve when it leads on an issue of global concern. \nThe administration’s 85,000 figure included 10,000 Syrian refugees, a figure advocacy groups had criticized as inadequate given the wealth of the U.S. and the fact that other countries, such as Canada and Germany, were welcoming far greater numbers of Syrians fleeing the civil war there. \nMore than four dozen U.S. businesses also pledged $650 million in support to help refugees, the White House announced Tuesday. \nThe Associated Press contributed to this report. Advertisement", "external_links": [], "published": "2016-09-21T00:34:00.000+03:00", "crawled": "2016-09-20T19:51:02.535+03:00", "highlightTitle": ""}