{"organizations": [], "uuid": "956d19498a2a276d3a8802364b3068b4241ebec1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 6, "shares": 6, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "nation.foxnews.com", "main_image": "http://nation.foxnews.com/sites/nation.foxnews.com/files/styles/story_624_300/public/ISIS031016_2.jpg", "site_section": "", "section_title": "", "url": "http://nation.foxnews.com/2016/09/09/sebastian-and-katharine-gorka-america-retreat", "country": "US", "domain_rank": 185, "title": "Sebastian and Katharine Gorka: America in Retreat - Fox Nation", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Sebastian and Katharine Gorka: America in Retreat - Fox Nation", "spam_score": 0.506, "site_type": "news", "published": "2016-09-09T08:00:00.000+03:00", "replies_count": 0, "uuid": "956d19498a2a276d3a8802364b3068b4241ebec1"}, "author": "", "url": "http://nation.foxnews.com/2016/09/09/sebastian-and-katharine-gorka-america-retreat", "ord_in_thread": 0, "title": "Sebastian and Katharine Gorka: America in Retreat - Fox Nation", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Sebastian and Katharine Gorka: America in Retreat Published September 9, 2016 \nU.S. adversaries are exploiting the void left by withdrawn American leadership \nBy Dr. Sebastian Gorka and Katharine Gorka, for LifeZette.com \nWhen President Obama took office, Osama bin Laden was in hiding, al-Qaida in Iraq was in retreat, and the governments of the Middle East, while not necessarily exemplars of democracy, were at least stable. \nToday, seven-and-a-half years later, as we near the end of his presidential term, al-Qaida is resurgent under the leadership of Ayman al Zawahiri, the Taliban rules half of Afghanistan, and al-Qaida in Iraq, after becoming ISIS, has declared a caliphate with more territory than the United Kingdom and with “fully operational” affiliates in 18 nations around the world and dozens more groups sympathetic to its totalitarian religious ideology of global jihad. \nEverywhere one looks, our adversaries and enemies have assiduously exploited the vacuum created by the White House.Syria is in its fourth year of a civil war that has sparked the largest refugee crisis the world has ever seen and some 65 million people in the world now live as displaced persons. Libya and Yemen are failed states and the countries that experienced the so-called Arab Spring continue to face instability and multiple Islamic insurgencies. And this is just one particular part of the world where we see the true cost of Obama’s avowed policy of “Leading from Behind.” ", "external_links": [], "published": "2016-09-09T08:00:00.000+03:00", "crawled": "2016-09-09T20:37:38.309+03:00", "highlightTitle": ""}