{"organizations": [], "uuid": "160309a0f1ed435f2ee3fd1ee9de7aee6f8f1ad8", "thread": {"social": {"gplus": {"shares": 5}, "pinterest": {"shares": 1}, "vk": {"shares": 0}, "linkedin": {"shares": 2}, "facebook": {"likes": 765, "shares": 765, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/media2.foxnews.com/2016/08/18/0/0/081816_dotcom_syrianboy_1280.jpg?ve=1", "site_section": "http://feeds.feedburner.com/foxnews/affiliates/kpth?format=xml", "section_title": "FOX News", "url": "http://www.foxnews.com/opinion/2016/09/08/martha-maccallum-what-is-aleppo-that-s-question-whole-world-must-answer.html", "country": "US", "domain_rank": 185, "title": "Martha MacCallum: 'What is Aleppo?’ – That’s a question the whole world must answer", "performance_score": 7, "site": "foxnews.com", "participants_count": 3, "title_full": "Martha MacCallum: 'What is Aleppo?’ – That’s a question the whole world must answer | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2016-09-08T03:00:00.000+03:00", "replies_count": 2, "uuid": "160309a0f1ed435f2ee3fd1ee9de7aee6f8f1ad8"}, "author": "FoxNews.com", "url": "http://www.foxnews.com/opinion/2016/09/08/martha-maccallum-what-is-aleppo-that-s-question-whole-world-must-answer.html", "ord_in_thread": 0, "title": "Martha MacCallum: 'What is Aleppo?’ – That’s a question the whole world must answer", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Martha MacCallum \n  FoxNews.com   livefyre Email Print   \nThursday morning a candidate for the presidency of the United States was asked “and what would you do if elected, about Aleppo?”\nHis silence hung in the air as the questioner and the others on set waited for his answer.  \nAnd then Gary Johnson, the Libertarian candidate for president and former governor of New Mexico, went deer-in-the-headlights and dropped this verbal barrel bomb, “and what is Aleppo?”\nAn awful moment – perhaps a devastating one --  for him as a candidate. The pauses painful and potent.\n#AndWhatisAleppo? It’s a very good question. A question that prompts the squirming. It is one we must answer. It is Sarajevo, it is Bosnia, it is a village in Rwanda. It’s a place we thought would go away. It is somebody’s home.\nAnd thus a new Twitter hashtag was born.  We should all be asking ourselves this question:  #AndWhatisAleppo?\nPerhaps it’s not so surprising -- not to know. \nThe White House speaks of it only when pressed.  No one wants to go there, it’s nearly impossible for reporters and aid workers, although the brave get through and we commend them.\nAleppo is the town in war torn Syria where a little boy named Omran was recently swept out of his crumbled home by an aid worker and seated in an emergency vehicle. His heartbreakingly dazed and dirty face was splashed all over the newspapers and TV screens that next day. \nSome asked if it was a picture that could turn the tide of the world’s attention?  But as it turns out, it wasn’t.  It was just another #Bringbackourgirls moment of sad faces and Twitter angst.\nThis week reports say 70 people were injured in #AndWhatisAleppo by chlorine bombs that were dropped from President Assad’s government helicopters. Last week barrel bombs took out an estimated 16 children who were attending a funeral for others killed in this “opposition town” as it is referred to by the Assad government.   \nBarrel bombs are improvised devices in round metal containers, containing explosives, shrapnel and sometimes chemicals.  They are crude larger IEDs, dropping from the sky, and targeting anything  unlucky enough to be in the path.  Tens of thousands of children have been slaughtered in Syria according to the U.N., so Omran was lucky to survive.  Over eight million children have been affected by the conflict. Many have nowhere to go, nowhere to live and if they are five or under like Omran, war is  all they’ve ever known.\nRemember  #AssadMustGo?\nBack on Sep 6, 2013, President Obama said this. “We have been very clear to the Assad regime, that a red line for us is we start seeing a whole bunch of chemical weapons moving around or being utilized. That would change my calculus.”   \nThe line was crossed, and the only calculus that changed was Assad’s.  It became clear he could defend his Alawite minority dictatorship and for now, no one was going to stop him. The world stood back as Vladimir Putin helped him crush the ‘rebels.’  \nThreatened with death, the refugee crisis began. Millions and millions of people flooded out of Syria. Like their beleaguered neighbors in Iraq and Libya many fled to Europe. Now our allies there are overburdened and scared that -- among those who ran -- are people who want to (and do) cause them harm.\nThere is a battle here at home about how many more refugees we should let into our country as well. The compassionate argument is that we must help, but it is also appropriate to ask where was the compassion in 2013, when the “redline” was crossed?  These people wanted to live their lives and raise their families in their hometowns, but they could not.  In places like #AndWhatisAleppo, those who stayed are under siege.\n#AndWhatisAleppo?  It’s a very good question. A question that prompts the squirming. It is one we must answer. It is Sarajevo, it is Bosnia, it is a village in Rwanda. It’s a place we thought would go away. It is somebody’s home.\nBy late Thursday morning, after his interview, Gary Johnson had issued a statement. It said in part: \"… hit with 'What about Aleppo?' I immediately was thinking about an acronym, not the Syrian conflict. I blanked. It happens, and it will happen again during the course of this campaign … Can I name every city in Syria? No. Should I have identified Aleppo? Yes. Do I understand its significance? Yes.\"\nJohnson also admitted he needs to study more and gain a better understanding.  Perhaps he’s not alone.\n\nMartha MacCallum currently serves as the co-anchor of \" America's Newsroom \" alongside Bill Hemmer (Weekdays 9-11AM/ET). She joined FOX News Channel (FNC) in January 2004. Click here for more information on Martha MacCallum .", "external_links": [], "published": "2016-09-08T03:00:00.000+03:00", "crawled": "2016-09-09T01:18:10.473+03:00", "highlightTitle": ""}