{"organizations": [], "uuid": "3c10f80d62403040c94515982d15e227145e45c6", "thread": {"social": {"gplus": {"shares": 1}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 8, "shares": 8, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/images.foxnews.com/content/fox-news/us/2016/09/19/where-stand-trump-clinton-clash-on-islamic-extremism/_jcr_content/par/featured-media/media-0.img.jpg/0/0/1474320168851.jpg?ve=1", "site_section": "http://feeds.foxnews.com/foxnews/national", "section_title": "FOX News", "url": "http://www.foxnews.com/us/2016/09/19/where-stand-trump-clinton-clash-on-islamic-extremism.html", "country": "CH", "domain_rank": 185, "title": "Where they stand: Trump, Clinton clash on Islamic extremism", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Where they stand: Trump, Clinton clash on Islamic extremism", "spam_score": 0.0, "site_type": "news", "published": "2016-09-20T05:19:00.000+03:00", "replies_count": 0, "uuid": "3c10f80d62403040c94515982d15e227145e45c6"}, "author": "", "url": "http://www.foxnews.com/us/2016/09/19/where-stand-trump-clinton-clash-on-islamic-extremism.html", "ord_in_thread": 0, "title": "Where they stand: Trump, Clinton clash on Islamic extremism", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Where they stand: Trump, Clinton clash on Islamic extremism   Democratic presidential candidate Hillary Clinton waves at a campaign stop at Temple University in Philadelphia, Monday, Sept. 19, 2016. (AP Photo/Matt Rourke) (The Associated Press) Republican presidential candidate Donald Trump steps off his plane after arriving for a campaign rally at Germain Arena, Monday, Sept. 19, 2016, in Ft. Myers, Fla. (AP Photo/ Evan Vucci) (The Associated Press) Previous Next \nWASHINGTON – Bombings in the New York region and a stabbing attack in Minnesota have thrust Islamic extremism into the forefront of the 2016 election just a week before the first presidential debate, with Donald Trump and Hillary Clinton offering dramatically different visions of how to fight it. \nTrump has embraced aggressive rhetoric in a plan that's short on detail, but centers on limiting immigration — both legal and illegal — and dispensing with \"politically correct\" policies that currently block racial profiling and the use of torture. \nClinton has offered policies that would focus on leveraging alliances and improving relationships with Muslim communities at home while working closely with technology companies to crack down on propaganda and communication that encourages \"lone wolf\" attacks. \nThere are limits, of course, to what the White House can do to prevent extremist attacks at the local level, where local law enforcement remains the first line of defense. Yet the occupant of the Oval Office will have the power to set the course of the nation's approach to fighting the threat of such attacks at home and abroad. \nHere's a look at each candidate's prescription: \n___ \nIMMIGRATION \nTRUMP: His plan to combat illegal immigration — and reduce legal immigration — is the centerpiece of his plan to address Islamic extremism. Trump has repeatedly called for a moratorium on accepting Syrian refugees. His position is part of a broader stance on immigrants that has ranged from imposing a complete ban on foreign Muslims entering the United States \"until we know what the hell is going on\" to \"extreme vetting\" and an ideological test for would-be immigrants from regions plagued by Islamic extremism. \nCLINTON: She has said she would expand President Barack Obama's refugee program from accepting 10,000 to about 65,000 Syrian refugees annually. This would be in addition to the tens of thousands of refugees accepted from around the world every year. Clinton says she would continue to use the existing system to vet the background of immigrants and refugees, an effort that can take years to complete. More broadly, she supports creating a pathway to citizenship for immigrants living in the country illegally, so long as they are not violent criminals. \n___ \nFIGHTING THE ISLAMIC STATE ABROAD \nCLINTON: She has said she would not authorize sending ground troops to Syria or Iraq to take on the Islamic State group, instead favoring a plan to intensify the current coalition air-strike campaign. She also would increase diplomatic efforts aimed at resolving Syria's civil war and Iraq's sectarian conflict between Sunnis and Shiites, which fueled the group's rise, and has pledged to improve cooperation with European intelligence agencies to halt extremist networks. She has also called for an \"intelligence surge\" that would include Arabic speakers with deep expertise in the Middle East and a closer partnership with regional intelligence services. \nTRUMP: He has said repeatedly that he wants to \"bomb the hell out of ISIS.\" Trump spent months on the campaign trail suggesting he had a secret plan to defeat the Islamic State group — in May, he deemed it a \"foolproof way of winning\" — but has added he does not want to reveal it because it would tip off extremist leaders. Earlier this month, he instead suggested that, upon his election, he would give generals \"30 days to submit to the Oval Office a plan for defeating ISIS.\" He has said he'd send ground troops to the Middle East to fight the Islamic State group, in addition to the 5,500 there now, but has wavered on how many. \n___ \nDOMESTIC ATTACKS \nTRUMP: He has repeatedly endorsed racial profiling   as a counterterrorism tool. Trump has not released any specifics as to how U.S. law enforcement would use profiling, or how he would require it as president, but said Monday that authorities have no choice but to use racial profiling and noted it is a tool Israel uses to combat Islamic extremists. He said \"politically correct\" policies currently prevent police from keeping Americans safe. The New York billionaire also believes local law enforcement agencies should monitor mosques, saying in June that it should be done \"respectfully.\" \nCLINTON: She wants local law enforcement to develop improved relationships with Muslim community leaders, who she said are best positioned to recognize extremists in their communities. Clinton has argued that racial profiling is generally ineffective and demeaning to the people being profiled. She has promised to boost federal support for local law enforcement, a move she cites as a key to her strategy. And she supports a law that would prohibit people on the terror watch list from being able to purchase firearms. \n___ \nCYBERSECURITY \nTRUMP: He has not articulated a policy for addressing cybersecurity, an area national security officials cite as one of the most significant threats to the nation. Asked by an ally earlier in the month to explain his approach to cybersecurity, Trump said \"cyber is so big\" and later noted it's becoming \"more important.\" On Monday morning, when asked about websites that offer directions on how to build bombs, he said people who post such sites \"should be arrested immediately.\" \nCLINTON: She has called on U.S. technology companies to be more cooperative in countering extremist propaganda, tracking social media patterns and incepting encrypted communications. She supports the creation of a National Commission on Encryption to help tech companies and the government find a balance between privacy and security concerns. Clinton said in an August speech that she would treat a cyberattack from an adversary \"like any other attack\" against the United States. She has called on the government to work with private institutions to protect against cyberattacks from countries like Russia and China, while vowing to modernize the nation's electric grid to address its vulnerabilities. \n___ \nCLASH ON TORTURE \nCLINTON: Clinton has condemned the use of torture as an interrogation technique. During her first presidential run, Clinton briefly suggested that its limited use in extreme circumstances could save lives, but by September 2007 she categorically ruled it out, saying \"it cannot be American policy, period.\" She has also suggested that it doesn't work and, in a March speech at Stanford University, warned that \"it puts our own troops and increasingly our own civilians at greater risk\" by promoting retaliation. \nTRUMP: He has repeatedly come out in favor of using torture. \"What do you think about waterboarding?\" he asked the crowd at a June rally in Ohio. \"I like it a lot. I don't think it's tough enough.\" He has on other occasions suggested that he would authorize techniques that were \"a hell of a lot worse than waterboarding.\" Waterboarding, used during the Bush administration on detainees after 9/11, was later outlawed by Congress in a law signed by Obama. \n___ \nCOALITION BUILDING \nTRUMP: He has made \"America First\" a key campaign slogan and has suggested he would pull back on international relationships. Earlier this year, he suggested that he would consider pulling the United States out of NATO, because it was \"obsolete\" and \"costing us a fortune.\" In July, he raised the possibility he would not automatically defend NATO allies unless those nations have \"fulfilled their (financial) obligations to us.\" He also advocated for a stronger ties with Russia, saying \"wouldn't it be nice\" to have warmer relationship with that nation. \nCLINTON: She has pointed to a need to build international coalitions. In a reference to Trump's approach, she warned last month that, \"You don't build a coalition by insulting our friends or acting like a loose cannon.\" She called NATO one of \"the best investments\" the United States has made and has pledged to remain a member of the military alliance. And she has pointed to her coalition-building record as secretary of state, including an 18-month effort to impose sanctions on Iran in an effort to hinder its nuclear programs. Advertisement", "external_links": [], "published": "2016-09-20T05:19:00.000+03:00", "crawled": "2016-09-20T00:35:04.013+03:00", "highlightTitle": ""}