{"organizations": [], "uuid": "1089cca136867d53f1bf0e8d46e3980673eb1ae0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/694940094001_5114428894001_cavuto-cuban-090616.jpg", "site_section": "http://www.foxnews.com/yourworld/", "section_title": "Your World with Neil Cavuto | Fox News", "url": "http://www.foxnews.com/transcript/2016/09/06/mark-cuban-trump-is-master-headline-porn/", "country": "IT", "domain_rank": 185, "title": "Mark Cuban: Trump is the 'master of headline porn'", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "Mark Cuban: Trump is the 'master of headline porn' | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2016-09-06T03:00:00.000+03:00", "replies_count": 0, "uuid": "1089cca136867d53f1bf0e8d46e3980673eb1ae0"}, "author": "FoxNews.com", "url": "http://www.foxnews.com/transcript/2016/09/06/mark-cuban-trump-is-master-headline-porn/", "ord_in_thread": 0, "title": "Mark Cuban: Trump is the 'master of headline porn'", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "jack", "sentiment": "none"}, {"name": "colin kaepernick", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "bill clinton", "sentiment": "none"}, {"name": "jack welch", "sentiment": "none"}, {"name": "mark cuban", "sentiment": "none"}, {"name": "clinton", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "kaepernick", "sentiment": "none"}, {"name": "mark", "sentiment": "none"}, {"name": "ronald reagan", "sentiment": "none"}, {"name": "donald", "sentiment": "none"}, {"name": "neil cavuto", "sentiment": "none"}, {"name": "cavuto", "sentiment": "none"}, {"name": "neil", "sentiment": "none"}], "locations": [{"name": "united states", "sentiment": "none"}, {"name": "chicago", "sentiment": "none"}, {"name": "dallas", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}], "organizations": [{"name": "mavericks", "sentiment": "none"}, {"name": "llc", "sentiment": "none"}, {"name": "san francisco 49ers", "sentiment": "none"}, {"name": "bureau of labor statistics", "sentiment": "none"}, {"name": "ge", "sentiment": "none"}, {"name": "fbi", "sentiment": "none"}, {"name": "mavericks", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "fox news network", "sentiment": "none"}, {"name": "inc", "sentiment": "none"}, {"name": "pledge of allegiance", "sentiment": "none"}, {"name": "clinton foundation", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Published September 06, 2016\nThis is a rush transcript from \"Your World,\" September 6, 2016. This copy may not be in its final form and may be updated.\nNEIL CAVUTO, HOST: You know, say this about Mark Cuban, he speaks his mind, whether you agree or disagree.\nWhat's odd is, about a year ago, he had no real apparent problem with Donald Trump. But now he has been very critical of Donald Trump, especially Trump's style, this sort of \"Seinfeld\" campaign he told me about some time ago that is all about nothing. Donald Trump might disagree, but, well, Cuban is sticking to it.\n(BEGIN VIDEOTAPE)\nMARK CUBAN, OWNER, DALLAS MAVERICKS: Donald has done a great job of setting the agenda for the media.\nThe guy is a master at headline porn. You just want to deal with the headlines and not look what's underneath it. And there is nobody better at it than him.\nBut that's not the decision-making. That's not what I look for when it comes to deciding who I want to vote for, for president. At some point, somebody has to govern. At some point, he would have to understand policy. At some point, he would have to get into details. And he just has not shown a talent for doing any of those things.\nCAVUTO: Has Hillary Clinton, though?\nCUBAN: I think she has.\nCAVUTO: We don't -- have scant details on her own track record, on her own past, even emails that are released, and flip-flops and stories.\nCUBAN: Oh, yes, look, I'm happy -- I mean, look, all candidates flip- flop to a certain extent over the years. And I don't even hold that so much against Donald.\nBut in terms of details, look, I'm happy to discuss the emails. The thing about Hillary Clinton, she is not good at communicating with the media. Donald is a master of it.\nThe thing about the emails, people don't trust her judgment when it comes to classified information because she has never discussed what she actually did with classified information.\nThe reality is, for 99.99 percent of the classified information she has dealt with, she did it in hard copy, paper, secured transfer. Everything was done by the book. She didn't even use a P.C.\nFor her email, she sent and received emails from a total of 13 people. That's it, 13 people. And across those 13 people, there were 68 classified threads. So, over the course of four years...\nCAVUTO: Well, that we know of, and 15,000 more out there. We don't know what they will ultimately show.\nCUBAN: No, that's -- no, that's not the case, Neil. That's not the case, because the FBI went and interviewed everybody and anybody who connected with her via email, anybody who communicated with her at all.\n(CROSSTALK)\nCAVUTO: All right, but just an image issue -- and I'm not taking sides with either candidate.\nCUBAN: Sure.\nCAVUTO: That it looks weird when someone sets up their own private email server as secretary of state of the United States.\nCUBAN: No, I don't think so, because I am a tech guy. Right? I have set up email servers. I made -- I had a business that I built and sold.\n(CROSSTALK)\nCAVUTO: You were never secretary of state.\nCUBAN: No, I wasn't, but I understood the security elements of having a private server. And so, to me, it wasn't weird.\n(CROSSTALK)\nCAVUTO: You also knew the benefits of having a private server.\nCUBAN: Yes.\nAnd, in reality, it was to be more secure than what she would have done otherwise. But to your point, look, she has done a horrible job communicating. She has tried to address the emails as a stand-alone issue, when, really the question is, how does she deal with classified information on a day-to-day basis?\nAnd she has a great answer. She did it via hard copy, but she has never used that answer. And, as I said, she doesn't do a good job explaining herself.\nCAVUTO: Now, the talk is that you are sort of a de facto behind-the- scenes supporter trying to help her out, that you would even help her prepare for the debates by playing the role of Donald Trump. Is that true?\nCUBAN: Yes.\nCAVUTO: It is true?\nCUBAN: I haven't been asked but, would I do it? Yes.\nCAVUTO: Have they asked? If you volunteered it, have they said, yes, we would like to...\n(CROSSTALK)\nCUBAN: No, they haven't brought it up at all.\nAnd it is not like I talk to them every day. I get an email once every few weeks asking -- they ask me for my advice on small business. They asked me to go back and talk to my \"Shark Tank\" companies and get feedback on the elements that were important to them in terms of top to bottom, ranking them and prioritizing them.\nAnd, in reality she included a bunch of those things that I got back from the companies in her small business proposal. I mean, she is responsive in that respect.\nCAVUTO: I'm going to hobnob around here.\nOn this issue with the San Francisco 49ers player Colin Kaepernick, who sits during the national anthem, you kind of defended him, tweeting that -- it has caused quite a bit of controversy. You were saying that -- explaining why critics of Kaepernick's action are wrong, you say that: \"He didn't throw a bomb, didn't fire a shot or start a riot, throw a punch, shut a business, yell at someone, troll anyone. He just sat there quietly.\"\nOthers have interpreted that and -- as, why now? You say what?\nCUBAN: In terms of why now?\nBecause he -- it just happened now. And I also tweeted after that that, in terms of my family, my kids, my team, I'm going to suggest, and my family, I'm going to require that they put their hands over their heart and they stand for the national anthem, the Pledge of Allegiance, \"God Bless America,\" et cetera.\nCAVUTO: But what if your Mavericks players doesn't do it? What if one of them doesn't do it?\nCUBAN: It is his choice. Right? I would discuss it with him and said, look, if this is the message you want to send, then that's up to you.\nBut the point I was making in the first tweet, in this day and age, we don't have a lot of civil discourse. When somebody disagrees, we tend to march, we tend to punch, we tend to yell, we tend to scream, we tend to shoot, all -- nothing that's positive.\nColin Kaepernick, he didn't put out a press release. He just didn't stand up. And my point was, I respect somebody who, if you're going to take issue with something, particularly as important as standing for the national anthem, he did it in a nonviolent manner, when so many other people are creating conflict and causing situations that can lead to harm, if not death.\nHe did it in a nonviolent manner. And I think that's a positive.\nCAVUTO: You know, Mark, I was -- you have -- not intentionally, I'm sure, but you have picked fights with a lot of folks, Jack Welch the latest, when you were taking him on for attacking the Clinton Foundation and this idea that those who have helped the foundation had a pay-for-play reward. And you wanted him to prove it, and unless he could prove it, he was throwing false accusations.\nIs that the gist of it?\nCUBAN: Oh, yes. And it was absolutely intentional to pick a war.\nI try to pick the wars with the people who should be able to defend themselves. And, look, my point with Jack was -- and I don't know him, never met him, never talked to him -- was that, when he was the CEO of GE, he got accused of a lot of things. I don't know what was true. I don't know what wasn't true.\nBut I would never accuse him of something without knowing the facts. And that's exactly what Jack Welch has done. And it is not the first time. I mean, he made accusations that the Bureau of Labor Statistics, I think, with the unemployment rate was run by, what did he say, the guys in Chicago or something like that?\nCAVUTO: Right. Right.\nCUBAN: And so it is not the first time for him. And all I'm -- and I am just trying to make the point, and, again, only against the folks that should be able to have a foundation for what they are saying.\n(CROSSTALK)\nCAVUTO: You don't think there was ever anything that looked a little weird about those who attended Clinton events and those that gave to the foundation?\nCUBAN: No. No. And I will tell you exactly why.\nFirst of all, you have to ask yourself, what's the market for giving -\n- a former president giving a speech, right, because that's one of the issues to be addressed.\nCAVUTO: Right.\nCUBAN: So, first of all, Ronald Reagan had gotten paid more than $1 million per speech in 1989. He went to Japan and gave two speeches.\nSecond of all, Bill Clinton got -- made a lot, I think it was $250,000, give or take, for a lot of speeches. I have made $250,000 for a bunch of speeches. For the most part, he gets paid a little bit more than I do. But the point is, he was right inside the market. He wasn't getting paid more or less than the market. Third...\n(CROSSTALK)\nCAVUTO: But I know where you're -- I didn't want to interrupt you there, but this is more than about events.\nCUBAN: That's OK.\nCAVUTO: This is for a foundation that ostensibly raises questions about whether there is a pay-for-play relationship.\nCUBAN: Right.\nBut, OK, in order for -- a pay-for-play relationship suggests that he is gaining money in order for -- to give a favor, correct? And so in order to determine if there is any quid pro quo, there has got to be some money destined for the trade-off.\nAnd my point is, if I'm president -- the former president of the United States who has had a lot of experience creating health initiatives around the world and has a phenomenal brand, one of the best brands globally of anybody ever, for him to go to a foreign nation and say, look, if you give to my foundation, I'm going to provide you support, I'm going to provide you brand support, I'm going to help you with your health initiatives, it's going to be -- you're going to be perceived in a much more positive light because you are working for me, and what I would like for you to do...\n(CROSSTALK)\nCAVUTO: When it's -- his wife makes an appearance, as a future candidate -- I guess we can argue this back and forth. So, I won't waste your time on that.\nCUBAN: Yes, but, Neil, there's -- they have been investigated more than anybody. They have turned over all their e-mails. They have talked to everybody who has ever e-mailed them. And there's been no support for any...\n(CROSSTALK)\nCAVUTO: They actually didn't actually turn them over. It took multiple court orders to get the latest batch we have.\nCUBAN: But, Neil, OK, so let's -- but, Neil, I just -- I really want to make this point.\nCAVUTO: Sure.\nCUBAN: The FBI talked to everybody that she emailed. So, whenever you emailed, there's two sides, right? There's the sender and the receiver.\n(CROSSTALK)\nCAVUTO: So, this is not a big deal to you. This is not a big deal.\nThey raised questions about her honesty. It's not a big deal.\nCUBAN: It is a nonevent.\nCAVUTO: All right.\nOn the markets in general, are you worried, after a pretty quiet August -- you are a pretty good investor -- that we are in for a rocky fall? Everyone worries about that as we get to the fall. Are you?\nCUBAN: Yes, absolutely, because we don't know what we don't know.\nI think there are so many external global influences on our market, what money comes here when there is uncertainty overseas, what money goes into treasuries, and where does it go if rates go higher or lower.\nAnd then there is the uncertainty of the election. I mean, I have my Trump hedge on. In the event Donald wins, I have no doubt in my mind the market tanks. And so I literally have put on a more than 100 percent hedge that I will get -- I will put on stronger if it looks like there's a better chance as we go forward.\nCAVUTO: Really?\nWhat does that mean? Donald Trump wins in November, what is Mark Cuban doing?\nCUBAN: Mark Cuban -- if the polls look like there is a decent chance that Donald could win, I will put a huge hedge on that's over 100 percent of my equity positions and my bond position as well that protects me just in case he wins.\nCAVUTO: What is so horrible about that prospect?\nCUBAN: I just think all the uncertainty.\nI mean, we don't know what Donald Trump's plans are. And just right now, all we know are a little bit about his immigration, which tends to change on a day-to-day basis. And we know he is going to reduce taxes significantly.\nWhen you reduce taxes significantly, there is a timeline involved. Everybody is going to put off selling and doing anything until next year because of the drop in tax rates, if he is able to get it passed.\nAnd because of that, you are going to see a huge sell-off, I think, in stocks, because people will take advantage of any type of tax gain. And then who knows if the flip side comes through to prop it back up? I don't know.\nAnd I can go through 20 other things. But the bottom line is, of all the things we can discuss, the one thing the markets hate is uncertainty. And right now, with Donald, there is uncertainty. And then, on the global peace basis, all you have to do is say the wrong thing one time, and there's no good that will come of it.\nCAVUTO: You never know. History -- history can be a fickle thing.\nMark Cuban, thank you so much for taking the time, my friend. I very much appreciate it.\nCUBAN: Any time, Neil.\nCAVUTO: Continued success.\nCUBAN: And I am so glad you are back. Continued health.\nCAVUTO: Thank you, my friend.\n(END VIDEOTAPE)\nContent and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.", "external_links": [], "published": "2016-09-06T03:00:00.000+03:00", "crawled": "2016-09-07T17:57:29.392+03:00", "highlightTitle": ""}