{"organizations": [], "uuid": "0a10865b1c9fcf513cf662457f581c222e540b16", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 11, "shares": 11, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/news/0/0/Pendejo%20Nieto.jpg", "site_section": "http://feeds.latino.foxnews.com/home/feed", "section_title": "FOX News", "url": "http://latino.foxnews.com/latino/opinion/2016/09/01/rick-sanchez-mexico-pena-nieto-gave-trump-chance-to-look-presidential/", "country": "US", "domain_rank": 185, "title": "Rick Sanchez: Mexico's Peña Nieto gave Trump a chance to look presidential | Fox News Latino", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "Rick Sanchez: Mexico's Peña Nieto gave Trump a chance to look presidential | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2016-09-01T03:00:00.000+03:00", "replies_count": 0, "uuid": "0a10865b1c9fcf513cf662457f581c222e540b16"}, "author": "Rick Sanchez", "url": "http://latino.foxnews.com/latino/opinion/2016/09/01/rick-sanchez-mexico-pena-nieto-gave-trump-chance-to-look-presidential/", "ord_in_thread": 0, "title": "Rick Sanchez: Mexico's Peña Nieto gave Trump a chance to look presidential | Fox News Latino", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "negative"}, {"name": "peña nieto", "sentiment": "negative"}, {"name": "rick sanchez", "sentiment": "negative"}, {"name": "trump", "sentiment": "none"}, {"name": "barack obama", "sentiment": "none"}, {"name": "bibi netanyahu", "sentiment": "none"}, {"name": "bill clinton", "sentiment": "none"}, {"name": "mitt romney", "sentiment": "none"}, {"name": "george w. bush", "sentiment": "none"}, {"name": "clinton", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "john mccain", "sentiment": "none"}, {"name": "yuri cortez", "sentiment": "none"}, {"name": "enda kenny", "sentiment": "none"}, {"name": "nieto", "sentiment": "none"}, {"name": "enrique peña nieto", "sentiment": "none"}], "locations": [{"name": "mexico", "sentiment": "none"}, {"name": "latino us", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "south carolina", "sentiment": "none"}, {"name": "missouri", "sentiment": "none"}, {"name": "indiana", "sentiment": "none"}, {"name": "arizona", "sentiment": "none"}, {"name": "mexico city", "sentiment": "none"}, {"name": "ireland", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}, {"name": "georgia", "sentiment": "none"}, {"name": "israel", "sentiment": "none"}, {"name": "iowa", "sentiment": "none"}], "organizations": [{"name": "fox news", "sentiment": "negative"}, {"name": "trump", "sentiment": "negative"}, {"name": "fox news latino", "sentiment": "none"}, {"name": "gop", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "national action party", "sentiment": "none"}, {"name": "facebook  follow us on twitter & instagram", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Rick Sanchez \nPublished September 01, 2016 Fox News Latino US presidential candidate Donald Trump (R) and Mexican President Enrique Peña Nieto prepare to deliver a joint press conference in Mexico City on August 31, 2016./ AFP / YURI CORTEZ (Photo credit should read YURI CORTEZ/AFP/Getty Images) This content is subject to copyright. \nFor one shining moment yesterday, Donald Trump seemed reasonable — maybe even statesmanlike. \nHe finally got a world leader to share a stage with him. Israel’s Bibi Netanyahu wanted no part of him and neither did the Scottish Parliament, while Ireland’s Enda Kenny announced he would only meet with Trump to “tell him he’s a racist.”\nSo along comes Mexico’s President Enrique Peña Nieto, who also happens to be the third most despised entity South of the Border behind only Trump and lice (yes, in that order), to throw the Republican presidential nominee’s floundering campaign a lifeline.\nNeedless to say, it was not a popular move by Peña Nieto. \nIn fact, with this one very public act of kissing Trump’s behind, he forever cements his image in the minds of the Mexican people as President “Pendejo” Nieto. He worshiped at the foot of the man who called his people “rapists.” \nPeña Nieto’s image, horribly tarnished by charges of corruption against both him and his wife and by his ham-handed attempt to brush the disappearance of 43 students under Mexico's carpet, is now even more damaged and may have just guaranteed a win by the conservative National Action Party (PAN) in the next presidential election.\nMeanwhile, Trump seems to have gained, if nothing else at least a great photo op in whichin that one brief moment he seemed almost presidential. But then he went and blew it by running back to his base at a rally in Arizona where people were actually holding up Hillary Clinton’s bloody head on a stick (not kidding, look at the video) and screaming for more than an hour. Trump’s message was as simple as it was wrong: Undocumented immigrants are bad and dangerous and I will get rid of them all. Nice!\nThe problem for Donald Trump is exactly what a TV executive once warned me about when I kept insisting on booking an easily excitable guest — “He scares people.” \nThis is bad, real bad for Donald Trump’s campaign. Not because it’s going to affect his base, the ones we saw last night at his Arizona rally. They’re locked in. \nThe voters he is scaring off are the very people who were willing to give him a chance. These voters aren’t Latinos or African-Americans, they’re long gone. nor are they Muslim, Asian or young. Trump has no chance with them either.\nThe one voting block Trump could possibly grow or at least maintain is made up of disaffected white, non-Asian, non-Latinos. These potential Trump voters would have been more than willing to support the GOP candidate as they have in the past. Many if not most of them chose John McCain and Mitt Romney over Barack Obama. They voted for Bill Clinton, but then turned around and voted for George W. Bush. \nYou could argue these are the voters who truly moderate our elections. Could I go as far as to suggest they keep us sane? \nNo, then let’s call what is going on right now white flight . \nThe so-called moderate or undecided white voters appear to be abandoning Trump by record numbers in states that have been unheard of for Republicans to lose in past elections — places like Georgia, Iowa, Missouri and Arizona, where Trump and Clinton are tied, and in places like Texas, Indiana and South Carolina where Clinton is within striking distance. \nLet me say that again, the Democratic candidate for the presidency of the United States is within a 4 to 8-point margin of winning in Texas, South Carolina and Indiana. \nIf present trends continue, what we’re witnessing is historic — a true game changer.\nThe election of Donald Trump, which once seemed improbable, is now looking downright impossible. In fact, the only thing that could make it worse, make it a complete blowout, would be for Trump to lose the support of his base. Then we would be looking at a landslide. \nThat could never happen, right? \nNo, because the only thing that could bring that about is a major Trump shift on his core positions. For example, Trump’s raison d'être — his reason for being, his essence — is immigration. He has based his entire campaign on “kicking out the illegals” faster than “our heads can spin” on “Day 1 of his presidency.”\nDevoted Trumpsters love that kind of talk. It’s their sweet spot, the sugar in their Southern sweet tea, the baloney in their sandwich and the gravy on their meatloaf. You can’t have one without the other. There is no Trump base without a Trump message about kicking out “the illegals.”\nAnd that is why last night Trump had to undo whatever goodwill President “Pendejo” Nieto may have bestowed on him. \n\nRick Sanchez is a contributor for Fox News Latino. \nLike us on Facebook \nFollow us on Twitter & Instagram", "external_links": [], "published": "2016-09-01T03:00:00.000+03:00", "crawled": "2016-09-01T19:37:35.680+03:00", "highlightTitle": ""}