{"organizations": [], "uuid": "7d7f812bcdb5cf60a0015fdddf3cfb81aad34ef2", "thread": {"social": {"gplus": {"shares": 2}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 7}, "facebook": {"likes": 66, "shares": 66, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/politics/0/0/Joe%20Heck%20Latinos.jpg", "site_section": "http://feeds.latino.foxnews.com/home/feed", "section_title": "FOX News", "url": "http://latino.foxnews.com/latino/politics/2016/09/07/nevada-race-for-us-senate-seat-heats-up-around-immigration-issue/", "country": "US", "domain_rank": 185, "title": "Nevada race for Senate seat heats up as immigration becomes central issue", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "Nevada race for Senate seat heats up as immigration becomes central issue | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2016-09-07T03:00:00.000+03:00", "replies_count": 0, "uuid": "7d7f812bcdb5cf60a0015fdddf3cfb81aad34ef2"}, "author": "Fox News Latino", "url": "http://latino.foxnews.com/latino/politics/2016/09/07/nevada-race-for-us-senate-seat-heats-up-around-immigration-issue/", "ord_in_thread": 0, "title": "Nevada race for Senate seat heats up as immigration becomes central issue", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  Fox News Latino U.S. Rep. Joe Heck on November 6, 2012 in Las Vegas, Nevada. Getty \nA Democratic super-PAC is set to launch a new Spanish-language ad in Nevada aimed at comparing Republican Rep. Joe Heck to his party’s presidential nominee, Donald Trump.\nThe Senate Majority PAC ad, which will run in Nevada’s two most populous cities of Las Vegas and Reno, draws parallels between Trump and Heck and harangues the lawmaker on issues like immigration and education. \nHeck is fighting former state Attorney General Catherine Cortez Masto, a Democrat, to replace longtime Democratic Nevada Sen. Harry Reid, who is set to retire at the end of the year.\nThe RealClearPolitics average of polls shows Heck and Cortez Masto in a statistical dead heat, with the Nevada lawmaker holding only a 0.2 percent lead over the former attorney general.\n\nThe ad references that Heck voted four times to rescind President Barack Obama’s executive orders that halted the deportation of people who immigrated to the country illegally as children and of illegal immigrants who are the parents of citizens and permanent residents.\nIt then juxtaposes that with a subtitled clip of Trump declaring, “We’re going to have a deportation force.”\nThe ad also hits Heck for voting to cut Pell grants, and then follows it up with a clip of the Republican presidential nominee pledging  to cut the Department of Education.\n“On the issues that matter most to us, there is no difference between Joe Heck and Donald Trump,” the narrator concludes in Spanish.\nWhile the ad was done by a Democratic super-PAC, Cortez Masto has had no problem comparing her rival to Trump while she’s on the campaign trail.\n“It is crazy to me that in this day and age we're having this discussion about electing somebody who is full of hate and discrimination,\" Cortez Masto said. \"I have an opponent I'm running against, Congressman Heck, who is supporting him.\"\nHeck insisted such attacks won't work.\n\"People know who Joe Heck is,\" he said. \"This idea of identity politics or guilt by association, I think the electorate is smarter than that.\"\nIf Heck faces a challenge in being linked to Trump, Cortez Masto is confronting something similar in her connections to Reid, who is closely involved in her campaign and has put his still-formidable political machine behind her. Reid, 76, is a polarizing figure in the state, beloved by many Democrats but loathed by Republicans.\nCortez Masto, a cautious campaigner who has not previously faced a highly competitive race, is quick to change the topic when asked about him.\n\"Sen. Reid's not on the ballot, and to me this is a race I'm focused on about the issues that people in my state, where I was born and raised, care about, because I will be representing them in Washington, not Sen. Reid,\" Cortez Masto said.\nThe Associated Press contributed to this report. \nLike us on Facebook \nFollow us on Twitter & Instagram", "external_links": [], "published": "2016-09-07T03:00:00.000+03:00", "crawled": "2016-09-07T23:36:20.750+03:00", "highlightTitle": ""}