{"organizations": [], "uuid": "f89d0e3056b052bd98e84747afa60a2a629d9784", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 9, "shares": 9, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/media2.foxnews.com/BrightCove/694940094001/2016/08/26/0/0/694940094001_5100189198001_1280-out-gitmo-1280.jpg?ve=1", "site_section": "http://feeds.foxnews.com/foxnews/world", "section_title": "FOX News", "url": "http://www.foxnews.com/world/2016/09/15/ex-gitmo-detainee-awakes-from-coma-after-uruguay-protest.html", "country": "IT", "domain_rank": 185, "title": "Ex-Gitmo detainee awakes from coma after Uruguay protest", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "Ex-Gitmo detainee awakes from coma after Uruguay protest | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2016-09-15T03:00:00.000+03:00", "replies_count": 0, "uuid": "f89d0e3056b052bd98e84747afa60a2a629d9784"}, "author": "Associated Press", "url": "http://www.foxnews.com/world/2016/09/15/ex-gitmo-detainee-awakes-from-coma-after-uruguay-protest.html", "ord_in_thread": 0, "title": "Ex-Gitmo detainee awakes from coma after Uruguay protest", "locations": [], "entities": {"persons": [{"name": "wolosky", "sentiment": "none"}, {"name": "lee wolosky", "sentiment": "none"}, {"name": "mirza", "sentiment": "none"}, {"name": "cristian mirza", "sentiment": "none"}, {"name": "dhiab", "sentiment": "none"}, {"name": "julia galzerano", "sentiment": "none"}, {"name": "abu wa'el dhiab", "sentiment": "none"}], "locations": [{"name": "montevideo", "sentiment": "none"}, {"name": "ex-gitmo", "sentiment": "none"}, {"name": "guantanamo", "sentiment": "none"}, {"name": "uruguay", "sentiment": "none"}, {"name": "cuba", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "argentina", "sentiment": "none"}, {"name": "venezuela", "sentiment": "none"}, {"name": "turkey", "sentiment": "none"}, {"name": "montevideo", "sentiment": "none"}, {"name": "guantanamo bay", "sentiment": "none"}], "organizations": [{"name": "associated press", "sentiment": "none"}, {"name": "medical union", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "  livefyre Email Print   \nMONTEVIDEO, Uruguay –   A former Guantanamo detainee reportedly has awakened from a coma that resulted from a hunger strike to dramatize his unhappiness about being resettled in Uruguay and his demand to be moved to another country.\nCristian Mirza, the Uruguayan government's liaison with six resettled detainees, said Thursday that Abu Wa'el Dhiab had come out of the coma at his apartment in Montevideo.\nDr. Julia Galzerano of the Medical Union of Uruguay said Dhiab was extremely dehydrated after 11 days without water, but said his vital signs were generally good, despite kidney problems.\nShe said paramedics found him unconscious when they arrived at the apartment where the 45-year-old Syrian has been staying in Montevideo. He remained at the apartment for treatment, in keeping with his wishes not to be hospitalized during his protest.\nA supporters' group known as Vigil for Jihad Dhiab said he began to regain consciousness after treatment with a saline solution. But it said that after regaining lucidity, he decided to remove the intravenous line.\nDhiab drew international attention through hunger strikes during his 12 years of occasionally confrontational confinement at the U.S. military base in Guantanamo Bay, Cuba. Released in December 2014, he could not return to his war-torn homeland and was taken in as a refugee by Uruguay along with five other freed detainees.\nWhile the others mostly stayed out of the spotlight, Dhiab grew increasingly disgruntled in this South American country.\nLess than two months after his arrival, he turned up in neighboring Argentina, and denounced the U.S. failure to close Guantanamo. U.S. officials said the trip violated an understanding he not leave the country but Uruguay has said there was no such agreement.\nHe also publicly complained about life in Uruguay, to the increasing irritation of the government, and he protested outside the U.S. Embassy. In July, he set off alarms when he vanished for several weeks, before turning up in Venezuela, which sent him back to Uruguay.\nAt some point, he began the hunger strike seeking to pressure Uruguay's government into allowing him to join his wife and children in Turkey or another nation.\nMirza said Wednesday that officials have been working \"at the highest levels\" to find another country that would accept Dhiab.\nWhile at Guantanamo, where he was detained as an enemy combatant with suspected ties to militants but was never charged, Dhiab saw his weight drop at one point to about 155 pounds, gaunt for a man over 6 feet tall. Authorities there said he often struggled with guards, who forcibly removed him from his cell at least 48 times in less than a single year of his protest. Troops also said he assaulted them with feces and vomit several times.\nAmbassador Lee Wolosky, the U.S. special envoy for Guantanamo closure, expressed bewilderment Wednesday about Dhiab's actions. He said Uruguay's government had been in \"very advanced stages\" of bringing Dhiab's wife and children from Turkey when Dhiab took off to Venezuela.\n\"I think that Dhiab has been offered every opportunity by the government of Uruguay to move on with his life and he has disgracefully repudiated the extraordinary hospitality and generosity of the government of Uruguay,\" Wolosky said in an interview with The Associated Press.\nThe envoy pointed out the former prisoner had agreed to the resettlement offer and said Uruguay provided him with a $500 monthly stipend and an apartment and offered language and vocational classes.\n\"He has gotten more support than refugees receive in that country in the normal course by far and he has received more support than many Uruguayan citizens receive,\" Wolosky said. \"He's had every opportunity to make good choices and be reunited with his family and he has instead made bad choices.\"", "external_links": [], "published": "2016-09-15T03:00:00.000+03:00", "crawled": "2016-09-15T17:21:40.668+03:00", "highlightTitle": ""}