{"organizations": [], "uuid": "bdaa915bc7f67526e479c93818fefc9402cbbc4b", "thread": {"social": {"gplus": {"shares": 1}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 9}, "facebook": {"likes": 889, "shares": 889, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/news/0/0/12134861w.jpg", "site_section": "", "section_title": "", "url": "http://latino.foxnews.com/latino/news/2016/09/15/conservative-latinos-launch-campaign-vs-ramos-for-biased-trump-coverage/", "country": "US", "domain_rank": 185, "title": "Conservative Latinos launch campaign against Univision reporter for biased Trump coverage | Fox News Latino", "performance_score": 8, "site": "foxnews.com", "participants_count": 0, "title_full": "Conservative Latinos launch campaign against Univision reporter for biased Trump coverage | Fox News Latino", "spam_score": 0.007, "site_type": "news", "published": "2016-09-15T23:15:00.000+03:00", "replies_count": 0, "uuid": "bdaa915bc7f67526e479c93818fefc9402cbbc4b"}, "author": "", "url": "http://latino.foxnews.com/latino/news/2016/09/15/conservative-latinos-launch-campaign-vs-ramos-for-biased-trump-coverage/", "ord_in_thread": 0, "title": "Conservative Latinos launch campaign against Univision reporter for biased Trump coverage | Fox News Latino", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Conservative Latinos launch campaign against Univision reporter for biased Trump coverage Published September 15, 2016 EFE \nWashington – A group of conservative Latino leaders launched a campaign against journalist Jorge Ramos and asked the Univision network to remove him from election coverage for having \"crossed a significant line\" with his open opposition to Republican presidential nominee Donald Trump. \n\"Journalists have a responsibility to report on (elections) with as much impartiality, independence and fairness as they can possibly muster — it is certainly not the job of journalists to tell citizens either who to vote against or who to vote for,\" said the members of the \"Ramos Must Go\" campaign. \nThey said that Ramos has shown himself to be incapable of being an impartial and credible anchor for Univision's millions of viewers. \nThey also said it would be in \"the interests of both Univision's audience and the capacity of the network itself to serve as an impartial and credible source of news\" to remove Ramos from his nightly news anchor duties until after Election Day. \nThe initiative was launched by the conservative Media Research Center and the statement was signed by at least 15 Hispanic political and media leaders, including Richard Aguilar, the editor of Latino American Today, and Luis Hernandez, the former news director at Noticias Mundo Fox. \nRamos - who is of Mexican origin, one of Univision's star journalists and probably the best-known Hispanic media personality in the United States - has openly criticized Trump's proposals to build a wall along the U.S.-Mexico border to halt illegal immigration and his remarks denigrating Mexican migrants to the United States. \nAfter being expelled by Trump from a press conference in Iowa last year, Ramos said that given the New York magnate's stances on various issues, \"There are certain instances in which you have to take a stand. ... I'm not saying (journalists) should put aside objectivity; I am saying neutrality is not an option.\" \nIn situations involving \"discrimination, racism, corruption, public lying, dictatorships, human rights, we're obligated to take sides,\" Ramos said in an interview with EFE last March. \nLike us on Facebook ", "external_links": [], "published": "2016-09-15T23:15:00.000+03:00", "crawled": "2016-09-15T19:20:26.045+03:00", "highlightTitle": ""}