{"organizations": [], "uuid": "8d07ea586b231f3d9e217d955644c23df72ad69a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 666, "shares": 666, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/feeds/Misc/2016/09/01/0/0/8829822-colin-kaepernick-nfl-san-fr-97a6b786236e6510VgnVCM100000d7c1a8c0____.jpg", "site_section": "http://feeds.latino.foxnews.com/home/feed", "section_title": "FOX News", "url": "http://latino.foxnews.com/latino/opinion/2016/09/08/opinion-kaepernicks-silent-protest-speaks-to-me-as-american-daughter/", "country": "US", "domain_rank": 185, "title": "Opinion: Kaepernick’s silent protest speaks to me as the American daughter of undocumented immigrants", "performance_score": 6, "site": "foxnews.com", "participants_count": 1, "title_full": "Opinion: Kaepernick’s silent protest speaks to me as the American daughter of undocumented immigrants | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2016-09-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "8d07ea586b231f3d9e217d955644c23df72ad69a"}, "author": "Elice Rojas-Cruz", "url": "http://latino.foxnews.com/latino/opinion/2016/09/08/opinion-kaepernicks-silent-protest-speaks-to-me-as-american-daughter/", "ord_in_thread": 0, "title": "Opinion: Kaepernick’s silent protest speaks to me as the American daughter of undocumented immigrants", "locations": [], "entities": {"persons": [{"name": "kaepernick", "sentiment": "negative"}, {"name": "colin kaepernick", "sentiment": "negative"}, {"name": "elice rojas-cruz    fox", "sentiment": "neutral"}, {"name": "megan rapinoe", "sentiment": "none"}, {"name": "elice rojas-cruz", "sentiment": "none"}], "locations": [{"name": "united states", "sentiment": "none"}, {"name": "kaepernick", "sentiment": "none"}, {"name": "san francisco", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "u.s.a.", "sentiment": "none"}], "organizations": [{"name": "national anthem", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "facebook  follow us on twitter & instagram", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Elice Rojas-Cruz \n  Fox News Latino \nColin Kaepernick has been in the news for sitting during the National Anthem, but he’s not the only one to protest our most patriotic emblem. I don’t sit, but for years now I don’t sing and I don’t place my hand over my heart during the Pledge of Allegiance. I’m an American, born to undocumented parents in a country that doesn’t want them. All my life, I have existed with the duality of growing up here, even as this country treats my family, and me by extension, like second-class citizens.\nLike Kaepernick, I won’t be proud of this country until this country treats all of our communities - African Americans, immigrants and people of color- the same as the white majority. Until that day comes to pass, I will sit. - Elice Rojas-Cruz\nThe reaction to Kaepernick’s silent protest has been fierce and divisive. The San Francisco 49er’s player said he wouldn’t show pride in a flag that oppresses black and brown people. Soccer player Megan Rapinoe took a knee in support of Kaepernick, who she said has been maligned by a news media unwilling – or unable – to cover the issue fairly. As a lesbian woman, she said that she knows what it’s like to feel discriminated against in this country. Their actions created an uproar, even though for some time now celebrities and sports figures have been more vocal about their political and social concerns.\nUnlike most of us, Kaepernick has a national platform on which he can display his beliefs. His actions struck a chord. I identify with Kaepernick’s actions and have the same concerns. I, too, will sit with him.\nFrom a young age, I had trouble showing pride in my country. Born and raised in New York, I grew up with undocumented parents. I kept my family secret for nearly 10 years. During that time, federal immigration officials threatened to deport them. I questioned why we lived in the United States when it was clear the country didn’t want us here. I didn’t understand why my family was considered a threat to the only place I’ve ever known. Immigration came at us hard.\nEvery time we passed a police officer or had an encounter with a government or school official, we faced the threat that my family would be torn apart. Even as a young child, I spent my life with a heightened sense of awareness.\nWhen I was 12, my parents decided to make things right. They applied for residency, but were denied and instead received their first deportation orders. Which meant that as my friends were worrying about the latest clothes or being cool, I was questioning my identity as an American.\nWhere did we – I – belong if not here. In the end, my parents decided to risk staying and lived quietly hidden in suburbia for many years after that. My parents believed in my future so strongly that they refused to leave. I was a bright student and held the potential to be the first  in my family to graduate from college. My parents thought the risk was worth it if it meant I would have opportunities to thrive in the United States.\nMy early questioning turned into anger and frustration. I would stand during the Pledge of Allegiance in school, but I refused to place my hand over my heart. I was born here, but I didn’t feel protected by the same rights as my white classmates under that red, white and blue flag. My peers and teachers gave me side-eye glances, but no one made a big deal because I was still standing for the flag. In post-9/11 New York, a few students chose to sit during the pledge. I watched those students get pulled into the principal’s office and questioned extensively. I couldn’t risk revealing my family’s identity. So I stood, but protested in my own quiet way. I didn’t recite, I didn’t sing, and I would not place my hand over my heart.\nIt wasn’t until college that I publically owned up to my parents’ status. I met the most nationalistic, U-S-A-chanting people I had ever met in my life. I told a few friends that I didn’t buy into such patriotism. That I actually didn’t love America all that much. I was met with stunned faces, quickly followed by a screaming argument. “How could you not love America? U.S.A. IS NUMBER ONE!” they argued. I felt attacked and scared. But it emboldened me enough to say for the first time out loud, “My parents are undocumented. This country does not want us here. How could I love a country that wants nothing to do with us?” Silence. The conversation never came up again and I was never questioned furhter. I was terrified revealing my family’s identity, but I also felt free to live my truth. Throughout the ensuing years, I told confidants about my family and what it was like growing up afraid in the country of your birth. When my parents finally became residents, I spoke about it publicly, on the internet, no less.\nIt’s been years since those experiences, but the same fear, frustration and sadness with a country that can’t embrace all of us, flooded back to me when I read about Kaepernick and why he was sitting for what he believes in. It takes a lot of courage and strength to act, and the attacks by the media and threats by police unions are unfair and unwarranted. His right to say what he believes does not mean that he’s a threat to this country, let alone his football team and fans. He is living his truth.\nMy views have changed a bit now that my parents have their papers. I’m proud that they are residents of the United States. Hopefully one day they will become citizens and I can watch them exercise their rights fully under that red, white and blue flag. But for now, I still can't place my hand on my heart because I know there are still immigrant children, families, and individuals that deserve comprehensive immigration reform and equal protection under the law. Like Kaepernick, I won’t be proud of this country until this country treats all of our communities - African Americans, immigrants and people of color- the same as the white majority. Until that day comes to pass, I will sit.\n\nElice Rojas-Cruz is a digital campaigner for Reform Immigration for America. \nLike us on Facebook \nFollow us on Twitter & Instagram", "external_links": [], "published": "2016-09-08T03:00:00.000+03:00", "crawled": "2016-09-08T20:13:22.550+03:00", "highlightTitle": ""}