{"organizations": [], "uuid": "c69533e7b1f7ca9ccc2a721eef30534f200dfbdb", "thread": {"social": {"gplus": {"shares": 1}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 3, "shares": 3, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/news/0/0/Obama%20and%20President%20of%20Colombia.jpg", "site_section": "http://feeds.latino.foxnews.com/home/feed", "section_title": "FOX News", "url": "http://latino.foxnews.com/latino/news/2016/09/17/obama-to-meet-with-colombian-president-to-discuss-historic-farc-peace-agreement/", "country": "US", "domain_rank": 185, "title": "Obama to meet with Colombian President to discuss historic FARC peace agreement", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "Obama to meet with Colombian President to discuss historic FARC peace agreement | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2016-09-17T03:00:00.000+03:00", "replies_count": 0, "uuid": "c69533e7b1f7ca9ccc2a721eef30534f200dfbdb"}, "author": "Fox News Latino", "url": "http://latino.foxnews.com/latino/news/2016/09/17/obama-to-meet-with-colombian-president-to-discuss-historic-farc-peace-agreement/", "ord_in_thread": 0, "title": "Obama to meet with Colombian President to discuss historic FARC peace agreement", "locations": [], "entities": {"persons": [{"name": "obama", "sentiment": "negative"}, {"name": "barack obama", "sentiment": "negative"}, {"name": "rhodes", "sentiment": "none"}, {"name": "boko haram", "sentiment": "none"}, {"name": "muhammadu buhari", "sentiment": "none"}, {"name": "shawn thew", "sentiment": "none"}, {"name": "ben rhodes", "sentiment": "none"}, {"name": "juan manuel santos", "sentiment": "none"}, {"name": "antony blinken", "sentiment": "none"}, {"name": "haider al-abadi", "sentiment": "none"}, {"name": "santos", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "western hemisphere", "sentiment": "none"}, {"name": "nigeria", "sentiment": "none"}, {"name": "syria", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "north korea", "sentiment": "none"}, {"name": "colombia", "sentiment": "none"}, {"name": "baghdad", "sentiment": "none"}, {"name": "oval office", "sentiment": "none"}, {"name": "washington, dc", "sentiment": "none"}, {"name": "iraq", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "ethiopia", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "jordan", "sentiment": "none"}, {"name": "africa", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}, {"name": "aleppo", "sentiment": "none"}, {"name": "mosul", "sentiment": "none"}, {"name": "sweden", "sentiment": "none"}], "organizations": [{"name": "farc", "sentiment": "negative"}, {"name": "u.n.", "sentiment": "none"}, {"name": "islamic state", "sentiment": "none"}, {"name": "state", "sentiment": "none"}, {"name": "revolutionary armed forces of colombia", "sentiment": "none"}, {"name": "general assembly", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "u.n. general assembly", "sentiment": "none"}, {"name": "ap", "sentiment": "none"}, {"name": "facebook  follow us on twitter & instagram", "sentiment": "none"}, {"name": "democratic party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "  Fox News Latino WASHINGTON, DC - FEBRUARY 04: U.S. President Barack Obama meets with Colombian President Juan Manuel Santos in the Oval Office of the White House on February 4, 2016 in Washington, DC. Obama and Santos are expected to make a bid for increased aid for Colombia and talk about \"Plan Colombia\", a U.S. aid initiative started in 2000 to help combat Colombian drug cartels. (Photo by Shawn Thew - Pool/Getty Images) 2016 Getty Images \nWASHINGTON (AP) –   President Barack Obama will review military strategy against the Islamic State group, press nations to admit more refugees and review progress around the world, despite new challenges, when he makes his final appearance at the U.N. General Assembly session in New York next week, the White House said Friday.\nOn the sidelines of the session, Obama has scheduled meetings with the leaders of Iraq, Nigeria and Colombia and plans to promote trade between the U.S. and Africa.\nObama heads to New York on Sunday for the General Assembly session that opens Monday, his eighth and final as president.\nHe plans to sit down Monday with Iraqi Prime Minister Haider al-Abadi to discuss progress the country has made countering the Islamic State group, a coming Iraqi military operation to take back the city of Mosul from IS militants, and a brewing humanitarian crisis inside Iraq, said Ben Rhodes, Obama's deputy national security adviser.\nDeputy Secretary of State Antony Blinken said this week while visiting Baghdad that Iraqi forces aided by the U.S.-led coalition against IS had retaken half the territory that militants once held in the country. He also announced more than $181 million in aid to address a humanitarian crisis that has festered in Iraq as a result of the insurgency.\nDespite a series of major defeats in recent months, IS has maintained its grip on Mosul, Iraq's second largest city. Iraq hopes to launch an operation this year to retake Mosul.\nObama delivers his final address to the yearly gathering of world leaders on Tuesday, and will use the opportunity to \"step back\" and review some of the progress over the past eight years along with \"some of the trends that have been shaping our international order,\" said Rhodes, previewing the trip for reporters.\nThe Syrian conflict continues to confound world leaders, although a recent cease-fire agreement appears to be holding, but Syria has not yet allowed humanitarian aid to flow to the city of Aleppo and other affected areas. Meanwhile, North Korea continues to defy the international community with its recent nuclear and ballistic missile tests.\nObama also plans to meet Tuesday with Nigerian President Muhammadu Buhari, who has held office for just over a year, to talk about continued U.S. support for security and economic changes in the country, as well the government's efforts to counter the Islamic extremist group Boko Haram.\nAt a summit on refugees that the president is hosting, Obama is expected to press more nations to open their borders and help double the number of refugees who are resettled around the world. Mexico, Sweden, Canada, Germany, Jordan and Ethiopia are co-hosting the summit along with U.N. Secretary-General Ban Ki-moon.\nEurope has shouldered a large portion of the Syrian refugee crisis. Canada welcomed 25,000 Syrian refugees, and the U.S. recently met its goal of resettling 10,000 Syrian refugees this year.\nObama will devote a portion of Wednesday, the final day of the General Assembly session, to promoting trade between the U.S. and Africa. He was attending a summit with some 200 American and African CEOs, and African heads of state.\nThe president also plans to meet with Colombian President Juan Manuel Santos, mainly to discuss a historic peace agreement recently struck between Santos' government and the Revolutionary Armed Forces of Colombia rebel group to end 52 years of hostilities, the Western Hemisphere's longest-running war.\nThe U.S. supported the peace effort, and the people of Colombia will vote on it a nationwide referendum in early October.\nOn Sunday evening in New York, Obama was headlining a Democratic Party fundraiser.\nLike us on Facebook \nFollow us on Twitter & Instagram", "external_links": [], "published": "2016-09-17T03:00:00.000+03:00", "crawled": "2016-09-17T22:04:06.519+03:00", "highlightTitle": ""}