{"organizations": [], "uuid": "15cb581c9aa63989e990c8e252d605cc42e51d74", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/FNL/Politics/0/0/trump%20hil%20latino.jpg", "site_section": "http://feeds.latino.foxnews.com/home/feed", "section_title": "FOX News", "url": "http://latino.foxnews.com/latino/politics/2016/09/26/in-first-debate-trump-and-clinton-spar-over-trade-deals-and-mexico/", "country": "US", "domain_rank": 185, "title": "In first debate Trump and Clinton spar over trade deals and Mexico | Fox News Latino", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "In first debate Trump and Clinton spar over trade deals and Mexico | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2016-09-26T03:00:00.000+03:00", "replies_count": 0, "uuid": "15cb581c9aa63989e990c8e252d605cc42e51d74"}, "author": "Fox News Latino", "url": "http://latino.foxnews.com/latino/politics/2016/09/26/in-first-debate-trump-and-clinton-spar-over-trade-deals-and-mexico/", "ord_in_thread": 0, "title": "In first debate Trump and Clinton spar over trade deals and Mexico | Fox News Latino", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "negative"}, {"name": "clinton", "sentiment": "negative"}, {"name": "trump", "sentiment": "negative"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "conway", "sentiment": "none"}, {"name": "bernie sanders", "sentiment": "none"}, {"name": "barack obama", "sentiment": "none"}, {"name": "bill clinton", "sentiment": "none"}, {"name": "obama", "sentiment": "none"}], "locations": [{"name": "mexico", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "n.y.", "sentiment": "none"}, {"name": "u.s", "sentiment": "none"}, {"name": "michigan", "sentiment": "none"}, {"name": "hempstead", "sentiment": "none"}, {"name": "vermont", "sentiment": "none"}, {"name": "middle east", "sentiment": "none"}, {"name": "ohio", "sentiment": "none"}], "organizations": [{"name": "fox news latino republican", "sentiment": "negative"}, {"name": "quinnipiac university", "sentiment": "none"}, {"name": "islamic state", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "associated press", "sentiment": "none"}, {"name": "congress", "sentiment": "none"}, {"name": "gop", "sentiment": "none"}, {"name": "congressional research service", "sentiment": "none"}, {"name": "goldman", "sentiment": "none"}, {"name": "ap", "sentiment": "none"}, {"name": "hofstra university", "sentiment": "none"}, {"name": "facebook  follow us on twitter & instagram", "sentiment": "none"}, {"name": "trump university", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Published September 26, 2016 Fox News Latino Republican presidential nominee Donald Trump and Democratic presidential nominee Hillary Clinton spar during the presidential debate at Hofstra University in Hempstead, N.Y., Monday, Sept. 26, 2016. (AP Photo/David Goldman) Copyright 2016 The Associated Press. All rights reserved. \nIn their first face-off just weeks before one of them becomes U.S. president, GOP nominee Donald Trump and Democratic rival Hillary Clinton sparred over trade agreements, with Trump frequently assailing U.S. companies that have taken production to Mexico.\nThe debate took place as the most recent polls showed Trump and Clinton in a virtual tie, with Quinnipiac University calling the election on Monday “too close to call.”\nTrump blamed Clinton for what he says have been \"defective\" trade agreements that have cost American jobs.\nTrump said Mexico taxes American products imported there, but the U.S. does not tax Mexican imports.\n“Our jobs are fleeing the country, they’re going to Mexico. Thousands of jobs are leaving Michigan, leaving Ohio,” Trump said. “We have to stop our jobs from being stolen from us…We have to stop our companies from leaving the United States and firing the American people.”\nHe says Clinton's been \"doing this for 30 years,\" a reference to her long career on the American political scene.\nClinton responded that she held jobs, such as senator from New York and secretary of state, that did not give her a primary role in crafting trade agreements.\nTrump also criticized the North American Free Trade Agreement, which was approved under President Bill Clinton, Hillary Clinton's husband.\nThe nonpartisan Congressional Research Service has said that 1994 deal had a \"relatively small\" impact on the U.S. economy.\nLatinos are considered one of the most important voting blocs this year, with 27 million eligible to vote. If the race remains close leading up to Nov. 8, getting their support, and getting them to the polls, will be particularly crucial, experts say.\nDespite Clinton's advantages, including a sophisticated get-out-the-vote operation and a favorable electoral map, Trump has gained on the former secretary of state.\nClinton has tended to poll better among Latinos than Trump, whose remarks about mass deportation and Mexico -- as well as his doubts that an Indiana-born judge presiding over a Trump University case can be objective because of his Mexican heritage – have alienated many Hispanics.\n\"African Americans, Hispanics, are living in hell,\" said Trump in answer to a question about racial unrest in cities across the country following police shooting.\nTrump also denounced gangs made up of undocumented immigrants when he was discussing the violence in urban areas.\nThe centerpiece of Trump's campaign has been a push for restrictive immigration measures, including a physical wall along the U.S.-Mexico border and an early proposal to temporarily bar foreign Muslims from coming to the U.S.\nAbout 75 minutes into the expected 90-minute debate, the issue of immigration did not arise, except for Trump's remark that the union of immigration agents had endorsed him.\nAt the Republican National Convention in July, and in a major speech about immigration in recent weeks, Trump put a spotlight on undocumented immigrants who had killed Americans, inviting the victims’ relatives to the stage to talk about their painful experiences.\nClinton has called for expanding President Barack Obama's executive orders if Congress won't pass legislation to overhaul the nation's immigration system.\nSurveys of Latinos, however, show a lack of enthusiasm over Clinton, for many of the same reasons other voters who lean Democratic have tempered support for her.\nNational interest in the race has been intense, and the campaigns were expecting a record-breaking audience to watch Monday's event – the first of three -- at suburban New York's Hofstra University.\nTrump and Clinton have spent months tangling from afar and are divided on virtually every major issue facing the country.\nWhile Trump has spoken often about building a wall along the U.S.-Mexico border, and vowing to implement what he has termed extreme vetting of people wanting to some to the United States to live or work, he's been less detailed about other ideas, including his plan for stamping out the Islamic State group in the Middle East, and Conway suggested he'd be similarly reticent in the debate.\nClinton is banking on voters seeing her as a steady hand who can build on the record of President Barack Obama, whose popularity is rising as he winds down his second term in office.\nTrump was often a commanding presence in the Republican primary debates, launching biting personal attacks on his rivals. But at other times, he appeared to fade into the background, especially during more technical policy discussions — something he could not do with two candidates on stage.\nClinton has debated more than 30 times at the presidential level, including several one-on-one contests against Obama in 2008 and Vermont Sen. Bernie Sanders in 2016. But Monday's contest was her first presidential debate against a candidate from the opposing party.\nThe Associated Press contributed to this report. \nLike us on Facebook \nFollow us on Twitter & Instagram", "external_links": [], "published": "2016-09-26T03:00:00.000+03:00", "crawled": "2016-09-27T05:41:34.755+03:00", "highlightTitle": ""}