{"organizations": [], "uuid": "8843fd0aef1b797bcaf42358c619ed2f794e3d6e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 12, "shares": 12, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/images.foxnews.com/content/fox-news/us/2016/09/23/latest-clinton-backs-bill-allowing-11-lawsuits/_jcr_content/par/featured-media/media-0.img.jpg/0/0/1474657607183.jpg?ve=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/us/2016/09/23/latest-clinton-backs-bill-allowing-11-lawsuits.html", "country": "EU", "domain_rank": 185, "title": "The Latest: Clinton backs bill allowing 9/11 lawsuits | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "The Latest: Clinton backs bill allowing 9/11 lawsuits | Fox News", "spam_score": 0.006, "site_type": "news", "published": "2016-09-23T08:00:00.000+03:00", "replies_count": 0, "uuid": "8843fd0aef1b797bcaf42358c619ed2f794e3d6e"}, "author": "", "url": "http://www.foxnews.com/us/2016/09/23/latest-clinton-backs-bill-allowing-11-lawsuits.html", "ord_in_thread": 0, "title": "The Latest: Clinton backs bill allowing 9/11 lawsuits | Fox News", "locations": [], "entities": {"persons": [{"name": "clinton", "sentiment": "negative"}, {"name": "jim crow", "sentiment": "none"}, {"name": "joe burbank/orlando sentinel", "sentiment": "none"}, {"name": "bruce springsteen", "sentiment": "none"}, {"name": "tim kaine", "sentiment": "none"}, {"name": "barack obama", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "katie couric", "sentiment": "none"}, {"name": "kaine", "sentiment": "none"}, {"name": "fredrik skavlan", "sentiment": "none"}, {"name": "ralph nader", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "mike lee", "sentiment": "none"}, {"name": "martin luther king jr.", "sentiment": "none"}, {"name": "evan vucci", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "kathy miller", "sentiment": "none"}, {"name": "al gore", "sentiment": "none"}, {"name": "gary johnson", "sentiment": "none"}, {"name": "obama", "sentiment": "none"}, {"name": "johnson", "sentiment": "none"}, {"name": "jesse lehrich", "sentiment": "none"}, {"name": "walsh", "sentiment": "none"}, {"name": "hillary", "sentiment": "none"}, {"name": "antonin scalia", "sentiment": "none"}, {"name": "springsteen", "sentiment": "none"}], "locations": [{"name": "saudi arabia", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "penn.", "sentiment": "none"}, {"name": "houston", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}, {"name": "iowa", "sentiment": "none"}, {"name": "orlando", "sentiment": "none"}, {"name": "charlotte", "sentiment": "none"}, {"name": "iraq", "sentiment": "none"}, {"name": "new hampshire", "sentiment": "none"}, {"name": "fla.", "sentiment": "none"}, {"name": "mahoning county", "sentiment": "none"}, {"name": "aston", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "north carolina", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "utah", "sentiment": "none"}, {"name": "pennsylvania", "sentiment": "none"}, {"name": "norway", "sentiment": "none"}, {"name": "nevada", "sentiment": "none"}, {"name": "ohio", "sentiment": "none"}, {"name": "sweden", "sentiment": "none"}], "organizations": [{"name": "facebook", "sentiment": "negative"}, {"name": "fox news", "sentiment": "negative"}, {"name": "trump", "sentiment": "none"}, {"name": "sun center studios", "sentiment": "none"}, {"name": "dagens nyheter", "sentiment": "none"}, {"name": "supreme court", "sentiment": "none"}, {"name": "abc", "sentiment": "none"}, {"name": "national museum of african american history and culture", "sentiment": "none"}, {"name": "associated press-gfk", "sentiment": "none"}, {"name": "associated press", "sentiment": "none"}, {"name": "nbc", "sentiment": "none"}, {"name": "guardian", "sentiment": "none"}, {"name": "nrk", "sentiment": "none"}, {"name": "national museum of african american history", "sentiment": "none"}, {"name": "ap", "sentiment": "none"}, {"name": "smithsonian institution", "sentiment": "none"}, {"name": "yahoo news", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The Latest: Clinton backs bill allowing 9/11 lawsuits Published September 23, 2016 Facebook 0 Twitter 0 Email Print Democratic presidential nominee Hillary Clinton meets and greets supporters during a campaign stop in Orlando, Fla., Wednesday, Sept. 21, 2016. (Joe Burbank/Orlando Sentinel via AP) (The Associated Press) Republican presidential candidate Donald Trump speaks during a campaign rally at Sun Center Studios, Thursday, Sept. 22, 2016, in Aston, Penn. (AP Photo/ Evan Vucci) (The Associated Press) FILE - In this photo Sept. 14, 2016, final preparations are being made for the opening of the National Museum of African American History and Culture in Washington. The museum opens in Washington this Saturday, Sept. 24, 2016, aiming to tell the story of black people in the U.S. through compelling artifacts, yet visitors will find few personal mementos from one of the most famous and influential black Americans, the Rev. Martin Luther King Jr. (AP Photo/Susan Walsh, File) (The Associated Press) \nWASHINGTON – The Latest on the U.S. presidential election campaign (all times EDT): \n2:45 p.m. \nHillary Clinton is breaking with President Barack Obama and backing legislation that would allow families of Sept. 11 victims to sue the government of Saudi Arabia for any role in the attack. \nThe Democratic presidential candidate would sign the bill if she were president. That's according to a spokesman, Jesse Lehrich. \nHe said Friday that Clinton continues to support efforts to \"hold accountable those responsible\" for the attacks. \nObama is expected to veto the bill later Friday. He says it would undermine already-strained diplomatic relations with a critical U.S. ally. \nCongressional leaders say they have the voters to override Obama's veto. \n___ \n1 p.m. \nIn the final sprint to Election Day, Donald Trump faces a daunting series of roadblocks in the minds of Americans as he tries to catch up to Hillary Clinton. \nThat's according to a new Associated Press-GfK poll that finds that more than half the country fears a Trump presidency. Only about third of Americans believe he is at least somewhat qualified to serve in the White House. \nMoreover, most voters oppose the hard-line approach to immigration that is the centerpiece of the billionaire businessman's campaign. \nWhile Trump undoubtedly has a passionate base of supporters, most voters don't share their fervor. Only 29 percent of registered voters would be excited and just 24 percent would be proud should Trump prevail in November. \n___ \n12 p.m. \nDemocratic vice presidential candidate Tim Kaine is highlighting some of Donald Trump's provocative statements about women, the same day Hillary Clinton's campaign released television ads doing the same. \nSpeaking at a rally at a union hall in Houston, Kaine said Trump has a troubling history of calling women \"fat pigs\" and \"dogs.\" \nThe Clinton campaign's new ad shows girls and women looking in the mirror as audio plays of Trump making insulting comments about women. \nKaine also criticized Trump's campaign for selling buttons on its website that say \"Hillary for prison.\" Kaine said Trump's history of name-calling will likely be on display during Monday's first presidential debate. \nKaine said: \"They name-call her because that's all they got folks.\" \n___ \n11:50 a.m. \nTim Kaine is warning those considering voting for Libertarian Gary Johnson as a form of protest that their decision could have \"deeply troubling\" consequences. \nThe Democratic vice presidential candidate says votes for third-party candidates have been costly. Kaine said if Ralph Nader hadn't pulled away votes from Al Gore in the 2000 election, then the U.S. \"probably wouldn't have had a war in Iraq.\" He spoke in an interview with Katie Couric for Yahoo News posted online Friday. \nKaine said \"everybody knows\" that Johnson won't win, but supporting him could help Republican presidential nominee Donald Trump. \nKaine said that \"casting a vote, a protest vote for a third-party candidate that's going to lose may well affect the outcome, and may well lead to a consequence that is deeply, deeply troubling.\" \n___ \n11:45 a.m. \nBruce Springsteen says Donald Trump's presidential campaign is a \"great embarrassment\" for Americans. \nThe Boss shared his thoughts on the Republican candidate as a guest on Swedish-Norwegian talk show \"Skavlan.\" \nIn an excerpt of the program posted online by Swedish newspaper Dagens Nyheter on Friday, Springsteen said he understands why people who have struggled to make ends meet could find some of Trump's arguments compelling. \nCommenting on Trump's chances, he said \"the absurdity is beyond cartoon-like. But he's gotten close enough so it can make you nervous. I don't think he's going to win, but even him running is a great embarrassment if you're an American.\" \nHosted by Norwegian TV personality Fredrik Skavlan, the talk show is produced jointly for public service broadcasters SVT of Sweden and NRK of Norway. \n___ \n11:35 a.m. \nDonald Trump has added 10 names to the list of people he says he'll choose from to fill Supreme Court vacancies. \nAmong the names on the list to be released Friday: Utah Sen. Mike Lee, who notably has yet to endorse the Republican nominee. \nThe list adds several minority judges to Trump's list. Nine of the 10 new names are men. The list was first reported by NBC. \nTrump in May unveiled a list of 11 federal and state court judges as potential replacements for the late Justice Antonin Scalia. \nTrump has wavered in the language he's used to describe the list. At times, he's said he would pick directly from it. At others, he's said the people he would nominate would share similar qualities to those on the list. \n___ \n7:30 a.m. \nPresident Barack Obama says it would good for Donald Trump to visit the Smithsonian Institution's new National Museum of African American History and Culture that is opening this weekend. \nObama was disputing the Republican presidential candidate's assertion that \"African-American communities are absolutely in the worst shape that they have ever been in before.\" \nIn an interview broadcast Friday on ABC's \"Good Morning America,\" Obama said: \"I think even most 8-year-olds would tell you that whole slavery thing wasn't very good for black people. Jim Crow wasn't very good for black people.\" \nWhen asked what advice he would give Hillary Clinton ahead of Monday's debate with Trump, Obama said she should be herself and explain what motivates her. \nHe said: \"She's in this for the right reasons.\" \n___ \n6:00 a.m. \nHillary Clinton's campaign is releasing a new television ad that rehashes some of Donald Trump's most provocative statements about women in the past. \nThe 30-second ad shows young girls and women looking in the mirror as they hear Trump describe various women as \"fat,\" a \"slob\" and one who \"ate like a pig.\" \nIt ends with the tag line: \"Is this the president we want for our daughters?\" It's the latest attempt by her campaign to use Trump's words against him and is similar to ads aimed at voters in battleground states, including veterans and people with disabilities. \nClinton's campaign plans to run the ad in Ohio, New Hampshire, Iowa, Florida, Nevada, North Carolina, Pennsylvania and on national cable. \n3:30 a.m. \nRepublican presidential candidate Donald Trump is seeking to show law-and-order toughness along with empathy for African-Americans as he criticizes violent protests stemming from another fatal police shooting of a black man. \nHis Democratic opponent, Hillary Clinton, was behind closed doors as she prepared for their initial debate and did not address on Thursday the escalating racial tensions in Charlotte, North Carolina. The city was under a midnight curfew after two previous nights of chaotic protests that led to one death as well as injuries, arrests and vandalism. \nTrump has spent the last several weeks asking black Americans for their support and asserting that President Barack Obama has failed the black community, but those appeals have been undermined at times. On Thursday, the Trump campaign accepted the resignation of an Ohio volunteer, Mahoning County chair Kathy Miller, who told the Guardian newspaper, \"I don't think there was any racism until Obama got elected.\" Advertisement ", "external_links": [], "published": "2016-09-23T08:00:00.000+03:00", "crawled": "2016-09-23T22:21:18.370+03:00", "highlightTitle": ""}