{"organizations": [], "uuid": "06e9bf829699aa1323db74bfb81d66314a893945", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 15, "shares": 15, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/FNL/Politics/0/0/lawsuit%20lgbt%20latino.jpg", "site_section": "http://feeds.latino.foxnews.com/home/feed", "section_title": "FOX News", "url": "http://latino.foxnews.com/latino/news/2016/09/24/transgender-mexican-immigrant-sues-indiana-over-law-preventing-him-from/", "country": "US", "domain_rank": 185, "title": "Transgender Mexican immigrant sues Indiana over law preventing him from changing first name | Fox News Latino", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "Transgender Mexican immigrant sues Indiana over law preventing him from changing first name | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2016-09-24T03:00:00.000+03:00", "replies_count": 0, "uuid": "06e9bf829699aa1323db74bfb81d66314a893945"}, "author": "Fox News Latino", "url": "http://latino.foxnews.com/latino/news/2016/09/24/transgender-mexican-immigrant-sues-indiana-over-law-preventing-him-from/", "ord_in_thread": 0, "title": "Transgender Mexican immigrant sues Indiana over law preventing him from changing first name | Fox News Latino", "locations": [], "entities": {"persons": [{"name": "dave cheatham", "sentiment": "none"}, {"name": "john doe", "sentiment": "none"}, {"name": "aaron c. morris", "sentiment": "none"}, {"name": "thomas saenz", "sentiment": "none"}, {"name": "saenz", "sentiment": "none"}, {"name": "hiroshi motomura", "sentiment": "none"}, {"name": "shawn meerkamper", "sentiment": "none"}], "locations": [{"name": "indiana", "sentiment": "none"}, {"name": "indianapolis", "sentiment": "none"}, {"name": "north dakota", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "ap", "sentiment": "negative"}, {"name": "fox news latino ap", "sentiment": "negative"}, {"name": "ucla", "sentiment": "none"}, {"name": "transgender law center", "sentiment": "none"}, {"name": "associated press", "sentiment": "none"}, {"name": "mexican american legal defense and educational fund", "sentiment": "none"}, {"name": "u.s. supreme court", "sentiment": "none"}, {"name": "facebook  follow us on twitter & instagram", "sentiment": "none"}, {"name": "immigration equality", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Published September 24, 2016 Fox News Latino AP \nINDIANAPOLIS (AP) –   A transgender man granted asylum by the U.S. last year is challenging an Indiana law that prevents him from changing his first name to a male name that matches his gender identity.\nThe 31-year-old, who was brought to Indiana from Mexico illegally by his parents at age six, contends in his federal lawsuit that Indiana's law requiring anyone seeking a name-change to provide proof of U.S. citizenship is unconstitutional and essentially forces him to \"out\" himself as transgender whenever he must display his driver's license.\nThat law was passed in 2010 amid what his attorneys say was a spate of \"anti-immigrant lawmaking\" in several states.\nThe man's federal lawsuit says his driver's license lists his sex as male alongside the female birth name he wants changed, a contradiction that's forced him to disclose to complete strangers the \"deeply personal information\" that he's transgender, causing him embarrassment, humiliation and fears of harassment and violence.\nThe man, identified in the suit only as \"John Doe,\" recalled in an interview the humiliation he faced when he visited an emergency room in 2013 for neck pain and nurses began talking about him and laughing when he told one he was transgender after she noticed his ID's female name.\n\"I felt really ashamed. I was in pain and I had to go through all that just to get medication,\" he told The Associated Press, declining to give his name to protect his privacy. \"I've done everything I can and just because of that law I can't live a normal life like everyone else. I just hate it.\"\nThe male gender and female name on his driver's license are the result of dissonance between state and federal rules.\nThe Indiana man was granted permission in 2013 to live and work legally in the U.S. under a federal government program that shields immigrants brought to the country illegally as children. At the same time, his gender was changed to male on all his U.S. government documents based on his diagnosis of gender dysphoria, in which a person feels extreme distress because of a disconnect between their birth sex and gender identity, his attorneys said. He used those documents to get an Indiana driver's license indicating he is male, but he can't change his name on the license because he needs a state court order, which Indiana won't grant because of its law.\nThe only similar state law is in North Dakota, which requires anyone seeking a name change to be a citizen or a permanent resident, said Shawn Meerkamper, an attorney for the Transgender Law Center, which filed the suit Sept. 13 on the Indiana man's behalf.\nIndiana's attorney general's office declined to comment on the suit, saying it would review the complaint \"and file a response in court at the appropriate time.\"\nThe man, who's married to a woman who is a U.S. citizen, takes hormones that have deepened his voice and given him a more masculine appearance. He won asylum last year as \"a protective step\" in case he were deported to Mexico, where he could face persecution for being transgender, said Thomas Saenz, general counsel for the Los Angeles-based Mexican American Legal Defense and Educational Fund, which joined his lawsuit.\nSaenz said the man expects to apply for permanent U.S. residency this month, but will still face at least a 3-year wait before that's approved.\nHiroshi Motomura, a law professor at UCLA who studies immigration and citizenship law, said Indiana's law is \"very vulnerable\" to the legal challenge because the U.S. Supreme Court has repeatedly ruled that states cannot treat U.S. citizens and permanent residents differently.\n\"And when someone gets asylum, they are on a normal track to getting permanent residency,\" he said.\nThe author of Indiana's law, former Democratic state Rep. Dave Cheatham, said he would support amending it to avoid difficulties for immigrants who \"have legal status and want to change their name.\"\nTransgender advocates say a growing number of foreign-born people are asking the U.S. to grant them asylum because of fears of LGBT persecution in their country of origin.\nThe New York-based advocacy group Immigration Equality put 366 foreign-born LGBT people into the asylum application process last year — more than double the 179 cases it handled in 2010. The group has about 600 open asylum cases for LGBT and HIV-positive people, said its executive director, Aaron C. Morris.\nLike us on Facebook \nFollow us on Twitter & Instagram", "external_links": [], "published": "2016-09-24T03:00:00.000+03:00", "crawled": "2016-09-24T19:02:18.705+03:00", "highlightTitle": ""}