{"organizations": [], "uuid": "419fa4a9816eaab2fca7b17193ef684049010ca1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.foxnews.com", "main_image": "http://www.foxnews.com/content/dam/fox-news/logo/og-fn-foxnews.jpg", "site_section": "http://feeds.foxnews.com/foxnews/world", "section_title": "FOX News", "url": "http://www.foxnews.com/world/2016/09/04/nationalists-strong-merkels-party-weak-german-exit-polls-show.html", "country": "IT", "domain_rank": 185, "title": "Nationalists strong, Merkel's party weak, German exit polls show", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "Nationalists strong, Merkel's party weak, German exit polls show | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2016-09-04T03:00:00.000+03:00", "replies_count": 0, "uuid": "419fa4a9816eaab2fca7b17193ef684049010ca1"}, "author": "Associated Press", "url": "http://www.foxnews.com/world/2016/09/04/nationalists-strong-merkels-party-weak-german-exit-polls-show.html", "ord_in_thread": 0, "title": "Nationalists strong, Merkel's party weak, German exit polls show", "locations": [], "entities": {"persons": [{"name": "merkel", "sentiment": "negative"}, {"name": "leif-erik holm", "sentiment": "none"}, {"name": "mecklenburg", "sentiment": "none"}, {"name": "erwin sellering", "sentiment": "none"}, {"name": "angela merkel", "sentiment": "none"}], "locations": [{"name": "berlin", "sentiment": "none"}, {"name": "hungary", "sentiment": "none"}, {"name": "saxony-anhalt", "sentiment": "none"}, {"name": "mecklenburg-western pomerania", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "islamic state", "sentiment": "none"}, {"name": "ard", "sentiment": "none"}, {"name": "left party", "sentiment": "none"}, {"name": "zdf", "sentiment": "none"}, {"name": "popular social democratic", "sentiment": "none"}, {"name": "national democratic party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "  livefyre Email Print BERLIN –   A nationalist, anti-immigration party performed strongly in a state election Sunday in the region where Chancellor Angela Merkel has her political base, likely overtaking her conservative party to take second place, exit polls indicated Sunday.\nExit polls for ARD and ZDF public television put support for Alternative for Germany, or AfD, in Sunday's election for the state legislature in Mecklenburg-Western Pomerania around 21 percent. They put support for Merkel's Christian Democrats at 19 or 20 percent, which would be their worst result yet in the state.\nThe center-left Social Democrats, who lead the outgoing state government, were expected to be the strongest party with about 30 percent support.\nMecklenburg-Western Pomerania is home to 1.6 million of Germany's 80 million people and is a relative political lightweight. It is, however, the state where Merkel has her parliamentary constituency, and Sunday's vote was the first of five regional votes before a national election a bit more than a year away.\n\"Perhaps this is the beginning of the end of Angela Merkel's chancellorship today,\" local AfD leader Leif-Erik Holm told supporters. His party, however, fell well short of its aim of becoming the strongest party, and also didn't match the 24.3 percent support it won in another eastern state, Saxony-Anhalt, in March.\nMerkel's refugee policies were a prominent issue in the campaign for Sunday's election, which came a year after she decided to let in migrants from Hungary — setting off the peak of last year's influx. Germany registered more than 1 million people as asylum-seekers last year.\nNew arrivals in Germany have slowed drastically this year. Still, New Year's Eve robberies and sexual assaults blamed largely on foreigners, as well as two attacks in July carried out by asylum-seekers and claimed by the Islamic State group, have fed tensions.\nMerkel has stuck to her insistence that \"we will manage\" the refugee crisis.\nMecklenburg was the only one of Germany's 16 states where the far-right National Democratic Party was represented in a state legislature, but it appeared to have lost its seats on Sunday. The exit polls put its support below the 5 percent needed to keep them, with many supporters apparently switching to AfD.\nThe state has been run for the past decade by the parties that currently run Germany. Popular Social Democratic governor Erwin Sellering has governed with Merkel's party as his junior partner. Both parties lost support compared with the last state election five years ago, when they polled 35.6 and 23 percent, respectively.\nThe opposition Left Party also lost support, slipping about six points to 12.5 percent, and the left-leaning Greens were hovering around the 5 percent mark.\nThere's no realistic prospect of AfD going into government.", "external_links": [], "published": "2016-09-04T03:00:00.000+03:00", "crawled": "2016-09-04T20:07:52.864+03:00", "highlightTitle": ""}