{"organizations": [], "uuid": "0ceb4a070bf07cd74c0958a9e31ec87648601bbe", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/images.foxnews.com/content/fox-news/us/2016/09/07/once-rivals-and-allies-clinton-schumer-eye-new-partnership/_jcr_content/par/featured-media/media-0.img.jpg/0/0/1473268691449.jpg?ve=1", "site_section": "http://feeds.foxnews.com/foxnews/national", "section_title": "FOX News", "url": "http://www.foxnews.com/us/2016/09/07/once-rivals-and-allies-clinton-schumer-eye-new-partnership.html", "country": "CH", "domain_rank": 185, "title": "Once rivals and allies, Clinton, Schumer eye new partnership", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Once rivals and allies, Clinton, Schumer eye new partnership", "spam_score": 0.0, "site_type": "news", "published": "2016-09-08T01:04:00.000+03:00", "replies_count": 0, "uuid": "0ceb4a070bf07cd74c0958a9e31ec87648601bbe"}, "author": "", "url": "http://www.foxnews.com/us/2016/09/07/once-rivals-and-allies-clinton-schumer-eye-new-partnership.html", "ord_in_thread": 0, "title": "Once rivals and allies, Clinton, Schumer eye new partnership", "locations": [], "entities": {"persons": [{"name": "schumer", "sentiment": "negative"}, {"name": "clinton", "sentiment": "negative"}, {"name": "chuck schumer", "sentiment": "none"}, {"name": "barack obama", "sentiment": "none"}, {"name": "charles schumer", "sentiment": "none"}, {"name": "bill clinton", "sentiment": "none"}, {"name": "polly trottenberg", "sentiment": "none"}, {"name": "obama", "sentiment": "none"}, {"name": "sean sweeney", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "marco rubio", "sentiment": "none"}, {"name": "julie pace", "sentiment": "none"}, {"name": "walsh", "sentiment": "none"}, {"name": "hillary", "sentiment": "none"}], "locations": [{"name": "new york city", "sentiment": "none"}, {"name": "manhattan", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "capitol", "sentiment": "none"}, {"name": "d-n.y.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "pennsylvania avenue", "sentiment": "none"}, {"name": "capitol hill", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}], "organizations": [{"name": "hunan dynasty", "sentiment": "none"}, {"name": "senate", "sentiment": "none"}, {"name": "associated press", "sentiment": "none"}, {"name": "congress", "sentiment": "none"}, {"name": "gop", "sentiment": "none"}, {"name": "ruth fremson/new york times", "sentiment": "none"}, {"name": "armed services committee", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "house", "sentiment": "none"}, {"name": "russell senate", "sentiment": "none"}, {"name": "ap", "sentiment": "none"}, {"name": "democratic", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Once rivals and allies, Clinton, Schumer eye new partnership   FILE - In this May 7, 2002 file photo, then-Sen. Hillary Clinton, D-N.Y., and Sen. Charles Schumer, D-N.Y., meet with reporters on Capitol in Washington to discuss their legislation to provide federal funds to help New York City schools recover from the Sept. 11, 2001 terrorist attacks. If Clinton wins the White House, Schumer is expected to be her top Democratic partner in the Senate _ with the November election also determining whether he’ll be leading a majority or minority party. In either case, their relationship would quickly become one of the most important in Washington, a crucial lynchpin in Clinton’s efforts to garner congressional support for her priorities. (AP Photo/Kenneth Lambert, File) (The Associated Press) FILE - In this May 22, 2007 file photo, Democratic presidential candidate then-second-term Sen. Hillary Clinton, D-N.Y., left, walks in the hallway of the Russell Senate office building on Capitol Hill in Washington with Sen. Charles Schumer, D-N.Y. If Clinton wins the White House, Schumer is expected to be her top Democratic partner in the Senate _ with the November election also determining whether he’ll be leading a majority or minority party. In either case, their relationship would quickly become one of the most important in Washington, a crucial lynchpin in Clinton’s efforts to garner congressional support for her priorities. (AP Photo/Susan Walsh, File) (The Associated Press) FILE - In this Sept. 11, 2003 file photo, then-Sen. Hillary Clinton, D-N.Y., center, and Sen. Charles Schumer, D-N.Y., right, bow their heads during a moment of silence as they join mourners gathering to remember those lost during the terrorist attacks on the World Trade Center at ground zero in New York. If Clinton wins the White House, Schumer is expected to be her top Democratic partner in the Senate, with the November election also determining whether he’ll be leading a majority or minority party. In either case, their relationship would quickly become one of the most important in Washington, a crucial lynchpin in Clinton’s efforts to garner congressional support for her priorities. (Ruth Fremson/New York Times, Pool, File) (The Associated Press) \nWASHINGTON – During their eight overlapping years in the U.S. Senate, Hillary Clinton and Chuck Schumer were political partners, friendly — and sometimes less than friendly — rivals. Both were influential powerbrokers for New York, his home state and her adopted one. \nNow, their political fortunes could be aligning once again. \nIf Clinton wins the White House, Schumer is expected to be her top Democratic partner in the Senate — with the November election also determining whether he'll be leading a majority or minority. In either case, their relationship would quickly become one of the most important in Washington, a linchpin in Clinton's efforts to garner congressional support for her priorities. \nThe two already speak a few times a month on the presidential race and Senate landscape. They're also eying an agenda for 2017 that includes a sweeping immigration overhaul, an infrastructure package and gun control legislation. \n\"We basically think alike,\" said Schumer, the Brooklyn-accented lawmaker with unfettered enthusiasm for the Senate's often tedious work. \"We have the same legislative approach: Let's reach out to get the other side and not let the perfect be the enemy of the good.\" \nThat professed spirit of bipartisanship is hardly reciprocated by Republicans in this election year. To some GOP lawmakers, the only thing as bad as Clinton occupying the White House is the prospect of a Schumer-led Senate at their end of Pennsylvania Avenue. \nFlorida Sen. Marco Rubio has wielded that possibility as a warning to voters during his own re-election campaign, saying that even if Republicans win the White House, \"you won't be able to get anything done because Chuck Schumer is blocking it.\" \nWhile Clinton and Schumer are stalwart Democrats, both can be more transactional than ideological. Schumer backed President Barack Obama's signature health care legislation in 2010, then panned the decision to pursue the measure after it damaged Senate Democrats' electoral prospects. Clinton called the Trans-Pacific Partnership the \"gold standard\" of trade agreements as secretary of state, then announced her opposition to the deal when it fell out of favor with her party. \nIn the Senate, their relationship was defined by an only-in-Washington blend of shared interests and personal ambition. \nAfter toiling in the House for nearly two decades, Schumer was eager to expand his national profile as New York's senior senator when Clinton arrived on Capitol Hill. The popular former first lady was instantly the Senate's biggest celebrity, effortlessly garnering the kind of attention the spotlight-seeking Schumer worked doggedly to attain. \nOne former Clinton aide recalled the senators standing together to catch the Senate subway when a group of students from New York approached Clinton to ask for a picture. When a student pressed a camera toward Schumer to ask if he might take the photo, Clinton quickly suggested the students get a picture with both of their state's senators, as the aide swooped in to intercept the camera. \nOn more substantive matters, the senators' staffs worked feverishly to keep each other in the loop on potential areas of disagreement, knowing the New York tabloids in particular were eager for any hint of a rift. Clinton largely deferred to Schumer on judicial issues, an area where he is passionate, while he took a backseat on the national security matters that passed through her Armed Services Committee. \n\"It took us about six months to a year to work things out,\" Schumer said. \"Neither of us is a wallflower.\" \nThey would still clash over seemingly minor issues — a kerfuffle over the naming of a courthouse in lower Manhattan still lingers in the minds of former aides — but joined forces when tragedy hit their state on Sept. 11, 2001. Together, they worked the halls of Congress and the White House to secure $20 billion in federal aid for New York. \n\"9/11 was a defining event in their relationship, it was a defining event in their careers,\" said Polly Trottenberg, a former Schumer adviser who currently serves as New York City's transportation commissioner. \"In some funny measure, the fact that the two of them were such a team had an effect on people.\" \nThe senators would occasionally swap strategy over dinner at Hunan Dynasty, Schumer's favorite Chinese restaurant near Capitol Hill — \"She hated the choice of the restaurant,\" says one former Clinton aide — but Schumer never became part of Hillary and Bill Clinton's expansive social circle. He did win their admiration when he stuck by her until the bitter end of her failed 2008 presidential campaign, resisting pressure to publicly switch to then-Sen. Barack Obama. \nIn some ways, Clinton's political failures deepened Schumer's respect. He's known to tell colleagues and staff that Clinton \"has had to climb the greasy pole\" — a colorful compliment about her ability to fight back from adversity and political defeats. \nSchumer allies say the senator sees a more natural partnership with Clinton than he's had with Obama. While Schumer has grown on Obama over the years, the president has struggled to connect with Schumer's passion for the Senate's political maneuvering and has shown little interest in the kind of pressure tactics and horse-trading that can be used to secure votes. \nWhile Obama largely delegated legislative outreach to his staff, aides say Clinton is more likely to call Schumer for suggestions about how she can woo individual lawmakers. \n\"At the level that they're at now, they've been together from the beginning,\" said Sean Sweeney, who has worked for both Schumer and Clinton. \"There's not going to be much of a getting to know each other period.\" \n___ \nFollow Julie Pace at http://twitter.com/jpaceDC Advertisement", "external_links": [], "published": "2016-09-08T01:04:00.000+03:00", "crawled": "2016-09-07T20:30:33.294+03:00", "highlightTitle": ""}