{"organizations": [], "uuid": "62ad1bd9239867be9412c70042ba2aaaa7008cad", "thread": {"social": {"gplus": {"shares": 1}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 97, "shares": 97, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/images.foxnews.com/content/fox-news/world/2016/09/15/doctor-says-hunger-striking-ex-gitmo-prisoner-slips-into-coma/_jcr_content/par/featured-media/media-0.img.jpg/0/0/1473908258839.jpg?ve=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/world/2016/09/15/doctor-says-hunger-striking-ex-gitmo-prisoner-slips-into-coma.html", "country": "EU", "domain_rank": 185, "title": "Doctor says hunger-striking ex-Gitmo prisoner slips into coma | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Doctor says hunger-striking ex-Gitmo prisoner slips into coma | Fox News", "spam_score": 0.145, "site_type": "news", "published": "2016-09-15T08:00:00.000+03:00", "replies_count": 0, "uuid": "62ad1bd9239867be9412c70042ba2aaaa7008cad"}, "author": "", "url": "http://www.foxnews.com/world/2016/09/15/doctor-says-hunger-striking-ex-gitmo-prisoner-slips-into-coma.html", "ord_in_thread": 0, "title": "Doctor says hunger-striking ex-Gitmo prisoner slips into coma | Fox News", "locations": [], "entities": {"persons": [{"name": "wolosky", "sentiment": "none"}, {"name": "jon eisenberg", "sentiment": "none"}, {"name": "christian mirza", "sentiment": "none"}, {"name": "lee wolosky", "sentiment": "none"}, {"name": "eisenberg", "sentiment": "none"}, {"name": "galzerano", "sentiment": "none"}, {"name": "jose mujica", "sentiment": "none"}, {"name": "dhiab", "sentiment": "none"}, {"name": "julia galzerano", "sentiment": "none"}, {"name": "abu wa'el dhiab", "sentiment": "none"}], "locations": [{"name": "california", "sentiment": "none"}, {"name": "montevideo", "sentiment": "none"}, {"name": "cuba", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "argentina", "sentiment": "none"}, {"name": "guantanamo", "sentiment": "none"}, {"name": "syria", "sentiment": "none"}, {"name": "venezuela", "sentiment": "none"}, {"name": "uruguay", "sentiment": "none"}, {"name": "turkey", "sentiment": "none"}, {"name": "montevideo", "sentiment": "none"}, {"name": "guantanamo bay", "sentiment": "none"}], "organizations": [{"name": "fox news doctor", "sentiment": "negative"}, {"name": "embassy", "sentiment": "none"}, {"name": "associated press", "sentiment": "none"}, {"name": "congress", "sentiment": "none"}, {"name": "taliban", "sentiment": "none"}, {"name": "medical union", "sentiment": "none"}, {"name": "ap", "sentiment": "none"}, {"name": "twitter", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Doctor says hunger-striking ex-Gitmo prisoner slips into coma Published September 15, 2016 Facebook 0 Twitter 0 livefyre Email Print FILE - In this Sept. 9, 2016 file photo, Syrian native Abu Wa'el Dhiab rests in bed while conversing with his family via a laptop, in his apartment in Montevideo, Uruguay. (AP) \nMONTEVIDEO, Uruguay – A former Guantanamo prisoner on a hunger strike slipped into a coma Wednesday, said a doctor in Uruguay, where the ex-detainee was taken in as a refugee nearly two years ago but has been demanding to move elsewhere to reunite with his family. \nAbu Wa'el Dhiab was unconscious and extremely dehydrated when paramedics arrived at the apartment where he is staying in Montevideo, said Dr. Julia Galzerano of the Medical Union of Uruguay, who was treating the former prisoner from Syria. \n\"We hope that it is reversible. We can't know\" for a while, Galzerano said. The doctor said she was told Dhiab had gone 12 days without water. \nDhiab was being treated at an apartment in keeping with his wishes not to be hospitalized during his protest. \nHe drew international attention by hunger-striking during his 12 years of occasionally confrontational confinement at the U.S. base in Guantanamo Bay, Cuba. He was released from Guantanamo in December 2014 but could not return to his homeland and was allowed to resettle in Uruguay. \nDhiab has grown increasingly disgruntled in the South American country and launched the hunger strike to pressure the government to allow him to join his family in Turkey or to go to another country. \nChristian Mirza, the former prisoner's liaison with the Uruguayan government, said officials have been working \"at the highest levels\" to find another country to accept him. \nThe 45-year-old Syrian was one of six freed Guantanamo prisoners taken in by Uruguay as a humanitarian gesture by then President Jose Mujica. While the others settled in, Dhiab has struggled. He announced in a Sept. 6 video that he had been on hunger strike at that point for 23 days and that he had taken nothing but water over the preceding five days. His weight was not publicly known. \nAt Guantanamo, where he was detained as an enemy combatant with suspected ties to militants but never charged, his weight dropped at one point to about 155 pounds (70) kilograms, gaunt for a man over 6 feet tall (183 centimeters). Authorities there said he often struggled with guards, who forcibly removed him from his cell at least 48 times in less than a single year of his protest. Troops also said he assaulted them with feces and vomit several times. \nIn Uruguay, Dhiab has stayed out of the public eye recently, protected by activists from several generally anti-government groups who have taken up his cause. \nJon Eisenberg, a California lawyer who represented Dhiab in the past, said he had not spoken with him since Aug. 31 and was unable to get direct information. \n\"I have no doubt that he is quite ill and in despair, but I fear that the people now surrounding him are exploiting his personal despair in pursuit of their own political agenda and are not acting in his best interest,\" Eisenberg said. \nIt was the latest turn in the case of a man who has become an international headache for Uruguay's government. \nLess than two months after his arrival in Uruguay, Dhiab turned up in neighboring Argentina, in violation of an agreement not to travel, and denounced the U.S. failure to close Guantanamo. He appeared in a mock orange prison jumpsuit, an icon of the prison that was opened in 2002 to hold suspected enemy combatants in the war against al-Qaida and the Taliban following the 9/11 terrorist attack. \nDhiab then began publicly complaining about life in Uruguay, to the increasing irritation of the government, and protesting outside the U.S. Embassy, angering members of Congress. In July, he set off alarms when he vanished for several weeks, then turned up in Venezuela, which rejected his request to be sent to Turkey to join his wife and children and sent him back to Uruguay. \nAmbassador Lee Wolosky, the U.S. special envoy for Guantanamo closure, expressed bewilderment Wednesday about Dhiab's situation, saying Uruguay's government had been in \"very advanced stages\" of bringing his wife and children from Turkey when he took off to Venezuela. \n\"I think that Dhiab has been offered every opportunity by the government of Uruguay to move on with his life and he has disgracefully repudiated the extraordinary hospitality and generosity of the government of Uruguay,\" Wolosky said in an interview with The Associated Press. \nThe envoy pointed out the former prisoner had agreed to the resettlement offer and said Uruguay provided him with a $500 monthly stipend and an apartment and offered language and vocational classes. The resettlement of the other five has been a \"success,\" in contrast with Dhiab, he said. \n\"He has gotten more support than refugees receive in that country in the normal course by far and he has received more support than many Uruguayan citizens receive,\" Wolosky said. \"He's had every opportunity to make good choices and be reunited with his family and he has instead made bad choices.\" Advertisement ", "external_links": [], "published": "2016-09-15T08:00:00.000+03:00", "crawled": "2016-09-15T06:07:17.456+03:00", "highlightTitle": ""}