{"organizations": [], "uuid": "41a263a50f7e2b9ccee51140482e3d64ada181e1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 96, "shares": 96, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/politics/0/0/Latino%20vote%20with%20flag.jpg", "site_section": "http://feeds.latino.foxnews.com/home/feed", "section_title": "FOX News", "url": "http://latino.foxnews.com/latino/politics/2016/09/04/latino-gop-strategist-on-arizona-think-that-right-now-were-at-tipping-point/", "country": "US", "domain_rank": 185, "title": "Latino GOP strategist on Arizona: 'I think that right now we're at a tipping point'", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "Latino GOP strategist on Arizona: 'I think that right now we're at a tipping point' | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2016-09-04T03:00:00.000+03:00", "replies_count": 0, "uuid": "41a263a50f7e2b9ccee51140482e3d64ada181e1"}, "author": "Fox News Latino", "url": "http://latino.foxnews.com/latino/politics/2016/09/04/latino-gop-strategist-on-arizona-think-that-right-now-were-at-tipping-point/", "ord_in_thread": 0, "title": "Latino GOP strategist on Arizona: 'I think that right now we're at a tipping point'", "locations": [], "entities": {"persons": [{"name": "hillary clinton", "sentiment": "negative"}, {"name": "richins", "sentiment": "none"}, {"name": "juan hernandez", "sentiment": "none"}, {"name": "flake", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "joe hunter", "sentiment": "none"}, {"name": "george w. bush", "sentiment": "none"}, {"name": "al gore", "sentiment": "none"}, {"name": "andy barr", "sentiment": "none"}, {"name": "gary johnson", "sentiment": "none"}, {"name": "barr", "sentiment": "none"}, {"name": "kyrsten sinema", "sentiment": "none"}, {"name": "ralph nader", "sentiment": "none"}, {"name": "clinton", "sentiment": "none"}, {"name": "dave richins", "sentiment": "none"}, {"name": "johnson", "sentiment": "none"}, {"name": "jill stein", "sentiment": "none"}, {"name": "tim sifert", "sentiment": "none"}, {"name": "ann kirkpatrick", "sentiment": "none"}, {"name": "gary", "sentiment": "none"}, {"name": "jeff flake", "sentiment": "none"}, {"name": "matthew sherman", "sentiment": "none"}], "locations": [{"name": "latino getty images  phoenix", "sentiment": "none"}, {"name": "arizona", "sentiment": "none"}, {"name": "new hampshire", "sentiment": "none"}, {"name": "oregon", "sentiment": "none"}, {"name": "utah", "sentiment": "none"}, {"name": "new mexico", "sentiment": "none"}, {"name": "wisconsin", "sentiment": "none"}, {"name": "colorado", "sentiment": "none"}, {"name": "mesa city", "sentiment": "none"}, {"name": "phoenix", "sentiment": "none"}, {"name": "iowa", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}], "organizations": [{"name": "ap", "sentiment": "negative"}, {"name": "fox news", "sentiment": "negative"}, {"name": "green party", "sentiment": "none"}, {"name": "senate", "sentiment": "none"}, {"name": "republican", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "associated press", "sentiment": "none"}, {"name": "gop", "sentiment": "none"}, {"name": "u.s. house", "sentiment": "none"}, {"name": "house", "sentiment": "none"}, {"name": "federal election commission", "sentiment": "none"}, {"name": "arizona republican party", "sentiment": "none"}, {"name": "libertarian party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "  Fox News Latino Getty Images \nPHOENIX (AP) –   If Hillary Clinton carries Arizona in November, there's a good chance it won't be because Democrats on their own have flipped a reliable GOP state they hope to win consistently someday.\nInstead, Clinton and Democrats may have Gary Johnson to thank.\nThe Libertarian Party nominee's best chance to influence the presidential race may come in Arizona, where the former New Mexico governor appeals to a group of finicky conservatives who make up part of the GOP base.\n\"It could happen,\" said GOP Sen. Jeff Flake. \"Donald Trump has managed to make this an interesting state in terms of presidential politics, and not in the way that Republicans have wanted.\"\nJohnson \"is an easy out for some people in our party,\" Flake told The Associated Press.\nAbout a dozen of the most contested states will help determine which candidate gets the 270 electoral votes to win the presidency. In Arizona, where the Republican nominee has carried the state in 11 of the past 12 presidential elections, Johnson could play the spoiler, potentially putting 11 electoral votes in Clinton's column.\nThe GOP's recent struggle with independent-minded, small-government Libertarians was clear before Trump's speech Wednesday in Phoenix, when he reaffirmed a hard line on immigration. And his stance could alienate the roughly one-quarter of Hispanic voters in the state who usually align with Republicans.\n\"I think that right now we're at a tipping point, where at any moment we are going to begin to see an outpouring of support,\" said Latino GOP strategist Juan Hernandez, who works for Johnson in Arizona.\nSensing an opportunity herself, Clinton began airing television advertisements in the state Friday, and has reserved $500,000 in ad time through mid-September.\nDemocratic strategist Andy Barr said Hispanic turnout was \"the multimillion-dollar question.\" About one-third of the state's population identifies as Latino, but their share of the vote ranges between 12 percent and 16 percent, according to public and private polling.\n\"This closer it gets to 20 percent, the more our chances of winning go up,\" Barr said.\nJohnson will appear on the ballot in every state this fall, while Green Party nominee Jill Stein is on track to make it in at least half. Neither is remotely within reach of carrying a state. Neither seems in a position to tip any state toward Trump.\nBut Johnson could move a close race toward Clinton, in much the same way that Ralph Nader pulled enough votes away from Democrat Al Gore in 2000 to hand Florida to Republican George W. Bush.\nFour years ago, Libertarian candidates in Arizona drew enough votes away from Republicans that Democrats Ann Kirkpatrick and Kyrsten Sinema won election to the U.S. House.\nFlake, who had endeared himself to many Libertarians while serving in the House, won his Senate race that year, too.\n\"It's a really sore spot for the party,\" Arizona Republican Party spokesman Tim Sifert said of those 2012 results. \"You could see people frustrated, throwing away their vote and going with a third-party candidate.\"\nThe views of most Libertarians, focused on personal liberty and small government, overlap more with Republicans than Democrats. Johnson's call for dramatically lower business taxes and regulation to unburden entrepreneurs resonates with Matthew Sherman of Phoenix, who describes himself as more as a conservative than as a Republican.\n\"I'm for whoever has the best plan on startup companies,\" said the 31-year-old who's working on a business networking app. \"So far, that's Gary.\"\nRepublican Dave Richins, a councilman in Mesa City, said Johnson is conservative on spending, but tolerant on social issues, which he calls \"a pragmatic combination.\"\n\"For me, a lifelong Republican, I don't agree with everything Johnson proposes,\" said Richins, a Johnson organizer. \"But I find his pragmatism refreshing. That's how we get things done.\"\nJohnson's hands-off approach to government also includes decriminalizing marijuana, and he could benefit from a November ballot proposal in Arizona on that question.\n\"That's another reason for Libertarians to vote in higher numbers,\" said Barr, who is running the decriminalization campaign. \"We're inclined to believe that could increase Johnson's performance.\"\nAt the beginning of August, Johnson's campaign had $1.2 million after raising $1.6 million in July, according to Federal Election Commission reports. Since Aug. 1, he's raised more than $3 million, according to his campaign. That's a paltry sum compared with Trump and Clinton, whose campaign said it raised a total of $143 million last month.\nJohnson is spending in a few competitive campaign states, including Colorado, Iowa, New Hampshire and Wisconsin, and less competitive ones such as Oregon, New Mexico and Utah.\nArizona is not on that list, but aides say it likely will be this fall.\n\"As a New Mexican, he's fairly well known in Arizona,\" said Johnson's spokesman, Joe Hunter. \"Arizona makes sense for us. We have a natural base of support there.\"\n ", "external_links": [], "published": "2016-09-04T03:00:00.000+03:00", "crawled": "2016-09-04T19:45:06.179+03:00", "highlightTitle": ""}