{"organizations": [], "uuid": "e8b1b635510a487d3631b0eaa75979fb2025f0e9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 2}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 80, "shares": 80, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/images.foxnews.com/content/fox-news/world/2016/09/25/prince-william-kate-middleton-bring-children-to-canada-for-first-official-trip/_jcr_content/par/featured-media/media-0.img.jpg/0/0/1474780351976.jpg?ve=1", "site_section": "http://feeds.foxnews.com/foxnews/world", "section_title": "FOX News", "url": "http://www.foxnews.com/world/2016/09/25/prince-william-kate-middleton-bring-children-to-canada-for-first-official-trip.html", "country": "IT", "domain_rank": 185, "title": "Prince William, Kate Middleton bring children to Canada for first official trip", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "Prince William, Kate Middleton bring children to Canada for first official trip | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2016-09-25T03:00:00.000+03:00", "replies_count": 0, "uuid": "e8b1b635510a487d3631b0eaa75979fb2025f0e9"}, "author": "Associated Press", "url": "http://www.foxnews.com/world/2016/09/25/prince-william-kate-middleton-bring-children-to-canada-for-first-official-trip.html", "ord_in_thread": 0, "title": "Prince William, Kate Middleton bring children to Canada for first official trip", "locations": [], "entities": {"persons": [{"name": "william", "sentiment": "negative"}, {"name": "kate", "sentiment": "negative"}, {"name": "kate middleton", "sentiment": "negative"}, {"name": "queen elizabeth ii", "sentiment": "none"}, {"name": "diana", "sentiment": "none"}, {"name": "elizabeth ii", "sentiment": "none"}, {"name": "prince charles", "sentiment": "none"}, {"name": "justin trudeau", "sentiment": "none"}, {"name": "darryl", "sentiment": "none"}, {"name": "charlotte", "sentiment": "none"}, {"name": "princess charlotte", "sentiment": "none"}, {"name": "jenny packham", "sentiment": "none"}, {"name": "harry", "sentiment": "none"}, {"name": "debbie burnham", "sentiment": "none"}, {"name": "trudeau", "sentiment": "none"}, {"name": "akaysha", "sentiment": "none"}, {"name": "amber bassett", "sentiment": "none"}, {"name": "prince george", "sentiment": "none"}, {"name": "linda gunther", "sentiment": "none"}, {"name": "george", "sentiment": "none"}], "locations": [{"name": "canada", "sentiment": "none"}, {"name": "cambridge", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "victoria", "sentiment": "none"}, {"name": "syria", "sentiment": "none"}, {"name": "barbados", "sentiment": "none"}, {"name": "british columbia", "sentiment": "none"}, {"name": "jamaica", "sentiment": "none"}, {"name": "charlotte", "sentiment": "none"}, {"name": "victoria", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}, {"name": "sheway", "sentiment": "none"}, {"name": "vancouver", "sentiment": "none"}, {"name": "little princess charlotte", "sentiment": "none"}, {"name": "pacific coast", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}, {"name": "glasgow", "sentiment": "none"}, {"name": "new zealand", "sentiment": "none"}], "organizations": [{"name": "duke", "sentiment": "none"}, {"name": "lock and co.", "sentiment": "none"}, {"name": "ap", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Published September 25,   livefyre Email Print Sept. 24, 2016: Kate, the Duchess of Cambridge, holds her daughter Princess Charlotte as she speaks to her son Prince George as she and her husband Britain's Prince William, the Duke of Cambridge, arrive in Victoria, British Columbia.  (Darryl Dyck/The Canadian Press via AP) \nVICTORIA, British Columbia –   Little Princess Charlotte, Prince George and their parents, Prince William and Kate, arrived in Canada on Saturday for their first official trip overseas as a family of four.\nCharlotte nibbled on her finger while being held by Kate as they were greeted by Canadian Prime Minister Justin Trudeau and his wife. A shy George hid behind his dad while holding his hand and looked for his mother who crouched down to comfort him. George later waved for the cameras but looked a little overwhelmed after a long flight.\nThe eight-day trip marks the first overseas jaunt for 1-year-old Charlotte. Her brother, 3-year-old George, has visited Australia and New Zealand on an official tour.\nThe public will only see the children once at their departure on Oct. 1 and the media will only see the kids a few times during an eight-day visit. The airport welcoming ceremony was closed to the public.\nRoyal watcher Debbie Burnham expressed disappointment but said she understands considering the distance traveled and all the attention.\n\"It would have been overwhelming for them,\" she said. \"This allows the parents to relax.\"\nKate wore a blue Jenny Packham dress with a hat by Lock and Co. and a maple leaf broach lent to her by Queen Elizabeth II for the Canada trip.\nOn their first official trip as newlyweds in 2011, the Duke and Duchess of Cambridge won raucous cheers and endeared themselves to Canadian crowds. On this visit the royals will visit British Columbia and the Yukon.\nThe kids did not attend the official welcoming ceremony where several thousand people greeted the royal couple at British Columbia's ornate government buildings in the provincial capital of Victoria.\n\"When we were here last time we were married only three months. The warm welcome that you gave us at that important part of our lives meant a lot to us and we've never forgotten it,\" William told the crowd. \"That is why we are so pleased that George and Charlotte can be with us in Canada this time around, beginning their lifetime of friendship with this wonderful country.\"\nThe 44-year-old Trudeau, who also received loud cheers, joked that getting the kids back on the plane could be a challenge after they see Canada's beautiful Pacific Coast.\n\"I know you've visited Canada before. But as any parent who has travelled with children knows, it's a different experience when you bring your whole family with you,\" Trudeau said. \"I want to commend you - and thank you - for introducing our part of the world to Prince George and Princess Charlotte.\"\nThe trip is Prince William's second to the province of British Columbia. He accompanied his father, Prince Charles, and his brother Harry in 1998, 11 months after the death of their mother Princess Diana. William recalled being a shy teenager then. Crowds of frenzied teenage girls greeted the princes in Vancouver then, cementing William's status as a teen heartthrob.\nRoyal watchers were thrilled to meet the couple Saturday.\n\"Oh my god, it was awesome,\" said Amber Bassett, whose daughter Akaysha, 2, gave the duchess some dahlias. \"She asked about my daughter and how old she was and she must be close in age to George. How awesome.\"\nLinda Gunther said it was fine George and Charlotte weren't there. \"They're kids. They're little,\" she said.\nFar from Victoria's marbled halls and manicured lawns, the royal couple will move to Vancouver on Sunday for a visit to the city's gritty Downtown Eastside, a dozen square blocks of poverty and addiction. They'll have tea with residents at Sheway, a support program for pregnant women and new mothers dealing with addiction and other challenges. William's mother Diana was on hand when Sheway's precursor opened in Glasgow, Scotland, in 1991.\nThe royals will then visit an immigrant welcome center where they will meet with a newly arrived refugee family from Syria. More than 30,000 Syrian refugees have arrived in Canada since Trudeau was elected last fall.\nWhile Australia, Jamaica and Barbados have talked about becoming republics, Canada has shown less interest in replacing Queen Elizabeth II as the figurative head of state. Canadians are somewhat indifferent to the monarchy, but most have great affection for the queen, as well as her grandsons and Kate.", "external_links": [], "published": "2016-09-25T03:00:00.000+03:00", "crawled": "2016-09-25T08:33:38.460+03:00", "highlightTitle": ""}