{"organizations": [], "uuid": "8827ae2e9b4d2e85fff681eccda10781ccf5725e", "thread": {"social": {"gplus": {"shares": 1}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 2}, "facebook": {"likes": 179, "shares": 179, "comments": 100}, "stumbledupon": {"shares": 0}}, "site_full": "www.buzzfeed.com", "main_image": "https://img.buzzfeed.com/buzzfeed-static/static/2016-09/9/17/campaign_images/buzzfeed-prod-fastlane01/the-alt-right-wants-to-professionalize-2-28829-1473457991-8_dblbig.jpg", "site_section": "http://www.buzzfeed.com/politics.xml", "section_title": "BuzzFeed - Politics", "url": "https://www.buzzfeed.com/rosiegray/the-alt-right-wants-to-professionalize", "country": "US", "domain_rank": 137, "title": "The Alt-Right Wants To Professionalize", "performance_score": 1, "site": "buzzfeed.com", "participants_count": 1, "title_full": "The Alt-Right Wants To Professionalize", "spam_score": 0.0, "site_type": "news", "published": "2016-09-10T05:53:00.000+03:00", "replies_count": 0, "uuid": "8827ae2e9b4d2e85fff681eccda10781ccf5725e"}, "author": "Rosie Gray", "url": "https://www.buzzfeed.com/rosiegray/the-alt-right-wants-to-professionalize", "ord_in_thread": 0, "title": "The Alt-Right Wants To Professionalize", "locations": [], "entities": {"persons": [{"name": "rosie gray", "sentiment": "negative"}, {"name": "breitbart", "sentiment": "none"}, {"name": "ku klux", "sentiment": "none"}, {"name": "spencer", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "brimelow", "sentiment": "none"}, {"name": "peter brimelow", "sentiment": "none"}, {"name": "steve bannon", "sentiment": "none"}, {"name": "richard spencer", "sentiment": "none"}, {"name": "taylor", "sentiment": "none"}, {"name": "jared taylor", "sentiment": "none"}], "locations": [{"name": "washington", "sentiment": "none"}, {"name": "spencer", "sentiment": "none"}, {"name": "willard hotel", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}], "organizations": [{"name": "national press club", "sentiment": "none"}, {"name": "national review", "sentiment": "none"}, {"name": "vdare", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "breitbart news", "sentiment": "none"}, {"name": "national policy institute", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Rosie Gray / BuzzFeed News ID: 9592258 \nWASHINGTON — A year ago, the alt-right was a loosely connected group of white nationalists mostly communicating online via trolling and memes. It’s still that, but now it has a logo and is holding press conferences right near the White House. \nThree white nationalist leaders — the National Policy Institute’s Richard Spencer, VDare’s Peter Brimelow, and American Renaissance founder Jared Taylor — held forth behind a lectern at the Willard Hotel on Friday afternoon next to an “AR” logo created by Spencer. The event was an attempt to capitalize on the heightened level of notoriety the group has achieved this year in tandem with the rise of Donald Trump, especially since HIllary Clinton mentioned them in a speech last month. It indicated that elements of the alt-right, nebulous as it is, seek to turn it into a more cohesive, professionalized movement. \n“The big challenge for the alt-right is professionalization,” Spencer said. “I understand people wanting to be anonymous but we’ve got to get beyond that. We’ve got to have professional organizations, professional people doing it, we’ve got to amp up what we’re already doing.” \n“We can’t be a Trump cheerleading squad,” Spencer said, acknowledging that some in the alt-right had discussed changing their level of support for Trump this summer when he started to waver on immigration. \nSpencer says he “wants to influence people,” and cited the neoconservative movement as a “model to be emulated,” starting out small and growing to have “tremendous impact.” \nTaylor, for his part, said he does envision a future in which alt-right candidates are running for office. \n“There’s no reason why people in the alt right can’t also run for office,” Taylor said. “I think that will happen as well.” \nThe alt-right — at least its more public-facing leaders like the three who held the press conference on Friday — has cultivated a kind of high-low aesthetic, delving into obscure political ideologies one moment and talking about “dank memes” the next. At one point during the press conference, Spencer described the Pepe frog meme as a “smug frog. This is someone who’s willing to speak the truth.” \nBrimelow, Spencer, and Taylor say alt-right ideas are gaining momentum. And while it’s certainly true that the movement has become more and more well-known, it’s tough to imagine that a movement that delves into such questions as “Did you realize that you could tell the races apart by [microbes] living in your mouth?” (a question posed by Taylor at one point during the press conference) and that consists of an unquantifiable number of mostly anonymous people will gain mainstream legitimacy in the near future. \nThe kerfuffle over the press conference itself shows how far they have left to go in terms of the professionalization Spencer seeks. The three had originally tried to book a space at the National Press Club, before the club canceled their reservation. The organizers waited until shortly before the beginning of the press conference to announce where it would take place, at one point telling attendees to go to the Old Ebbitt Grill where they would be met by a man in a charcoal suit who would lead them to the exact location. \nThough Spencer created a logo for the movement, he insisted that he, Taylor, and Brimelow are not attempting to present themselves as the alt-right’s leaders, instead describing them as “three important nodes in the alt right.” Taylor noted that most in the alt-right prefer to be anonymous, and that they are among the few who are “not afraid to face the cameras” for fear of social or professional repercussions. \nThe logo, Spencer said, is aesthetically influenced by his love of “synthwave nostalgia” and is meant to evoke what he described as the youthfulness and dynamism of the movement. The version shown at the press conference was in black and gold and printed out on a placard. In the original version displayed on the invitation to the event, the color scheme was done in blue and white, leading some on Twitter to compare the triangular white “A” to a Ku Klux Klan hood. \nThe press conference was billed as an explainer of the alt-right, but it was also focused on where the three men see things developing in the future, both politically and on a grander philosophical level. Brimelow sees the country breaking up geographically into different sections, while Spencer envisions a white ethno-state. But the matter of more immediate concern is still Trump’s campaign, which while not a perfect vessel for the alt-right is as close as anything has come, culminating in Trump’s hiring former Breitbart News chairman Steve Bannon, who has described Breitbart as “platform for the alt-right.” Alt-right members sneer not just at the left but also at movement conservatives, viewing them as relics who sold out on the issue that matters most: race. Brimelow dismissed National Review , for example, as a “cuckservative operation.” \n“Certainly we have been you could say riding his coattails,” Spencer said of Trump. He acknowledged the alt-right’s differences of opinion with Trump on policy but downplayed the importance of policies at all; “it’s about him,” Spencer said. “And it’s about in a way projecting onto him our hopes and dreams.” 2.", "external_links": [], "published": "2016-09-10T05:53:00.000+03:00", "crawled": "2016-09-10T04:05:45.816+03:00", "highlightTitle": ""}