{"organizations": [], "uuid": "4d629e5994ff26790ec5739de5592ceb97ae770e", "thread": {"social": {"gplus": {"shares": 1}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 33, "shares": 33, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/politics/0/0/Clinton%20Trump%20Crop.jpg", "site_section": "", "section_title": "", "url": "http://latino.foxnews.com/latino/politics/2016/09/26/after-months-sparring-from-afar-clinton-and-trump-set-for-highly-anticipated/", "country": "US", "domain_rank": 185, "title": "After months of sparring from afar, Clinton and Trump set for highly anticipated debate | Fox News Latino", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "After months of sparring from afar, Clinton and Trump set for highly anticipated debate | Fox News Latino", "spam_score": 0.064, "site_type": "news", "published": "2016-09-26T19:15:00.000+03:00", "replies_count": 0, "uuid": "4d629e5994ff26790ec5739de5592ceb97ae770e"}, "author": "", "url": "http://latino.foxnews.com/latino/politics/2016/09/26/after-months-sparring-from-afar-clinton-and-trump-set-for-highly-anticipated/", "ord_in_thread": 0, "title": "After months of sparring from afar, Clinton and Trump set for highly anticipated debate | Fox News Latino", "locations": [], "entities": {"persons": [{"name": "clinton", "sentiment": "negative"}, {"name": "trump", "sentiment": "negative"}, {"name": "kellyanne conway", "sentiment": "none"}, {"name": "flowers", "sentiment": "none"}, {"name": "bernie sanders", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "barack obama", "sentiment": "none"}, {"name": "robby mook", "sentiment": "none"}, {"name": "bill clinton", "sentiment": "none"}, {"name": "mark cuban", "sentiment": "none"}, {"name": "obama", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "conway", "sentiment": "none"}, {"name": "ted cruz", "sentiment": "none"}, {"name": "alex wong/getty images", "sentiment": "none"}, {"name": "justin", "sentiment": "none"}, {"name": "mook", "sentiment": "none"}, {"name": "lester holt", "sentiment": "none"}, {"name": "hillary", "sentiment": "none"}, {"name": "reince priebus", "sentiment": "none"}, {"name": "gennifer flowers", "sentiment": "none"}], "locations": [{"name": "las vegas", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "philadelphia", "sentiment": "none"}, {"name": "syria", "sentiment": "none"}, {"name": "u.s", "sentiment": "none"}, {"name": "philadelphia", "sentiment": "none"}, {"name": "iowa", "sentiment": "none"}, {"name": "vermont", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "las vegas", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "pennsylvania", "sentiment": "none"}, {"name": "middle east", "sentiment": "none"}, {"name": "nevada", "sentiment": "none"}], "organizations": [{"name": "islamic state", "sentiment": "none"}, {"name": "congress", "sentiment": "none"}, {"name": "republican national committee", "sentiment": "none"}, {"name": "wells fargo center", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "cnn", "sentiment": "none"}, {"name": "hofstra university", "sentiment": "none"}, {"name": "fox news latino", "sentiment": "none"}, {"name": "abc", "sentiment": "none"}, {"name": "nbc news", "sentiment": "none"}, {"name": "associated press", "sentiment": "none"}, {"name": "gop", "sentiment": "none"}, {"name": "fox new channel", "sentiment": "none"}, {"name": "pa", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "After months of sparring from afar, Clinton and Trump set for highly anticipated debate Published September 26, 2016 Fox News Latino (FILE PHOTO) In this composite image a comparison has been made between former US Presidential Candidates Hillary Clinton (L) and Donald Trump. ***LEFT IMAGE*** PHILADELPHIA, PA - JULY 28: Democratic presidential candidate Hillary Clinton delivers remarks during the fourth day of the Democratic National Convention at the Wells Fargo Center, July 28, 2016 in Philadelphia, Pennsylvania. Democratic presidential candidate Hillary Clinton received the number of votes needed to secure the party's nomination. An estimated 50,000 people are expected in Philadelphia, including hundreds of protesters and members of the media. The four-day Democratic National Convention kicked off July 25. (Photo by Alex Wong/Getty Images) ***RIGHT IMAGE*** LAS VEGAS, NV - DECEMBER 15: Republican presidential candidate Donald Trump during the CNN Republican presidential debate on December 15, 2015 in Las Vegas, Nevada. This is the last GOP debate of the year, with U.S. Sen. Ted Cruz (R-TX) gaining in the polls in Iowa and other early voting states and Donald Trump rising in national polls. (Photo by Justin Sullivan/Getty Images) 2016 Getty Images \nTwo vastly different visions of what's the United States' future should look like will be laid out in stark contrast as Hillary Clinton and Donald Trump confront each other face-to-face for the first time in Monday night's presidential debate at Hofstra University. \nThe high-stakes showdown — the first of three presidential debates — comes as both candidates are viewed negatively by large numbers of Americans, with Democrat Clinton facing questions about her trustworthiness and Republican Trump struggling to convince many voters that he has the temperament and policy depth to be president. \nInterest in the presidential race has been intense, and the campaigns are expecting a record-breaking audience to watch the 90-minute televised debate at suburban New York's Hofstra University. \nClinton, a former senator and secretary of state, is banking on voters seeing her as a steady hand who can build on the record of President Barack Obama, whose popularity is rising as he winds down his second term in office. She's called for expanding Obama's executive orders if Congress won't pass legislation to overhaul the nation's immigration system and for broader gun control measures. Overseas, she's called for a no-fly zone in Syria but has vowed to keep the military out of a large-scale ground war to defeat the Islamic State group. \nFor Clinton, victory in November largely hinges on rallying the same young and diverse coalition that elected Obama but has yet to fully embrace her. \n\"Hillary has recognized that she has a lot of work to do to earn people's trust,\" said Robby Mook, Clinton's campaign manager. \"We think this debate is a fantastic opportunity for her to present not just what she is going to do to make a difference in people's lives, but she actually has a long history of getting this done.\" \nTrump has tapped into deep anxieties among some Americans, particularly white, working-class voters who feel left behind in a changing economy and diversifying nation. While the real estate mogul lacks the experience Americans have traditionally sought in a commander in chief, he's banking on frustration with career politicians and disdain for Clinton to push him over the top on Election Day. \n\"He speaks a language that people out there can understand, and so I think that he's going to have a good night,\" Republican National Committee Chairman Reince Priebus said of Trump's debate prospects. \nThe centerpiece of Trump's campaign has been a push for restrictive immigration measures, including a physical wall along the U.S.-Mexico border and an early proposal to temporarily bar foreign Muslims from coming to the U.S. But he's been less detailed about other ideas, including his plan for stamping out the Islamic State group in the Middle East. \nClinton's camp is worried that Trump will be held to a different standard in the debate and is particularly concerned that the notoriously hot-headed businessman will be rewarded for simply keeping his cool. Clinton backers have been publicly pushing moderator Lester Holt of NBC News to fact-check Trump if he tries to mislead voters about his record and past statements. \n\"All that we're asking is that, if Donald Trump lies, that it's pointed out,\" Mook said. \nTrump's advisers have indeed been urging him to keep calm on stage, mindful of voters' concerns about his temperament. On Saturday, Trump showed a glimpse of the traits his advisers want to keep in check, announcing on Twitter that he might extend a debate invitation to Gennifer Flowers, a woman who had an affair with Clinton's husband, former President Bill Clinton. \nTrump's campaign said the candidate was responding to Clinton's decision to invite businessman and Trump critic Mark Cuban to the debate. And by Sunday morning, they said Flowers would not be attending. \nKellyanne Conway, Trump's campaign manager, said the candidate floated the invitation to \"remind people that he's a great counterpuncher.\" \nTrump was often a commanding presence in the Republican primary debates, launching biting personal attacks on his rivals. But at times, he appeared to fade into the background, especially during more technical policy discussions — something he'll be unable to do with just two candidates on stage. \nClinton has debated more than 30 times at the presidential level, including several one-on-one contests against Obama in 2008 and Vermont Sen. Bernie Sanders in 2016. But Monday's contest will be her first presidential debate against a candidate from the opposing party. \nMook and Conway spoke Sunday on ABC's \"This Week.\" Priebus appeared on Fox New Channel's \"Sunday Morning Futures.\" \nBased on reporting by The Associated Press. \nLike us on Facebook ", "external_links": [], "published": "2016-09-26T19:15:00.000+03:00", "crawled": "2016-09-26T15:41:32.937+03:00", "highlightTitle": ""}