{"organizations": [], "uuid": "a28fc764a4ae50d0d184bd14f71e8b916cbb4eff", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 2, "shares": 2, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/images.foxnews.com/content/fox-news/world/2016/09/15/un-refugee-agency-puts-focus-on-educating-kids-fleeing-war/_jcr_content/par/featured-media/media-0.img.jpg/0/0/1473917549477.jpg?ve=1", "site_section": "http://feeds.foxnews.com/foxnews/world", "section_title": "FOX News", "url": "http://www.foxnews.com/world/2016/09/15/un-refugee-agency-puts-focus-on-educating-kids-fleeing-war.html", "country": "IT", "domain_rank": 185, "title": "UN refugee agency puts focus on educating kids fleeing war | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "UN refugee agency puts focus on educating kids fleeing war | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2016-09-15T03:00:00.000+03:00", "replies_count": 0, "uuid": "a28fc764a4ae50d0d184bd14f71e8b916cbb4eff"}, "author": "Associated Press", "url": "http://www.foxnews.com/world/2016/09/15/un-refugee-agency-puts-focus-on-educating-kids-fleeing-war.html", "ord_in_thread": 0, "title": "UN refugee agency puts focus on educating kids fleeing war | Fox News", "locations": [], "entities": {"persons": [{"name": "filippo grandi", "sentiment": "none"}, {"name": "grandi", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "pakistan", "sentiment": "none"}, {"name": "kenya", "sentiment": "none"}, {"name": "ethiopia", "sentiment": "none"}, {"name": "chad", "sentiment": "none"}, {"name": "geneva", "sentiment": "none"}, {"name": "lebanon", "sentiment": "none"}, {"name": "turkey", "sentiment": "none"}, {"name": "libya", "sentiment": "none"}, {"name": "mediterranean sea", "sentiment": "none"}, {"name": "congo", "sentiment": "none"}, {"name": "sabratha", "sentiment": "none"}], "organizations": [{"name": "twitter", "sentiment": "negative"}, {"name": "associated press facebook", "sentiment": "negative"}, {"name": "fox news", "sentiment": "negative"}, {"name": "un", "sentiment": "negative"}, {"name": "u.n.", "sentiment": "none"}, {"name": "associated press", "sentiment": "none"}, {"name": "u.n. general assembly", "sentiment": "none"}, {"name": "united nations", "sentiment": "none"}, {"name": "unesco", "sentiment": "none"}, {"name": "ap", "sentiment": "none"}, {"name": "unhcr", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Published September 15, 2016 Associated Press Facebook 0 Twitter 0 Email Print In this photo taken on Saturday Sept. 10, 2016, African refugees and migrants wait aboard a partially punctured rubber boat to be assisted, during a rescue operation on the Mediterranean Sea, about 13 miles North of Sabratha, Libya. (AP Photo/Santi Palacios)  (The Associated Press) \nGENEVA –   Food, water and shelter are obvious basic needs for people fleeing war. But with refugees now spending roughly 20 years in exile on average, the U.N. refugee agency is calling on the world to do more to ensure refugee children have access to education as a fundamental right.\nOver 3.7 million school-age children, or about 62 percent of the children covered under the mandate of the United Nations High Commissioner for Refugees, have no schools to attend, the agency said in a report issued Thursday.\nEntitled \"Missing Out: Refugee Education in Crisis,\" the 48-page report's release comes as the U.N. General Assembly is preparing to host a summit on refugees and migrants in New York next week.\nU.N. High Commissioner for Refugees Filippo Grandi says that while education is vital for all children, it's especially crucial to help equip refugee children to succeed in work and life.\n\"Education is also a key contribution to keeping the hope of refugees, and in situations in which despair is so prevalent, going to school, learning, acquiring knowledge and skills, are fundamental,\" Grandi told The Associated Press in an interview Tuesday.\nComparing its own count of children attending school with global figures by the U.N. educational agency, UNHCR estimated that only half of all refugee children have access to primary education — compared to a world average of over 90 percent. And that rate only gets worse as refugee children get older.\nFewer than one in four of refugee adolescents attend secondary school compared to a global average of 84 percent, and only 1 percent of refugees attend university compared to about one in three people worldwide, according to the comparison with UNESCO figures.\n\"The average length of time a refugee spends in exile is about 20 years,\" Grandi wrote in the report's introduction. \"Given this sobering picture, it is critical that we think beyond a refugee's basic survival.\"\nThe report calls on charitable donors to take a longer-term approach by providing multi-year and not just emergency funding.\nThe U.N. refugee agency said about 86 percent of the world's refugees are hosted in developing regions, while over half of the out-of-school refugee children are located in just seven countries: Chad, Congo, Ethiopia, Kenya, Lebanon, Pakistan and Turkey.\nPointing to a growing population of school-age children worldwide over the last five years, the report says that countries seeing in an influx of refugees face a struggle of \"sheer numbers.\"\nWhile noting that host countries for refugees already face difficulties educating their own children, the report urges governments to make plans for including refugee children in their education systems.\n___\nUNHCR's full report: www.unhcr.org", "external_links": [], "published": "2016-09-15T03:00:00.000+03:00", "crawled": "2016-09-15T08:37:48.996+03:00", "highlightTitle": ""}