{"organizations": [], "uuid": "fe4cdd08da0152c10613a084a1cb98a36e3b75b2", "thread": {"social": {"gplus": {"shares": 1}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 4, "shares": 4, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/politics/0/0/Arpaio%20challenged%20by%20opponent.jpg", "site_section": "http://feeds.latino.foxnews.com/home/feed", "section_title": "FOX News", "url": "http://latino.foxnews.com/latino/politics/2016/09/17/sheriff-arpaio-challenged-by-opponent-for-investigating-obama-citizenship/", "country": "US", "domain_rank": 185, "title": "Sheriff Arpaio challenged by opponent for investigating Obama's citizenship", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "Sheriff Arpaio challenged by opponent for investigating Obama's citizenship | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2016-09-17T03:00:00.000+03:00", "replies_count": 0, "uuid": "fe4cdd08da0152c10613a084a1cb98a36e3b75b2"}, "author": "Fox News Latino", "url": "http://latino.foxnews.com/latino/politics/2016/09/17/sheriff-arpaio-challenged-by-opponent-for-investigating-obama-citizenship/", "ord_in_thread": 0, "title": "Sheriff Arpaio challenged by opponent for investigating Obama's citizenship", "locations": [], "entities": {"persons": [{"name": "joe arpaio", "sentiment": "negative"}, {"name": "arpaio", "sentiment": "negative"}, {"name": "obama", "sentiment": "negative"}, {"name": "bozo", "sentiment": "none"}, {"name": "chad willems", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "barack obama", "sentiment": "none"}, {"name": "john moore/getty images", "sentiment": "none"}, {"name": "lisa allen", "sentiment": "none"}, {"name": "paul penzone", "sentiment": "none"}], "locations": [{"name": "maricopa county", "sentiment": "none"}, {"name": "latino phoenix", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "getty images  phoenix", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "arizona", "sentiment": "none"}, {"name": "hawaii", "sentiment": "none"}, {"name": "phoenix", "sentiment": "none"}], "organizations": [{"name": "fox news", "sentiment": "negative"}, {"name": "republican", "sentiment": "none"}, {"name": "ap", "sentiment": "none"}, {"name": "facebook  follow us on twitter & instagram", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "  Fox News Latino PHOENIX - APRIL 29: Maricopa County sheriff Joe Arpaio speaks to participants of the Border Security Expo on April 29, 2010 in Phoenix, Arizona. Arpaio, promoted by his supporters as \"America's Toughest Sheriff\", voiced his support for Arizona's new immigration enforcement law. His deputies conduct frequent sweeps to arrest undocumented immigrants in his county, which includes the state capitol Phoenix. (Photo by John Moore/Getty Images) 2010 Getty Images \nPHOENIX (AP) –   The sheriff of metro Phoenix came under new criticism Friday from a political foe for his investigation of President Barack Obama's birth certificate on the same day that Republican nominee Donald Trump relented on his claim that the president wasn't born in the United States.\nSheriff Joe Arpaio has long questioned the president's American citizenship, launching an investigation in 2012 that remained open as late as two months ago. He once sent a sheriff's employee to Hawaii as part of the investigation and earned praise from Trump for his efforts. Arpaio defended the investigation by saying people in the county had requested it.\nHis opponent in the November election attacked Arpaio over the investigation Friday, saying the volunteer posse members who conducted the probe could have been used in other ways that could have actually made the community safer.\n\"Here, he has a resource with a volunteer base and instead of using it for serious public-safety investigations, he is wasting it on nonsense,\" said Democrat Paul Penzone, a retired Phoenix police sergeant.\nArpaio's campaign manager Chad Willems and the sheriff's office didn't respond to requests for comment Friday afternoon.\nThe sheriff has said his volunteers found probable cause that the president's long-form birth certificate was a computer-generated fake and questioned whether a selective service card completed by Obama in 1980 was a forgery. No arrests stemming from the investigation were ever made.\nArpaio initially said no taxpayer money would be spent on the investigation and that it would be funded through donations to the posse. But he later promised to use the donations to reimburse the county for some costs after it was revealed that he had sent a sheriff's employee to Hawaii as part of the case.\nThe sheriff won praise in a 2012 tweet from Trump: \"Congratulations to @RealSheriffJoe on his successful Cold Case Posse investigation which claims @BarackObama's 'birth certificate' is fake\"\nThe sheriff has never backed down from the investigation.\nTwo months ago, he said under oath in an unrelated deposition that the investigation into the birth certificate was ongoing. \"And, by the way, that investigation is not done yet,\" Arpaio testified.\nArpaio has said the investigation was necessary because nearly 250 people tied to an Arizona tea party group raised forgery allegations about Obama's birth record.\nAides to the sheriff tried unsuccessfully to dissuade him from pursuing the investigation as Arpaio was facing a tough re-election campaign in 2012.\nIn the 2014 documentary \"The Joe Show,\" then-Arpaio publicist Lisa Allen told the sheriff that pursuing the investigation he would make him \"look like Bozo the clown.\"\n\"Good, let them call me a kook,\" Arpaio said in the documentary. \"Let them do that. Add that one the list. Then we'll do a commercial on that.\"\nCritics have accused Arpaio of launching the investigation to divert attention from his worsening legal troubles and improve his already impressive campaign fundraising.\nArpaio is facing the toughest campaign in his 23 years in office.\nThree years ago, a federal judge concluded Arpaio's officers had racially profiled Latinos in regular traffic and immigration patrols. The judge asked federal prosecutors to bring a criminal contempt-of-court case against Arpaio for defying an order to stop the patrols.\nArpaio's support from voters has been waning in recent years, but his re-election bid is aided by $11 million in campaign fundraising during this election cycle. Much of the money comes from people living out of state.\nLike us on Facebook \nFollow us on Twitter & Instagram", "external_links": [], "published": "2016-09-17T03:00:00.000+03:00", "crawled": "2016-09-17T18:55:17.865+03:00", "highlightTitle": ""}