{"organizations": [], "uuid": "045a4fe19822ed0e510b19596a6c34f080f63e60", "thread": {"social": {"gplus": {"shares": 1}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/politics/0/0/Campaign%202016%20Distric_Garc.jpg", "site_section": "http://feeds.latino.foxnews.com/home/feed", "section_title": "FOX News", "url": "http://latino.foxnews.com/latino/politics/2016/09/29/large-texas-district-is-not-big-enough-for-opposing-candidates/", "country": "US", "domain_rank": 185, "title": "Neither candidate trying to represent large West district actually live there", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "Neither candidate trying to represent large West Texas district actually live there | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2016-09-29T03:00:00.000+03:00", "replies_count": 0, "uuid": "045a4fe19822ed0e510b19596a6c34f080f63e60"}, "author": "Fox News Latino", "url": "http://latino.foxnews.com/latino/politics/2016/09/29/large-texas-district-is-not-big-enough-for-opposing-candidates/", "ord_in_thread": 0, "title": "Neither candidate trying to represent large West district actually live there", "locations": [], "entities": {"persons": [{"name": "pete gallego", "sentiment": "negative"}, {"name": "pierson", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "tiday", "sentiment": "none"}, {"name": "justin hollis", "sentiment": "none"}, {"name": "tonya tiday", "sentiment": "none"}, {"name": "katrina pierson", "sentiment": "none"}, {"name": "nicolas", "sentiment": "none"}, {"name": "hurd", "sentiment": "none"}, {"name": "hollis", "sentiment": "none"}, {"name": "gallego", "sentiment": "none"}, {"name": "will hurd", "sentiment": "none"}, {"name": "pete sessions", "sentiment": "none"}, {"name": "maria elena ramon", "sentiment": "none"}], "locations": [{"name": "austin", "sentiment": "none"}, {"name": "west", "sentiment": "none"}, {"name": "west texas", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}, {"name": "el paso", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "pakistan", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "austin", "sentiment": "none"}, {"name": "helotes", "sentiment": "none"}, {"name": "hollywood", "sentiment": "none"}, {"name": "afghanistan", "sentiment": "none"}, {"name": "san antonio", "sentiment": "none"}, {"name": "india", "sentiment": "none"}], "organizations": [{"name": "ap", "sentiment": "neutral"}, {"name": "u.s. census bureau", "sentiment": "none"}, {"name": "hurd", "sentiment": "none"}, {"name": "associated press", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "gop", "sentiment": "none"}, {"name": "congress", "sentiment": "none"}, {"name": "alpine chamber of commerce", "sentiment": "none"}, {"name": "cia", "sentiment": "none"}, {"name": "wal-mart", "sentiment": "none"}, {"name": "texas a&m", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "  Rep. Pete Gallego in a Sept. 25, 2012, file photo. ap \nAUSTIN, Texas (AP) –   A West Texas congressional district sprawls 58,000-plus square miles and two time zones, from San Antonio to just outside El Paso. Yet neither the Republican who represents it nor the Democrat trying to reclaim the seat actually lives there.\nThe home of first-term Republican Rep. Will Hurd, 39, is in the San Antonio suburb of Helotes, just outside the borders of a district that is larger in land area than 29 states.\nThe challenger, former Rep. Pete Gallego, spends most of his time away from the district in Austin, but lists his official address as the remote town of Alpine, which is in the district. One of the properties his family owns there — a boarded up home and former cafe site — was recently slapped with a sign declaring it a \"dangerous\" violation of Alpine safety codes. Gallego has declined to say if he ever stays at one of the others.\nGallego, 54, keeps a district apartment in San Antonio that serves as his base while campaigning, but his wife, Maria Elena Ramon, and 11-year-old son Nicolas live 80 miles north of San Antonio in Austin. Contracts show Gallego worked in governmental relations positions there as recently as the summer of 2015, but a statement his campaign released Wednesday said he \"is not and never has been a registered lobbyist.\"\nFederal candidates aren't required to live in the district where they run for office, and districts represented by members of Congress who reside elsewhere are fairly common throughout the country. But few districts nationwide are as large as the one Hurd and Gallego are contesting.\nConservative Texas activists have sometimes tried to make living outside a congressional district an issue. GOP primary challenger and Dallas-area tea party organizer Katrina Pierson, now a national spokeswoman for Donald Trump's presidential campaign, accused longtime Republican Rep. Pete Sessions of it in 2014. That charge didn't stick and Sessions trounced Pierson. Hurd faced no serious primary challenger this cycle.\n\"You can't really make the argument that Will doesn't live in the district, either. He's in San Antonio all the time when he's away from Washington,\" said Hurd campaign manager Justin Hollis.\nA former Texas A&M student body president, Hurd spent nine years with the CIA in India, New York, Afghanistan and Pakistan before returning to Texas. Hurd's house in Helotes was part of the district when he first ran for Congress and lost in the Republican primary in 2010, Hollis said, and now is \"less than 100 yards\" outside it according to more-recent redistricting maps.\nAsked why Hurd hasn't moved into the district since, Hollis said it was a moot point because the congressman \"lives a stone's throw away.\"\nThe race is the only competitive one among Texas' 36 congressional districts. Hurd unseated Gallego two years ago by 2,422 votes out of more than 115,000 cast. Gallego is hoping that Trump's harsh immigration rhetoric and promises to build a wall the length of the U.S.-Mexico border can boost him in a district that's nearly 70 percent Hispanic and features 800-plus miles of Texas-Mexico border. Hurd counters that voters care more about issues like national security than about having Trump's name topping the GOP ticket.\nGallego says his family's Austin home is an investment property that his wife owns separately. Prior to his first congressional run in 2012, Gallego spent 22 years in the Texas Legislature. Although it meets in Austin, he kept a residence in Alpine because of a mandate in the state constitution that legislators live in the districts they represent.\n\"Alpine has been and always will be home,\" Gallego said in a statement to The Associated Press. \"Like many West Texans, my jobs have required me to travel. And, like many families, we've balanced two careers with raising a family.\"\nAlpine is a picturesque town 375 miles west of San Antonio where the cowboy culture and high desert mountain-dotted vistas seem straight out of a Hollywood western. Gallego was born and raised there and county records show he and his parents own several local properties, but Gallego avoided questions about where he resides while in town.\nBoth candidates' out-of-district residency may not mean much in a part of Texas that takes pride in just how empty it is. Featuring expansive pastureland, the district is listed by the U.S. Census Bureau as 99.5 percent rural, even though it includes swaths of San Antonio.\n\"The remoteness is the charm,\" said Tonya Tiday, assistant director of the Alpine Chamber of Commerce. She said Gallego's family name has long resonated in close-knit Alpine, but how much time he actually spends in town isn't a major concern.\n\"The sense of community is different than other places,\" Tiday said. \"It's the reason you'll never see a Wal-Mart out here.\"\n ", "external_links": [], "published": "2016-09-29T03:00:00.000+03:00", "crawled": "2016-09-29T15:02:05.702+03:00", "highlightTitle": ""}