{"organizations": [], "uuid": "50c35b5e30aafce65e365fab631eec0833c4b6b4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 4}, "facebook": {"likes": 91, "shares": 91, "comments": 0}, "stumbledupon": {"shares": 30}}, "site_full": "www.foxnews.com", "main_image": "http://www.foxnews.com/content/dam/fox-news/logo/og-fn-foxnews.jpg", "site_section": "http://feeds.foxnews.com/foxnews/world", "section_title": "FOX News", "url": "http://www.foxnews.com/world/2016/09/24/un-nearly-2-million-without-running-water-in-aleppo.html", "country": "IT", "domain_rank": 185, "title": "UN: Nearly 2 million without running water in Aleppo | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "UN: Nearly 2 million without running water in Aleppo | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2016-09-24T03:00:00.000+03:00", "replies_count": 0, "uuid": "50c35b5e30aafce65e365fab631eec0833c4b6b4"}, "author": "Associated Press", "url": "http://www.foxnews.com/world/2016/09/24/un-nearly-2-million-without-running-water-in-aleppo.html", "ord_in_thread": 0, "title": "UN: Nearly 2 million without running water in Aleppo | Fox News", "locations": [], "entities": {"persons": [{"name": "yassin abu raed", "sentiment": "none"}, {"name": "suleiman al-halabi", "sentiment": "none"}, {"name": "hanaa singer", "sentiment": "none"}], "locations": [{"name": "aleppo", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "castello road", "sentiment": "none"}, {"name": "syria", "sentiment": "none"}, {"name": "beirut", "sentiment": "none"}, {"name": "handarat", "sentiment": "none"}], "organizations": [{"name": "associated press facebook", "sentiment": "negative"}, {"name": "un", "sentiment": "negative"}, {"name": "local coordination committees", "sentiment": "none"}, {"name": "syrian observatory for human rights", "sentiment": "none"}, {"name": "unicef", "sentiment": "none"}, {"name": "u.n.", "sentiment": "none"}, {"name": "associated press", "sentiment": "none"}, {"name": "observatory", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Published September 24, 2016 Associated Press Facebook 0 Twitter 0 livefyre Email Print Syrian government forces captured a rebel-held area on the edge of Aleppo on Saturday, tightening their siege on opposition-held neighborhoods in the northern city as an ongoing wave of airstrikes destroyed more buildings.\nThe new government push came as the U.N. said that nearly 2 million people in Aleppo, Syria's largest city and onetime commercial center, are without running water following an escalation in fighting over the past few days.\nGovernment forces captured the rebel-held Palestinian refugee camp of Handarat as airstrikes pounded rebel-held eastern neighborhoods of Aleppo, killing at least 25 people, according to the Britain-based Syrian Observatory for Human Rights. The Local Coordination Committees, another monitoring group, said 49 were killed on Saturday alone.\nThe Observatory said the death toll in Aleppo is expected to rise since many wounded people are in critical condition and rescue workers are still digging through the rubble.\nResidents say the latest bombardment is the worst they've seen since rebels captured parts of the city in 2012.\nAn unnamed Syrian military official was quoted by state media on Friday as saying that airstrikes and shelling in Aleppo would continue for an extended period and \"include a ground offensive\" into rebel-held areas.\nThe fall of Handarat to Syrian troops allied with pro-government Palestinian fighters pushes insurgents further away from Castello Road, a main artery leading to rebel-held parts of the city, which is now controlled by the government.\n\"Breaking the siege through the Castello road has become very difficult,\" Yassin Abu Raed, an opposition activist based in Aleppo province, told The Associated Press.\nAn unnamed Syrian military official quoted by state TV confirmed the capture of Handarat, adding that many insurgents were killed. He said experts are removing explosives from the area. The camp, which is almost empty and largely destroyed, has witnessed intense fighting and bombardment in recent years. It has changed hands in the past between government forces and insurgents.\nThe push came as diplomats in New York have failed to salvage a cease-fire that lasted nearly a week, before giving way to what residents and activists say is a new level of violence. The bombing, which began in earnest late Wednesday, has been unprecedented, targeting residential areas, infrastructure and civil defense centers.\nA Western diplomat speaking to a group of journalists in Beirut said that in New York, the impression from meeting with the Russians was that there is no new offensive, but there are been some mixed messages from the ground. He said there had been reports of advances on the ground and some beefing up of the government and allied forces there.\n\"I will say it seems highly improbable that there will be quick defeat of eastern Aleppo,\" the diplomat said, referring to the rebel-held districts. \"The only way to take it is by such monstrous atrocities that it would resonate for generations.\"\n\"It would be absolutely the stuff of myth and history,\" he said.\nLiving conditions in the already-battered eastern districts have meanwhile grown even worse.\nHanaa Singer, UNICEF representative in Syria, said intense attacks damaged the Bab al-Nairab station, which supplies water to some 250,000 people in the rebel-held east.\nSinger said that in retaliation, the Suleiman al-Halabi pumping station, also located in the rebel-held east, was switched off — cutting water to 1.5 million people in government-held western parts of the city.\n\"Depriving children of water puts them at risk of catastrophic outbreaks of water-borne diseases,\" Singer warned in her statement, released late Friday.", "external_links": [], "published": "2016-09-24T03:00:00.000+03:00", "crawled": "2016-09-24T16:40:26.421+03:00", "highlightTitle": ""}