{"organizations": [], "uuid": "20ed2a64d8aaa052a47637719fdb29bfab437216", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "archive.is", "main_image": "http://archive.li/g72BF/53ca23740ee9c4124cb7d45ec4e7f944b61db818/scr.png", "site_section": "http://archive.is/rss", "section_title": "archive.is", "url": "http://archive.is/g72BF", "country": "IS", "domain_rank": 3638, "title": "In every state, pessimism about...", "performance_score": 0, "site": "archive.is", "participants_count": 0, "title_full": "In every state, pessimism about...", "spam_score": 0.0, "site_type": "news", "published": "2016-09-07T18:33:00.000+03:00", "replies_count": 0, "uuid": "20ed2a64d8aaa052a47637719fdb29bfab437216"}, "author": "", "url": "http://archive.is/g72BF", "ord_in_thread": 0, "title": "In every state, pessimism about...", "locations": [], "entities": {"persons": [{"name": "clinton", "sentiment": "neutral"}, {"name": "trump", "sentiment": "neutral"}, {"name": "donald j. trump", "sentiment": "none"}, {"name": "david sherfinski", "sentiment": "none"}, {"name": "evan vucci/ap", "sentiment": "none"}, {"name": "tim kaine", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "david muir", "sentiment": "none"}, {"name": "kaine", "sentiment": "none"}, {"name": "muir", "sentiment": "none"}, {"name": "anne holton", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "jason chaffetz", "sentiment": "none"}, {"name": "james comey", "sentiment": "none"}, {"name": "goldie taylor", "sentiment": "none"}, {"name": "mike pence", "sentiment": "none"}, {"name": "howard", "sentiment": "none"}], "locations": [{"name": "upper midwest", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "cleveland", "sentiment": "none"}, {"name": "capitol hill", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}, {"name": "new national poll patch.com", "sentiment": "none"}, {"name": "canfield", "sentiment": "none"}, {"name": "lone star state", "sentiment": "none"}, {"name": "d-va.", "sentiment": "none"}, {"name": "usa", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "clinton benghazi", "sentiment": "none"}, {"name": "new poll time", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}, {"name": "ohio", "sentiment": "none"}], "organizations": [{"name": "washington post", "sentiment": "neutral"}, {"name": "trump washington post", "sentiment": "none"}, {"name": "trump leads clinton among military", "sentiment": "none"}, {"name": "fox news", "sentiment": "none"}, {"name": "department of justice", "sentiment": "none"}, {"name": "canfield fair", "sentiment": "none"}, {"name": "republican party", "sentiment": "none"}, {"name": "capitol hill", "sentiment": "none"}, {"name": "cnn", "sentiment": "none"}, {"name": "nbc news/surveymonkey", "sentiment": "none"}, {"name": "congress politico", "sentiment": "none"}, {"name": "imani temple ministries", "sentiment": "none"}, {"name": "senate", "sentiment": "none"}, {"name": "credit al drago/the new york times", "sentiment": "none"}, {"name": "cbs news", "sentiment": "none"}, {"name": "breitbart news", "sentiment": "none"}, {"name": "gop", "sentiment": "none"}, {"name": "republican", "sentiment": "none"}, {"name": "wmur manchester", "sentiment": "none"}, {"name": "california democratic party", "sentiment": "none"}, {"name": "new york times", "sentiment": "none"}, {"name": "nbc news", "sentiment": "none"}, {"name": "fbi", "sentiment": "none"}, {"name": "associated press", "sentiment": "none"}, {"name": "abc news", "sentiment": "none"}, {"name": "wbur", "sentiment": "none"}, {"name": "trump 'stealth' voters could thwart california democrats' supermajority breitbart news", "sentiment": "none"}, {"name": "week magazine", "sentiment": "none"}, {"name": "ap", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "In every state, pessimism about Trump, Clinton and the impact of the election Washington Post - ‎31 minutes ago‎ The presidential campaign has intensified long-standing political divisions, but there is one area of broad agreement among voters in both red states and blue states — a pervasive pessimism that no matter the outcome, the election will do little to ... New trove of Clinton Benghazi emails proves thin Politico - ‎23 minutes ago‎ A set of about 30 Benghazi-related messages found by the FBI during their investigation into Hillary Clinton's private email system turns out to contain little fodder for critics or supporters of the Democratic presidential nominee. A lawyer for the ... GOP: Trump won't cost us Congress Politico - ‎1 hour ago‎ Even after the tumultuous Summer of Trump, Republicans still insist that he won't doom their hopes of retaining control of Capitol Hill. Returning to Washington after their long August recess, Republican lawmakers are cautiously optimistic that GOP ... The fight for the Senate ain't over yet Washington Post - ‎29 minutes ago‎ Nine months ago, I thought that Democrats had a pretty easy road to a four-seat gain and a Senate majority in November. Now I'm not so sure. The numbers, of course, still favor them. With 10 Republican-held Senate seats at risk this year and only a ... Poll: Most oppose Trump's wall, split on who is best on immigration CNN - ‎28 minutes ago‎ Washington (CNN) Donald Trump's immigration policies are highly unpopular, but voters are split over whether the Republican presidential nominee or his Democratic rival, Hillary Clinton, would better handle the issue, according to a new CNN/ORC Poll. Poll: Nine weeks out, a near even race CNN - ‎11 hours ago‎ Washington (CNN) Donald Trump and Hillary Clinton start the race to November 8 on essentially even ground, with Trump edging Clinton by a scant two points among likely voters, and the contest sparking sharp divisions along demographic lines in a new ... For the Record: This election isn't a popularity contest USA TODAY - ‎1 hour ago‎ Happy Wednesday, and happy 89th birthday to television, the thing that created Donald Trump. If it hadn't been for television, 40-plus percent of us probably would be backing the presidential candidacy of some other mass medium megastar, like Howard ... Poll: Trump Leads Clinton Among Military and Veteran Voters NBCNews.com - ‎30 minutes ago‎ Donald Trump leads Hillary Clinton by 19 points — 55 percent to 36 percent — among voters who are currently serving or have previously served in the U.S. military, according to the latest NBC News|SurveyMonkey Weekly Election Tracking Poll. The poll ... Hack Attack: Are Trump or Clinton 'choking' in this election? Fox News - ‎1 hour ago‎ Ladies and gentlemen, it's time to (cough) focus on choking. And by that, I don't mean Hillary Clinton's coughing spell the other day, which sparked some of the old conspiracy chatter about her health (and #HackingHillary quickly became a top Twitter ... Donald Trump Leads Hillary Clinton Among Military Voters in Poll Wall Street Journal - ‎32 minutes ago‎ Donald Trump leads Hillary Clinton by nearly 20 points among voters with military experience, although they mostly prefer the former secretary of state to handle the nation's nuclear weapons, according to a new NBC News/SurveyMonkey poll. The online ... The next president's most daunting economic challenges CBS News - ‎1 hour ago‎ No matter whether Republican Donald Trump or Democrat Hillary Clinton wins the race for president in November, America's next chief executive will need to address a number of daunting economic issues. Adding another hurdle to that challenge is the ... GOP Lawmaker Repeats Call for Inquiry Into Hillary Clinton New York Times - ‎9 hours ago‎ Representative Jason Chaffetz in July. He has said that Hillary Clinton's emails should not have been deleted because there were orders from two congressional committees to preserve messages on her account. Credit Al Drago/The New York Times. Trump 'Stealth' Voters Could Thwart California Democrats' Supermajority Breitbart News - ‎1 hour ago‎ The California Democratic Party believes it will pick up a legislative super-majority that would allow them to raise taxes despite Republican opposition, but it may find itself blindsided by Trump “stealth voters” who clandestinely support his policies ... How Hillary Clinton could win WMUR Manchester - ‎14 minutes ago‎ (CNN) —Hillary Clinton has advantages heading into the final stretch of the campaign that any presidential candidate would envy: a fleet of popular surrogates, a mountain of cash and an opponent who is often sidetracked by self-inflicted wounds. Videos. Hillary Clinton's latest email excuse amounts to 'I'm an idiot' The Week Magazine - ‎31 minutes ago‎ When James Comey concluded the FBI's probe into Hillary Clinton's private email server with a recommendation that the Department of Justice take no further action, the FBI director said he could not establish an intent to break the law, and later told ... Donald Trump leads Hillary Clinton by 2 points nationally: poll Washington Times - ‎8 hours ago‎ Republicans on Capitol Hill said they're increasingly hopeful of Donald Trump's chances in November. (Associated Press) more >. View Comments Print. By David Sherfinski - The Washington Times - Tuesday, September 6, 2016. A stunning new poll ... The Fact That Hillary Clinton and Donald Trump Are Even Close in Texas Is Amazing Daily Beast - ‎13 hours ago‎ Two decades after the last Democrat won statewide in Texas, Republicans might lose their grip on the Lone Star State—and their relevance as a national party. Goldie Taylor. 09.06.16 2:30 PM ET. It's been 20 years since the last time a Democrat came ... Donald Trump Can Win -- And Indeed, He Might WBUR - ‎1 hour ago‎ Republican presidential candidate Donald Trump waves during a visit to the Canfield Fair, Monday, Sept. 5, 2016, in Canfield, Ohio. (Evan Vucci/AP). In politics, summer is the silly season. Aficionados may hang on every policy pronouncement and ... A new 50-state poll shows exactly why Clinton holds the advantage over Trump Washington Post - ‎Sep 6, 2016‎ With nine weeks until Election Day, Donald Trump is within striking distance in the Upper Midwest, but Hillary Clinton's strength in many battlegrounds and some traditional Republican strongholds gives her a big electoral college advantage, according ... Clinton should stop pretending she's not elite Washington Post - ‎10 hours ago‎ Despite Hillary Clinton's recent slip in the polls, she has a big political opportunity, even though some of her advisers might regard it as a curse: She can run as the candidate who represents the “mainstream” leadership of both parties and knows how ... TRANSCRIPT: ABC News Anchor David Muir Interviews Donald Trump and Mike Pence ABC News - ‎11 hours ago‎ On Monday, September 5, 2016, ABC News \"World News Tonight\" anchor David Muir interviewed Republican presidential candidate Donald Trump and running mate Mike Pence. The following is a transcript of the interview: MUIR: Mr. Trump, Governor ... Extended Interview: Clinton, Kaine Sit Down With David Muir ABC News - ‎11 hours ago‎ As the election hits full speed, the Democratic nominees talk about the state of the race. 31:53 | 09/06/16. buffering. Replay. Captions. OFF. ON. Track : None. Presets : Aa. Aa. Aa. Aa. Font : Monospaced Serif, Proportional Serif, Monospaced Sans ... Save the Republican Party: Vote for Clinton New York Times - ‎19 hours ago‎ Every day, I run into Republican friends who can't stomach a vote for Donald J. Trump but don't know what to do. Vote for Hillary Clinton, who has trouble with the truth, wants to raise taxes and opposes free trade with Asia? Vote for the Libertarian ... Hillary Clinton and Tim Kaine give Labor Day speeches in Cleveland: Live coverage cleveland.com - ‎Sep 5, 2016‎ Democratic presidential candidate Hillary Clinton, Democratic vice presidential candidate Sen. Tim Kaine, D-Va., and Kaine's wife Anne Holton, left, speak together on their campaign bus after visiting Imani Temple Ministries in Cleveland, Sunday, July ... Donald Trump makes me allergic: Hillary Clinton after coughing fit Deccan Chronicle - ‎12 hours ago‎ Republican presidential candidate Donald Trump waves during a visit to the170th Canfield Fair in Ohio. (Photo: AP). Washington: Republican presidential candidate Donald Trump landed just ahead of Democrat Hillary Clinton in a new national poll released ... Latest presidential poll: Donald Trump tied with Hillary Clinton AL.com - ‎Sep 4, 2016‎ Republican presidential nominee Donald Trump is effectively tied with Democratic challenger Hillary Clinton in the race for the White House, according to the latest Reuters/Ipsos national poll. The poll showed Trump with the backing of 40 percent of ... Donald Trump Up 2 Points Over Hillary Clinton in New National Poll Patch.com - ‎20 hours ago‎ Republican presidential nominee Donald Trump has a two-point lead over Democratic rival Hillary Clinton in a new national poll of likely voters released Tuesday, essentially putting the two on even ground in the final push to Election Day 2016. Among ... Shock: CNN Poll Shows Trump Now Leading Hillary Clinton Breitbart News - ‎Sep 6, 2016‎ Republican presidential nominee Donald Trump is now polling ahead of Hillary Clinton, according to a new CNN poll released this morning. SIGN UP FOR OUR NEWSLETTER. Trump is now leading with 45 percent of the vote while Clinton is now at 43 ... Donald Trump Closes Gap With Hillary Clinton in New Poll TIME - ‎18 hours ago‎ A new poll shows Republican presidential nominee Donald Trump slightly ahead of rival Hillary Clinton, eliminating the lead she took last month after the Democratic National Convention. The national CNN/ORC poll, released on Tuesday, found that 45% of ... Donald Trump tops Hillary Clinton by two points in new post-Labor Day poll Daily Mail - ‎22 hours ago‎ Republican presidential candidate Donald Trump has opened up a two-point lead over Hillary Clinton in the latest CNN / ORC poll with the elections just nine weeks away. The poll is just the latest to show an improvement for Trump in recent weeks. 1", "external_links": [], "published": "2016-09-07T18:33:00.000+03:00", "crawled": "2016-09-07T13:41:56.174+03:00", "highlightTitle": ""}